
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-SECURE</TITLE>
</HEAD><BODY>
<H1>APT-SECURE</H1>
Section: APT (8)<BR>Updated: 06&nbsp;ao&ucirc;t&nbsp;2016<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-secure - Gestion de l'authentification d'archive avec APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Depuis sa version&nbsp;0.6,
<B>apt</B>
sait v&eacute;rifier la signature du fichier Release de chaque d&eacute;p&ocirc;t. On s'assure ainsi que les paquets dans l'archive ne peuvent pas &ecirc;tre modifi&eacute;s par quelqu'un qui ne poss&egrave;de pas la cl&eacute; de la signature du fichier Release. &Agrave; partir de la version&nbsp;1.1,
<B>apt</B>
exige que les d&eacute;p&ocirc;ts fournissent des informations r&eacute;centes d'authentification pour une utilisation libre du d&eacute;p&ocirc;t. Depuis la version&nbsp;1.5, les modifications dans les informations contenues dans le fichier Release sur le d&eacute;p&ocirc;t, doivent &ecirc;tre confirm&eacute;es avant qu'APT continue &agrave; appliquer les mises &agrave; jour depuis ce d&eacute;p&ocirc;t.
<P>

Attention&nbsp;: toutes les interfaces de gestion de paquets comme
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+aptitude">aptitude</A></B>(8)
et
<B><A HREF="/cgi-bin/man/man2html?8+synaptic">synaptic</A></B>(8)
poss&egrave;dent cette fonction de certification, aussi cette page de manuel utilise
APT
pour se r&eacute;f&eacute;rer &agrave; l'ensemble d'entre elles, pour des raisons de simplicit&eacute;.
<A NAME="lbAD">&nbsp;</A>
<H2>D&Eacute;P&Ocirc;TS NON SIGN&Eacute;S</H2>

<P>

Si une archive poss&egrave;de un fichier Release non sign&eacute; ou pas de fichier Release du tout, les versions actuelles d'APT refuseront par d&eacute;faut d'en t&eacute;l&eacute;charger des donn&eacute;es dans les op&eacute;rations
<B>update</B>. M&ecirc;me si un frontal tel que
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
est forc&eacute; de t&eacute;l&eacute;charger, il demandera une confirmation explicite si une installation inclut un paquet d'une archive non authentifi&eacute;e.
<P>

Vous pouvez contraindre les clients APT &agrave; n'&eacute;mettre que des avertissements en configurant l'option
<B>Acquire::AllowInsecureRepositories</B>
&agrave;
true. L'option
allow-insecure=yes
de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
peut aussi permettre &agrave; des d&eacute;p&ocirc;ts individuels d'&ecirc;tre non s&eacute;curis&eacute;s. Veuillez noter que les d&eacute;p&ocirc;ts non s&eacute;curis&eacute;s sont fortement d&eacute;conseill&eacute;s et toutes les options pour contraindre APT &agrave; continuer &agrave; les prendre en charge devront &ecirc;tre &eacute;ventuellement supprim&eacute;es. Les utilisateurs disposent aussi de l'option
<B>Trusted</B>
pour d&eacute;sactiver m&ecirc;me les avertissements, mais il faut &ecirc;tre s&ucirc;r de comprendre ses implications d&eacute;taill&eacute;es dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<P>

Un d&eacute;p&ocirc;t qui auparavant &eacute;tait authentifi&eacute;, mais qui perdrait cet &eacute;tat lors d'une op&eacute;ration
<B>update</B>
envoie un message d'erreur &agrave; tous les clients d'APT quelle que soit l'option d'autoriser ou d'interdire l'utilisation de d&eacute;p&ocirc;ts non s&eacute;curis&eacute;s. L'erreur peut &ecirc;tre contourn&eacute;e par le r&eacute;glage suppl&eacute;mentaire de
<B>Acquire::AllowDowngradeToInsecureRepositories</B>
&agrave;
true, ou, pour des d&eacute;p&ocirc;ts individuels avec l'option
allow-downgrade-to-insecure=yes
de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAE">&nbsp;</A>
<H2>D&Eacute;P&Ocirc;TS SIGN&Eacute;S</H2>

<P>

D'une archive APT jusqu'&agrave; l'utilisateur, la cha&icirc;ne de confiance se construit en plusieurs &eacute;tapes.
<B>Apt-secure</B>
est la derni&egrave;re &eacute;tape. Faire confiance &agrave; une archive ne signifie pas que les paquets qu'elle contient sont exempts de code malveillant, mais signifie que vous faites confiance au responsable de l'archive. C'est ensuite au responsable de l'archive de faire en sorte que l'archive soit fiable.
<P>

<B>Apt-secure</B>
n'examine pas la signature d'un paquet. Certains programmes peuvent le faire comme
<B>debsig-verify</B>
ou
<B>debsign</B>, qu'on peut trouver dans les paquets debsig-verify et devscripts.
<P>

La cha&icirc;ne de confiance dans Debian commence, par exemple, quand un responsable de paquet envoie un nouveau paquet ou une nouvelle version d'un paquet dans l'archive. Cet envoi, pour &ecirc;tre effectif, doit &ecirc;tre sign&eacute; avec la cl&eacute; d'un responsable qui se trouve dans un des trousseaux des responsables de paquet Debian (disponibles dans le paquet debian-keyring). Les cl&eacute;s des responsables de paquet sont sign&eacute;es par d'autres responsables, suivant des proc&eacute;dures pr&eacute;&eacute;tablies pour s'assurer de l'identit&eacute; des propri&eacute;taires de la cl&eacute;. Des proc&eacute;dures similaires existent dans toutes les distributions bas&eacute;es sur Debian.
<P>

Une fois que le paquet envoy&eacute; a &eacute;t&eacute; v&eacute;rifi&eacute; et inclus dans l'archive, la signature du responsable est enlev&eacute;e, une somme de contr&ocirc;le du paquet est calcul&eacute;e et mise dans le fichier Packages. Une somme de contr&ocirc;le de tous les paquets est ensuite calcul&eacute;e et mise dans le fichier Release. Ce fichier est sign&eacute; par la cl&eacute; de l'archive pour la version courante de la distribution et distribu&eacute;e en m&ecirc;me temps que les paquets et les fichiers Packages sur les miroirs. Les cl&eacute;s sont dans le trousseau de cl&eacute;s de l'archive fournies par le paquet
ubuntu-keyring.
<P>

Un utilisateur peut consulter la signature du fichier Release, extraire la somme de contr&ocirc;le d'un paquet et la comparer avec la somme du paquet qu'il a t&eacute;l&eacute;charg&eacute;, ou tout simplement compter sur APT pour faire ces op&eacute;rations automatiquement.
<P>

Cette fa&ccedil;on de faire est diff&eacute;rente d'une v&eacute;rification de la signature d'un paquet. Elle vise &agrave; emp&ecirc;cher deux types d'attaque possibles&nbsp;:
<P>
<DL COMPACT><DT id="1"><DD>
&bull;


Attaque r&eacute;seau de type &laquo;&nbsp;homme au milieu&nbsp;&raquo;. Sans v&eacute;rification de signature, quelqu'un de malveillant peut s'introduire au milieu du processus de t&eacute;l&eacute;chargement et ins&eacute;rer du code soit en contr&ocirc;lant un &eacute;l&eacute;ment du r&eacute;seau, routeur, commutateur, etc. soit en d&eacute;tournant le trafic vers un serveur fourbe (par usurpation d'adresses).
</DL>

<P>
<DL COMPACT><DT id="2"><DD>
&bull;


Attaque par compromission d'un miroir sur le r&eacute;seau. Sans v&eacute;rification de signature, quelqu'un de malveillant peut compromettre un miroir et modifier les fichiers. Ainsi tous ceux qui t&eacute;l&eacute;chargent les paquets de ce miroir propagent du code malveillant.
</DL>

<P>

Cependant cette m&eacute;thode ne prot&egrave;ge pas contre une compromission du serveur principal lui-m&ecirc;me (qui signe les paquets) ni contre la compromission de la cl&eacute; qui sert &agrave; signer les fichiers Release. Mais elle peut compl&eacute;ter la signature des paquets.
<A NAME="lbAF">&nbsp;</A>
<H2>MODIFICATIONS DES INFORMATIONS</H2>

<P>

Le fichier Release renferme, en plus des sommes de contr&ocirc;le pour les fichiers du d&eacute;p&ocirc;t, des informations g&eacute;n&eacute;rales sur le d&eacute;p&ocirc;t comme l'origine, le nom de code ou le num&eacute;ro de la version.
<P>

Ces informations apparaissent &agrave; plusieurs endroits, aussi, le propri&eacute;taire d'un d&eacute;p&ocirc;t devrait toujours s'assurer de leur exactitude. Par ailleurs, les configurations de l'utilisateur, comme
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5), peuvent d&eacute;pendre de ces informations et les utiliser. Depuis la version&nbsp;1.5, l'utilisateur doit par cons&eacute;quent confirmer de fa&ccedil;on explicite les modifications pour signaler qu'il est suffisamment pr&eacute;par&eacute;, par exemple, pour la nouvelle version majeure de la distribution fournie dans le d&eacute;p&ocirc;t (comme indiqu&eacute; par exemple par le nom de code).
<A NAME="lbAG">&nbsp;</A>
<H2>CONFIGURATION UTILISATEUR</H2>

<P>

Le programme qui g&egrave;re la liste des cl&eacute;s utilis&eacute;es par APT pour faire confiance aux d&eacute;p&ocirc;ts s'appelle
<B>apt-key</B>. Il peut ajouter ou supprimer des cl&eacute;s aussi bien que lister les cl&eacute;s de confiance. Il est possible de limiter la capacit&eacute; pour une ou plusieurs cl&eacute;s de signer telle ou telle archive avec l'option
<B>Signed-By</B>
dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<P>

Veuillez noter qu'une installation par d&eacute;faut poss&egrave;de toutes les cl&eacute;s pour obtenir en toute s&eacute;curit&eacute; des paquets des d&eacute;p&ocirc;ts par d&eacute;faut, aussi, bricoler avec
<B>apt-key</B>
n'est n&eacute;cessaire que si vous souhaitez ajouter des d&eacute;p&ocirc;ts tiers.
<P>

Pour ajouter une cl&eacute;, vous devez d'abord la t&eacute;l&eacute;charger. Il vaut mieux utiliser un canal fiable pour ce t&eacute;l&eacute;chargement. Ensuite vous l'ajoutez avec la commande
<B>apt-key</B>
et vous lancez la commande
<B>apt-get update</B>
pour t&eacute;l&eacute;charger et v&eacute;rifier le fichier
InRelease
ou
Release.gpg
de l'archive que vous avez configur&eacute;e.
<A NAME="lbAH">&nbsp;</A>
<H2>CONFIGURATION DU D&Eacute;P&Ocirc;T</H2>

<P>

Si vous voulez signer les archives dont vous avez la responsabilit&eacute;, vous devez&nbsp;:
<P>
<DL COMPACT><DT id="3"><DD>
&bull;


<I>cr&eacute;er un fichier Release &agrave; la racine de l'archive</I>, s'il n'existe pas d&eacute;j&agrave;. Vous pouvez le cr&eacute;er avec la commande
<B>apt-ftparchive release</B>
(fournie dans le paquet apt-utils).
</DL>

<P>
<DL COMPACT><DT id="4"><DD>
&bull;


<I>le signer</I>, avec les commandes
<B>gpg --clearsign -o InRelease Release</B>
et
<B>gpg -abs -o Release.gpg Release</B>.
</DL>

<P>
<DL COMPACT><DT id="5"><DD>
&bull;


<I>publier l'empreinte de la cl&eacute;</I>. Ainsi les utilisateurs de votre archive conna&icirc;tront la cl&eacute; qu'ils doivent importer pour authentifier les fichiers de l'archive. Le mieux est de diffuser sa cl&eacute; dans son propre paquet de trousseau comme le fait Ubuntu avec
ubuntu-keyring
pour ensuite distribuer automatiquement les mises &agrave; jour et les transitions de cl&eacute;s.
</DL>

<P>
<DL COMPACT><DT id="6"><DD>
&bull;


<I>fournir les instructions pour ajouter l'archive et la cl&eacute;</I>. Si les utilisateurs ne peuvent r&eacute;cup&eacute;rer de fa&ccedil;on s&ucirc;re votre cl&eacute;, la cha&icirc;ne de confiance d&eacute;crite plus haut est rompue. La fa&ccedil;on d'aider les utilisateurs &agrave; ajouter votre cl&eacute; de l'archive d&eacute;pend de l'archive et de l'audience cible&nbsp;: cela va d'un paquet de trousseau inclus dans une autre archive que des utilisateurs ont d&eacute;j&agrave; configur&eacute;e (comme les d&eacute;p&ocirc;ts par d&eacute;faut de leur distribution) &agrave; la mobilisation du web de confiance.
</DL>

<P>

Chaque fois que le contenu de l'archive change, (suppression ou ajout de nouveaux paquets) le responsable doit refaire les deux premi&egrave;res &eacute;tapes.
<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-key">apt-key</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+debsign">debsign</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+debsig-verify">debsig-verify</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+gpg">gpg</A></B>(1)
<P>

Pour des informations plus compl&egrave;tes, vous pouvez consulter
m[blue]<B>l'infrastructure debian pour la s&eacute;curit&eacute;</B>m[]<FONT SIZE="-2">[1]</FONT>
un chapitre du manuel Debian sur la s&eacute;curit&eacute; (disponible dans le paquet harden-doc) et le
m[blue]<B>Strong Distribution HOWTO</B>m[]<FONT SIZE="-2">[2]</FONT>
par V. Alex Brennen.
<A NAME="lbAJ">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[3]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>AUTHOR</H2>

<P>

APT a &eacute;t&eacute; &eacute;crit par l'&eacute;quipe de d&eacute;veloppement APT
&lt;<A HREF="mailto:apt@packages.debian.org">apt@packages.debian.org</A>&gt;.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTEURS DES PAGES DE MANUEL</H2>

<P>

Cette page a &eacute;t&eacute; &eacute;crite &agrave; partir des travaux de Javier Fern&aacute;ndez-Sanguino Pe&ntilde;a, Isaac Jones, Colin Walters, Florian Weimer et Michael Vogt.
<A NAME="lbAM">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="7"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="8"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="9"> 1.<DD>
l'infrastructure debian pour la s&eacute;curit&eacute;
<DL COMPACT><DT id="10"><DD>
<A HREF="https://www.debian.org/doc/manuals/securing-debian-howto/ch7">https://www.debian.org/doc/manuals/securing-debian-howto/ch7</A>
</DL>

<DT id="11"> 2.<DD>
Strong Distribution HOWTO
<DL COMPACT><DT id="12"><DD>
<A HREF="http://www.cryptnet.net/fdp/crypto/strong_distro.html">http://www.cryptnet.net/fdp/crypto/strong_distro.html</A>
</DL>

<DT id="13"> 3.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NOM</A><DD>
<DT id="16"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="17"><A HREF="#lbAD">D&Eacute;P&Ocirc;TS NON SIGN&Eacute;S</A><DD>
<DT id="18"><A HREF="#lbAE">D&Eacute;P&Ocirc;TS SIGN&Eacute;S</A><DD>
<DT id="19"><A HREF="#lbAF">MODIFICATIONS DES INFORMATIONS</A><DD>
<DT id="20"><A HREF="#lbAG">CONFIGURATION UTILISATEUR</A><DD>
<DT id="21"><A HREF="#lbAH">CONFIGURATION DU D&Eacute;P&Ocirc;T</A><DD>
<DT id="22"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="23"><A HREF="#lbAJ">BOGUES</A><DD>
<DT id="24"><A HREF="#lbAK">AUTHOR</A><DD>
<DT id="25"><A HREF="#lbAL">AUTEURS DES PAGES DE MANUEL</A><DD>
<DT id="26"><A HREF="#lbAM">TRADUCTEURS</A><DD>
<DT id="27"><A HREF="#lbAN">AUTEURS</A><DD>
<DT id="28"><A HREF="#lbAO">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:03 GMT, March 31, 2021
</BODY>
</HTML>
