
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CACHE</TITLE>
</HEAD><BODY>
<H1>APT-CACHE</H1>
Section: APT (8)<BR>Updated: 04&nbsp;avril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-cache - recherche dans le cache d'APT
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cache</B> [<B>-agipns</B>] [<B>-o=</B><B></B><I>cha&icirc;ne_de_configuration</I>] [<B>-c=</B><B></B><I>fichier_de_configuration</I>] {gencaches | showpkg&nbsp;<I>paquet</I>...  | showsrc&nbsp;<I>paquet</I>...  | stats | dump | dumpavail | unmet | search&nbsp;<I>expression_r&eacute;guli&egrave;re</I>...  | show&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | depends&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | rdepends&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | pkgnames&nbsp;[<I>pr&eacute;fixe</I>]  | dotty&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | xvcg&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | policy&nbsp;[<I>paquet</I>...]  | madison&nbsp;<I>paquet</I>...  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

<B>apt-cache</B>
<DD>r&eacute;alise diff&eacute;rentes op&eacute;rations sur le cache de paquet d'APT.
<B>apt-cache</B>
ne manipule pas l'&eacute;tat du syst&egrave;me mais fournit des moyens de recherche dans les m&eacute;tadonn&eacute;es d'un paquet desquelles il extrait les informations int&eacute;ressantes. Les m&eacute;tadonn&eacute;es sont obtenues et mises &agrave; jour avec la commande update d'<B>apt-get</B>
par exemple, et peuvent donc &ecirc;tre p&eacute;rim&eacute;es si la derni&egrave;re mise &agrave; jour est trop ancienne, mais en contrepartie
<B>apt-cache</B>
fonctionne ind&eacute;pendamment de la disponibilit&eacute; des sources configur&eacute;es (par exemple hors ligne).
<P>

&Agrave; moins que l'option
<B>-h</B>
ou
<B>--help</B>
ne soit donn&eacute;e, l'une des commandes suivantes doit &ecirc;tre pr&eacute;sente.
<P>

<B>gencaches</B>
<DL COMPACT><DT id="2"><DD>
gencaches
cr&eacute;e le cache d'APT. Cette action est faite implicitement par toute commande qui a besoin de ce cache s'il est manquant ou obsol&egrave;te.
</DL>

<P>

<B>showpkg</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="3"><DD>
La commande
showpkg
affiche des informations sur les paquets donn&eacute;s en argument. Les arguments restants sont les noms de paquets. Les versions disponibles et les d&eacute;pendances inverses de chaque paquet r&eacute;pertori&eacute; sont list&eacute;es, ainsi que les d&eacute;pendances normales pour chaque version. Les d&eacute;pendances normales d'un paquet sont constitu&eacute;es par les paquets dont il d&eacute;pend&nbsp;; les d&eacute;pendances inverses sont les paquets qui d&eacute;pendent du paquet en question. Les d&eacute;pendances normales doivent donc &ecirc;tre satisfaites et les d&eacute;pendances inverses n'ont pas besoin de l'&ecirc;tre. Ainsi, la commande
<B>apt-cache showpkg libreadline2</B>
donnera ce r&eacute;sultat&nbsp;:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Package: libreadline2
Versions: 2.1-12(/var/state/apt/lists/foo_Packages),
Reverse Depends: 
  libreadlineg2,libreadline2
  libreadline2-altdev,libreadline2
Dependencies:
2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null))
Provides:
2.1-12 - 
Reverse Provides: 
</PRE>

</DL>




On peut voir que libreadline2, version&nbsp;2.1-12, d&eacute;pend de libc5 et ncurses3.0&nbsp;; ces paquets doivent &ecirc;tre install&eacute;s au pr&eacute;alable pour que libreadline2 fonctionne. &Agrave; leur tour, libreadlineg2 et libreadline2-altdev d&eacute;pendent de libreadline2. Si libreadline2 est install&eacute;, libc5 et ncurses3.0 doivent &ecirc;tre install&eacute;s&nbsp;; libreadlineg2 et libreadline2-altdev n'ont pas &agrave; l'&ecirc;tre. Pour conna&icirc;tre le sens de la fin de cha&icirc;ne, il est pr&eacute;f&eacute;rable de consulter le code source d'APT.
</DL>

<P>

<B>stats</B>
<DL COMPACT><DT id="5"><DD>
La commande
stats
affiche des statistiques &agrave; propos du cache. Aucun autre argument n'est attendu. Voici les informations rapport&eacute;es&nbsp;:
<P>
<DL COMPACT><DT id="6"><DD>
&bull;


Total package names
est le nombre de paquets trouv&eacute;s dans le cache.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Normal packages
est le nombre de paquets simples, ordinaires&nbsp;; ces paquets tol&egrave;rent une correspondance bijective entre leur nom et le nom utilis&eacute; par les autres paquets pour les qualifier comme d&eacute;pendance. La majorit&eacute; des paquets appartient &agrave; cette cat&eacute;gorie.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Pure virtual packages
est le nombre de paquets qui n'existent que sous la forme d'un nom repr&eacute;sentant un paquet virtuel&nbsp;; ces paquets &laquo;&nbsp;fournissent&nbsp;&raquo; seulement un nom de paquet virtuel et aucun paquet n'utilise v&eacute;ritablement ce nom. Par exemple, au sein du syst&egrave;me Debian GNU/Linux, le nom &laquo;&nbsp;mail-transport-agent&nbsp;&raquo; est un paquet virtuel pur&nbsp;; plusieurs paquets peuvent &laquo;&nbsp;fournir&nbsp;&raquo; ce nom &laquo;&nbsp;mail-transport-agent&nbsp;&raquo;, mais il n'existe aucun paquet nomm&eacute; &laquo;&nbsp;mail-transport-agent&nbsp;&raquo;.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Single virtual packages
est le nombre de paquets virtuels qui ne peuvent &ecirc;tre remplis que par un seul paquet. Par exemple, au sein du syst&egrave;me Debian, &laquo;&nbsp;X11-text-viewer&nbsp;&raquo; est un paquet virtuel&nbsp;; seul le paquet &laquo;&nbsp;xless&nbsp;&raquo; remplit &laquo;&nbsp;X11-text-viewer&nbsp;&raquo;.
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Mixed virtual packages
est le nombre de paquets qui remplissent un paquet virtuel particulier ou dont le nom est un nom de paquet virtuel. Par exemple, au sein du syst&egrave;me Debian, &laquo;&nbsp;debconf&nbsp;&raquo; est un paquet r&eacute;el et il est aussi fourni par &laquo;&nbsp;debconf-tiny&nbsp;&raquo;.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


Missing
est le nombre de paquets r&eacute;f&eacute;renc&eacute;s dans une d&eacute;pendance mais qui ne sont fournis par aucun paquet. Les paquets manquants peuvent &ecirc;tre mis en &eacute;vidence quand on n'acc&egrave;de pas &agrave; une distribution compl&egrave;te ou si un paquet (r&eacute;el ou virtuel) a &eacute;t&eacute; sorti d'une distribution. Habituellement on les trouve dans les champs &laquo;&nbsp;Conflicts&nbsp;&raquo; ou &laquo;&nbsp;Breaks&nbsp;&raquo;.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


Total distinct
versions est le nombre de versions de paquets trouv&eacute;es dans le cache. Quand on acc&egrave;de &agrave; plus d'une distribution (&laquo;&nbsp;stable&nbsp;&raquo; et &laquo;&nbsp;unstable&nbsp;&raquo;, par exemple), cette valeur peut &ecirc;tre consid&eacute;rablement plus grande que le nombre total de paquets.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Total dependencies
est le nombre de relations de d&eacute;pendances d&eacute;clar&eacute;es par tous les paquets pr&eacute;sents dans le cache.
</DL>

<P>
</DL>

<P>

<B>showsrc</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="14"><DD>
showsrc
affiche toutes les entr&eacute;es de paquets source qui correspondent aux noms donn&eacute;s. Toutes les versions sont affich&eacute;es et toutes les entr&eacute;es qui d&eacute;clarent que ces noms correspondent &agrave; des paquets binaires. Utilisez l'option
<B>--only-source</B>
pour n'afficher que le nom des paquets source.
</DL>

<P>

<B>dump</B>
<DL COMPACT><DT id="15"><DD>
La commande
dump
affiche un court r&eacute;sum&eacute; sur chaque paquet du cache. Elle est d'abord destin&eacute;e au d&eacute;bogage.
</DL>

<P>

<B>dumpavail</B>
<DL COMPACT><DT id="16"><DD>
La commande
dumpavail
affiche sur la sortie standard la liste des paquets disponibles. Elle convient &agrave; une utilisation avec
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
et la m&eacute;thode
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
s'en sert.
</DL>

<P>

<B>unmet</B>
<DL COMPACT><DT id="17"><DD>
La commande
unmet
affiche un r&eacute;sum&eacute; concernant toutes les d&eacute;pendances absentes dans le cache de paquets.
</DL>

<P>

<B>show</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="18"><DD>
La commande
show
est semblable &agrave;
<B>dpkg --print-avail</B>&nbsp;; elle affiche des informations sur les paquets donn&eacute;s en argument.
</DL>

<P>

<B>search</B> <B></B><I>expression_r&eacute;guli&egrave;re</I><B>...</B>
<DL COMPACT><DT id="19"><DD>
La commande
search
recherche l'expression rationnelle POSIX donn&eacute;e en param&egrave;tre sur tous les paquets disponibles, voir
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7). Elle cherche une occurrence de la cha&icirc;ne dans les noms de paquets et dans les descriptions puis elle affiche le nom du paquet et sa description courte. Quand l'option
<B>--full</B>
est fournie, la sortie est identique &agrave;
show
pour chaque paquet&nbsp;; quand l'option
<B>--names-only</B>
est fournie, la recherche ne porte pas sur les descriptions longues, mais seulement sur les noms de paquets et les paquets fournis.
<P>
On peut utiliser des arguments distincts pour indiquer des expressions rationnelles diff&eacute;rentes sur lesquelles seront r&eacute;alis&eacute;es un &laquo;&nbsp;et&nbsp;&raquo; logique.
</DL>

<P>

<B>depends</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="20"><DD>
La commande
depends
affiche la liste de toutes les d&eacute;pendances d'un paquet et la liste de tous les paquets possibles qui satisfont ces d&eacute;pendances.
</DL>

<P>

<B>rdepends</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="21"><DD>
La commande
rdepends
affiche la liste de toutes les d&eacute;pendances inverses d'un paquet.
</DL>

<P>

<B>pkgnames</B> [<I>pr&eacute;fixe</I>]
<DL COMPACT><DT id="22"><DD>
Cette commande affiche le nom de chaque paquet connu par APT. Un pr&eacute;fixe pour filtrer la liste des noms peut &ecirc;tre donn&eacute; en param&egrave;tre. La sortie est adapt&eacute;e &agrave; une utilisation au sein d'une fonction compl&egrave;te de shell&nbsp;; elle est produite tr&egrave;s rapidement. On utilise au mieux cette commande avec l'option
<B>--generate</B>.
<P>
Veuillez noter qu'un paquet connu par APT n'est pas forc&eacute;ment disponible, installable ou install&eacute;. Par exemple, les paquets virtuels sont &eacute;galement affich&eacute;s dans la liste cr&eacute;&eacute;e.
</DL>

<P>

<B>dotty</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="23"><DD>
La commande
dotty
prend une liste de paquets sur la ligne de commande et affiche une sortie appropri&eacute;e &agrave; une utilisation par la commande dotty du paquet
m[blue]<B>GraphViz</B>m[]<FONT SIZE="-2">[1]</FONT>. Il en r&eacute;sulte un ensemble de n&oelig;uds et d'arcs repr&eacute;sentant les relations entre les paquets. Par d&eacute;faut les paquets donn&eacute;s en argument suivent toutes leurs d&eacute;pendances, ce qui peut produire un graphe tr&egrave;s volumineux. Pour limiter la sortie aux seuls paquets list&eacute;s sur la ligne de commande, positionnez l'option
APT::Cache::GivenOnly.
<P>
Les noeuds r&eacute;sultants ont plusieurs formes&nbsp;; les paquets normaux sont des bo&icirc;tes, les &laquo;&nbsp;provides&nbsp;&raquo; purs sont des triangles, les &laquo;&nbsp;provides&nbsp;&raquo; mixtes sont des diamants et les paquets manquants sont des hexagones. Les bo&icirc;tes oranges expriment un arr&ecirc;t de la r&eacute;cursivit&eacute; [paquet feuille], les lignes bleues repr&eacute;sentent des pr&eacute;d&eacute;pendances et les lignes vertes repr&eacute;sentent des conflits.
<P>
Attention, dotty ne peut pas repr&eacute;senter des ensembles tr&egrave;s grands de paquets.
</DL>

<P>

<B>xvcg</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="24"><DD>
Identique &agrave;
dotty, mais r&eacute;serv&eacute; &agrave; xvcg fourni avec
m[blue]<B>VCG tool</B>m[]<FONT SIZE="-2">[2]</FONT>.
</DL>

<P>

<B>policy</B> [<I>paquet</I>...]
<DL COMPACT><DT id="25"><DD>
policy
sert &agrave; d&eacute;boguer des probl&egrave;mes relatifs au fichier des pr&eacute;f&eacute;rences. Sans argument, la commande affiche la priorit&eacute; de chaque source. Sinon, elle affiche des informations pr&eacute;cises sur la priorit&eacute; du paquet donn&eacute; en argument.
</DL>

<P>

<B>madison</B> <B></B><I>paquet</I><B>...</B>
<DL COMPACT><DT id="26"><DD>
La commande
madison
d'apt-cache
cherche &agrave; mimer le format de sortie propre &agrave; l'outil debian de gestion d'archives,
madison, ainsi qu'une partie de ses fonctionnalit&eacute;s. Elle affiche les versions disponibles d'un paquet dans un tableau. Contrairement au programme original
madison, elle n'affiche que des informations concernant l'architecture pour laquelle Apt a lu la liste des paquets disponibles (APT::Architecture).
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Toutes les options de la ligne de commande peuvent &ecirc;tre d&eacute;finies dans le fichier de configuration, les descriptions indiquant l'option de configuration concern&eacute;e. Pour les options bool&eacute;ennes, vous pouvez inverser les r&eacute;glages du fichiers de configuration avec
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
et d'autres variantes analogues.
<P>

<B>-p</B>, <B>--pkg-cache</B>
<DL COMPACT><DT id="27"><DD>
Indique le fichier servant de cache des paquets. Le cache des paquets est le cache primaire utilis&eacute; par toutes les op&eacute;rations. &Eacute;l&eacute;ment de configuration&nbsp;:
Dir::Cache::pkgcache.
</DL>

<P>

<B>-s</B>, <B>--src-cache</B>
<DL COMPACT><DT id="28"><DD>
Indique le fichier servant de cache des sources. Ce cache n'est utilis&eacute; que par
gencaches&nbsp;; une version des informations sur les paquets, issue d'une analyse de sources distantes, est conserv&eacute;e. Quand le cache des paquets est cr&eacute;&eacute;, le cache des sources est utilis&eacute; afin d'&eacute;viter d'analyser &agrave; nouveau tous les paquets. &Eacute;l&eacute;ment de configuration&nbsp;:
Dir::Cache::srcpkgcache.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="29"><DD>
Mode silencieux&nbsp;; produit une sortie pertinente pour l'enregistrement dans un fichier-journal, sans afficher d'indicateur de progression. Un plus grand nombre de&nbsp;q produira un plus grand silence, avec un maximum de&nbsp;2. Vous pouvez aussi utiliser
<B>-q=#</B>
pour positionner le niveau de silence, annulant le fichier de configuration. &Eacute;l&eacute;ment de configuration&nbsp;:
quiet.
</DL>

<P>

<B>-i</B>, <B>--important</B>
<DL COMPACT><DT id="30"><DD>
N'affiche que les d&eacute;pendances importantes&nbsp;; &agrave; utiliser avec les commandes
unmet
et
depends
pour n'afficher que les relations Depends et Pre-Depends. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::Important.
</DL>

<P>

<B>--no-pre-depends</B>, <B>--no-depends</B>, <B>--no-recommends</B>, <B>--no-suggests</B>, <B>--no-conflicts</B>, <B>--no-breaks</B>, <B>--no-replaces</B>, <B>--no-enhances</B>
<DL COMPACT><DT id="31"><DD>
Par d&eacute;faut,
<B>depends</B>
et
<B>rdepends</B>
affichent toutes les d&eacute;pendances. Ce comportement peut &ecirc;tre modifi&eacute; avec ces r&eacute;glages qui omettront le type de d&eacute;pendance indiqu&eacute;. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::Show<I>TypeD&eacute;pendance</I>, p.&nbsp;ex.&nbsp;APT::Cache::ShowRecommends.
</DL>

<P>

<B>--implicit</B>
<DL COMPACT><DT id="32"><DD>
Par d&eacute;faut,
<B>depends</B>
et
<B>rdepends</B>
n'affichent que les d&eacute;pendances indiqu&eacute;es explicitement dans les m&eacute;tadonn&eacute;es. Avec ce marqueur, ils afficheront aussi les d&eacute;pendances ajout&eacute;es de fa&ccedil;on implicite bas&eacute;es sur les donn&eacute;es rencontr&eacute;es. Par exemple, un message
Conflicts: foo
exprime de fa&ccedil;on implicite que ce paquet est aussi en conflit avec le paquet foo de n'importe quelle autre architecture. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::ShowImplicit.
</DL>

<P>

<B>-f</B>, <B>--full</B>
<DL COMPACT><DT id="33"><DD>
Affiche la totalit&eacute; des champs d'information sur le paquet lors d'une recherche. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::ShowFull.
</DL>

<P>

<B>-a</B>, <B>--all-versions</B>
<DL COMPACT><DT id="34"><DD>
Affiche la totalit&eacute; des champs d'information pour toutes les versions disponibles&nbsp;: c'est la valeur par d&eacute;faut. Pour la d&eacute;sactiver, utilisez l'option
<B>--no-all-versions</B>. Quand l'option
<B>--no-all-versions</B>
est choisie, seuls les &eacute;l&eacute;ments de la version choisie (celle qui serait install&eacute;e) seront affich&eacute;s. Cette option concerne seulement la commande
show. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::AllVersions.
</DL>

<P>

<B>-g</B>, <B>--generate</B>
<DL COMPACT><DT id="35"><DD>
R&eacute;alise une mise &agrave; jour automatique du cache des paquets plut&ocirc;t que de se servir du cache tel qu'il est. Pour d&eacute;sactiver cette option (option par d&eacute;faut), utilisez l'option
<B>--no-generate</B>. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::Generate.
</DL>

<P>

<B>--names-only</B>, <B>-n</B>
<DL COMPACT><DT id="36"><DD>
N'effectue une recherche que sur les noms de paquets et de paquets fournis, pas sur les descriptions longues. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::NamesOnly.
</DL>

<P>

<B>--all-names</B>
<DL COMPACT><DT id="37"><DD>
Avec cette option,
pkgnames
affiche tous les noms, les noms des paquets virtuels et les d&eacute;pendances manquantes. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::AllNames.
</DL>

<P>

<B>--recurse</B>
<DL COMPACT><DT id="38"><DD>
Avec cette option,
depends
et
rdepends
sont r&eacute;cursives de mani&egrave;re &agrave; n'afficher qu'une seule fois les paquets mentionn&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::RecurseDepends.
</DL>

<P>

<B>--installed</B>
<DL COMPACT><DT id="39"><DD>
Cette option limite la sortie de
depends
et de
rdepends
aux paquets qui sont actuellement install&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Cache::Installed.
</DL>

<P>

<B>--with-source</B> <B></B><I>nom_de_fichier</I>
<DL COMPACT><DT id="40"><DD>
Ajoute le fichier donn&eacute; comme source de m&eacute;tadonn&eacute;es. La commande peut &ecirc;tre r&eacute;p&eacute;t&eacute;e pour ajouter de multiples fichiers. Actuellement, les fichiers*.deb,
*.dsc,
*.changes,
Sources
et
Packages, aussi bien que les r&eacute;pertoires de paquets source sont pris en charge. Les correspondances de fichier sont bas&eacute;es sur leur nom seulement et non sur leur contenu&nbsp;!
<P>
Les
Sources
et
Packages
peuvent &ecirc;tre compress&eacute;s dans n'importe quel format qu'APT prend en charge &agrave; condition qu'ils portent la bonne extension. Si vous avez besoin de stocker plusieurs de ces fichiers dans un seul r&eacute;pertoire, vous pouvez ajouter comme pr&eacute;fixe le nom que vous voulez pourvu que le dernier caract&egrave;re soit un tiret bas (&laquo;&nbsp;_&nbsp;&raquo;). Exemple&nbsp;: mon.exemple_Packages.xz
<P>
Veuillez noter que ces sources sont trait&eacute;es comme fiables (voir
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)). &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Sources::With.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="41"><DD>
Afficher un bref r&eacute;sum&eacute; de l'utilisation.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="42"><DD>
Afficher la version du programme.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="43"><DD>
Fichier de configuration ; indique le fichier de configuration &agrave; utiliser. Le programme lira le fichier de configuration par d&eacute;faut puis le fichier indiqu&eacute; ici. Si les r&eacute;glages de configuration doivent &ecirc;tre &eacute;tablis avant l'analyse des fichiers de configuration par d&eacute;faut, un fichier peut &ecirc;tre indiqu&eacute; avec la variable d'environnement
<B>APT_CONFIG</B>. Veuillez consulter
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
pour des informations sur la syntaxe d'utilisation.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="44"><DD>
D&eacute;finir une option de configuration ; permet de r&eacute;gler une option de configuration donn&eacute;e. La syntaxe est
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
et
<B>--option</B>
peuvent &ecirc;tre utilis&eacute;es plusieurs fois pour d&eacute;finir des options diff&eacute;rentes.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="45"><DD>
Emplacement pour la r&eacute;cup&eacute;ration des paquets. &Eacute;l&eacute;ment de configuration :
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="46"><DD>
Fragments de fichiers d&eacute;finissant les emplacements de r&eacute;cup&eacute;ration de paquets. &Eacute;l&eacute;ment de configuration :
Dir::Etc::SourceParts.
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="47"><DD>
Zone de stockage pour les informations qui concernent chaque ressource de paquet sp&eacute;cifi&eacute;e dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
&Eacute;l&eacute;ment de configuration :
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="48"><DD>
Zone de stockage pour les informations en transit. &Eacute;l&eacute;ment de configuration :
Dir::State::Lists
(partial
sera implicitement ajout&eacute;).
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8).
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGNOSTICS</H2>

<P>

<B>apt-cache</B>
retourne z&eacute;ro apr&egrave;s un d&eacute;roulement normal et le nombre d&eacute;cimal&nbsp;100 en cas d'erreur.
<A NAME="lbAI">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[3]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="49"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="50"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="51"> 1.<DD>
GraphViz
<DL COMPACT><DT id="52"><DD>
<A HREF="http://www.research.att.com/sw/tools/graphviz/">http://www.research.att.com/sw/tools/graphviz/</A>
</DL>

<DT id="53"> 2.<DD>
VCG tool
<DL COMPACT><DT id="54"><DD>
<A HREF="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html</A>
</DL>

<DT id="55"> 3.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="56"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="57"><A HREF="#lbAB">NOM</A><DD>
<DT id="58"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="59"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="60"><A HREF="#lbAE">OPTIONS</A><DD>
<DT id="61"><A HREF="#lbAF">FICHIERS</A><DD>
<DT id="62"><A HREF="#lbAG">VOIR AUSSI</A><DD>
<DT id="63"><A HREF="#lbAH">DIAGNOSTICS</A><DD>
<DT id="64"><A HREF="#lbAI">BOGUES</A><DD>
<DT id="65"><A HREF="#lbAJ">TRADUCTEURS</A><DD>
<DT id="66"><A HREF="#lbAK">AUTEURS</A><DD>
<DT id="67"><A HREF="#lbAL">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
