
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-GET</TITLE>
</HEAD><BODY>
<H1>APT-GET</H1>
Section: APT (8)<BR>Updated: 15&nbsp;janvier&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-get - Utilitaire APT pour la gestion des paquets -- interface en ligne de commande.
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>apt-get</B> [<B>-asqdyfmubV</B>] [<B>-o=</B><B></B><I>cha&icirc;ne_de_configuration</I>] [<B>-c=</B><B></B><I>fichier_de_configuration</I>] [<B>-t=</B><B></B><I>publication_cible</I>] [<B>-a=</B><B></B><I>architecture</I>] {update | upgrade | dselect-upgrade | dist-upgrade | install&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | remove&nbsp;<I>paquet</I>...  | purge&nbsp;<I>paquet</I>...  | source&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | build-dep&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | download&nbsp;<I>paquet</I>&nbsp;[{=<I>num&eacute;ro_version_paquet</I>&nbsp;|&nbsp;/<I>publication_cible</I>}]...  | check | clean | autoclean | autoremove | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

<B>apt-get</B>
<DD>est le programme en ligne de commande pour la gestion des paquets. Il peut &ecirc;tre consid&eacute;r&eacute; comme l'outil de base pour les autres programmes de la biblioth&egrave;que APT. Plusieurs interfaces utilisateur existent, comme
<B><A HREF="/cgi-bin/man/man2html?8+aptitude">aptitude</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+synaptic">synaptic</A></B>(8)
and
<B><A HREF="/cgi-bin/man/man2html?1+wajig">wajig</A></B>(1).
<P>

&Agrave; moins que l'option
<B>-h</B>
ou
<B>--help</B>
ne soit donn&eacute;e, l'une des commandes suivantes doit &ecirc;tre pr&eacute;sente.
<P>

<B>update</B>
<DL COMPACT><DT id="2"><DD>
La commande
update
permet de resynchroniser un fichier d'index r&eacute;pertoriant les paquets disponibles et sa source. Ces fichiers sont r&eacute;cup&eacute;r&eacute;s aux endroits sp&eacute;cifi&eacute;s dans
/etc/apt/sources.list. Ainsi, lorsqu'on utilise une archive Debian, cette commande r&eacute;cup&egrave;re les fichiers
Packages.gz
et les analyse de mani&egrave;re &agrave; rendre disponibles les informations concernant les nouveaux paquets et les paquets mis &agrave; jour. On devrait toujours ex&eacute;cuter une commande
update
avant les commandes
upgrade
ou
dist-upgrade. Veuillez noter que l'indicateur de progression d'ensemble peut &ecirc;tre impr&eacute;cis puisque la taille de ces fichiers ne peut &ecirc;tre connue &agrave; l'avance.
</DL>

<P>

<B>upgrade</B>
<DL COMPACT><DT id="3"><DD>
La commande
upgrade
permet d'installer les versions les plus r&eacute;centes de tous les paquets pr&eacute;sents sur le syst&egrave;me en utilisant les sources &eacute;num&eacute;r&eacute;es dans
/etc/apt/sources.list. Les paquets install&eacute;s dont il existe de nouvelles versions sont r&eacute;cup&eacute;r&eacute;s et mis &agrave; niveau. En aucun cas des paquets d&eacute;j&agrave; install&eacute;s ne sont supprim&eacute;s&nbsp;; de m&ecirc;me, des paquets qui ne sont pas d&eacute;j&agrave; install&eacute;s ne sont ni r&eacute;cup&eacute;r&eacute;s ni install&eacute;s. Les paquets dont de nouvelles versions ne peuvent pas &ecirc;tre install&eacute;es sans changer le statut d'installation d'un autre paquet sont laiss&eacute;s dans leur version courante. On doit d'abord ex&eacute;cuter la commande
update
pour que
<B>apt-get</B>
connaisse l'existence de nouvelles versions des paquets.
</DL>

<P>

<B>dist-upgrade</B>
<DL COMPACT><DT id="4"><DD>
La commande
dist-upgrade
effectue la fonction
upgrade
en y ajoutant une gestion intelligente des changements de d&eacute;pendances dans les nouvelles versions des paquets&nbsp;;
<B>apt-get</B>
poss&egrave;de un syst&egrave;me &laquo;&nbsp;intelligent&nbsp;&raquo; de r&eacute;solution des conflits et il essaye, quand c'est n&eacute;cessaire, de mettre &agrave; niveau les paquets les plus importants avant les paquets les moins importants. Le fichier
/etc/apt/sources.list
contient une liste de sources o&ugrave; r&eacute;cup&eacute;rer les paquets d&eacute;sir&eacute;s. Voyez aussi
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)
pour un m&eacute;canisme de remplacement des param&egrave;tres g&eacute;n&eacute;raux pour certains paquets.
</DL>

<P>

<B>dselect-upgrade</B>
<DL COMPACT><DT id="5"><DD>
dselect-upgrade
est utilis&eacute;e conjointement avec
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1), la plus ancienne interface du projet Debian pour la gestion des paquets. La commande
dselect-upgrade
suit les modifications faites par
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
dans le champ
Status
des paquets disponibles, et effectue les actions n&eacute;cessaires &agrave; la r&eacute;alisation de cet &eacute;tat (par exemple, suppression d'anciens paquets, installation de nouveaux paquets).
</DL>

<P>

<B>install</B>
<DL COMPACT><DT id="6"><DD>
La commande
install
est suivie par un ou plusieurs paquets &agrave; installer. Chaque paquet est un nom de paquet&nbsp;; ce n'est pas un nom complet de fichier (par exemple, dans un syst&egrave;me Debian, on indiquera
apt-utils
et non pas
apt-utils_2.0.4_amd64.deb). Tous les paquets requis par le(s) paquet(s) que l'on veut installer sont aussi r&eacute;cup&eacute;r&eacute;s et install&eacute;s. Le fichier
/etc/apt/sources.list
est utilis&eacute; pour retrouver les paquets d&eacute;sir&eacute;s. Quand un trait d'union est accol&eacute; (sans espace interm&eacute;diaire) au nom d'un paquet d&eacute;j&agrave; install&eacute;, ce paquet est supprim&eacute;. De m&ecirc;me on peut ajouter un signe &laquo;&nbsp;+&nbsp;&raquo; pour d&eacute;signer un paquet &agrave; installer. Cette derni&egrave;re fonctionnalit&eacute; peut &ecirc;tre utilis&eacute;e pour annuler les d&eacute;cisions prises par le syst&egrave;me de r&eacute;solution des conflits d'apt-get.
<P>
On peut choisir d'installer une version particuli&egrave;re d'un paquet en faisant suivre son nom par un signe &eacute;gal et par la version. Cette version sera recherch&eacute;e et l'installation sera demand&eacute;e. On peut aussi choisir une distribution particuli&egrave;re en faisant suivre le nom du paquet par une barre oblique et par le nom de la distribution ou de l'archive (stable, testing, unstable).
<P>
Avec ces possibilit&eacute;s de choisir la version, de vieilles versions d'un paquet peuvent &ecirc;tre install&eacute;es. Cette fonctionnalit&eacute; est donc &agrave; utiliser avec pr&eacute;caution.
<P>
Cette m&eacute;thode est aussi utile pour mettre &agrave; jour un ou plusieurs paquets d&eacute;j&agrave; install&eacute;s sans mettre &agrave; jour les autres paquets du syst&egrave;me. &Agrave; la diff&eacute;rence de la commande &laquo;&nbsp;upgrade&nbsp;&raquo; qui installera la derni&egrave;re version disponible de tous les paquets install&eacute;s au moment de son ex&eacute;cution, &laquo;&nbsp;install&nbsp;&raquo; n'installera la nouvelle version que pour le(s) paquet(s) indiqu&eacute;(s). Il suffit de fournir le nom du(des) paquet(s) &agrave; mettre &agrave; jour et si une nouvelle version est disponible, cette version (et ses d&eacute;pendances, comme d&eacute;crit plus haut) sera r&eacute;cup&eacute;r&eacute;e et install&eacute;e.
<P>
Enfin, le m&eacute;canisme d'<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)
permet de cr&eacute;er d'autres r&egrave;gles pour l'installation des paquets.
<P>
Quand aucun paquet ne correspond &agrave; l'expression donn&eacute;e en param&egrave;tre et que cette expression contient l'un des caract&egrave;res &laquo;&nbsp;.&nbsp;&raquo;, &laquo;&nbsp;?&nbsp;&raquo; ou &laquo;&nbsp;*&nbsp;&raquo;, elle est consid&eacute;r&eacute;e comme une expression rationnelle POSIX et elle est appliqu&eacute;e &agrave; tous les paquets de la base de donn&eacute;es. Tout paquet correspondant est install&eacute; (ou supprim&eacute;). Veuillez noter que la comparaison est effectu&eacute;e par sous-cha&icirc;ne et &laquo;&nbsp;lo.*&nbsp;&raquo; correspond aussi bien &agrave; &laquo;&nbsp;how-lo&nbsp;&raquo; qu'&agrave; &laquo;&nbsp;lowest&nbsp;&raquo;. Si ce n'est pas le comportement souhait&eacute;, l'expression peut &ecirc;tre ancr&eacute;e avec un caract&egrave;re &laquo;&nbsp;^&nbsp;&raquo; ou un caract&egrave;re &laquo;&nbsp;$&nbsp;&raquo;, une autre possibilit&eacute; &eacute;tant d'utiliser une expression plus pr&eacute;cise.
<P>
Fallback to regular expressions is deprecated in APT 2.0, has been removed in
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8), except for anchored expressions, and will be removed from
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
in a future version. Use
<B><A HREF="/cgi-bin/man/man2html?5+apt-patterns">apt-patterns</A></B>(5)
instead.
</DL>

<P>

<B>reinstall</B>
<DL COMPACT><DT id="7"><DD>
reinstall
est un alias de la commande
install --reinstall.
</DL>

<P>

<B>remove</B>
<DL COMPACT><DT id="8"><DD>
La commande
remove
est identique &agrave; la commande
install, les paquets &eacute;tant alors supprim&eacute;s et non install&eacute;s. Veuillez noter que la suppression d'un paquet en laisse les fichiers de configuration sur le syst&egrave;me. Quand un signe plus est accol&eacute; (sans espace interm&eacute;diaire) au nom du paquet, le paquet est install&eacute; au lieu d'&ecirc;tre supprim&eacute;.
</DL>

<P>

<B>purge</B>
<DL COMPACT><DT id="9"><DD>
La commande
purge
est identique &agrave;
remove
mais les paquets indiqu&eacute;s sont supprim&eacute;s et purg&eacute;s (leurs fichiers de configuration sont &eacute;galement effac&eacute;s).
</DL>

<P>

<B>source</B>
<DL COMPACT><DT id="10"><DD>
Avec la commande
source,
<B>apt-get</B>
r&eacute;cup&egrave;re des paquets source. APT examine les paquets disponibles pour choisir le paquet source &agrave; r&eacute;cup&eacute;rer. Il t&eacute;l&eacute;charge ensuite dans le r&eacute;pertoire courant la version la plus r&eacute;cente du paquet, d&eacute;finie par rapport &agrave; la distribution par d&eacute;faut &eacute;tablie soit avec l'option
APT::Default-Release, soit avec l'option
<B>-t</B>
ou soit par paquet avec la syntaxe
paquet/version
si possible.
<P>
Les arguments sont interpr&eacute;t&eacute;s comme des noms de paquet binaire ou de paquet source. Voir l'option
<B>--only-source</B>
si vous souhaitez modifier cela.
<P>
Les paquets source sont g&eacute;r&eacute;s ind&eacute;pendamment des paquets binaires, avec les lignes
deb-src
dans le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). Il est donc n&eacute;cessaire d'ajouter une telle ligne pour chaque d&eacute;p&ocirc;t pour lequel vous souhaitez pouvoir obtenir les sources. Dans le cas contraire, vous n'obtiendrez pas les m&ecirc;mes sources que celles du paquet que vous avez install&eacute; ou que vous voulez installer.
<P>
Si l'option
<B>--compile</B>
est sp&eacute;cifi&eacute;e, le paquet est compil&eacute; en un binaire .deb avec
<B>dpkg-buildpackage</B>
pour l'architecture d&eacute;finie par l'option
<B>--host-architecture</B>. Si
<B>--download-only</B>
est sp&eacute;cifi&eacute;, le source n'est pas d&eacute;compact&eacute;.
<P>
De la m&ecirc;me fa&ccedil;on qu'avec les paquets binaires, on peut r&eacute;cup&eacute;rer une version particuli&egrave;re d'un paquet source en faisant suivre son nom par un signe &eacute;gal et par la version. Cela permet une comparaison exacte entre le nom du paquet source et la version&nbsp;; l'option correspondante est&nbsp;:&nbsp;APT::Get::Only-Source.
<P>
Veuillez noter que les paquets source ne sont pas install&eacute;s et suivis dans la base de donn&eacute;es de
<B>dpkg</B>
comme le sont les paquets binaires&nbsp;; ils sont simplement t&eacute;l&eacute;charg&eacute;s dans le r&eacute;pertoire courant, comme les archives tar.
</DL>

<P>

<B>build-dep</B>
<DL COMPACT><DT id="11"><DD>
Avec la commande
build-dep, apt-get installe ou supprime des paquets dans le but de satisfaire les d&eacute;pendances de construction d'un paquet source. Par d&eacute;faut, les d&eacute;pendances sont satisfaites pour la construction native du paquet. Au besoin, une architecture h&ocirc;te peut &ecirc;tre indiqu&eacute;e avec l'option
<B>--host-architecture</B>.
<P>
Les arguments sont interpr&eacute;t&eacute;s comme des noms de paquet binaire ou de paquet source. Voir l'option
<B>--only-source</B>
si vous souhaitez modifier cela.
</DL>

<P>

<B>satisfy</B>
<DL COMPACT><DT id="12"><DD>
satisfy
causes apt-get to satisfy the given dependency strings. The dependency strings may have build profiles and architecture restriction list as in build dependencies. They may optionally be prefixed with
&quot;Conflicts: &quot;
to unsatisfy the dependency string. Multiple strings of the same type can be specified.
<P>
Example:
apt-get satisfy &quot;foo&quot; &quot;Conflicts: bar&quot; &quot;baz (&gt;&gt; 1.0) | bar (= 2.0), moo&quot;
<P>
The legacy operator '&lt;/&gt;' is not supported, use '&lt;=/&gt;=' instead.
</DL>

<P>

<B>check</B>
<DL COMPACT><DT id="13"><DD>
La commande
check
est un outil de diagnostic&nbsp;; il met &agrave; jour le cache des paquets et cherche les d&eacute;pendances d&eacute;fectueuses.
</DL>

<P>

<B>download</B>
<DL COMPACT><DT id="14"><DD>
download
t&eacute;l&eacute;charge le fichier binaire indiqu&eacute; dans le r&eacute;pertoire courant.
</DL>

<P>

<B>clean</B>
<DL COMPACT><DT id="15"><DD>
La commande
clean
nettoie le d&eacute;p&ocirc;t local des paquets r&eacute;cup&eacute;r&eacute;s. Elle supprime tout, except&eacute; le fichier de verrou situ&eacute; dans
/var/cache/apt/archives/
et
/var/cache/apt/archives/partial/.
</DL>

<P>

<B>autoclean</B> (et <B>auto-clean</B> l'alias depuis la version&nbsp;1.1)
<DL COMPACT><DT id="16"><DD>
Tout comme
clean,
autoclean
nettoie le d&eacute;p&ocirc;t local des paquets r&eacute;cup&eacute;r&eacute;s. La diff&eacute;rence est qu'il supprime uniquement les paquets qui ne peuvent plus &ecirc;tre t&eacute;l&eacute;charg&eacute;s et qui sont inutiles. On peut ainsi contr&ocirc;ler la taille de ce cache sur une longue p&eacute;riode. Tant qu'elle n'est pas activ&eacute;e, l'option de configuration
APT::Clean-Installed
emp&ecirc;che la suppression de paquets install&eacute;s.
</DL>

<P>

<B>autoremove</B> (et <B>auto-remove</B> l'alias depuis la version&nbsp;1.1)
<DL COMPACT><DT id="17"><DD>
Avec la commande
autoremove, apt-get supprime les paquets install&eacute;s dans le but de satisfaire les d&eacute;pendances d'autres paquets et qui ne sont plus n&eacute;cessaires.
</DL>

<P>

<B>changelog</B>
<DL COMPACT><DT id="18"><DD>
changelog
tente de t&eacute;l&eacute;charger le journal des modifications d'un paquet et l'affiche avec
<B>sensible-pager</B>. Par d&eacute;faut, c'est le journal des modifications de la version install&eacute;e du paquet qui est affich&eacute;. Cependant, il est possible d'utiliser les m&ecirc;mes options que pour la commande
<B>install</B>.
</DL>

<P>

<B>indextargets</B>
<DL COMPACT><DT id="19"><DD>
La commande affiche par d&eacute;faut une liste au format deb822 des informations sur tous les fichiers de donn&eacute;es (ou cibles d'index) que
<B>apt-get update</B>
peut t&eacute;l&eacute;charger. Elle prend en charge une option
<B>--format</B>
pour modifier le format de sortie et accepte les lignes de la sortie par d&eacute;faut pour filtrer les enregistrements. La commande est utilis&eacute;e principalement comme interface avec les outils qui fonctionnent avec APT pour obtenir des informations comme les noms des fichiers t&eacute;l&eacute;charg&eacute;s de telle sorte qu'ils peuvent les utiliser plut&ocirc;t que de les t&eacute;l&eacute;charger &agrave; nouveau de leur c&ocirc;t&eacute;. La documentation d&eacute;taill&eacute;e, absente ici, peut &ecirc;tre trouv&eacute;e dans le fichier
/usr/share/doc/apt-doc/acquire-additional-files.md.gz
fourni par le paquet
apt-doc.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Toutes les options de la ligne de commande peuvent &ecirc;tre d&eacute;finies dans le fichier de configuration, les descriptions indiquant l'option de configuration concern&eacute;e. Pour les options bool&eacute;ennes, vous pouvez inverser les r&eacute;glages du fichiers de configuration avec
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
et d'autres variantes analogues.
<P>

<B>--no-install-recommends</B>
<DL COMPACT><DT id="20"><DD>
Ne pas consid&eacute;rer les paquets recommand&eacute;s comme des d&eacute;pendances &agrave; installer. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Install-Recommends.
</DL>

<P>

<B>--install-suggests</B>
<DL COMPACT><DT id="21"><DD>
Consid&eacute;rer les paquets sugg&eacute;r&eacute;s comme des d&eacute;pendances &agrave; installer. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Install-Suggests.
</DL>

<P>

<B>-d</B>, <B>--download-only</B>
<DL COMPACT><DT id="22"><DD>
R&eacute;cup&eacute;ration seule&nbsp;; les paquets sont r&eacute;cup&eacute;r&eacute;s mais ne sont ni d&eacute;paquet&eacute;s ni install&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Download-Only.
</DL>

<P>

<B>-f</B>, <B>--fix-broken</B>
<DL COMPACT><DT id="23"><DD>
Correction&nbsp;; cette option demande de r&eacute;parer un syst&egrave;me o&ugrave; existent des d&eacute;pendances d&eacute;fectueuses. Utilis&eacute;e avec install ou remove, elle peut exclure un paquet pour permettre de d&eacute;duire une solution viable. Tout paquet sp&eacute;cifi&eacute; doit compl&egrave;tement corriger le probl&egrave;me. Cette option est quelquefois n&eacute;cessaire lorsque l'on ex&eacute;cute APT pour la premi&egrave;re fois&nbsp;; APT interdit les d&eacute;pendances d&eacute;fectueuses dans un syst&egrave;me. Il est possible que la structure de d&eacute;pendances d'un syst&egrave;me soit tellement corrompue qu'elle requiert une intervention manuelle (ce qui veut dire la plupart du temps utiliser
<B>dpkg --remove</B>
pour &eacute;liminer les paquets en cause). L'utilisation de cette option conjointement avec
<B>-m</B>
peut produire une erreur dans certaines situations. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Fix-Broken.
</DL>

<P>

<B>-m</B>, <B>--ignore-missing</B>, <B>--fix-missing</B>
<DL COMPACT><DT id="24"><DD>
Ignorer les paquets manquants&nbsp;; si des paquets ne peuvent &ecirc;tre r&eacute;cup&eacute;r&eacute;s, ou, apr&egrave;s r&eacute;cup&eacute;ration, ne satisfont pas au contr&ocirc;le d'int&eacute;grit&eacute;, cette commande met ces paquets de c&ocirc;t&eacute; et g&egrave;re le r&eacute;sultat. Utiliser cette option conjointement avec
<B>-f</B>
peut produire une erreur dans certaines situations. Quand un paquet, s&eacute;lectionn&eacute; pour une installation (particuli&egrave;rement si c'est mentionn&eacute; en ligne de commande), ne peut &ecirc;tre r&eacute;cup&eacute;r&eacute;, il est mis silencieusement de c&ocirc;t&eacute;. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Fix-Missing.
</DL>

<P>

<B>--no-download</B>
<DL COMPACT><DT id="25"><DD>
Pas de r&eacute;cup&eacute;ration. Le mieux est d'utiliser cette option avec
<B>--ignore-missing</B>
pour forcer APT &agrave; n'utiliser que les .deb qu'il a d&eacute;j&agrave; r&eacute;cup&eacute;r&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Download.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="26"><DD>
Mode silencieux&nbsp;; cette commande produit une sortie destin&eacute;e &agrave; l'enregistrement dans un fichier-journal en omettant les indicateurs de progression. Un plus grand nombre de &laquo;&nbsp;q&nbsp;&raquo; (2 au plus) produit un plus grand silence. On peut aussi utiliser
<B>-q=#</B>
pour positionner le niveau de silence, et annuler le fichier de configuration. Notez qu'un niveau de silence &eacute;gal &agrave;&nbsp;2 implique
<B>-y</B>
et vous ne devez jamais utiliser
<B>-qq</B>
sans l'accompagner d'un modificateur tel que
<B>-d</B>,
<B>--print-uris</B>
ou
<B>-s</B>&nbsp;: APT pourrait alors ex&eacute;cuter des actions inattendues. &Eacute;l&eacute;ment de configuration&nbsp;:
quiet.
</DL>

<P>

<B>-s</B>, <B>--simulate</B>, <B>--just-print</B>, <B>--dry-run</B>, <B>--recon</B>, <B>--no-act</B>
<DL COMPACT><DT id="27"><DD>
Pas d'action&nbsp;; r&eacute;alise une simulation des &eacute;v&eacute;nements qui pourraient survenir sur la base de l'&eacute;tat du syst&egrave;me actuel, mais ne modifie pas v&eacute;ritablement le syst&egrave;me. Le verrouillage sera d&eacute;sactiv&eacute; (<B>Debug::NoLocking</B>), ainsi l'&eacute;tat du syst&egrave;me peut changer pendant que
<B>apt-get</B>
est ex&eacute;cut&eacute;. Les simulations peuvent aussi &ecirc;tre ex&eacute;cut&eacute;es par les utilisateurs ordinaires qui pourraient ne pas avoir acc&egrave;s en lecture &agrave; toute la configuration d'apt, ce qui fausse la simulation. Une annonce exprimant cet avertissement est aussi affich&eacute;e par d&eacute;faut pour les utilisateurs ordinaires (<B>APT::Get::Show-User-Simulation-Note</B>). &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Simulate.
<P>
La simulation affiche une s&eacute;rie de lignes repr&eacute;sentant chacune une op&eacute;ration de
<B>dpkg</B>, Configure (Conf), Remove (Remv), Unpack (Inst). Des crochets encadrent des paquets endommag&eacute;s et des crochets n'encadrant rien indiquent que les dommages n'ont aucune cons&eacute;quence (rare).
</DL>

<P>

<B>-y</B>, <B>--yes</B>, <B>--assume-yes</B>
<DL COMPACT><DT id="28"><DD>
R&eacute;pondre automatiquement oui aux questions&nbsp;; pr&eacute;sume &laquo;&nbsp;oui&nbsp;&raquo; comme r&eacute;ponse &agrave; toutes les questions et s'ex&eacute;cute de mani&egrave;re non interactive. Dans le cas d'une situation ind&eacute;sirable, comme le changement d'un paquet gel&eacute;, l'installation d'un paquet non authentifi&eacute; ou la suppression d'un paquet essentiel,
apt-get
s'interrompt. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Assume-Yes.
</DL>

<P>

<B>--assume-no</B>
<DL COMPACT><DT id="29"><DD>
R&eacute;pondre automatiquement n&eacute;gativement aux questions. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Assume-No.
</DL>

<P>

<B>--no-show-upgraded</B>
<DL COMPACT><DT id="30"><DD>
Ne pas afficher la liste de tous les paquets qui doivent &ecirc;tre mis &agrave; niveau. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Show-Upgraded.
</DL>

<P>

<B>-V</B>, <B>--verbose-versions</B>
<DL COMPACT><DT id="31"><DD>
Afficher les versions compl&egrave;tes des paquets install&eacute;s ou mis &agrave; niveau. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Show-Versions.
</DL>

<P>

<B>-a</B>, <B>--host-architecture</B>
<DL COMPACT><DT id="32"><DD>
Cette option contr&ocirc;le comment les paquets d'architectures sont construits par
<B>apt-get source --compile</B>
et comment les d&eacute;pendances de construction transverses sont respect&eacute;es. Elle n'est pas positionn&eacute;e par d&eacute;faut ce qui signifie que l'architecture h&ocirc;te est la m&ecirc;me que l'architecture de construction (d&eacute;finie par
APT::Architecture). &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Host-Architecture.
</DL>

<P>

<B>-P</B>, <B>--build-profiles</B>
<DL COMPACT><DT id="33"><DD>
Cette option contr&ocirc;le les profils de construction actifs pour lesquels un paquet source est construit par
<B>apt-get source --compile</B>
et comment les d&eacute;pendances sont respect&eacute;es. Par d&eacute;faut, aucun profil de construction n'est actif. Plus d'un profil peut &ecirc;tre activ&eacute; en m&ecirc;me temps en les concat&eacute;nant par une virgule. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Build-Profiles.
</DL>

<P>

<B>-b</B>, <B>--compile</B>, <B>--build</B>
<DL COMPACT><DT id="34"><DD>
Cette commande compile un paquet source apr&egrave;s l'avoir r&eacute;cup&eacute;r&eacute;. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Compile.
</DL>

<P>

<B>--ignore-hold</B>
<DL COMPACT><DT id="35"><DD>
Cette commande ignore la marque &laquo;&nbsp;Hold&nbsp;&raquo; (&laquo;&nbsp;retenu&nbsp;&raquo;) d'un paquet&nbsp;; par ce biais,
<B>apt-get</B>
ignore un &laquo;&nbsp;hold&nbsp;&raquo; plac&eacute; sur un paquet. cela peut &ecirc;tre utile avec
dist-upgrade
pour annuler un grand nombre de &laquo;&nbsp;hold&nbsp;&raquo; ind&eacute;sirables. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Ignore-Hold.
</DL>

<P>

<B>--with-new-pkgs</B>
<DL COMPACT><DT id="36"><DD>
Cette commande permet d'installer de nouveaux paquets lorsqu'elle est utilis&eacute;e en conjonction avec la commande
upgrade. C'est utile si la mise &agrave; jour d'un paquet install&eacute; exige l'installation de nouveaux paquets. Plut&ocirc;t que de conserver le paquet,
upgrade
mettra &agrave; jour le paquet et installera les nouvelles d&eacute;pendances. Remarquez que la commande
upgrade
avec cette option ne retirera jamais de paquets&nbsp;: elle ne permettra que l'ajout de nouveaux. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Upgrade-Allow-New.
</DL>

<P>

<B>--no-upgrade</B>
<DL COMPACT><DT id="37"><DD>
Aucune mise &agrave; niveau&nbsp;; quand elle est utilis&eacute;e avec
install, cette commande emp&ecirc;che les paquets mentionn&eacute;s sur la ligne de commande d'&ecirc;tre mis &agrave; niveau. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Upgrade.
</DL>

<P>

<B>--only-upgrade</B>
<DL COMPACT><DT id="38"><DD>
N'installe aucun nouveau paquet&nbsp;; quand elle est utilis&eacute;e avec
install,
only-upgrade
ne met &agrave; jour que les paquets install&eacute;s sans en installer de nouveaux. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Only-Upgrade.
</DL>

<P>

<B>--allow-downgrades</B>
<DL COMPACT><DT id="39"><DD>
Cette option est dangereuse parce qu'elle laisse APT continuer sans poser de questions quand il r&eacute;alise un retour en arri&egrave;re. Elle ne doit &ecirc;tre utilis&eacute;e que dans des circonstances tr&egrave;s sp&eacute;ciales. L'utiliser peut &eacute;ventuellement d&eacute;truire le syst&egrave;me&nbsp;! &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::allow-downgrades. Introduite dans APT&nbsp;1.1
</DL>

<P>

<B>--allow-remove-essential</B>
<DL COMPACT><DT id="40"><DD>
Forcer l'acceptation&nbsp;; cette option est dangereuse parce qu'elle laisse APT continuer sans poser de questions quand il supprime des paquets essentiels. Cette option ne doit &ecirc;tre utilis&eacute;e que dans des circonstances tr&egrave;s sp&eacute;ciales. L'utiliser peut &eacute;ventuellement d&eacute;truire le syst&egrave;me&nbsp;! &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::allow-remove-essential. Introduite dans APT&nbsp;1.1.
</DL>

<P>

<B>--allow-change-held-packages</B>
<DL COMPACT><DT id="41"><DD>
Forcer l'acceptation&nbsp;; cette option est dangereuse parce qu'elle laisse APT continuer sans poser de questions quand il modifie des paquets retenus. (&laquo;&nbsp;hold&nbsp;&raquo;). Cette option ne doit &ecirc;tre utilis&eacute;e que dans des circonstances tr&egrave;s sp&eacute;ciales. L'utiliser peut &eacute;ventuellement d&eacute;truire le syst&egrave;me&nbsp;! &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::allow-change-held-packages. Introduite dans&nbsp;APT&nbsp;1.1.
</DL>

<P>

<B>--force-yes</B>
<DL COMPACT><DT id="42"><DD>
Forcer l'acceptation&nbsp;; cette option est dangereuse parce qu'elle laisse APT continuer sans poser de questions quand il r&eacute;alise quelque chose de potentiellement dommageable. Cette option ne doit &ecirc;tre utilis&eacute;e que dans des circonstances tr&egrave;s sp&eacute;ciales. Utiliser
force-yes
peut &eacute;ventuellement d&eacute;truire le syst&egrave;me&nbsp;! &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::force-yes. Cette option est obsol&egrave;te et remplac&eacute;e par
<B>--allow-unauthenticated</B>,
<B>--allow-downgrades</B>,
<B>--allow-remove-essential</B>
et
<B>--allow-change-held-packages</B>
dans APT&nbsp;1.1.
</DL>

<P>

<B>--print-uris</B>
<DL COMPACT><DT id="43"><DD>
Au lieu de r&eacute;cup&eacute;rer les paquets &agrave; installer, leurs URI sont affich&eacute;es. Chaque URI a un chemin, un nom de fichier destination, une taille et une cl&eacute; MD5 attendue. Veuillez noter que le nom de fichier &agrave; afficher ne correspond pas toujours au nom de fichier sur le site distant. Cette option fonctionne aussi avec la commande
source
et avec la commande
update. Avec la commande
update, la somme MD5 et la taille ne sont pas donn&eacute;es et c'est &agrave; l'utilisateur de d&eacute;compresser les fichiers compress&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Print-URIs.
</DL>

<P>

<B>--purge</B>
<DL COMPACT><DT id="44"><DD>
Utiliser &laquo;&nbsp;purge&nbsp;&raquo; &agrave; la place de &laquo;&nbsp;remove&nbsp;&raquo; pour supprimer tout ce qui peut &ecirc;tre supprim&eacute;. Un ast&eacute;risque (*) sera accol&eacute; aux noms des paquets qui vont &ecirc;tre purg&eacute;s.
<B>remove --purge</B>
est &eacute;quivalent &agrave; la commande
<B>purge</B>. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Purge.
</DL>

<P>

<B>--reinstall</B>
<DL COMPACT><DT id="45"><DD>
R&eacute;installer les paquets d&eacute;j&agrave; install&eacute;s avec leur version la plus r&eacute;cente. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::ReInstall.
</DL>

<P>

<B>--list-cleanup</B>
<DL COMPACT><DT id="46"><DD>
Cette option est activ&eacute;e par d&eacute;faut&nbsp;; utilisez
--no-list-cleanup
pour la d&eacute;sactiver. Quand elle est activ&eacute;e,
<B>apt-get</B>
g&egrave;re automatiquement le contenu de
/var/lib/apt/lists
afin d'assurer que les fichiers obsol&egrave;tes soient effac&eacute;s. La seule raison de la d&eacute;sactiver est une modification fr&eacute;quente de la liste de sources. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::List-Cleanup.
</DL>

<P>

<B>-t</B>, <B>--target-release</B>, <B>--default-release</B>
<DL COMPACT><DT id="47"><DD>
Cette option contr&ocirc;le l'entr&eacute;e par d&eacute;faut pour les questions de distribution&nbsp;; un &eacute;pinglage (pin) par d&eacute;faut dont la priorit&eacute; vaut 990 est cr&eacute;&eacute;e en utilisant la cha&icirc;ne sp&eacute;cifi&eacute;e. Le fichier des pr&eacute;f&eacute;rences peut annuler cette d&eacute;cision. En clair, cette option permet de contr&ocirc;ler simplement dans quelle distribution seront r&eacute;cup&eacute;r&eacute;s les paquets. Par exemple&nbsp;:
<B>-t '2.1*'</B>,
<B>-t unstable</B>
ou
<B>-t sid</B>. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Default-Release. Voyez aussi la page de manuel d'<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
</DL>

<P>

<B>--trivial-only</B>
<DL COMPACT><DT id="48"><DD>
Ne r&eacute;alise que les op&eacute;rations &laquo;&nbsp;triviales&nbsp;&raquo;. Logiquement ceci peut &ecirc;tre consid&eacute;r&eacute; comme relatif &agrave;
<B>--assume-yes</B>. Alors que
<B>--assume-yes</B>
r&eacute;pond oui &agrave; n'importe quelle question,
<B>--trivial-only</B>
r&eacute;pond non. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Trivial-Only.
</DL>

<P>

<B>--no-remove</B>
<DL COMPACT><DT id="49"><DD>
Arr&ecirc;ter imm&eacute;diatement apt-get, sans poser de questions, si des paquets doivent &ecirc;tre supprim&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Remove.
</DL>

<P>

<B>--auto-remove</B>, <B>--autoremove</B>
<DL COMPACT><DT id="50"><DD>
Si la commande utilis&eacute;e est soit
install
soit
remove, cette option a le m&ecirc;me effet qu'autoremove
et supprime les paquets de d&eacute;pendance inutilis&eacute;s. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Upgrade.
</DL>

<P>

<B>--only-source</B>
<DL COMPACT><DT id="51"><DD>
Cette option n'a de sens qu'avec les commandes
source
et
build-dep. Elle indique que les noms de sources donn&eacute;s ne doivent pas &ecirc;tre rep&eacute;r&eacute;s &agrave; travers le tableau des binaires. Cela signifie que si cette option est choisie, la commande
source
acceptera seulement des noms de paquets source comme argument&nbsp;; elle n'acceptera pas de les rechercher &agrave; partir des noms de paquets binaires correspondants. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Only-Source
</DL>

<P>

<B>--diff-only</B>, <B>--dsc-only</B>, <B>--tar-only</B>
<DL COMPACT><DT id="52"><DD>
Ne t&eacute;l&eacute;charger que le fichier .diff, .dsc ou .tar d'une archive source. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Diff-Only,
APT::Get::Dsc-Only
et
APT::Get::Tar-Only,
</DL>

<P>

<B>--arch-only</B>
<DL COMPACT><DT id="53"><DD>
Ne traiter que les d&eacute;pendances de construction d&eacute;pendantes de l'architecture. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Arch-Only.
</DL>

<P>

<B>--indep-only</B>
<DL COMPACT><DT id="54"><DD>
Ne traiter que les d&eacute;pendances de construction ind&eacute;pendantes de l'architecture. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::Indep-Only.
</DL>

<P>

<B>--allow-unauthenticated</B>
<DL COMPACT><DT id="55"><DD>
Ignorer le fait que les paquets ne peuvent pas &ecirc;tre authentifi&eacute;s&nbsp;; ne le signale pas &agrave; l'utilisateur. Cette option peut &ecirc;tre utile si on travaille avec des d&eacute;p&ocirc;ts locaux, mais cela repr&eacute;sente un risque consid&eacute;rable si l'authenticit&eacute; des donn&eacute;es n'est pas assur&eacute;e d'une autre mani&egrave;re par l'utilisateur lui-m&ecirc;me. L'utilisation de l'option
<B>Trusted</B>
pour les entr&eacute;es de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
devrait &ecirc;tre habituellement pr&eacute;f&eacute;r&eacute;e &agrave; ce remplacement global. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::Get::AllowUnauthenticated.
</DL>

<P>

<B>--no-allow-insecure-repositories</B>
<DL COMPACT><DT id="56"><DD>
Interdire la commande update pour obtenir des donn&eacute;es non v&eacute;rifiables des sources configur&eacute;es. APT &eacute;chouera si la commande update vise des d&eacute;p&ocirc;ts sans signatures cryptographiques valables. Voir aussi
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
pour plus de d&eacute;tails sur le concept et ses implications. &Eacute;l&eacute;ment de configuration&nbsp;:
Acquire::AllowInsecureRepositories.
</DL>

<P>

<B>--allow-releaseinfo-change</B>
<DL COMPACT><DT id="57"><DD>
Permettre &agrave; la commande update de poursuivre le t&eacute;l&eacute;chargement de donn&eacute;es &agrave; partir d'un d&eacute;p&ocirc;t qui a modifi&eacute; ses informations sur la version contenue dans le d&eacute;p&ocirc;t indiquant par exemple une nouvelle version majeure. APT &eacute;chouera &agrave; l'ex&eacute;cution de la commande update pour ces d&eacute;p&ocirc;ts jusqu'&agrave; ce que la modification soit confirm&eacute;e pour s'assurer que l'utilisateur est pr&eacute;par&eacute; &agrave; ce changement. Voir aussi
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
pour plus de d&eacute;tails sur le concept et la configuration.
<P>
Des options sp&eacute;cialis&eacute;es (--allow-releaseinfo-change-
<I>champ</I>) existent pour permettre des modifications uniquement pour certains champs tels que
origin,
label,
codename,
suite,
version
et
defaultpin. Voir aussi
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5). &Eacute;l&eacute;ment de configuration&nbsp;:
Acquire::AllowReleaseInfoChange.
</DL>

<P>

<B>--show-progress</B>
<DL COMPACT><DT id="58"><DD>
Cette commande montre les informations de progression conviviales dans la fen&ecirc;tre du terminal quand des paquets sont install&eacute;s, mis &agrave; jour ou supprim&eacute;s. Pour une version exploitable par une machine de ces donn&eacute;es, voir README.progress-reporting dans le r&eacute;pertoire doc de apt. &Eacute;l&eacute;ment de configuration&nbsp;:
Dpkg::Progress
et
Dpkg::Progress-Fancy.
</DL>

<P>

<B>--with-source</B> <B></B><I>nom_de_fichier</I>
<DL COMPACT><DT id="59"><DD>
Ajoute le fichier donn&eacute; comme source de m&eacute;ta-donn&eacute;es. La commande peut &ecirc;tre r&eacute;p&eacute;t&eacute;e pour ajouter de multiples fichiers. Voir la description de l'option
<B>--with-source</B>
dans
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
pour plus de d&eacute;tails.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="60"><DD>
Afficher un bref r&eacute;sum&eacute; de l'utilisation.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="61"><DD>
Afficher la version du programme.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="62"><DD>
Fichier de configuration ; indique le fichier de configuration &agrave; utiliser. Le programme lira le fichier de configuration par d&eacute;faut puis le fichier indiqu&eacute; ici. Si les r&eacute;glages de configuration doivent &ecirc;tre &eacute;tablis avant l'analyse des fichiers de configuration par d&eacute;faut, un fichier peut &ecirc;tre indiqu&eacute; avec la variable d'environnement
<B>APT_CONFIG</B>. Veuillez consulter
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
pour des informations sur la syntaxe d'utilisation.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="63"><DD>
D&eacute;finir une option de configuration ; permet de r&eacute;gler une option de configuration donn&eacute;e. La syntaxe est
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
et
<B>--option</B>
peuvent &ecirc;tre utilis&eacute;es plusieurs fois pour d&eacute;finir des options diff&eacute;rentes.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="64"><DD>
Emplacement pour la r&eacute;cup&eacute;ration des paquets. &Eacute;l&eacute;ment de configuration :
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="65"><DD>
Fragments de fichiers d&eacute;finissant les emplacements de r&eacute;cup&eacute;ration de paquets. &Eacute;l&eacute;ment de configuration :
Dir::Etc::SourceParts.
</DL>

<P>

/etc/apt/apt.conf
<DL COMPACT><DT id="66"><DD>
Fichier de configuration d'APT. &Eacute;l&eacute;ment de configuration :
Dir::Etc::Main.
</DL>

<P>

/etc/apt/apt.conf.d/
<DL COMPACT><DT id="67"><DD>
Fragments du fichier de configuration d'APT. &Eacute;l&eacute;ment de configuration&nbsp;:
Dir::Etc::Parts.
</DL>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="68"><DD>
Fichier des pr&eacute;f&eacute;rences. C'est dans ce fichier qu'on peut faire de l'&eacute;pinglage (pinning) c'est-&agrave;-dire, choisir d'obtenir des paquets d'une source distincte ou d'une distribution diff&eacute;rente. &Eacute;l&eacute;ment de configuration :
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="69"><DD>
Fragments de fichiers pour la pr&eacute;f&eacute;rence des versions. &Eacute;l&eacute;ment de configuration :
Dir::Etc::PreferencesParts.
</DL>

<P>

/var/cache/apt/archives/
<DL COMPACT><DT id="70"><DD>
Zone de stockage des fichiers r&eacute;cup&eacute;r&eacute;s. &Eacute;l&eacute;ment de configuration :
Dir::Cache::Archives.
</DL>

<P>

/var/cache/apt/archives/partial/
<DL COMPACT><DT id="71"><DD>
Zone de stockage pour les paquets en transit. &Eacute;l&eacute;ment de configuration :
Dir::Cache::Archives
(partial
sera implicitement ajout&eacute;).
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="72"><DD>
Zone de stockage pour les informations qui concernent chaque ressource de paquet sp&eacute;cifi&eacute;e dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
&Eacute;l&eacute;ment de configuration :
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="73"><DD>
Zone de stockage pour les informations en transit. &Eacute;l&eacute;ment de configuration :
Dir::State::Lists
(partial
sera implicitement ajout&eacute;).
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8), le guide d'APT dans /usr/share/doc/apt-doc/,
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5), le &laquo;&nbsp;HOWTO&nbsp;&raquo; d'APT.
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGNOSTICS</H2>

<P>

<B>apt-get</B>
renvoie z&eacute;ro apr&egrave;s une op&eacute;ration normale, le d&eacute;cimal 100 en cas d'erreur.
<A NAME="lbAI">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="74"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="75"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="76"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="77"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="78"><A HREF="#lbAB">NOM</A><DD>
<DT id="79"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="80"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="81"><A HREF="#lbAE">OPTIONS</A><DD>
<DT id="82"><A HREF="#lbAF">FICHIERS</A><DD>
<DT id="83"><A HREF="#lbAG">VOIR AUSSI</A><DD>
<DT id="84"><A HREF="#lbAH">DIAGNOSTICS</A><DD>
<DT id="85"><A HREF="#lbAI">BOGUES</A><DD>
<DT id="86"><A HREF="#lbAJ">TRADUCTEURS</A><DD>
<DT id="87"><A HREF="#lbAK">AUTEURS</A><DD>
<DT id="88"><A HREF="#lbAL">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:03 GMT, March 31, 2021
</BODY>
</HTML>
