
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-KEY</TITLE>
</HEAD><BODY>
<H1>APT-KEY</H1>
Section: APT (8)<BR>Updated: 04&nbsp;avril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-key - Utilitaire de gestion des cl&eacute;s d'APT
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>apt-key</B> [<B>--keyring&nbsp;</B><B></B><I>nom_de_fichier</I>] {add&nbsp;<I>nom_de_fichier</I> | del&nbsp;<I>id_de_cl&eacute;</I> | export&nbsp;<I>id_de_cl&eacute;</I> | exportall | list | finger | adv | update | net-update | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

<B>apt-key</B>
<DD>g&egrave;re les cl&eacute;s dont se sert apt pour authentifier les paquets. Les paquets authentifi&eacute;s par ces cl&eacute;s seront r&eacute;put&eacute;s fiables.
<P>

Notez que si vous souhaitez utiliser
<B>apt-key</B>, l'installation compl&eacute;mentaire de la suite GNU Privacy Guard (paquet
gnupg) est requise. Pour cette raison uniquement, l'utilisation programm&eacute;e (en particulier dans les scripts des responsables des paquets&nbsp;!) est fortement d&eacute;conseill&eacute;e. En outre, le format de sortie de toutes les commandes est ind&eacute;fini et de plus il peut changer, et il change r&eacute;ellement chaque fois que les commandes sous-jacentes changent.
<B>apt-key</B>
essaiera de d&eacute;tecter un tel usage et, dans ces cas, enverra des alertes sur l'erreur standard.
<A NAME="lbAE">&nbsp;</A>
<H2>TROUSSEAUX DE CL&Eacute;S PRIS EN CHARGE</H2>

<P>

apt-key ne prend en charge que le format binaire OpenPGP (connu aussi sous le nom de &laquo;&nbsp;trousseau de cl&eacute;s public GPG&nbsp;&raquo;) dans les fichiers avec l'extension &laquo;&nbsp;gpg&nbsp;&raquo;, et pas le format de base de donn&eacute;es Keybox, introduit comme format par d&eacute;faut pour les fichiers de trousseau de cl&eacute;s dans les versions les plus r&eacute;centes de
<B><A HREF="/cgi-bin/man/man2html?1+gpg">gpg</A></B>(1). Les fichiers binaires de trousseau de cl&eacute;s destin&eacute;s &agrave; &ecirc;tre utilis&eacute;s dans toutes les versions d'apt devraient donc toujours &ecirc;tre cr&eacute;&eacute;s avec la commande
<B>gpg --export</B>.
<P>

Autrement, si tous les syst&egrave;mes susceptibles d'utiliser le trousseau de cl&eacute;s cr&eacute;&eacute; disposent d'une version d'apt &gt;=&nbsp;1.4, il est possible d'utiliser plut&ocirc;t le format ASCII-Armored, avec l'extension &laquo;&nbsp;asc&nbsp;&raquo;, qui peut &ecirc;tre cr&eacute;&eacute; par la commande
<B>gpg --armor --export</B>.
<A NAME="lbAF">&nbsp;</A>
<H2>COMMANDES</H2>

<P>

<B>add</B> <B></B><I>nom_de_fichier</I>
<DL COMPACT><DT id="2"><DD>
Ajouter une cl&eacute; &agrave; la liste des cl&eacute;s fiables. La cl&eacute; est lue dans le fichier indiqu&eacute; avec le param&egrave;tre
<I>nom_de_fichier</I>
ou sur l'entr&eacute;e standard si le nom de fichier est
-.
<P>
Il est primordial de v&eacute;rifier que les cl&eacute;s ajout&eacute;es manuellement avec
<B>apt-key</B>
appartiennent bien au propri&eacute;taire des d&eacute;p&ocirc;ts comme elles le pr&eacute;tendent, sinon l'infrastructure de
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
est compl&egrave;tement compromise.
<P>
<I>Attention</I>&nbsp;: plut&ocirc;t que d'utiliser cette commande, un trousseau de cl&eacute;s peut &ecirc;tre plac&eacute; directement dans le r&eacute;pertoire
/etc/apt/trusted.gpg.d/
avec un nom descriptif et soit &laquo;&nbsp;gpg&nbsp;&raquo; soit &laquo;&nbsp;asc&nbsp;&raquo; comme extension de fichier.
</DL>

<P>

<B>del</B> <B></B><I>id_de_cl&eacute;</I>
<DL COMPACT><DT id="3"><DD>
Supprimer une cl&eacute; de la liste des cl&eacute;s fiables.
</DL>

<P>

<B>export</B> <B></B><I>id_de_cl&eacute;</I>
<DL COMPACT><DT id="4"><DD>
Afficher la cl&eacute;
<I>id_de_cl&eacute;</I>
sur la sortie standard.
</DL>

<P>

<B>exportall</B>
<DL COMPACT><DT id="5"><DD>
Afficher toutes les cl&eacute;s fiables sur la sortie standard.
</DL>

<P>

<B>list</B>, <B>finger</B>
<DL COMPACT><DT id="6"><DD>
Afficher la liste des cl&eacute;s fiables avec leurs empreintes.
</DL>

<P>

<B>adv</B>
<DL COMPACT><DT id="7"><DD>
Passer des options avanc&eacute;es &agrave; gpg. Avec
<B>adv --recv-key</B>, il est possible par exemple de t&eacute;l&eacute;charger une cl&eacute; directement d'un serveur de cl&eacute; dans l'ensemble de cl&eacute;s fiables. Veuillez noter qu'il n'y a
<I>aucune</I>
v&eacute;rification r&eacute;alis&eacute;e, aussi, il peut &ecirc;tre facile de compromettre compl&egrave;tement l'infrastructure
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8), si la commande est utilis&eacute;e sans pr&eacute;caution.
</DL>

<P>

<B>update</B> (obsol&egrave;te)
<DL COMPACT><DT id="8"><DD>
Mettre &agrave; jour le trousseau de cl&eacute;s local avec le trousseau de cl&eacute;s de l'archive et y supprimer les cl&eacute;s qui ne sont plus valables. Le trousseau de cl&eacute;s de l'archive est fourni dans le paquet
archive-keyring
de la distribution, par exemple le paquet
ubuntu-keyring
dans Ubuntu.
<P>
Veuillez noter qu'une distribution n'a pas besoin et, en fait, ne devrait plus utiliser cette commande et plut&ocirc;t charger directement les fichiers de trousseau de cl&eacute;s dans le r&eacute;pertoire
/etc/apt/trusted.gpg.d/
parce que cela &eacute;vite une d&eacute;pendance &agrave;
gnupg
et qu'il est plus facile pour les responsables et les utilisateurs de g&eacute;rer les cl&eacute;s en ajoutant ou en retirant simplement des fichiers.
</DL>

<P>

<B>net-update</B>
<DL COMPACT><DT id="9"><DD>
Effectuer une mise &agrave; jour analogue &agrave; celle de la commande
<B>update</B>
mais avec r&eacute;cup&eacute;ration du trousseau de cl&eacute;s de l'archive depuis une URI et la valide avec une cl&eacute; ma&icirc;tre. Cette commande n&eacute;cessite que
<B><A HREF="/cgi-bin/man/man2html?1+wget">wget</A></B>(1)
soit install&eacute;, qu'APT soit construit pour le r&eacute;cup&eacute;rer sur un serveur et enfin une cl&eacute; ma&icirc;tre pour effectuer la validation. Cette commande n'est pas g&eacute;r&eacute;e par APT dans Debian o&ugrave;
<B>update</B>
est utilis&eacute; &agrave; la place. Par contre, la version d'Ubuntu permet de l'utiliser.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Veuillez noter que les options doivent &ecirc;tre utilis&eacute;es avant les commandes d&eacute;crites dans la section suivante.
<P>

<B>--keyring</B> <B></B><I>nom_de_fichier</I>
<DL COMPACT><DT id="10"><DD>
Cette option permet d'indiquer le fichier porte-cl&eacute;s sur lequel la commande doit agir. Par d&eacute;faut, une commande sera ex&eacute;cut&eacute;e sur le fichier
trusted.gpg
ainsi que sur tous les fichiers du r&eacute;pertoire
trusted.gpg.d. Le fichier
trusted.gpg
reste le fichier principal pour les cl&eacute;s donc, par exemple, les nouvelles cl&eacute;s y seront ajout&eacute;es.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/apt/trusted.gpg
<DL COMPACT><DT id="11"><DD>
Porte-cl&eacute;s des cl&eacute;s de confiance locales. Les nouvelles cl&eacute;s y seront ajout&eacute;es. &Eacute;l&eacute;ment de configuration :
Dir::Etc::Trusted.
</DL>

<P>

/etc/apt/trusted.gpg.d/
<DL COMPACT><DT id="12"><DD>
Fragments de fichiers pour les cl&eacute;s de signatures s&ucirc;res. Des fichiers suppl&eacute;mentaires peuvent &ecirc;tre plac&eacute;s &agrave; cet endroit (par des paquets ou par l'administrateur). &Eacute;l&eacute;ment de configuration :
Dir::Etc::TrustedParts.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
<A NAME="lbAJ">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>AUTHOR</H2>

<P>

APT a &eacute;t&eacute; &eacute;crit par l'&eacute;quipe de d&eacute;veloppement APT
&lt;<A HREF="mailto:apt@packages.debian.org">apt@packages.debian.org</A>&gt;.
<A NAME="lbAL">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAM">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="13"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="14"><DD>
</DL>

<A NAME="lbAN">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="15"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="16"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="17"><A HREF="#lbAB">NOM</A><DD>
<DT id="18"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="19"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="20"><A HREF="#lbAE">TROUSSEAUX DE CL&Eacute;S PRIS EN CHARGE</A><DD>
<DT id="21"><A HREF="#lbAF">COMMANDES</A><DD>
<DT id="22"><A HREF="#lbAG">OPTIONS</A><DD>
<DT id="23"><A HREF="#lbAH">FICHIERS</A><DD>
<DT id="24"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="25"><A HREF="#lbAJ">BOGUES</A><DD>
<DT id="26"><A HREF="#lbAK">AUTHOR</A><DD>
<DT id="27"><A HREF="#lbAL">TRADUCTEURS</A><DD>
<DT id="28"><A HREF="#lbAM">AUTEURS</A><DD>
<DT id="29"><A HREF="#lbAN">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:03 GMT, March 31, 2021
</BODY>
</HTML>
