
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of LASTLOG</TITLE>
</HEAD><BODY>
<H1>LASTLOG</H1>
Section: Commandes de gestion du syst&egrave;m (8)<BR>Updated: 28/05/2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

lastlog - signaler les connexions les plus r&eacute;centes de tous les utilisateurs ou d'un utilisateur donn&eacute;
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>lastlog</B> [<I>options</I>]
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

<B>lastlog</B>
<DD>formats and prints the contents of the last login log
/var/log/lastlog
file. The
<I>login-name</I>,
<I>port</I>, and
<I>last login time</I>
will be printed. The default (no flags) causes lastlog entries to be printed, sorted by their order in
/etc/passwd.
<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

The options which apply to the
<B>lastlog</B>
command are:
<P>

<B>-b</B>, <B>--before</B>&nbsp;<I>DAYS</I>
<DL COMPACT><DT id="2"><DD>
Print only lastlog records older than
<I>DAYS</I>.
</DL>

<P>

<B>-C</B>, <B>--clear</B>
<DL COMPACT><DT id="3"><DD>
Clear lastlog record of a user. This option can be used only together with
<B>-u</B>
(<B>--user</B>)).
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="4"><DD>
Afficher un message d'aide et quitter.
</DL>

<P>

<B>-R</B>, <B>--root</B>&nbsp;<I>CHROOT_DIR</I>
<DL COMPACT><DT id="5"><DD>
Apply changes in the
<I>CHROOT_DIR</I>
directory and use the configuration files from the
<I>CHROOT_DIR</I>
directory.
</DL>

<P>

<B>-S</B>, <B>--set</B>
<DL COMPACT><DT id="6"><DD>
Set lastlog record of a user to the current time. This option can be used only together with
<B>-u</B>
(<B>--user</B>)).
</DL>

<P>

<B>-t</B>, <B>--time</B>&nbsp;<I>DAYS</I>
<DL COMPACT><DT id="7"><DD>
Print the lastlog records more recent than
<I>DAYS</I>.
</DL>

<P>

<B>-u</B>, <B>--user</B>&nbsp;<I>LOGIN</I>|<I>RANGE</I>
<DL COMPACT><DT id="8"><DD>
N'afficher que les entr&eacute;es correspondant aux utilisateurs indiqu&eacute;s.
<P>
The users can be specified by a login name, a numerical user ID, or a
<I>RANGE</I>
of users. This
<I>RANGE</I>
of users can be specified with a min and max values (<I>UID_MIN-UID_MAX</I>), a max value (<I>-UID_MAX</I>), or a min value (<I>UID_MIN-</I>).
</DL>

<P>

If the user has never logged in the message
<I>** Never logged in**</I>
will be displayed instead of the port and time.
<P>

Seules les entr&eacute;es pour les utilisateurs actuels du syst&egrave;me seront affich&eacute;es. D'autres entr&eacute;es peuvent exister pour les utilisateurs supprim&eacute;s pr&eacute;c&eacute;demment.
<A NAME="lbAF">&nbsp;</A>
<H2>NOTE</H2>

<P>

The
lastlog
file is a database which contains info on the last login of each user. You should not rotate it. It is a sparse file, so its size on the disk is usually much smaller than the one shown by &quot;<B>ls -l</B>&quot; (which can indicate a really big file if you have in
passwd
users with a high UID). You can display its real size with &quot;<B>ls -s</B>&quot;.
<A NAME="lbAG">&nbsp;</A>
<H2>CONFIGURATION</H2>

<P>

The following configuration variables in
/etc/login.defs
change the behavior of this tool:
<P>

<B>LASTLOG_UID_MAX</B> (number)
<DL COMPACT><DT id="9"><DD>
Highest user ID number for which the lastlog entries should be updated. As higher user IDs are usually tracked by remote user identity and authentication services there is no need to create a huge sparse lastlog file for them.
<P>
No
<B>LASTLOG_UID_MAX</B>
option present in the configuration means that there is no user ID limit for writing lastlog entries.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/var/log/lastlog
<DL COMPACT><DT id="10"><DD>
Base de donn&eacute;es de l'heure des connexions pr&eacute;c&eacute;dentes des utilisateurs.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H2>AVERTISSEMENTS</H2>

<P>

S'il y a des trous importants dans les valeurs des UID,
<B>lastlog</B>
s'ex&eacute;cutera plus lentement, sans affichage &agrave; l'&eacute;cran (par exemple, s'il n'y a pas d'entr&eacute;e pour les utilisateurs ayant un UID compris entre 170 et 800 dans base de donn&eacute;es lastlog, le programme lastlog semblera bloqu&eacute; comme s'il traitait les entr&eacute;es correspondant aux UID 171 &agrave; 799).
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="11"><A HREF="#lbAB">NOM</A><DD>
<DT id="12"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="13"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="14"><A HREF="#lbAE">OPTIONS</A><DD>
<DT id="15"><A HREF="#lbAF">NOTE</A><DD>
<DT id="16"><A HREF="#lbAG">CONFIGURATION</A><DD>
<DT id="17"><A HREF="#lbAH">FICHIERS</A><DD>
<DT id="18"><A HREF="#lbAI">AVERTISSEMENTS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:03 GMT, March 31, 2021
</BODY>
</HTML>
