
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of PWCONV</TITLE>
</HEAD><BODY>
<H1>PWCONV</H1>
Section: Commandes de gestion du syst&egrave;m (8)<BR>Updated: 28/05/2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

pwconv, pwunconv, grpconv, grpunconv - Convertir vers ou depuis les fichiers de mots de passe ou de groupe cach&eacute;s
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>pwconv</B> [<I>options</I>]
<DT id="2">
<B>pwunconv</B> [<I>options</I>]
<DT id="3">
<B>grpconv</B> [<I>options</I>]
<DT id="4">
<B>grpunconv</B> [<I>options</I>]
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

<DD>The
<B>pwconv</B>
command creates
<I>shadow</I>
from
<I>passwd</I>
and an optionally existing
<I>shadow</I>.
<P>

The
<B>pwunconv</B>
command creates
<I>passwd</I>
from
<I>passwd</I>
and
<I>shadow</I>
and then removes
<I>shadow</I>.
<P>

The
<B>grpconv</B>
command creates
<I>gshadow</I>
from
<I>group</I>
and an optionally existing
<I>gshadow</I>.
<P>

The
<B>grpunconv</B>
command creates
<I>group</I>
from
<I>group</I>
and
<I>gshadow</I>
and then removes
<I>gshadow</I>.
<P>

These four programs all operate on the normal and shadow password and group files:
/etc/passwd,
/etc/group,
/etc/shadow, and
/etc/gshadow.
<P>

Each program acquires the necessary locks before conversion.
<B>pwconv</B>
and
<B>grpconv</B>
are similar. First, entries in the shadowed file which don't exist in the main file are removed. Then, shadowed entries which don't have `x' as the password in the main file are updated. Any missing shadowed entries are added. Finally, passwords in the main file are replaced with `x'. These programs can be used for initial conversion as well to update the shadowed file if the main file is edited by hand.
<P>

<B>pwconv</B>
will use the values of
<I>PASS_MIN_DAYS</I>,
<I>PASS_MAX_DAYS</I>, and
<I>PASS_WARN_AGE</I>
from
/etc/login.defs
when adding new entries to
/etc/shadow.
<P>

Likewise
<B>pwunconv</B>
and
<B>grpunconv</B>
are similar. Passwords in the main file are updated from the shadowed file. Entries which exist in the main file but not in the shadowed file are left alone. Finally, the shadowed file is removed. Some password aging information is lost by
<B>pwunconv</B>. It will convert what it can.
<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

The options which apply to the
<B>pwconv</B>,
<B>pwunconv</B>,
<B>grpconv</B>, and
<B>grpunconv</B>
commands are:
<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="5"><DD>
Afficher un message d'aide et quitter.
</DL>

<P>

<B>-R</B>, <B>--root</B>&nbsp;<I>CHROOT_DIR</I>
<DL COMPACT><DT id="6"><DD>
Apply changes in the
<I>CHROOT_DIR</I>
directory and use the configuration files from the
<I>CHROOT_DIR</I>
directory.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>BOGUES</H2>

<P>

Errors in the password or group files (such as invalid or duplicate entries) may cause these programs to loop forever or fail in other strange ways. Please run
<B>pwck</B>
and
<B>grpck</B>
to correct any such errors before converting to or from shadow passwords or groups.
<A NAME="lbAG">&nbsp;</A>
<H2>CONFIGURATION</H2>

<P>

The following configuration variable in
/etc/login.defs
changes the behavior of
<B>grpconv</B>
and
<B>grpunconv</B>:
<P>

<B>MAX_MEMBERS_PER_GROUP</B> (number)
<DL COMPACT><DT id="7"><DD>
Maximum members per group entry. When the maximum is reached, a new group entry (line) is started in
/etc/group
(with the same name, same password, and same GID).
<P>
La valeur par d&eacute;faut est 0, ce qui signifie qu'il n'y a pas de limites pour le nombre de membres dans un groupe.
<P>
Cette fonctionnalit&eacute; (groupe d&eacute;coup&eacute;) permet de limiter la longueur des lignes dans le fichier de groupes. Ceci est utile pour s'assurer que les lignes pour les groupes NIS ne sont pas plus grandes que 1024 caract&egrave;res.
<P>
Si vous avez besoin de configurer cette limite, vous pouvez utiliser 25.
<P>
Remarque&nbsp;: les groupes d&eacute;coup&eacute;s ne sont peut-&ecirc;tre pas pris en charge par tous les outils (m&ecirc;me dans la suite d'outils Shadow). Vous ne devriez pas utiliser cette variable, sauf si vous en avez vraiment besoin.
</DL>

<P>

The following configuration variables in
/etc/login.defs
change the behavior of
<B>pwconv</B>:
<P>

<B>PASS_MAX_DAYS</B> (number)
<DL COMPACT><DT id="8"><DD>
Nombre maximum de jours de validit&eacute; d'un mot de passe. Apr&egrave;s cette dur&eacute;e, une modification du mot de passe est obligatoire. S'il n'est pas pr&eacute;cis&eacute;, la valeur de -1 est utilis&eacute;e (ce qui enl&egrave;ve toute restriction).
</DL>

<P>

<B>PASS_MIN_DAYS</B> (number)
<DL COMPACT><DT id="9"><DD>
Nombre minimum de jours autoris&eacute; avant la modification d'un mot de passe. Toute tentative de modification du mot de passe avant cette dur&eacute;e est rejet&eacute;e. S'il n'est pas pr&eacute;cis&eacute;, la valeur de -1 est utilis&eacute;e (ce qui enl&egrave;ve toute restriction).
</DL>

<P>

<B>PASS_WARN_AGE</B> (number)
<DL COMPACT><DT id="10"><DD>
Nombre de jours durant lesquels l'utilisateur recevra un avertissement avant que son mot de passe n'arrive en fin de validit&eacute;. Une valeur n&eacute;gative signifie qu'aucun avertissement n'est donn&eacute;. S'il n'est pas pr&eacute;cis&eacute;, aucun avertissement n'est donn&eacute;.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/login.defs
<DL COMPACT><DT id="11"><DD>
Configuration de la suite des mots de passe cach&eacute;s &laquo;&nbsp;shadow password&nbsp;&raquo;.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+grpck">grpck</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+login.defs">login.defs</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+pwck">pwck</A></B>(8).
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="12"><A HREF="#lbAB">NOM</A><DD>
<DT id="13"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="14"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="15"><A HREF="#lbAE">OPTIONS</A><DD>
<DT id="16"><A HREF="#lbAF">BOGUES</A><DD>
<DT id="17"><A HREF="#lbAG">CONFIGURATION</A><DD>
<DT id="18"><A HREF="#lbAH">FICHIERS</A><DD>
<DT id="19"><A HREF="#lbAI">VOIR AUSSI</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:03 GMT, March 31, 2021
</BODY>
</HTML>
