
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of start-stop-daemon</TITLE>
</HEAD><BODY>
<H1>start-stop-daemon</H1>
Section: suite dpkg (8)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

start-stop-daemon - Lance ou arr&ecirc;te des d&eacute;mons syst&egrave;me
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>start-stop-daemon</B> [<I>option</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

On se sert de <B>start-stop-daemon</B> pour contr&ocirc;ler la cr&eacute;ation ou l'arr&ecirc;t de
processus syst&egrave;me. En utilisant les options correspondantes,
<B>start-stop-daemon</B> peut &ecirc;tre configur&eacute; pour trouver les exemplaires
pr&eacute;sents d'un processus en fonctionnement.
<P>

Veuillez noter qu'&agrave; moins d'utiliser <B>--pid</B> ou <B>--pidfile</B>, le programme
<B>start-stop-daemon</B> se comporte comme <B><A HREF="/cgi-bin/man/man2html?1+killall">killall</A></B>(1). <B>start-stop-daemon</B>
recherche dans le tableau des processus tout processus qui correspond au
nom, pid parent, uid et/ou gid du processus (si indiqu&eacute;). Toute
correspondance emp&ecirc;chera <B>--start</B> de d&eacute;marrer le d&eacute;mon. Tous les processus
qui correspondent recevront le signal TERM (ou le signal indiqu&eacute; par
<B>--signal</B> ou <B>--retry</B>) si <B>--stop</B> est indiqu&eacute;. Pour les d&eacute;mons avec
des processus enfant qui doivent survivre &agrave; un <B>--stop</B>, il est n&eacute;cessaire
d'indiquer un fichier pid (&laquo;&nbsp;pidfile&nbsp;&raquo;).
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1"><B>-S</B>, <B>--start</B> [<B>--</B>] <I>param&egrave;tres</I><DD>
V&eacute;rifier l'existence d'un processus particulier. Quand il existe un tel
processus, <B>start-stop-daemon</B> ne fait rien et se termine avec un code
d'erreur &eacute;gal &agrave; <B>1</B> (<B>0</B> si <B>--oknodo</B> est pr&eacute;cis&eacute;). Quand un tel
processus n'existe pas, un exemplaire de l'ex&eacute;cutable est lanc&eacute;, en
utilisant le param&egrave;tre de <B>--exec</B> ou celui de <B>--startas</B> si cette option
est pr&eacute;cis&eacute;e. Tout argument donn&eacute; apr&egrave;s <B>--</B> sur la ligne de commande est
pass&eacute; tel quel au programme qui doit &ecirc;tre lanc&eacute;.
<DT id="2"><B>-K</B>, <B>--stop</B><DD>
V&eacute;rifier aussi l'existence d'un processus particulier. Quand un tel
processus existe, <B>start-stop-daemon</B> lui envoie le signal pr&eacute;cis&eacute; avec
<B>--signal</B> et se termine avec un code d'erreur &eacute;gal &agrave; <B>0</B>. Quand un tel
processus n'existe pas, <B>start-stop-daemon</B> se termine avec un code
d'erreur &eacute;gal &agrave; <B>1</B> (<B>0</B> si <B>--oknodo</B> est pr&eacute;cis&eacute;). Si <B>--retry</B> est
indiqu&eacute;e, <B>start-stop-daemon</B> recherche si le processus ou les processus se
sont bien termin&eacute;s.
<DT id="3"><B>-T</B>, <B>--status</B><DD>
Contr&ocirc;le l'existence du processus indiqu&eacute; et sort avec un code de sortie
d&eacute;fini par les actions des scripts d'initialisation de la LSB (&laquo;&nbsp;LSB Init
Script Actions&nbsp;&raquo; -&nbsp;depuis la version&nbsp;1.16.1).
<DT id="4"><B>-H</B>, <B>--help</B><DD>
Affiche un message d'aide, puis quitte.
<DT id="5"><B>-V</B>, <B>--version</B><DD>
Affiche la version du programme, puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<A NAME="lbAG">&nbsp;</A>
<H3>Options de correspondance</H3>

<DL COMPACT>
<DT id="6">[<B>--pid</B>] <I>pid</I><DD>
V&eacute;rifie l'existence d'un processus avec le <I>pid</I> sp&eacute;cifi&eacute; (depuis la
version&nbsp;1.17.6). Le <I>pid</I> doit avoir un num&eacute;ro sup&eacute;rieur &agrave;&nbsp;0.
<DT id="7">[<B>--ppid</B>] <I>pid parent</I><DD>
V&eacute;rifie l'existence d'un processus avec le pid parent <I>pid-parent</I> sp&eacute;cifi&eacute;
(depuis la version&nbsp;1.17.7). Le <I>pid-parent</I> doit avoir un num&eacute;ro sup&eacute;rieur
&agrave;&nbsp;0.
<DT id="8"><B>-p</B>, <B>--pidfile</B> <I>fichier-pid</I><DD>
Cherche les processus dont les identifiants sont pr&eacute;cis&eacute;s dans
<I>fichier-pid</I>.
<DT id="9"><DD>
Note&nbsp;: l'utilisation de l'option de correspondance seule peut provoquer des
actions sur des processus non pr&eacute;vus, si l'ancien processus s'est termin&eacute;
sans savoir retir&eacute; le <I>fichier-pid</I>.
<DT id="10"><DD>
<B>Attention</B>&nbsp;: L'utilisation de cette option de correspondance avec un
fichier pid accessible &agrave; tous en &eacute;criture ou seule avec un d&eacute;mon qui &eacute;crit
le fichier pid comme utilisateur non privil&eacute;gi&eacute; (pas root) sera refus&eacute;e avec
une erreur (depuis la version&nbsp;1.19.3) car c'est un risque de s&eacute;curit&eacute;, parce
que, si le d&eacute;mon se trouve compromis, le contenu du fichier pid ne peut plus
&ecirc;tre s&ucirc;r, et ainsi, un ex&eacute;cutant privil&eacute;gi&eacute; (comme un script init ex&eacute;cut&eacute; en
tant que root) pourrait en fin de compte agir sur n'importe quel processus
du syst&egrave;me. L'utilisation de <I>/dev/null</I> est exclue de ces v&eacute;rifications.
<DT id="11"><B>-x</B>, <B>--exec</B> <I>ex&eacute;cutable</I><DD>
Contr&ocirc;le l'existence de processus qui soient des exemplaires de cet
<I>ex&eacute;cutable</I>. Le param&egrave;tre <I>ex&eacute;cutable</I> doit &ecirc;tre un chemin absolu. Note&nbsp;:
cela peut ne pas fonctionner avec des scripts interpr&eacute;t&eacute;s, car l'ex&eacute;cutable
sera alors l'interpr&eacute;teur. Des processus en ex&eacute;cution au sein d'un
environnement ferm&eacute; d'ex&eacute;cution (&laquo;&nbsp;chroot&nbsp;&raquo;) seront &eacute;galement trouv&eacute;s et il
peut donc &ecirc;tre n&eacute;cessaire d'ajouter d'autres restrictions de correspondance.
<DT id="12"><B>-n</B>, <B>--name</B> <I>nom-de-processus</I><DD>
Contr&ocirc;le l'existence de processus avec <I>nom-de-processus</I> comme nom. Le
<I>nom-de-processus</I> est en g&eacute;n&eacute;ral le nom du fichier du processus, mais peut
avoir &eacute;t&eacute; modifi&eacute; par le processus lui-m&ecirc;me. Note&nbsp;: sur la plupart des
syst&egrave;mes, cette information est r&eacute;cup&eacute;r&eacute;e par le nom de communication du
noyau, ce qui induit une limite de longueur assez courte (la portabilit&eacute;
impose de ne pas supposer plus de 15&nbsp;caract&egrave;res).
<DT id="13"><B>-u</B>, <B>--user</B> <I>identifiant</I>|<I>uid</I><DD>
Contr&ocirc;le l'existence de processus dont le propri&eacute;taire est <I>identifiant</I> ou
<I>uid</I>. Note&nbsp;: si cette option est utilis&eacute;e seule, tous les processus de cet
utilisateur seront concern&eacute;s par l'action.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H3>Options g&eacute;n&eacute;riques</H3>

<DL COMPACT>
<DT id="14"><B>-g</B>, <B>--group</B> <I>groupe</I>|<I>gid</I><DD>
Modifie le <I>groupe</I> ou le <I>gid</I> au d&eacute;but du processus.
<DT id="15"><B>-s</B>, <B>--signal</B> <I>signal</I><DD>
L'action <B>--stop</B> d&eacute;finit le signal &agrave; envoyer au processus qui doit &ecirc;tre
arr&ecirc;t&eacute; (par d&eacute;faut&nbsp;: TERM).
<DT id="16"><B>-R</B>, <B>--retry</B> <I>dur&eacute;e</I>|<I>action-pr&eacute;vue</I><DD>
Avec l'action <B>--stop</B>, <B>start-stop-daemon</B> doit v&eacute;rifier que les
processus se sont termin&eacute;s. Il le fait pour tous les processus
correspondants qui tournent, jusqu'&agrave; ce qu'il n'y en ait plus. Quand le
processus ne se termine pas, il prend d'autres mesures d&eacute;termin&eacute;es par
l'<I>action-pr&eacute;vue</I>.
<P>
Si <I>dur&eacute;e</I> est indiqu&eacute;e plut&ocirc;t que <I>action-pr&eacute;vue</I>, l'action-pr&eacute;vue
<I>signal</I><B>/</B><I>dur&eacute;e</I><B>/KILL/</B><I>dur&eacute;e</I> est utilis&eacute;e, o&ugrave; <I>signal</I> est le
signal indiqu&eacute; par <B>--signal</B>.
<P>
<I>action-pr&eacute;vue</I> est une liste d'au moins deux items s&eacute;par&eacute;s par des barres
obliques (<B>/</B>)&nbsp;; chaque item peut &ecirc;tre de la forme <B>-</B><I>num&eacute;ro-signal</I> ou
de la forme [<B>-</B>]<I>nom-signal</I>, ce qui demande d'envoyer ce signal&nbsp;; ou
bien de la forme <I>dur&eacute;e,</I> ce qui demande d'attendre tant de secondes avant
de terminer les processus, ou bien de la forme <B>forever</B>, ce qui demande de
r&eacute;p&eacute;ter constamment le reste de action-pr&eacute;vue, si n&eacute;cessaire.
<P>
Quand la fin de l'action-pr&eacute;vue est atteinte et que <B>forever</B> n'a pas &eacute;t&eacute;
pr&eacute;cis&eacute;, <B>start-stop-daemon</B> se termine avec un code d'erreur &eacute;gal &agrave;
<B>2</B>. Quand une action-pr&eacute;vue est indiqu&eacute;e, tout signal donn&eacute; par
<B>--signal</B> est ignor&eacute;.
<DT id="17"><I>-a</I>, <B>--startas</B> <I>nom-de-chemin</I><DD>
Avec l'action <B>--start</B>, lance le processus sp&eacute;cifi&eacute; par
<I>nom-de-chemin</I>. Si rien n'est pr&eacute;cis&eacute;, c'est par d&eacute;faut l'argument donn&eacute; &agrave;
<B>--exec</B>.
<DT id="18"><B>-t</B>, <B>--test</B><DD>
Affiche les actions qui seraient entreprises et d&eacute;termine la bonne valeur de
retour, mais ne fait rien.
<DT id="19"><B>-o</B>, <B>--oknodo</B><DD>
Retourne un code de sortie &eacute;gal &agrave; <B>0</B> au lieu de <B>1</B> si rien n'est ou ne
sera fait.
<DT id="20"><B>-q</B>, <B>--quiet</B><DD>
N'affiche pas de messages d'information&nbsp;; affiche seulement les messages
d'erreur.
<DT id="21"><B>-c</B>, <B>--chuid</B> <I>identifiant</I>|<I>uid</I>[<B>:</B><I>groupe</I>|<I>gid</I>]<DD>
Change pour cet utilisateur ou &laquo;&nbsp;uid&nbsp;&raquo; avant de lancer le processus. On peut
aussi pr&eacute;ciser un groupe en ajoutant un <B>:</B>, puis le groupe ou un &laquo;&nbsp;gid&nbsp;&raquo;
de la m&ecirc;me fa&ccedil;on qu'avec la commande <B><A HREF="/cgi-bin/man/man2html?1+chown">chown</A></B>(1)
(<I>utilisateur</I><B>:</B><I>groupe</I>). Lorsqu'un utilisateur est indiqu&eacute; mais pas de
groupe alors le groupe primaire de celui-ci est utilis&eacute;. Quand on utilise
cette option, on doit veiller &agrave; ce que les groupes primaires ainsi que les
groupes secondaires existent bien, m&ecirc;me si l'option <B>--group</B> n'est pas
sp&eacute;cifi&eacute;e. L'option <B>--group</B> sert seulement pour les groupes dont
l'utilisateur n'est pas membre (c'est comme rendre membre d'un
groupe-pour-processus des utilisateurs g&eacute;n&eacute;riques comme <B>nobody</B>).
<DT id="22"><B>-r</B>, <B>--chroot</B> <I>root</I><DD>
Change de r&eacute;pertoire racine pour <B>root</B> avant de lancer le
processus. Remarquez que le &laquo;&nbsp;pidfile&nbsp;&raquo; est aussi &eacute;crit apr&egrave;s le changement
de racine.
<DT id="23"><B>-d</B>, <B>--chdir</B> <I>chemin</I><DD>
Change de r&eacute;pertoire pour <I>chemin</I> avant de commencer le processus. Cela
est fait apr&egrave;s le changement de r&eacute;pertoire racine si l'option
<B>-r</B>|<B>--chroot</B> est demand&eacute;e. Si rien n'est demand&eacute;, <B>start-stop-daemon</B>
changera de r&eacute;pertoire pour le r&eacute;pertoire racine avant de commencer le
processus.
<DT id="24"><B>-b</B>, <B>--background</B><DD>
Utilis&eacute; g&eacute;n&eacute;ralement pour les programmes qui ne &laquo;&nbsp;se d&eacute;tachent&nbsp;&raquo; pas
d'eux-m&ecirc;mes. Cette option oblige <B>start-stop-daemon</B> &agrave; se dupliquer (fork)
avant de lancer le processus, et l'oblige &agrave; passer en
arri&egrave;re-plan. <B>AVERTISSEMENT&nbsp;: start-stop-daemon</B> ne peut pas v&eacute;rifier le
code de sortie quand, pour <B>une raison ou une autre</B>, le processus
&eacute;choue. C'est un exp&eacute;dient dont on se servira seulement pour des programmes
dont la duplication n'a pas de sens ou bien des programmes dont le code
n'est pas adaptable pour leur ajouter cette fonctionnalit&eacute;.
<DT id="25"><B>--notify-await</B><DD>
Attend que le processus en arri&egrave;re-plan envoie une notification de
disponibilit&eacute; avant de consid&eacute;rer que le service est d&eacute;marr&eacute; (depuis la
version&nbsp;1.19.3). Cela met en &oelig;uvre des &eacute;l&eacute;ments du protocole de
disponibilit&eacute; de systemd, comme sp&eacute;cifi&eacute; dans la page de manuel de
<B><A HREF="/cgi-bin/man/man2html?3+sd_notify">sd_notify</A></B>(3). Les variables suivantes sont prises en charge&nbsp;:
<DL COMPACT><DT id="26"><DD>
<DL COMPACT>
<DT id="27"><B>READY=1</B><DD>
Le programme est pr&ecirc;t &agrave; offrir son service, il est possible de quitter sans
risque.
<DT id="28"><B>EXTEND_TIMEOUT_USEC=</B><I>nombre</I><DD>
Le programme demande l'extension de la dur&eacute;e de <I>nombre</I>
microsecondes. Cela fixera la dur&eacute;e en cours &agrave; la valeur sp&eacute;cifi&eacute;e.
<DT id="29"><B>ERRNO=</B> <I>nombre</I><DD>
Le programme s'est termin&eacute; avec une erreur. Fait la m&ecirc;me chose et affiche
une cha&icirc;ne conviviale pour la valeur de <B>errno</B>.
</DL>
</DL>

<DT id="30"><B>--notify-timeout</B><I>dur&eacute;e</I><DD>
D&eacute;finit une dur&eacute;e pour l'option <B>--notify-await</B> (depuis la
version&nbsp;1.19.3). Quand la dur&eacute;e est atteinte, <B>start-stop-daemon</B> s'arr&ecirc;te
avec un code d'erreur et aucune notification de disponibilit&eacute; n'est
attendue. La dur&eacute;e par d&eacute;faut est de <B>60</B>&nbsp;secondes.
<DT id="31"><B>-C</B>, <B>--no-close</B><DD>
Ne fermer aucun descripteur de fichiers en for&ccedil;ant le d&eacute;mon &agrave; s'ex&eacute;cuter en
arri&egrave;re-plan (depuis la version&nbsp;1.16.5). Utilis&eacute; &agrave; des fins de d&eacute;bogage afin
de voir ce qu'affiche le processus ou pour rediriger les descripteurs de
fichiers pour journaliser l'affichage du processus. N'est pertinent que lors
de l'utilisation de <B>--background</B>.
<DT id="32"><B>-N</B>, <B>--nicelevel</B> <I>int</I><DD>
Cela modifie la priorit&eacute; du processus avant qu'il ne soit lanc&eacute;.
<DT id="33"><B>-P</B>, <B>--procsched</B> <I>politique</I><B>:</B><I>priorit&eacute;</I><DD>
Modifie la politique du programmateur de processus (&laquo;&nbsp;process scheduler
policy&nbsp;&raquo;) et la priorit&eacute; du processus avant de le d&eacute;marrer (depuis la
version&nbsp;1.15.0). La priorit&eacute; peut &ecirc;tre indiqu&eacute;e de mani&egrave;re facultative avec
<B>:</B> suivi de la valeur souhait&eacute;e. La <I>priorit&eacute;</I> par d&eacute;faut est&nbsp;0. Les
valeurs de politiques actuellement g&eacute;r&eacute;es sont <B>other</B>, <B>fifo</B> et <B>rr</B>.
<DT id="34"><B>-I</B>, <B>--iosched</B> <I>classe</I><B>:</B><I>priorit&eacute;</I><DD>
Modifie la classe du programmateur d'entr&eacute;e/sortie (&laquo;&nbsp;IO scheduler&nbsp;&raquo;) et la
priorit&eacute; du processus avant de le d&eacute;marrer (depuis la version&nbsp;1.15.0). La
priorit&eacute; peut &ecirc;tre indiqu&eacute;e de mani&egrave;re facultative avec <B>:</B> suivi de la
valeur souhait&eacute;e. La <I>priorit&eacute;</I> par d&eacute;faut est&nbsp;4, sauf si <I>classe</I> est
<B>idle</B>, auquel cas <I>priorit&eacute;</I> sera toujours &eacute;gale &agrave;&nbsp;7. Les valeurs de
<I>classe</I> actuellement g&eacute;r&eacute;es sont <B>idle</B>, <B>best-effort</B> et <B>real-time</B>.
<DT id="35"><B>-k</B>, <B>--umask</B> <I>masque</I><DD>
Cela modifie le masque utilisateur du processus avant qu'il ne soit lanc&eacute;
(depuis la version&nbsp;1.13.22).
<DT id="36"><B>-m</B>, <B>--make-pidfile</B><DD>
Utilis&eacute; lors du lancement d'un programme qui ne cr&eacute;e pas son propre fichier
identificateur &laquo;&nbsp;pid&nbsp;&raquo;. Cette option indique &agrave; <B>start-stop-daemon</B> de cr&eacute;er
le fichier r&eacute;f&eacute;renc&eacute; par <B>--pidfile</B> et placer le &laquo;&nbsp;pid&nbsp;&raquo; dans ce fichier
juste avant d'ex&eacute;cuter le processus. Il faut remarquer que ce fichier ne
sera supprim&eacute; quand le programme s'arr&ecirc;te que si <B>--remove-pidfile</B> est
utilis&eacute;. <B>NOTE&nbsp;:</B> il se peut que cette caract&eacute;ristique ne marche pas dans
tous les cas. Notamment quand le programme qui est ex&eacute;cut&eacute; se duplique. &Agrave;
cause de cela, cette option n'est habituellement utile que combin&eacute;e avec
l'option <B>--background</B>.
<DT id="37"><B>--remove-pidfile</B><DD>
Utilis&eacute; lors de l'arr&ecirc;t d'un programme qui ne supprime pas lui-m&ecirc;me son
fichier identificateur &laquo;&nbsp;pid&nbsp;&raquo; (depuis la version&nbsp;1.17.19). Cette option
indique &agrave; <B>start-stop-daemon</B> de supprimer le fichier r&eacute;f&eacute;renc&eacute; par
<B>--pid-file</B> apr&egrave;s l'arr&ecirc;t du processus.
<DT id="38"><B>-v</B>, <B>--verbose</B><DD>
Affiche des messages prolixes en renseignements.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="39"><B>0</B><DD>
L'action demand&eacute;e a &eacute;t&eacute; effectu&eacute;e. Si <B>--oknodo</B> &eacute;tait indiqu&eacute;, il est
&eacute;galement possible que rien ne se soit pass&eacute;. Cela peut se produire si
<B>--start</B> &eacute;tait indiqu&eacute; et qu'un processus correspondant &eacute;tait d&eacute;j&agrave; en
train de s'ex&eacute;cuter ou si <B>--stop</B> &eacute;tait indiqu&eacute; et qu'aucun processus ne
correspondait.
<DT id="40"><B>1</B><DD>
Si <B>--oknodo</B> n'&eacute;tait pas indiqu&eacute; et que rien ne s'est pass&eacute;.
<DT id="41"><B>2</B><DD>
Si <B>--stop</B> et <B>--retry</B> &eacute;taient indiqu&eacute;s mais que la fin de la
planification a &eacute;t&eacute; atteinte et que les processus &eacute;taient toujours en cours
d'ex&eacute;cution.
<DT id="42"><B>3</B><DD>
Toute autre erreur.
</DL>
<P>

Lorsque la commande <B>--status</B> est utilis&eacute;e, les codes d'&eacute;tat suivants sont
renvoy&eacute;s&nbsp;:
<DL COMPACT>
<DT id="43"><B>0</B><DD>
Le programme est en cours d'ex&eacute;cution.
<DT id="44"><B>1</B><DD>
Le programme n'est pas en cours d'ex&eacute;cution et le fichier PID existe.
<DT id="45"><B>3</B><DD>
Le programme n'est pas en cours d'ex&eacute;cution.
<DT id="46"><B>4</B><DD>
Impossible de d&eacute;terminer l'&eacute;tat du programme.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>EXEMPLE</H2>

D&eacute;marre le d&eacute;mon <B>food</B>, &agrave; moins qu'il soit d&eacute;j&agrave; en cours d'ex&eacute;cution (un
processus nomm&eacute; <B>food</B>, tournant sous le nom d'utilisateur <B>food</B>, avec un
pid dans food.pid)&nbsp;:
<DL COMPACT>
<DT id="47"><DD>
<PRE>
start-stop-daemon --start --oknodo --user food --name food \
        --pidfile /run/food.pid --startas /usr/sbin/food \
        --chuid food -- --daemon
</PRE>

</DL>
<P>

Envoie le signal <B>SIGTERM</B> &agrave; <B>food</B> et attend durant 5&nbsp;secondes son
arr&ecirc;t&nbsp;:
<DL COMPACT>
<DT id="48"><DD>
<PRE>
start-stop-daemon --stop --oknodo --user food --name food \
        --pidfile /run/food.pid --retry 5
</PRE>

</DL>
<P>

D&eacute;monstration d'un ordonnanceur personnalis&eacute; pour l'arr&ecirc;t de <B>food</B>&nbsp;:
<DL COMPACT>
<DT id="49"><DD>
<PRE>
start-stop-daemon --stop --oknodo --user food --name food \
        --pidfile /run/food.pid --retry=TERM/30/KILL/5
</PRE>

</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="50"><A HREF="#lbAB">NOM</A><DD>
<DT id="51"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="52"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="53"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="54"><A HREF="#lbAF">OPTIONS</A><DD>
<DL>
<DT id="55"><A HREF="#lbAG">Options de correspondance</A><DD>
<DT id="56"><A HREF="#lbAH">Options g&eacute;n&eacute;riques</A><DD>
</DL>
<DT id="57"><A HREF="#lbAI">CODE DE SORTIE</A><DD>
<DT id="58"><A HREF="#lbAJ">EXEMPLE</A><DD>
<DT id="59"><A HREF="#lbAK">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:03 GMT, March 31, 2021
</BODY>
</HTML>
