
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CACHE</TITLE>
</HEAD><BODY>
<H1>APT-CACHE</H1>
Section: APT (8)<BR>Updated: 04&nbsp;Abril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-cache - pesquisa a cache do APT
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cache</B> [<B>-agipns</B>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>ficheiro_de_configura&ccedil;&atilde;o</I>] {gencaches | showpkg&nbsp;<I>pkg</I>...  | showsrc&nbsp;<I>pkg</I>...  | stats | dump | dumpavail | unmet | search&nbsp;<I>regex</I>...  | show&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | depends&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | rdepends&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | pkgnames&nbsp;[<I>prefixo</I>]  | dotty&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | xvcg&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | policy&nbsp;[<I>pkg</I>...]  | madison&nbsp;<I>pkg</I>...  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<B>apt-cache</B>
<DD>executa uma variedade de opera&ccedil;&otilde;es na cache de pacotes do APT.
<B>apt-cache</B>
n&atilde;o manipula o estado do sistema mas fornece opera&ccedil;&otilde;es para procurar e gerar resultados interessantes a partir dos metadados do pacote. Os metadados s&atilde;o adquiridos e actualizados via comando 'update' de, por exemplo,
<B>apt-get</B>, portanto podem estar desactualizados se a &uacute;ltima actualiza&ccedil;&atilde;o aconteceu &agrave; muito tempo, mas em troca o
<B>apt-cache</B>
funciona independentemente da disponibilidade das fontes configuradas (por exemplo em offline).
<P>

A menos que a op&ccedil;&atilde;o
<B>-h</B>, ou
<B>--help</B>
seja fornecida, um dos comandos abaixo t&ecirc;m que estar presentes.
<P>

<B>gencaches</B>
<DL COMPACT><DT id="2"><DD>
gencaches
cria a cache de pacotes do APT. Isto &eacute; feito implicitamente por todos os comandos que precisam desta cache se esta estiver em falta ou desactualizada.
</DL>

<P>

<B>showpkg</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="3"><DD>
showpkg
mostra informa&ccedil;&atilde;o acerca dos pacotes listados na linha de comandos. Os argumentos restantes s&atilde;o nomes de pacotes. S&atilde;o listadas as vers&otilde;es dispon&iacute;veis e depend&ecirc;ncias reversas de cada pacote listado, assim como as depend&ecirc;ncias dianteiras de cada vers&atilde;o. Depend&ecirc;ncias dianteiras (normais) s&atilde;o aqueles pacotes de que o pacote em quest&atilde;o depende; depend&ecirc;ncias reversas s&atilde;o aqueles pacotes que dependem do pacote em quest&atilde;o. Assim, as depend&ecirc;ncias dianteiras de um pacote t&ecirc;m de ser satisfeitas, mas as depend&ecirc;ncias reversas n&atilde;o precisam de ser. Por exemplo,
<B>apt-cache showpkg libreadline2</B>
dever&aacute; produzir resultados semelhantes ao seguinte:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Pacote: libreadline2
Vers&otilde;es: 2.1-12(/var/state/apt/lists/foo_Packages),
Depend&ecirc;ncias Reversas Depends: 
  libreadlineg2,libreadline2
  libreadline2-altdev,libreadline2
Depend&ecirc;ncias:
2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null))
Fornecimentos:
2.1-12 - 
Fornecimentos Reversos: 
</PRE>

</DL>




Assim pode-se ver que libreadline2, vers&atilde;o 2.1-12, depende de libc5 e ncurses3.0 que t&ecirc;m que ser instalados para que libreadline2 funcione. Por sua vez, libreadlineg2 e libreadline2-altdev dependem de libreadline2. Se libreadline2 for instalado, libc5 e ncurses3.0 (e ldso) tamb&eacute;m t&ecirc;m que ser instalados; libreadlineg2 e libreadline2-altdev n&atilde;o precisam de ser instalados. Para o significado espec&iacute;fico do lembrete da sa&iacute;da &eacute; melhor consultar o c&oacute;digo fonte do apt.
</DL>

<P>

<B>stats</B>
<DL COMPACT><DT id="5"><DD>
stats
mostra algumas estat&iacute;sticas acerca da cache. N&atilde;o s&atilde;o esperados mais argumentos. As estat&iacute;sticas reportadas s&atilde;o:
<P>
<DL COMPACT><DT id="6"><DD>
&bull;


Total package names
&eacute; o n&uacute;mero de nomes de pacotes encontrados na cache.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Normal packages
&eacute; o n&uacute;mero de nomes de pacotes regulares e ordin&aacute;rios; estes s&atilde;o pacotes que t&ecirc;m uma correspond&ecirc;ncia de um-para-um entre os seus nomes e os nomes usados por outros pacotes para eles nas depend&ecirc;ncias. A maioria dos pacotes caem nesta categoria.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Pure virtual packages
&eacute; o n&uacute;mero de pacotes que existem apenas como nome de pacote virtual; isto &eacute;, os pacotes apenas &quot;disponibilizam&quot; o nome do pacote virtual, e nenhum pacote usa realmente o nome. Por exemplo, &quot;mail-transport-agent&quot; no sistema Debian &eacute; um pacote puramente virtual; v&aacute;rios pacotes disponibilizam &quot;mail-transport-agent&quot;, mas n&atilde;o existe um existe um pacote chamado &quot;mail-transport-agent&quot;.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Single virtual packages
&eacute; o n&uacute;mero de pacotes com apenas um pacote a disponibilizar um pacote virtual particular. Por exemplo, no sistema Debian, &quot;X11-text-viewer&quot; &eacute; um pacote virtual, mas apenas um pacote, xless, disponibiliza &quot;X11-text-viewer&quot;.
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Mixed virtual packages
&eacute; o n&uacute;mero de pacotes que ou disponibilizam um pacote virtual particular ou t&ecirc;m o nome de pacote virtual como o nome de pacote. Por exemplo, no sistema Debian, &quot;debconf&quot; &eacute; tanto um pacote real, como tamb&eacute;m disponibilizado pelo pacote debconf-tiny.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


Missing
&eacute; o n&uacute;mero de nomes de pacotes que s&atilde;o referenciados numa depend&ecirc;ncia mas n&atilde;o foram disponibilizados por nenhum pacote. Os pacotes em falta podem ser uma evid&ecirc;ncia de que n&atilde;o se est&aacute; a aceder ao total de uma distribui&ccedil;&atilde;o, ou que um pacote (real ou virtual) foi removido da distribui&ccedil;&atilde;o. Normalmente s&atilde;o referenciados a partir de declara&ccedil;&otilde;es de Conflitos ou Breaks.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


Total distinct versions
&eacute; o n&uacute;mero de vers&otilde;es de pacotes encontrados na cache. Se for acedida a mais do que uma distribui&ccedil;&atilde;o (por exemplo &quot;stable&quot; e &quot;unstable&quot;), este valor pode ser consideravelmente maior que o n&uacute;mero do total de nomes de pacotes.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Total dependencies
&eacute; o n&uacute;mero de relacionamentos com depend&ecirc;ncias reivindicadas por todos os pacotes na cache.
</DL>

<P>
</DL>

<P>

<B>showsrc</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="14"><DD>
showsrc
mostra todos os registos de pacotes fonte que correspondem aos nomes de pacotes fornecidos. Todas as vers&otilde;es s&atilde;o mostradas, assim como todos os registos que declaram o nome como sendo um pacote bin&aacute;rio. Use
<B>--only-source</B>
para mostrar apenas nomes de pacotes fonte.
</DL>

<P>

<B>dump</B>
<DL COMPACT><DT id="15"><DD>
dump
mostra uma listagem curta de todos os pacotes na cache. &Eacute; principalmente para depura&ccedil;&atilde;o.
</DL>

<P>

<B>dumpavail</B>
<DL COMPACT><DT id="16"><DD>
dumpavail
escreve uma lista de disponibilidades no stdout. Isto &eacute; apropriado para usar com o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
e &eacute; usado pelo m&eacute;todo
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1).
</DL>

<P>

<B>unmet</B>
<DL COMPACT><DT id="17"><DD>
unmet
mostra um sum&aacute;rio de todas as depend&ecirc;ncias insatisfeitas na cache do pacote.
</DL>

<P>

<B>show</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="18"><DD>
show
executa uma fun&ccedil;&atilde;o semelhante ao
<B>dpkg --print-avail</B>; mostra os registos do pacote para os pacotes nomeados.
</DL>

<P>

<B>search</B> <B></B><I>regex</I><B>...</B>
<DL COMPACT><DT id="19"><DD>
search
executa uma busca de texto completo em todas as listas de pacotes dispon&iacute;veis para o padr&atilde;o POSIX regex fornecido, veja
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7). Procura nos nomes de pacotes e nas descri&ccedil;&otilde;es por uma ocorr&ecirc;ncia da express&atilde;o regular e escreve o nome do pacote e a descri&ccedil;&atilde;o curta, incluindo nomes de pacotes virtuais. Se for fornecido
<B>--full</B>
ent&atilde;o s&atilde;o produzidos resultados id&ecirc;nticos ao
show
para cada pacote correspondente, e se for fornecido
<B>--names-only</B>
ent&atilde;o n&atilde;o h&aacute; procura na descri&ccedil;&atilde;o longa, apenas no nome do pacote dos pacotes fornecidos.
<P>
Podem ser usados argumentos separados para especificar m&uacute;ltiplos padr&otilde;es de busca os quais s&atilde;o lidados em conjunto.
</DL>

<P>

<B>depends</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="20"><DD>
depends
mostra uma listagem de cada depend&ecirc;ncia que um pacote tem e todos os outros pacotes poss&iacute;veis que podem satisfazer essa depend&ecirc;ncia.
</DL>

<P>

<B>rdepends</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="21"><DD>
rdepends
mostra uma listagem de cada depend&ecirc;ncia reversa que um pacote tem.
</DL>

<P>

<B>pkgnames</B> [<I>prefixo</I>]
<DL COMPACT><DT id="22"><DD>
Este comando escreve o nome de cada pacote que o APT conhece. O argumento opcional &eacute; um prefixo de correspond&ecirc;ncia para filtrar a lista de nomes. O resultado &eacute; apropriado para usar numa fun&ccedil;&atilde;o completa de consola e o resultado &eacute; gerado com extrema rapidez. Este comando fica melhor usado com a op&ccedil;&atilde;o
<B>--generate</B>.
<P>
Note que um pacote que o APT conhe&ccedil;a n&atilde;o est&aacute; necessariamente dispon&iacute;vel para download, instal&aacute;vel ou instalado, por exemplo, os pacotes virtuais tamb&eacute;m s&atilde;o listados na lista gerada.
</DL>

<P>

<B>dotty</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="23"><DD>
dotty
recebe uma lista de pacotes na linha de comandos e gera resultados apropriados para uso pelo dotty do pacote
m[blue]<B>GraphViz</B>m[]<FONT SIZE="-2">[1]</FONT>. O resultado ser&aacute; um conjunto de n&oacute;s e orlas que representam os relacionamentos entre os pacotes. Por predefini&ccedil;&atilde;o, os pacotes fornecidos ir&atilde;o seguir todos os pacotes dependentes; isto pode produzir um gr&aacute;fico muito grande. Para limitar os resultados apenas aos pacotes listados na linha de comandos, defina a op&ccedil;&atilde;o
APT::Cache::GivenOnly.
<P>
Os n&oacute;s resultantes ir&atilde;o ter v&aacute;rias formas; pacotes normais s&atilde;o caixas, pacotes virtuais puros s&atilde;o tri&acirc;ngulos, pacotes virtuais de mistura s&atilde;o diamantes, pacotes desaparecidos s&atilde;o hex&aacute;gonos. Caixas cor de laranja significam que a recurs&atilde;o parou (pacotes leaf), linhas azuis s&atilde;o pr&eacute;-depend&ecirc;ncias, linhas verdes s&atilde;o conflitos.
<P>
Aten&ccedil;&atilde;o, o dotty n&atilde;o consegue fazer gr&aacute;ficos com grandes conjuntos de pacotes.
</DL>

<P>

<B>xvcg</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="24"><DD>
O mesmo que
dotty, apenas para xvcg a partir de
m[blue]<B>Ferramenta VCG</B>m[]<FONT SIZE="-2">[2]</FONT>.
</DL>

<P>

<B>policy</B> [<I>pkg</I>...]
<DL COMPACT><DT id="25"><DD>
policy
destina-se a ajudar a depurar problemas relacionados com o ficheiro de prefer&ecirc;ncias. Sem argumentos ir&aacute; escrever as propriedades de cada fonte. Caso contr&aacute;rio escreve informa&ccedil;&atilde;o detalhada acerca da selec&ccedil;&atilde;o de prioridade do pacote nomeado.
</DL>

<P>

<B>madison</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="26"><DD>
O comando
madison
do
apt-cache
tenta imitar o formato de sa&iacute;da e um subconjunto das funcionalidades da ferramenta
madison
de gest&atilde;o de pacotes da Debian. Mostra vers&otilde;es dispon&iacute;veis de um pacote num formato tabular. Ao contr&aacute;rio do
madison
original, apenas pode mostrar informa&ccedil;&atilde;o para a arquitectura que o APT recolheu listas de pacotes (APT::Architecture).
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Todas as op&ccedil;&otilde;es de linha de comandos podem ser definidas usando o ficheiro de configura&ccedil;&atilde;o, as descri&ccedil;&otilde;es indicam a op&ccedil;&atilde;o de configura&ccedil;&atilde;o a definir. Para op&ccedil;&otilde;es booleanas voc&ecirc; pode sobre por o ficheiro de configura&ccedil;&atilde;o usando algo como
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
ou v&aacute;rias outras variantes.
<P>

<B>-p</B>, <B>--pkg-cache</B>
<DL COMPACT><DT id="27"><DD>
Selecciona o ficheiro para armazenar a cache do pacote. A cache do pacote &eacute; a cache principal usada por todas as opera&ccedil;&otilde;es. Item de Configura&ccedil;&atilde;o:
Dir::Cache::pkgcache.
</DL>

<P>

<B>-s</B>, <B>--src-cache</B>
<DL COMPACT><DT id="28"><DD>
Selecciona o ficheiro para armazenar a cache de fonte. A fonte &eacute; usada apenas pelo
gencaches
e armazena uma vers&atilde;o analisada da informa&ccedil;&atilde;o do pacote a partir de fontes remotas. Ao construir a cache de pacote &eacute; usada a cache fonte para evitar reanalisar todos os ficheiros do pacote. Item de Configura&ccedil;&atilde;o:
Dir::Cache::srcpkgcache.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="29"><DD>
Quiet; produz resultados apropriados para registar em logs, omitindo os indicadores de progresso. Mais q's ir&atilde;o produzir mais serenidade at&eacute; um m&aacute;ximo de 2. Voc&ecirc; tamb&eacute;m pode usar
<B>-q=#</B>
para definir o n&iacute;vel de serenidade, sobrepondo o ficheiro de configura&ccedil;&atilde;o. Item de Configura&ccedil;&atilde;o:
quiet.
</DL>

<P>

<B>-i</B>, <B>--important</B>
<DL COMPACT><DT id="30"><DD>
Escreve apenas depend&ecirc;ncias importantes; para usar com
unmet
e
depends. Separa apenas rela&ccedil;&otilde;es de Depends e Pre-Depends para serem escritas. Item de Configura&ccedil;&atilde;o:
APT::Cache::Important.
</DL>

<P>

<B>--no-pre-depends</B>, <B>--no-depends</B>, <B>--no-recommends</B>, <B>--no-suggests</B>, <B>--no-conflicts</B>, <B>--no-breaks</B>, <B>--no-replaces</B>, <B>--no-enhances</B>
<DL COMPACT><DT id="31"><DD>
Por predefini&ccedil;&atilde;o o
<B>depends</B>
and
<B>rdepends</B>
escrevem todas as depend&ecirc;ncias. Isto pode ser &quot;afinado&quot; com estas bandeiras que ir&atilde;o omitir o tipo de depend&ecirc;ncia especificado. Item de Configura&ccedil;&atilde;o:
APT::Cache::Show<I>DependencyType</I>
ex.
APT::Cache::ShowRecommends.
</DL>

<P>

<B>--implicit</B>
<DL COMPACT><DT id="32"><DD>
Por predefini&ccedil;&atilde;o
<B>depends</B>
e
<B>rdepends</B>
apresentam apenas depend&ecirc;ncias expressamente expl&iacute;citas nos meta-dados. Com esta bandeira ir&aacute; tamb&eacute;m mostrar depend&ecirc;ncias adicionadas implicitamente com base nos dados encontrados. Um
Conflicts: foo
por exemplo, expressa implicitamente que este pacote tamb&eacute;m entra em conflito com o pacote foo de qualquer outra arquitectura. Item de Configura&ccedil;&atilde;o:
APT::Cache::ShowImplicit.
</DL>

<P>

<B>-f</B>, <B>--full</B>
<DL COMPACT><DT id="33"><DD>
Escreve registos de pacote completos quando procura. Item de Configura&ccedil;&atilde;o:
APT::Cache::ShowFull.
</DL>

<P>

<B>-a</B>, <B>--all-versions</B>
<DL COMPACT><DT id="34"><DD>
Escreve registos completos para todas as vers&otilde;es dispon&iacute;veis. Isto &eacute; a predefini&ccedil;&atilde;o; para a desligar, use
<B>--no-all-versions</B>. Se
<B>--no-all-versions</B>
for especificada, apenas a vers&atilde;o candidata ser&aacute; mostrada (aquela que seria seleccionada para instala&ccedil;&atilde;o). Esta op&ccedil;&atilde;o &eacute; aplic&aacute;vel apenas ao comando
show. Item de Configura&ccedil;&atilde;o:
APT::Cache::AllVersions.
</DL>

<P>

<B>-g</B>, <B>--generate</B>
<DL COMPACT><DT id="35"><DD>
Executa regenera&ccedil;&atilde;o autom&aacute;tica da cache de pacote, em vez de usar a cache como est&aacute;. Isto &eacute; a predefini&ccedil;&atilde;o; para a desligar, use
<B>--no-generate</B>. Item de Configura&ccedil;&atilde;o:
APT::Cache::Generate.
</DL>

<P>

<B>--names-only</B>, <B>-n</B>
<DL COMPACT><DT id="36"><DD>
Apenas procura no pacote e nos nomes dos pacotes fornecidos, e n&atilde;o nas descri&ccedil;&otilde;es longas. Item de Configura&ccedil;&atilde;o:
APT::Cache::NamesOnly.
</DL>

<P>

<B>--all-names</B>
<DL COMPACT><DT id="37"><DD>
Faz com que o
pkgnames
escreva todos os nomes, incluindo pacotes virtuais e depend&ecirc;ncias em falta. Item de configura&ccedil;&atilde;o:
APT::Cache::AllNames.
</DL>

<P>

<B>--recurse</B>
<DL COMPACT><DT id="38"><DD>
Torna
depends
e
rdepends
recursivo para que todos os pacotes mencionados sejam escritos uma vez. Item de Configura&ccedil;&atilde;o
APT::Cache::RecurseDepends.
</DL>

<P>

<B>--installed</B>
<DL COMPACT><DT id="39"><DD>
Limita a sa&iacute;da de
depends
e
rdepends
aos pacotes que est&atilde;o actualmente instalados. Item de Configura&ccedil;&atilde;o:
APT::Cache::Installed.
</DL>

<P>

<B>--with-source</B> <B></B><I>nome_do_ficheiro</I>
<DL COMPACT><DT id="40"><DD>
Adiciona o ficheiro fornecido como a fonte para meta-dados. Pode ser repetido para adicionar m&uacute;ltiplos ficheiros. Presentemente s&atilde;o suportados ficheiros
*.deb,
*.dsc,
*.changes,
Sources
e
Packages
assim como direct&oacute;rios de pacotes fonte: A correspond&ecirc;ncia dos ficheiros &eacute; baseada apenas com base no seu nome, n&atilde;o no seu conte&uacute;do.
<P>
Sources
e
Packages
podem ser comprimidos em qualquer formato suportado pelo apt desde de contenham a extens&atilde;o correcta. Se voc&ecirc; precisar de armazenar v&aacute;rios ficheiros destes num direct&oacute;rio pode usar um prefixo no nome &agrave; sua escolha com um underscore no &uacute;ltimo caractere (&quot;_&quot;). Exemplo: meu.exemplo_Packages.xz
<P>
Note que estas fontes s&atilde;o tratadas como de confian&ccedil;a (veja
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)). Item de Configura&ccedil;&atilde;o:
APT::Sources::With.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="41"><DD>
Mostra um sum&aacute;rio curto da utiliza&ccedil;&atilde;o.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="42"><DD>
Mostra a vers&atilde;o do programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="43"><DD>
Ficheiro de Configura&ccedil;&atilde;o; Especifica o ficheiro de configura&ccedil;&atilde;o a usar. O programa ir&aacute; ler o ficheiro de configura&ccedil;&atilde;o predefinido e depois este ficheiro de configura&ccedil;&atilde;o. Se as defini&ccedil;&otilde;es de configura&ccedil;&atilde;o precisarem de ser definidas antes, os ficheiros de configura&ccedil;&atilde;o predefinidos s&atilde;o analisados especificando um ficheiro com a vari&aacute;vel de ambiente
<B>APT_CONFIG</B>. Veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informa&ccedil;&atilde;o de sintaxe.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="44"><DD>
Define uma Op&ccedil;&atilde;o de Configura&ccedil;&atilde;o; Isto ir&aacute; definir uma op&ccedil;&atilde;o de configura&ccedil;&atilde;o arbitr&aacute;ria. A sintaxe &eacute;
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
e
<B>--option</B>
podem ser usadas v&aacute;rias vezes para definir op&ccedil;&otilde;es diferentes.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="45"><DD>
Localiza&ccedil;&otilde;es de onde obter pacotes. Item de Configura&ccedil;&atilde;o:
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="46"><DD>
Ficheiros fragmentados para localiza&ccedil;&otilde;es de onde obter pacotes. Item de Configura&ccedil;&atilde;o:
Dir::Etc::SourceParts.
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="47"><DD>
&Aacute;rea de armazenamento para informa&ccedil;&atilde;o de estado para cada recurso de pacote especificado em
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
Tem de Configura&ccedil;&atilde;o:
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="48"><DD>
&Aacute;rea de armazenamento para informa&ccedil;&atilde;o de estado em tr&acirc;nsito. Item de Configura&ccedil;&atilde;o:
Dir::State::Lists
ser&aacute; implicitamente acrescentado (partial)
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt-cache</B>
devolve zero em opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAI">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[3]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="49"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="50"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="51"> 1.<DD>
GraphViz
<DL COMPACT><DT id="52"><DD>
<A HREF="http://www.research.att.com/sw/tools/graphviz/">http://www.research.att.com/sw/tools/graphviz/</A>
</DL>

<DT id="53"> 2.<DD>
Ferramenta VCG
<DL COMPACT><DT id="54"><DD>
<A HREF="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html</A>
</DL>

<DT id="55"> 3.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="56"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="57"><A HREF="#lbAB">NOME</A><DD>
<DT id="58"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="59"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="60"><A HREF="#lbAE">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="61"><A HREF="#lbAF">FICHEIROS</A><DD>
<DT id="62"><A HREF="#lbAG">VEJA TAMB&Eacute;M</A><DD>
<DT id="63"><A HREF="#lbAH">DIAGN&Oacute;STICO</A><DD>
<DT id="64"><A HREF="#lbAI">BUGS</A><DD>
<DT id="65"><A HREF="#lbAJ">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="66"><A HREF="#lbAK">AUTORES</A><DD>
<DT id="67"><A HREF="#lbAL">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
