
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CDROM</TITLE>
</HEAD><BODY>
<H1>APT-CDROM</H1>
Section: APT (8)<BR>Updated: 30&nbsp;Novembro&nbsp;2013<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-cdrom - Utilit&aacute;rio de gest&atilde;o de CD-ROM do APT
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cdrom</B> [<B>-rmfan</B>] [<B>-d=</B><B></B><I>ponto_de_montagem-do_cdrom</I>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>ficheiro_de_configura&ccedil;&atilde;o</I>] {add | ident | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<DD>O
<B>apt-cdrom</B>
&eacute; usado para adicionar um novo CD-ROM &agrave; lista de fontes dispon&iacute;veis do APT. O
<B>apt-cdrom</B>
encarrega-se de determinar a estrutura do disco assim como corrigir v&aacute;rias falhas poss&iacute;veis e verificar os ficheiros de &iacute;ndice.
<P>

&Eacute; necess&aacute;rio usar o
<B>apt-cdrom</B>
para adicionar CDs ao sistema APT, n&atilde;o pode ser feito manualmente. Mais, cada disco de um conjunto de v&aacute;rios discos tem que ser inserido e sondado separadamente para ter em conta poss&iacute;veis falhas.
<P>

A menos que a op&ccedil;&atilde;o
<B>-h</B>, ou
<B>--help</B>
seja fornecida, um dos comandos abaixo t&ecirc;m que estar presentes.
<P>

<B>add</B>
<DL COMPACT><DT id="2"><DD>
add
&eacute; usado para adicionar um novo disco &agrave; lista de fontes. Ir&aacute; desmontar o dispositivo CD-ROM, pedir que seja inserido um disco e depois prosseguir com a sua sondagem e c&oacute;pia dos ficheiros &iacute;ndice. Se o disco n&atilde;o possuir um direct&oacute;rio
.disk
apropriado, ser-lhe-&agrave; pedido um t&iacute;tulo descritivo.
<P>
O APT usa um ID de CD-ROM para acompanhar qual disco est&aacute; actualmente na drive e mant&ecirc;m uma base de dados desses IDs em
/var/lib/apt/cdroms.list
</DL>

<P>

<B>ident</B>
<DL COMPACT><DT id="3"><DD>
Uma ferramenta de depura&ccedil;&atilde;o para reportar a identifica&ccedil;&atilde;o do disco actual assim como o nome de ficheiro armazenado
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Todas as op&ccedil;&otilde;es de linha de comandos podem ser definidas usando o ficheiro de configura&ccedil;&atilde;o, as descri&ccedil;&otilde;es indicam a op&ccedil;&atilde;o de configura&ccedil;&atilde;o a definir. Para op&ccedil;&otilde;es booleanas voc&ecirc; pode sobre por o ficheiro de configura&ccedil;&atilde;o usando algo como
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
ou v&aacute;rias outras variantes.
<P>

<B>--no-auto-detect</B>, <B>--cdrom</B>
<DL COMPACT><DT id="4"><DD>
N&atilde;o tente a auto-detec&ccedil;&atilde;o do caminho do CD-ROM. Normalmente combinada com a op&ccedil;&atilde;o
<B>--cdrom</B>. Item de Configura&ccedil;&atilde;o:
Acquire::cdrom::AutoDetect.
</DL>

<P>

<B>-d</B>, <B>--cdrom</B>
<DL COMPACT><DT id="5"><DD>
Ponto de Montagem; especifica a localiza&ccedil;&atilde;o para montar o cdrom. Este ponto de montagem deve estar listado em
/etc/fstab
e configurado apropriadamente. Item de configura&ccedil;&atilde;o:
Acquire::cdrom::mount.
</DL>

<P>

<B>-r</B>, <B>--rename</B>
<DL COMPACT><DT id="6"><DD>
Renomear um disco; muda a etiqueta de um disco ou sobrep&otilde;e a etiqueta fornecida do disco. Esta op&ccedil;&atilde;o ir&aacute; fazer com que o
<B>apt-cdrom</B>
pergunte por uma nova etiqueta. Item de configura&ccedil;&atilde;o:
APT::CDROM::Rename.
</DL>

<P>

<B>-m</B>, <B>--no-mount</B>
<DL COMPACT><DT id="7"><DD>
Nenhuma montagem; impede o
<B>apt-cdrom</B>
de montar e desmontar o ponto de montagem. Item de configura&ccedil;&atilde;o:
APT::CDROM::NoMount.
</DL>

<P>

<B>-f</B>, <B>--fast</B>
<DL COMPACT><DT id="8"><DD>
Copia r&aacute;pida; Assume que os ficheiros do pacote s&atilde;o v&aacute;lidos e n&atilde;o verifica cada pacote. Este op&ccedil;&atilde;o s&oacute; deve ser usada se o
<B>apt-cdrom</B>
j&aacute; foi corrido com este disco e n&atilde;o detectou nenhum erro. Item de configura&ccedil;&atilde;o:
APT::CDROM::Fast.
</DL>

<P>

<B>-a</B>, <B>--thorough</B>
<DL COMPACT><DT id="9"><DD>
Sondagem de pacote exaustiva; Esta op&ccedil;&atilde;o pode ser necess&aacute;ria com alguns discos Debian antigos 1.1/1.2 que t&ecirc;m ficheiros de pacotes em lugares estranhos. Demora muito mais tempo a sondar o CD mas ir&aacute; apanh&aacute;-los a todos.
</DL>

<P>

<B>-n</B>, <B>--just-print</B>, <B>--recon</B>, <B>--no-act</B>
<DL COMPACT><DT id="10"><DD>
Nenhuma altera&ccedil;&atilde;o; N&atilde;o altera o ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
e n&atilde;o escreve ficheiros &iacute;ndice. No entanto, tudo continua a ser verificado. Item de configura&ccedil;&atilde;o:
APT::CDROM::NoAct.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="11"><DD>
Mostra um sum&aacute;rio curto da utiliza&ccedil;&atilde;o.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="12"><DD>
Mostra a vers&atilde;o do programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="13"><DD>
Ficheiro de Configura&ccedil;&atilde;o; Especifica o ficheiro de configura&ccedil;&atilde;o a usar. O programa ir&aacute; ler o ficheiro de configura&ccedil;&atilde;o predefinido e depois este ficheiro de configura&ccedil;&atilde;o. Se as defini&ccedil;&otilde;es de configura&ccedil;&atilde;o precisarem de ser definidas antes, os ficheiros de configura&ccedil;&atilde;o predefinidos s&atilde;o analisados especificando um ficheiro com a vari&aacute;vel de ambiente
<B>APT_CONFIG</B>. Veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informa&ccedil;&atilde;o de sintaxe.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="14"><DD>
Define uma Op&ccedil;&atilde;o de Configura&ccedil;&atilde;o; Isto ir&aacute; definir uma op&ccedil;&atilde;o de configura&ccedil;&atilde;o arbitr&aacute;ria. A sintaxe &eacute;
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
e
<B>--option</B>
podem ser usadas v&aacute;rias vezes para definir op&ccedil;&otilde;es diferentes.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAG">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt-cdrom</B>
devolve zero em opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAH">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAI">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAJ">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="15"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="16"><DD>
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="17"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="18"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="19"><A HREF="#lbAB">NOME</A><DD>
<DT id="20"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="21"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="22"><A HREF="#lbAE">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="23"><A HREF="#lbAF">VEJA TAMB&Eacute;M</A><DD>
<DT id="24"><A HREF="#lbAG">DIAGN&Oacute;STICO</A><DD>
<DT id="25"><A HREF="#lbAH">BUGS</A><DD>
<DT id="26"><A HREF="#lbAI">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="27"><A HREF="#lbAJ">AUTORES</A><DD>
<DT id="28"><A HREF="#lbAK">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
