
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CONFIG</TITLE>
</HEAD><BODY>
<H1>APT-CONFIG</H1>
Section: APT (8)<BR>Updated: 30&nbsp;Novembro&nbsp;2013<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-config - Programa de Consulta de Configura&ccedil;&atilde;o do APT
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-config</B> [<B>--empty</B>] [<B>--format&nbsp;'</B><B></B><I>%f&nbsp;&quot;%v&quot;;%n</I><B>'</B>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>ficheiro_de_configura&ccedil;&atilde;o</I>] {shell | dump | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<B>apt-config</B>
&eacute; um programa interno usado por v&aacute;rias partes da suite APT para fornecer uma configurabilidade consistente. Acede ao ficheiro de configura&ccedil;&atilde;o principal
/etc/apt/apt.conf
<DD>de um modo que &eacute; f&aacute;cil de usar para aplica&ccedil;&otilde;es em script.
<P>

A menos que a op&ccedil;&atilde;o
<B>-h</B>, ou
<B>--help</B>
seja fornecida, um dos comandos abaixo t&ecirc;m que estar presentes.
<P>

<B>shell</B>
<DL COMPACT><DT id="2"><DD>
shell &eacute; usado para aceder &agrave; informa&ccedil;&atilde;o de configura&ccedil;&atilde;o a partir de um script shell. &Eacute; fornecido pares de argumentos, sendo o primeiro uma vari&aacute;vel de shell e o segundo o valor de configura&ccedil;&atilde;o a consultar. Como resultado cria uma lista de comandos atribu&iacute;dos a shell para cada valor presente. Num script shell dever&aacute; ser usado como se segue:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
OPTS=&quot;-f&quot;
RES=`apt-config shell OPTS MyApp::options`
eval $RES
</PRE>

</DL>




Isto ir&aacute; definir a vari&aacute;vel de ambiente shell $OPTS ao valor de MyApp::options com uma predefini&ccedil;&atilde;o de
<B>-f</B>.
<P>
O item de configura&ccedil;&atilde;o pode ser p&oacute;s-fixado com um /[fdbi]. f devolve nomes de ficheiros, d devolve direct&oacute;rios, b devolve verdadeiro ou falso e i devolve um n&uacute;mero inteiro. Cada um dos valores devolvidos &eacute; normalizado e verificado internamente.
</DL>

<P>

<B>dump</B>
<DL COMPACT><DT id="4"><DD>
Apenas mostra o conte&uacute;do do espa&ccedil;o de configura&ccedil;&atilde;o.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Todas as op&ccedil;&otilde;es de linha de comandos podem ser definidas usando o ficheiro de configura&ccedil;&atilde;o, as descri&ccedil;&otilde;es indicam a op&ccedil;&atilde;o de configura&ccedil;&atilde;o a definir. Para op&ccedil;&otilde;es booleanas voc&ecirc; pode sobre por o ficheiro de configura&ccedil;&atilde;o usando algo como
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
ou v&aacute;rias outras variantes.
<P>

<B>--empty</B>
<DL COMPACT><DT id="5"><DD>
Inclui op&ccedil;&otilde;es que t&ecirc;m um valor vazio. Isto &eacute; a predefini&ccedil;&atilde;o, ent&atilde;o use --no-empty para remov&ecirc;-las dos resultados.
</DL>

<P>

<B>--format '</B><B></B><I>%f &quot;%v&quot;;%n</I><B>'</B>
<DL COMPACT><DT id="6"><DD>
Define a sa&iacute;da de cada op&ccedil;&atilde;o de configura&ccedil;&atilde;o. %t ir&aacute; ser substitu&iacute;do com o seu nome individual, %f com o seu nome hier&aacute;rquico e %v com o seu valor. O uso de letras mai&uacute;sculas e caracteres especiais no valor ser&aacute; codificado para assegurar que pode, por exemplo, ser usado em seguran&ccedil;a numa string citada como definido por RFC822. Adicionalmente %n ser&aacute; substitu&iacute;do por uma nova linha, e %N por um separador. Um % pode ser escrito ao usar %%.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="7"><DD>
Mostra um sum&aacute;rio curto da utiliza&ccedil;&atilde;o.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="8"><DD>
Mostra a vers&atilde;o do programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="9"><DD>
Ficheiro de Configura&ccedil;&atilde;o; Especifica o ficheiro de configura&ccedil;&atilde;o a usar. O programa ir&aacute; ler o ficheiro de configura&ccedil;&atilde;o predefinido e depois este ficheiro de configura&ccedil;&atilde;o. Se as defini&ccedil;&otilde;es de configura&ccedil;&atilde;o precisarem de ser definidas antes, os ficheiros de configura&ccedil;&atilde;o predefinidos s&atilde;o analisados especificando um ficheiro com a vari&aacute;vel de ambiente
<B>APT_CONFIG</B>. Veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informa&ccedil;&atilde;o de sintaxe.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="10"><DD>
Define uma Op&ccedil;&atilde;o de Configura&ccedil;&atilde;o; Isto ir&aacute; definir uma op&ccedil;&atilde;o de configura&ccedil;&atilde;o arbitr&aacute;ria. A sintaxe &eacute;
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
e
<B>--option</B>
podem ser usadas v&aacute;rias vezes para definir op&ccedil;&otilde;es diferentes.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<A NAME="lbAG">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt-config</B>
devolve zero em opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAH">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAI">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAJ">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="11"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="12"><DD>
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="13"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NOME</A><DD>
<DT id="16"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="17"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="18"><A HREF="#lbAE">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="19"><A HREF="#lbAF">VEJA TAMB&Eacute;M</A><DD>
<DT id="20"><A HREF="#lbAG">DIAGN&Oacute;STICO</A><DD>
<DT id="21"><A HREF="#lbAH">BUGS</A><DD>
<DT id="22"><A HREF="#lbAI">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="23"><A HREF="#lbAJ">AUTORES</A><DD>
<DT id="24"><A HREF="#lbAK">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
