
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-MARK</TITLE>
</HEAD><BODY>
<H1>APT-MARK</H1>
Section: APT (8)<BR>Updated: 11&nbsp;Dezembro&nbsp;2018<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-mark - mostrar, definir e apagar v&aacute;rias defini&ccedil;&otilde;es para um pacote
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-mark</B> {<B>-f=</B><B></B><I>nome_do_ficheiro</I> | {auto&nbsp;|&nbsp;manual}&nbsp;<I>pkg</I>...  | {showauto&nbsp;|&nbsp;showmanual}&nbsp;[<I>pkg</I>...] } | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help} 
<DT id="2">
<B>apt-mark</B> {hold&nbsp;|&nbsp;unhold&nbsp;|&nbsp;install&nbsp;|&nbsp;remove&nbsp;|&nbsp;purge}&nbsp;<I>pkg</I>...  | {showhold&nbsp;|&nbsp;showinstall&nbsp;|&nbsp;showremove&nbsp;|&nbsp;showpurge}&nbsp;[<I>pkg</I>...]  
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<B>apt-mark</B>
<DD>pode ser usado como um front-end unificado para definir v&aacute;rias defini&ccedil;&otilde;es para um pacote, tal como marcar um pacote como sendo instalado automaticamente/manualmente ou alterar selec&ccedil;&otilde;es do
<B>dpkg</B>
como manter, instalar, desinstalar e purgar as quais s&atilde;o respeitadas, por exemplo, por
<B>apt-get dselect-upgrade</B>
ou
<B>aptitude</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>PACOTES INSTALADOS AUTOMATICAMENTE E MANUALMENTE</H2>

<P>

Quando voc&ecirc; pede que um pacote seja instalado, e como resultado outros pacotes s&atilde;o instalados para satisfazer as suas depend&ecirc;ncias, as depend&ecirc;ncias s&atilde;o marcadas como sendo instaladas automaticamente, enquanto que o pacote que voc&ecirc; instalou explicitamente &eacute; marcado como instalado manualmente. Uma vez que um pacote instalado automaticamente n&atilde;o &eacute; mais uma depend&ecirc;ncia de nenhum pacote instalado manualmente, &eacute; considerado como n&atilde;o sendo mais necess&aacute;rio e por ex o
<B>apt-get</B>
ou o
<B>aptitude</B>
ir&atilde;o sugerir remov&ecirc;-lo.
<P>

<B>auto</B>
<DL COMPACT><DT id="3"><DD>
auto
&eacute; usado para marcar um pacote como sendo instalado automaticamente, o que ir&aacute; causar a remo&ccedil;&atilde;o do pacote quando mais nenhum pacote instalado manualmente depender deste pacote.
</DL>

<P>

<B>manual</B>
<DL COMPACT><DT id="4"><DD>
manual
&eacute; usado para marcar um pacote como sendo instalado manualmente, o que ir&aacute; prevenir que o pacote seja removido automaticamente se nenhum outro pacote depender dele.
</DL>

<P>

<B>minimize-manual</B>
<DL COMPACT><DT id="5"><DD>
minimize-manual
&eacute; usado para marcar (transitivo) depend&ecirc;ncias is used to mark (transitive) dependencies de meta-pacotes como instalados automaticamente. Isto pode ser usado ap&oacute;s uma instala&ccedil;&atilde;o por exemplo, para minimizar o n&uacute;mero de pacotes instalados manualmente, ou continuamente em sistemas geridos por meta-pacotes de configura&ccedil;&atilde;o do sistema.
</DL>

<P>

<B>showauto</B>
<DL COMPACT><DT id="6"><DD>
showauto
&eacute; usado para escrever uma lista dos pacotes instalados automaticamente com cada pacote numa linha nova. Ser&atilde;o listados todos os pacotes instalados automaticamente se n&atilde;o for dado um pacote. Se forem dados pacotes ent&atilde;o s&oacute; ser&atilde;o mostrados aqueles que foram instalados automaticamente.
</DL>

<P>

<B>showmanual</B>
<DL COMPACT><DT id="7"><DD>
showmanual
pode ser usado do mesmo modo que o
showauto, excepto que ir&aacute; escrever uma lista dos pacotes instalados manualmente.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H3>Op&ccedil;&otilde;es</H3>

<P>

<B>-f=</B><B></B><I>nome_do_ficheiro</I>, <B>--file=</B><B></B><I>nome_do_ficheiro</I>
<DL COMPACT><DT id="8"><DD>
L&ecirc;/Escreve o estado de pacote a partir do nome de ficheiro dado com o par&acirc;metro
<I>nome_do_ficheiro</I>
em vez de o fazer a partir da localiza&ccedil;&atilde;o predefinida, a qual &eacute;
extended_states
no direct&oacute;rio definido pelo Item de Configura&ccedil;&atilde;o:
Dir::State.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>PREVENIR ALTERA&Ccedil;&Otilde;ES PARA UM PACOTE</H2>

<P>

<B>hold</B>
<DL COMPACT><DT id="9"><DD>
hold
&eacute; usado para marcar um pacote como segurado, o que ir&aacute; impedir o pacote de ser instalado automaticamente, actualizado ou removido.
</DL>

<P>

<B>unhold</B>
<DL COMPACT><DT id="10"><DD>
unhold
&eacute; usado para cancelar um &quot;hold&quot; previamente definido num pacote para permitir de novo todas as ac&ccedil;&otilde;es.
</DL>

<P>

<B>showhold</B>
<DL COMPACT><DT id="11"><DD>
showhold
&eacute; usado para escrever uma lista dos pacotes em reten&ccedil;&atilde;o do mesmo modo que os outros comandos show.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>AGENDAR PACOTES PARA INSTALAR, REMOVER E PURGAR</H2>

<P>

Alguns front-ends como o
<B>apt-get dselect-upgrade</B>
podem ser usados para aplicar altera&ccedil;&otilde;es previamente agendadas ao estado de instala&ccedil;&atilde;o de pacotes. Tais altera&ccedil;&otilde;es podem ser agendadas com os comandos
<B>install</B>,
<B>remove</B>
(tamb&eacute;m conhecido por
<B>deinstall</B>) e
<B>purge</B>. Os pacotes com uma selec&ccedil;&atilde;o espec&iacute;fica podem ser mostrados com
<B>showinstall</B>,
<B>showremove</B>
e
<B>showpurge</B>
respectivamente. Mais informa&ccedil;&atilde;o acerca destas chamadas selec&ccedil;&otilde;es do dpkg pode ser encontrada em
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<A NAME="lbAI">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="12"><DD>
Mostra um sum&aacute;rio curto da utiliza&ccedil;&atilde;o.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="13"><DD>
Mostra a vers&atilde;o do programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="14"><DD>
Ficheiro de Configura&ccedil;&atilde;o; Especifica o ficheiro de configura&ccedil;&atilde;o a usar. O programa ir&aacute; ler o ficheiro de configura&ccedil;&atilde;o predefinido e depois este ficheiro de configura&ccedil;&atilde;o. Se as defini&ccedil;&otilde;es de configura&ccedil;&atilde;o precisarem de ser definidas antes, os ficheiros de configura&ccedil;&atilde;o predefinidos s&atilde;o analisados especificando um ficheiro com a vari&aacute;vel de ambiente
<B>APT_CONFIG</B>. Veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informa&ccedil;&atilde;o de sintaxe.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="15"><DD>
Define uma Op&ccedil;&atilde;o de Configura&ccedil;&atilde;o; Isto ir&aacute; definir uma op&ccedil;&atilde;o de configura&ccedil;&atilde;o arbitr&aacute;ria. A sintaxe &eacute;
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
e
<B>--option</B>
podem ser usadas v&aacute;rias vezes para definir op&ccedil;&otilde;es diferentes.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/var/lib/apt/extended_states
<DL COMPACT><DT id="16"><DD>
Lista de estado de pacotes auto-instalados. Item de Configura&ccedil;&atilde;o:
Dir::State::extended_states.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),<B><A HREF="/cgi-bin/man/man2html?8+aptitude">aptitude</A></B>(8),<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<A NAME="lbAL">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt-mark</B>
devolve zero na opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAM">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAN">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAO">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Mike O'Connor</B>
<DL COMPACT><DT id="17"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="18"><DD>
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="19"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="20"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="21"><A HREF="#lbAB">NOME</A><DD>
<DT id="22"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="23"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="24"><A HREF="#lbAE">PACOTES INSTALADOS AUTOMATICAMENTE E MANUALMENTE</A><DD>
<DL>
<DT id="25"><A HREF="#lbAF">Op&ccedil;&otilde;es</A><DD>
</DL>
<DT id="26"><A HREF="#lbAG">PREVENIR ALTERA&Ccedil;&Otilde;ES PARA UM PACOTE</A><DD>
<DT id="27"><A HREF="#lbAH">AGENDAR PACOTES PARA INSTALAR, REMOVER E PURGAR</A><DD>
<DT id="28"><A HREF="#lbAI">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="29"><A HREF="#lbAJ">FICHEIROS</A><DD>
<DT id="30"><A HREF="#lbAK">VEJA TAMB&Eacute;M</A><DD>
<DT id="31"><A HREF="#lbAL">DIAGN&Oacute;STICO</A><DD>
<DT id="32"><A HREF="#lbAM">BUGS</A><DD>
<DT id="33"><A HREF="#lbAN">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="34"><A HREF="#lbAO">AUTORES</A><DD>
<DT id="35"><A HREF="#lbAP">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
