
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-GET</TITLE>
</HEAD><BODY>
<H1>APT-GET</H1>
Section: APT (8)<BR>Updated: 15&nbsp;Janeiro&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-get - Utilit&aacute;rio de manuseamento de pacotes do APT -- interface de linha de comandos
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-get</B> [<B>-asqdyfmubV</B>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>ficheiro_de_configura&ccedil;&atilde;o</I>] [<B>-t=</B><B></B><I>lan&ccedil;amento-alvo</I>] [<B>-a=</B><B></B><I>arquitectura</I>] {update | upgrade | dselect-upgrade | dist-upgrade | install&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | remove&nbsp;<I>pkg</I>...  | purge&nbsp;<I>pkg</I>...  | source&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | build-dep&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | download&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | check | clean | autoclean | autoremove | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<B>apt-get</B>
&eacute; a ferramenta de linha de comandos para lidar com pacotes, e pode ser considerada o &quot;back-end&quot; dos utilizadores para outras ferramentas que usam a biblioteca APT. Existem v&aacute;rias interfaces &quot;front-end&quot; como o
<B><A HREF="/cgi-bin/man/man2html?8+aptitude">aptitude</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+synaptic">synaptic</A></B>(8)
<DD>e
<B><A HREF="/cgi-bin/man/man2html?1+wajig">wajig</A></B>(1).
<P>

A menos que a op&ccedil;&atilde;o
<B>-h</B>, ou
<B>--help</B>
seja fornecida, um dos comandos abaixo t&ecirc;m que estar presentes.
<P>

<B>update</B>
<DL COMPACT><DT id="2"><DD>
update
&eacute; usado para re-sincronizar os ficheiros de &iacute;ndices de pacotes a partir das suas fontes. Os &iacute;ndices dos pacotes dispon&iacute;veis s&atilde;o obtidos a partir das localiza&ccedil;&otilde;es em
/etc/apt/sources.list. Por exemplo, quando se usa um arquivo Debian, este comando recolhe e analisa os ficheiros
Packages.gz
para que a informa&ccedil;&atilde;o sobre pacotes novos e actualizados fique dispon&iacute;vel. Um
update
deve ser sempre executado antes de um
upgrade
ou
dist-upgrade. Por favor note que a medi&ccedil;&atilde;o do processo total ira estar incorrecta pois o tamanho dos ficheiros de pacotes n&atilde;o pode ser conhecido com anteced&ecirc;ncia.
</DL>

<P>

<B>upgrade</B>
<DL COMPACT><DT id="3"><DD>
upgrade
&eacute; usado para instalar as vers&otilde;es mais recentes de todos os pacotes presentemente instalados no sistema a partir das fontes enumeradas em
/etc/apt/sources.list. Os pacotes presentemente instalados com vers&otilde;es novas s&atilde;o obtidos e instalados; em nenhumas circunst&acirc;ncias os pacotes presentemente instalados ser&atilde;o removidos, nem pacotes j&aacute; instalados ser&atilde;o obtidos e instalados.Os pacotes presentemente instalados com novas vers&otilde;es e que n&atilde;o possam ser actualizados sem alterarem o estado da instala&ccedil;&atilde;o de outro pacote ser&atilde;o deixados na vers&atilde;o presente. Deve ser executado primeiro um
update
para que o
<B>apt-get</B>
fique a saber que est&atilde;o dispon&iacute;veis novas vers&otilde;es de pacotes.
</DL>

<P>

<B>dist-upgrade</B>
<DL COMPACT><DT id="4"><DD>
dist-upgrade
adicionalmente a executar a fun&ccedil;&atilde;o do
upgrade, tamb&eacute;m lida inteligentemente com as altera&ccedil;&otilde;es de depend&ecirc;ncias com as novas vers&otilde;es de pacotes; o
<B>apt-get</B>
tem um sistema de resolu&ccedil;&atilde;o de conflitos 'inteligente', que ir&aacute; tentar actualizar os pacotes mais importantes a custo dos pacotes menos importantes, caso necess&aacute;rio. Portanto, o comando
dist-upgrade
pode remover alguns pacotes. O ficheiro
/etc/apt/sources.list
cont&eacute;m uma lista de localiza&ccedil;&otilde;es de onde obter os ficheiros de pacotes desejados. Veja tamb&eacute;m
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)
para um mecanismo para sobrepor as defini&ccedil;&otilde;es gerais em pacotes individuais.
</DL>

<P>

<B>dselect-upgrade</B>
<DL COMPACT><DT id="5"><DD>
dselect-upgrade
&eacute; usado em conjunto com o front-end de pacotes Debian tradicional,
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1).
dselect-upgrade
segue as altera&ccedil;&otilde;es feitas pelo
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
ao campo
Status
dos pacotes dispon&iacute;veis, e executa as ac&ccedil;&otilde;es necess&aacute;rias para realizar esse estado (por exemplo, a remo&ccedil;&atilde;o de pacotes antigos e a instala&ccedil;&atilde;o de novos).
</DL>

<P>

<B>install</B>
<DL COMPACT><DT id="6"><DD>
install
&eacute; seguido por um ou mais pacotes desejados para instala&ccedil;&atilde;o ou actualiza&ccedil;&atilde;o. Cada pacote &eacute; um nome de pacote, n&atilde;o um nome de ficheiro completamente qualificado (por exemplo, num sistema Debian GNU/Linux,
apt-utils
seria o argumento fornecido e n&atilde;o
apt-utils_2.0.4_amd64.deb). Todos os pacotes necess&aacute;rios pelos pacotes especificados para instala&ccedil;&atilde;o ir&atilde;o tamb&eacute;m ser obtidos e instalados. O ficheiro
/etc/apt/sources.list
&eacute; usado para localizar os pacotes desejados. Se for acrescentado um sinal menos (-) ao nome do pacote (sem nenhum espa&ccedil;o a separar), o pacote identificado ir&aacute; ser removido se estiver instalado. &Agrave; semelhan&ccedil;a, um sinal mais (+) pode ser usado para designar um pacote a instalar. Estas &uacute;ltimas funcionalidades podem ser usadas para sobrepor decis&otilde;es feitas pelo sistema de resolu&ccedil;&atilde;o de conflitos do apt-get.
<P>
Pode ser seleccionada para instala&ccedil;&atilde;o uma vers&atilde;o espec&iacute;fica de um pacote ao continuar o nome do pacote com um igual (=) e a vers&atilde;o do pacote a seleccionar. Isto ir&aacute; fazer com que essa vers&atilde;o seja localizada e seleccionada para instala&ccedil;&atilde;o. Alternativamente pode ser seleccionada uma distribui&ccedil;&atilde;o espec&iacute;fica ao continuar o nome do pacote com uma slash (/) e a vers&atilde;o da distribui&ccedil;&atilde;o ou o nome de Arquivo (stable, testing, unstable).
<P>
Ambos os mecanismos de selec&ccedil;&atilde;o de vers&atilde;o podem regredir pacotes (downgrade) e devem ser usados com cuidado.
<P>
Este &eacute; tamb&eacute;m o objectivo a usar se deseja actualizar um ou mais pacotes j&aacute; instalados sem actualizar todos os pacotes que tem no seu sistema. Ao contr&aacute;rio do objectivo &quot;upgrade&quot;, o qual instala as vers&otilde;es mais recentes de todos os pacotes presentemente instalados, o &quot;install&quot; ir&aacute; instalar a vers&atilde;o mais recente apenas dos pacotes especificados. Simplesmente forne&ccedil;a o nome do(s) pacote(s) que deseja actualizar, e se estiver dispon&iacute;vel uma nova vers&atilde;o, ela ( e as suas depend&ecirc;ncias, como descrito em cima) ser&atilde;o descarregadas e instaladas.
<P>
Finalmente, o mecanismo
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)
permite-lhe criar uma pol&iacute;tica de instala&ccedil;&atilde;o alternativa para pacotes individuais.
<P>
Se nenhum pacote coincidir com a express&atilde;o fornecida e a express&atilde;o conter um de '.', '?' ou '*' ent&atilde;o &eacute; assumido ser uma express&atilde;o regular POSIX, e &eacute; aplicada a todos os nomes de pacotes da base de dados. Quaisquer correspond&ecirc;ncias s&atilde;o ent&atilde;o instaladas (ou removidas). Note que a correspond&ecirc;ncia &eacute; feita por substring, portanto 'lo.*' corresponde a 'how-lo' e 'lowest'. Se isto for indesej&aacute;vel, ancore a express&atilde;o regular com a caractere '^' ou '$', para criar uma express&atilde;o regular mais espec&iacute;fica.
<P>
Fallback to regular expressions is deprecated in APT 2.0, has been removed in
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8), except for anchored expressions, and will be removed from
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
in a future version. Use
<B><A HREF="/cgi-bin/man/man2html?5+apt-patterns">apt-patterns</A></B>(5)
instead.
</DL>

<P>

<B>reinstall</B>
<DL COMPACT><DT id="7"><DD>
reinstall
&eacute; um alias para
install --reinstall.
</DL>

<P>

<B>remove</B>
<DL COMPACT><DT id="8"><DD>
remove
&eacute; id&ecirc;ntico a
install
&agrave; excep&ccedil;&atilde;o que os pacotes s&atilde;o removidos em vez de instalados. Note que remover um pacote deixa os seus ficheiros de configura&ccedil;&atilde;o no sistema. Se um sinal mais (+) for acrescentado ao nome do pacote (sem nenhum espa&ccedil;o a separar), o pacote identificado ser&aacute; instalado em vez de removido.
</DL>

<P>

<B>purge</B>
<DL COMPACT><DT id="9"><DD>
purge
&eacute; id&ecirc;ntico ao
remove
com a excep&ccedil;&atilde;o que os pacotes s&atilde;o removidos e purgados (quaisquer ficheiros de configura&ccedil;&atilde;o s&atilde;o tamb&eacute;m apagados).
</DL>

<P>

<B>source</B>
<DL COMPACT><DT id="10"><DD>
source
faz com que o
<B>apt-get</B>
procure pacotes fonte. O APT ir&aacute; examinar os pacotes dispon&iacute;veis para decidir qual pacote fonte obter. Ir&aacute; ent&atilde;o encontrar e descarregar para o direct&oacute;rio actual a vers&atilde;o dispon&iacute;vel mais recente desse pacote fonte enquanto respeita o lan&ccedil;amento predefinido, definido com a op&ccedil;&atilde;o
APT::Default-Release, a op&ccedil;&atilde;o
<B>-t</B>
ou por pacote com a sintaxe
pkg/release, se poss&iacute;vel.
<P>
Os argumentos s&atilde;o interpretados como nomes de pacotes bin&aacute;rios e de fonte. Veja a op&ccedil;&atilde;o
<B>--only-source</B>
se desejar alterar isso.
<P>
Os pacotes fonte s&atilde;o acompanhados em separado dos pacotes bin&aacute;rios via linhas
deb- src
no ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). Isto quer dizer que voc&ecirc; precisa de adicionar uma dessas linhas para cada reposit&oacute;rio de onde deseja obter fontes; caso contr&aacute;rio, ir&aacute; provavelmente obter vers&otilde;es de fonte erradas (muito antigas/muito novas) ou mesmo nenhuma.
<P>
Se for especificada a op&ccedil;&atilde;o
<B>--compile</B>
ent&atilde;o o pacote ir&aacute; ser compilado para um bin&aacute;rio .deb usando
<B>dpkg-buildpackage</B>
para a arquitectura definida pela op&ccedil;&atilde;o
<B>--host-architecture</B>. Se for especificado
<B>--download-only</B>
ent&atilde;o o pacote fonte n&atilde;o ser&aacute; desempacotado.
<P>
Uma vers&atilde;o fonte espec&iacute;fica pode ser obtida ao p&oacute;s-fixar o nome da fonte com um igual (=) e depois a vers&atilde;o a procurar, semelhante ao mecanismo usado para os ficheiros de pacotes. Isto activa a correspond&ecirc;ncia exacta do pacote fonte, nome e vers&atilde;o, activando implicitamente a op&ccedil;&atilde;o
APT::Get::Only-Source.
<P>
Note que os pacotes fonte n&atilde;o s&atilde;o instalados e acompanhados na base de dados do
<B>dpkg</B>
como os pacotes bin&aacute;rios; eles s&atilde;o simplesmente descarregados para o direct&oacute;rio actual, como tarballs fonte.
</DL>

<P>

<B>build-dep</B>
<DL COMPACT><DT id="11"><DD>
build-dep
faz o apt-get instalar/remover pacotes numa tentativa de satisfazer depend&ecirc;ncias de compila&ccedil;&atilde;o para um pacote fonte. Por predefini&ccedil;&atilde;o, as depend&ecirc;ncias s&atilde;o satisfeitas para compilar o pacote nativamente. Se desejado, em vez disso, pode ser especificada uma arquitectura-anfitri&atilde; com a op&ccedil;&atilde;o
<B>--host-architecture</B>.
<P>
Os argumentos s&atilde;o interpretados como nomes de pacotes bin&aacute;rios ou de fonte. Veja a op&ccedil;&atilde;o
<B>--only-source</B>
se desejar alterar isso.
</DL>

<P>

<B>satisfy</B>
<DL COMPACT><DT id="12"><DD>
satisfy
causes apt-get to satisfy the given dependency strings. The dependency strings may have build profiles and architecture restriction list as in build dependencies. They may optionally be prefixed with
&quot;Conflicts: &quot;
to unsatisfy the dependency string. Multiple strings of the same type can be specified.
<P>
Example:
apt-get satisfy &quot;foo&quot; &quot;Conflicts: bar&quot; &quot;baz (&gt;&gt; 1.0) | bar (= 2.0), moo&quot;
<P>
The legacy operator '&lt;/&gt;' is not supported, use '&lt;=/&gt;=' instead.
</DL>

<P>

<B>check</B>
<DL COMPACT><DT id="13"><DD>
check
&eacute; uma ferramenta de diagn&oacute;stico; actualiza a cache de pacotes e verifica por depend&ecirc;ncias quebradas.
</DL>

<P>

<B>download</B>
<DL COMPACT><DT id="14"><DD>
download
ir&aacute; descarregar o pacote bin&aacute;rio dado para o direct&oacute;rio actual.
</DL>

<P>

<B>clean</B>
<DL COMPACT><DT id="15"><DD>
clean
limpa o reposit&oacute;rio local dos ficheiros de pacotes obtidos. Remove tudo excepto o ficheiro lock de
/var/cache/apt/archives/
e
/var/cache/apt/archives/partial/.
</DL>

<P>

<B>autoclean</B> (e o <B>auto-clean</B> alias desde 1.1)
<DL COMPACT><DT id="16"><DD>
Tal como o
clean,
autoclean
limpa o reposit&oacute;rio local de ficheiros de pacotes obtidos. A diferen&ccedil;a &eacute; que apenas remove ficheiros de pacotes que j&aacute; n&atilde;o podem ser mais descarregados, e s&atilde;o na maioria dos casos in&uacute;teis. Isto permite a manuten&ccedil;&atilde;o de uma cache durante um longo per&iacute;odo sem que ela cres&ccedil;a descontroladamente. A op&ccedil;&atilde;o de configura&ccedil;&atilde;o
APT::Clean-Installed
ir&aacute; prevenir que pacotes instalados sejam apagados se estiver definida para 'off'.
</DL>

<P>

<B>autoremove</B> (e o <B>auto-remove</B> alias desde 1.1)
<DL COMPACT><DT id="17"><DD>
autoremove
&eacute; usado para remover pacotes que foram instalados automaticamente para satisfazer depend&ecirc;ncias de outros pacotes e que j&aacute; n&atilde;o s&atilde;o necess&aacute;rios.
</DL>

<P>

<B>changelog</B>
<DL COMPACT><DT id="18"><DD>
changelog
tenta descarregar o registo de altera&ccedil;&otilde;es de um pacote e mostra-o atrav&eacute;s do
<B>sensible-pager</B>. Por predefini&ccedil;&atilde;o mostra o registo de altera&ccedil;&otilde;es da vers&atilde;o que est&aacute; instalada. No entanto, voc&ecirc; pode especificar as mesmas op&ccedil;&otilde;es que s&atilde;o para o comando
<B>install</B>.
</DL>

<P>

<B>indextargets</B>
<DL COMPACT><DT id="19"><DD>
Mostra por predefini&ccedil;&atilde;o uma listagem em formato deb822 de informa&ccedil;&atilde;o acerca de todos os ficheiros de dados (os alvos dos &iacute;ndices) que um
<B>apt-get update</B>
deveria descarregar. Suporta uma op&ccedil;&atilde;o
<B>--format</B>
para ir modificando o formato do resultado assim que vai aceitando linhas do resultado predefinido para ir filtrando a informa&ccedil;&atilde;o. O comando &eacute; usado principalmente como uma interface para ferramentas externas que funcionam com o APT para obter informa&ccedil;&atilde;o assim como os nomes de ficheiros para os ficheiros descarregados para que os possa usar tamb&eacute;m em vez de os descarregar outra vez por sua conta. N&atilde;o existe aqui documenta&ccedil;&atilde;o detalhada e esta pode ser encontrada no ficheiro
/usr/share/doc/apt-doc/acquire-additional-files.md.gz
existente no pacote
apt-doc.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Todas as op&ccedil;&otilde;es de linha de comandos podem ser definidas usando o ficheiro de configura&ccedil;&atilde;o, as descri&ccedil;&otilde;es indicam a op&ccedil;&atilde;o de configura&ccedil;&atilde;o a definir. Para op&ccedil;&otilde;es booleanas voc&ecirc; pode sobre por o ficheiro de configura&ccedil;&atilde;o usando algo como
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
ou v&aacute;rias outras variantes.
<P>

<B>--no-install-recommends</B>
<DL COMPACT><DT id="20"><DD>
N&atilde;o considera pacotes recomendados como depend&ecirc;ncias para instala&ccedil;&atilde;o. Item de Configura&ccedil;&atilde;o:
APT::Install-Recommends.
</DL>

<P>

<B>--install-suggests</B>
<DL COMPACT><DT id="21"><DD>
Considera pacotes sugeridos como uma depend&ecirc;ncia para instala&ccedil;&atilde;o. Item de Configura&ccedil;&atilde;o:
APT::Install-Suggests.
</DL>

<P>

<B>-d</B>, <B>--download-only</B>
<DL COMPACT><DT id="22"><DD>
Apenas descarrega; os ficheiros pacotes s&atilde;o apenas obtidos, n&atilde;o s&atilde;o desempacotados nem instalados. Item de Configura&ccedil;&atilde;o:
APT::Get::Download-Only.
</DL>

<P>

<B>-f</B>, <B>--fix-broken</B>
<DL COMPACT><DT id="23"><DD>
Corrige; tenta corrigir um sistema com depend&ecirc;ncias quebradas no lugar. Esta op&ccedil;&atilde;o, quando usada com install/remove, pode omitir quaisquer pacotes para permitir ao APT deduzir uma solu&ccedil;&atilde;o prov&aacute;vel. Se forem especificados pacotes, este t&ecirc;m de corrigir completamente o problema. A op&ccedil;&atilde;o &eacute; por vezes necess&aacute;ria quando se corre o APT pela primeira vez. O pr&oacute;prio APT n&atilde;o permite que existam num sistema depend&ecirc;ncias de pacotes quebradas. &Eacute; poss&iacute;vel que uma estrutura de depend&ecirc;ncias de um sistema esteja t&atilde;o corrompida ao ponto de requerer interven&ccedil;&atilde;o manual (o que normalmente significa usar o
<B>dpkg --remove</B>
para eliminar alguns dos pacotes ofensivos). O uso desta op&ccedil;&atilde;o juntamente com
<B>-m</B>
pode produzir um erro em algumas situa&ccedil;&otilde;es. Item de Configura&ccedil;&atilde;o:
APT::Get::Fix-Broken.
</DL>

<P>

<B>-m</B>, <B>--ignore-missing</B>, <B>--fix-missing</B>
<DL COMPACT><DT id="24"><DD>
Ignora pacotes em falta; Se pacotes n&atilde;o podem ser obtidos ou falham a verifica&ccedil;&atilde;o de integridade ap&oacute;s obten&ccedil;&atilde;o (ficheiros de pacotes corrompidos), ret&ecirc;m esses pacotes e manuseia o resultado. Usar esta op&ccedil;&atilde;o em conjunto com
<B>-f</B>
pode produzir erros em algumas situa&ccedil;&otilde;es. Se um pacote for seleccionado para instala&ccedil;&atilde;o (particularmente se for mencionado na linha de comandos) e n&atilde;o pode ser descarregado est&atilde;o ser&aacute; segurado em sil&ecirc;ncio. Item de Configura&ccedil;&atilde;o:
APT::Get::Fix-Missing.
</DL>

<P>

<B>--no-download</B>
<DL COMPACT><DT id="25"><DD>
Desactiva a descarga de pacotes. Isto &eacute; melhor ser usado com
<B>--ignore-missing</B>
para for&ccedil;ar o APT a usar os .debs que j&aacute; foram descarregados. Item de Configura&ccedil;&atilde;o:
APT::Get::Download.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="26"><DD>
Silencioso; produz sa&iacute;da apropriada para registar em log, omitindo indicadores de progresso. Mais q's ir&aacute; resultar em mais sil&ecirc;ncio at&eacute; o m&aacute;ximo de 2. Voc&ecirc; tamb&eacute;m pode usar
<B>-q=#</B>
para definir o n&iacute;vel de sil&ecirc;ncio, sobrepondo o ficheiro de configura&ccedil;&atilde;o. Note que o sil&ecirc;ncio n&iacute;vel 2 implica
<B>-y</B>, voc&ecirc; nunca deve usar -qq sem um modificador de 'nenhuma ac&ccedil;&atilde;o' tal como -d, --print-uris ou -s pois o APT pode decidir fazer algo que voc&ecirc; n&atilde;o esperava. Item de Configura&ccedil;&atilde;o:
quiet.
</DL>

<P>

<B>-s</B>, <B>--simulate</B>, <B>--just-print</B>, <B>--dry-run</B>, <B>--recon</B>, <B>--no-act</B>
<DL COMPACT><DT id="27"><DD>
Nenhuma ac&ccedil;&atilde;o; executa uma simula&ccedil;&atilde;o de eventos que deveriam ocorrer com base no estado actual do sistema mas n&atilde;o muda realmente o sistema. O bloqueio ser&aacute; desactivado (<B>Debug::NoLocking</B>) para que o estado do sistema possa mudar enquanto o
<B>apt-get</B>
est&aacute; a correr. As simula&ccedil;&otilde;es tamb&eacute;m podem ser executadas por utilizadores n&atilde;o-root os quais podem n&atilde;o ter acesso de leitura a todas as configura&ccedil;&otilde;es do apt distorcendo a simula&ccedil;&atilde;o. Tamb&eacute;m &eacute; mostrada por predefini&ccedil;&atilde;o uma nota expressando este aviso aos utilizadores n&atilde;o-root. (<B>APT::Get::Show-User-Simulation-Note</B>). Item de Configura&ccedil;&atilde;o:
APT::Get::Simulate.
<P>
As simula&ccedil;&otilde;es escrevem uma s&eacute;rie de linhas cada uma representando uma opera&ccedil;&atilde;o do
<B>dpkg</B>: configurar (Conf), remover (Remv) ou desempacotar (Inst). Par&ecirc;ntesis rectos ([]) indicam pacotes quebrados e par&ecirc;ntesis rectos vazios indicam quebras que n&atilde;o t&ecirc;m consequ&ecirc;ncia (raro).
</DL>

<P>

<B>-y</B>, <B>--yes</B>, <B>--assume-yes</B>
<DL COMPACT><DT id="28"><DD>
Responde sim automaticamente aos avisos; assume &quot;yes&quot; como resposta a todos os avisos e corre n&atilde;o-interactivamente. Se uma situa&ccedil;&atilde;o indesej&aacute;vel ocorrer, tal como alterar um pacote segurado, tentar instalar um pacote n&atilde;o autenticado ou remover um pacote essencial, ent&atilde;o o
apt-get
ir&aacute; abortar. Item de Configura&ccedil;&atilde;o:
APT::Get::Assume-Yes.
</DL>

<P>

<B>--assume-no</B>
<DL COMPACT><DT id="29"><DD>
Resposta &quot;N&atilde;o&quot; autom&aacute;tica a todos os avisos. Item de Configura&ccedil;&atilde;o:
APT::Get::Assume-No.
</DL>

<P>

<B>--no-show-upgraded</B>
<DL COMPACT><DT id="30"><DD>
N&atilde;o mostra uma lista de todos os pacotes que est&atilde;o prestes a ser actualizados. Item de Configura&ccedil;&atilde;o:
APT::Get::Show-Upgraded.
</DL>

<P>

<B>-V</B>, <B>--verbose-versions</B>
<DL COMPACT><DT id="31"><DD>
Mostra as vers&otilde;es completas para pacotes actualizados e instalados. Item de Configura&ccedil;&atilde;o:
APT::Get::Show-Versions.
</DL>

<P>

<B>-a</B>, <B>--host-architecture</B>
<DL COMPACT><DT id="32"><DD>
Esta op&ccedil;&atilde;o controla a arquitectura para que os pacotes s&atilde;o compilados pelo
<B>apt-get source --compile</B>
e como as depend&ecirc;ncias cruzadas de compila&ccedil;&atilde;o s&atilde;o satisfeitas. Por predefini&ccedil;&atilde;o n&atilde;o est&aacute; activa o que significa que a arquitectura anfitri&atilde; &eacute; a mesma que a arquitectura de compila&ccedil;&atilde;o (a qual &eacute; definida por
APT::Architecture). item de Configura&ccedil;&atilde;o:
APT::Get::Host-Architecture
</DL>

<P>

<B>-P</B>, <B>--build-profiles</B>
<DL COMPACT><DT id="33"><DD>
Esta op&ccedil;&atilde;o controla perfis de compila&ccedil;&atilde;o activados pelos quais um pacote fonte &eacute; compilado por
<B>apt-get source --compile</B>
e como as depend&ecirc;ncias de compila&ccedil;&atilde;o s&atilde;o satisfeitas. Por predefini&ccedil;&atilde;o, nenhum perfil de compila&ccedil;&atilde;o est&aacute; activo. Podem ser activados ao mesmo tempo mais do que um perfil de compila&ccedil;&atilde;o ao concaten&aacute;-los com uma v&iacute;rgula. Item de configura&ccedil;&atilde;o:
APT::Build-Profiles.
</DL>

<P>

<B>-b</B>, <B>--compile</B>, <B>--build</B>
<DL COMPACT><DT id="34"><DD>
Compila pacotes fonte ap&oacute;s os descarregar. Item de Configura&ccedil;&atilde;o:
APT::Get::Compile.
</DL>

<P>

<B>--ignore-hold</B>
<DL COMPACT><DT id="35"><DD>
Ignora pacotes retidos; Isto faz com que o
<B>apt-get</B>
ignore a reten&ccedil;&atilde;o de um pacote. Isto pode ser &uacute;til em conjunto com
dist-upgrade
para sobrepor um grande n&uacute;mero de reten&ccedil;&otilde;es n&atilde;o desejadas. Item de Configura&ccedil;&atilde;o:
APT::Ignore-Hold.
</DL>

<P>

<B>--with-new-pkgs</B>
<DL COMPACT><DT id="36"><DD>
Permite a instala&ccedil;&atilde;o de novos pacotes quando usado em conjunto com
upgrade. Isto &eacute; &uacute;til se a actualiza&ccedil;&atilde;o de um pacote instalado requerer que sejam instaladas novas depend&ecirc;ncias. Em vez de reter o pacote, o
upgradeir&aacute; actualizar o pacote e instalar as novas depend&ecirc;ncias. Note que
upgrade
com esta op&ccedil;&atilde;o nunca ir&aacute; remover pacotes, apenas permitir adicionar novos. Item de configura&ccedil;&atilde;o:
APT::Get::Upgrade-Allow-New.
</DL>

<P>

<B>--no-upgrade</B>
<DL COMPACT><DT id="37"><DD>
N&atilde;o actualiza pacotes; Quando usado em conjunto com
install, o
no-upgrade
ir&aacute; prevenir que pacotes sejam actualizados na linha de comandos se estes j&aacute; estiverem instalados. Item de Configura&ccedil;&atilde;o:
APT::Get::Upgrade.
</DL>

<P>

<B>--only-upgrade</B>
<DL COMPACT><DT id="38"><DD>
N&atilde;o instala pacotes novos; quando usado em conjunto com
install,
only-upgrade
ir&aacute; instalar apenas actualiza&ccedil;&otilde;es para pacotes j&aacute; instalados e ignorar pedidos para instalar novos pacotes. Item de Configura&ccedil;&atilde;o:
APT::Get::Only-Upgrade.
</DL>

<P>

<B>--allow-downgrades</B>
<DL COMPACT><DT id="39"><DD>
Esta &eacute; uma op&ccedil;&atilde;o perigosa que ir&aacute; fazer com que o apt continue sem avisar quando est&aacute; a instalar vers&otilde;es anteriores (downgrades) N&atilde;o deve ser usado excepto em situa&ccedil;&otilde;es muito especiais. Us&aacute;-lo pode potencialmente destruir o seu sistema! Item de Configura&ccedil;&atilde;o:
APT::Get::allow-downgrades. introduzido no APT 1.1.
</DL>

<P>

<B>--allow-remove-essential</B>
<DL COMPACT><DT id="40"><DD>
For&ccedil;a o sim; Esta &eacute; uma op&ccedil;&atilde;o perigosa que ir&aacute; fazer com que o apt continue sem avisar quando est&aacute; a remover coisas essenciais. N&atilde;o deve ser usado excepto em situa&ccedil;&otilde;es muito especiais. Us&aacute;-lo pode potencialmente destruir o seu sistema! Item de Configura&ccedil;&atilde;o:
APT::Get::allow-remove-essential. Introduzido no APT 1.1.
</DL>

<P>

<B>--allow-change-held-packages</B>
<DL COMPACT><DT id="41"><DD>
For&ccedil;a o sim; Esta &eacute; uma op&ccedil;&atilde;o perigosa que ir&aacute; fazer com que o apt continue sem avisar se estiver a alterar pacotes segurados. N&atilde;o deve ser usado excepto em situa&ccedil;&otilde;es muito especiais. Us&aacute;-lo pode destruir potencialmente o seu sistema! Item de Configura&ccedil;&atilde;o:
APT::Get::allow-change-held-packages. Introduzido em APT 1.1.
</DL>

<P>

<B>--force-yes</B>
<DL COMPACT><DT id="42"><DD>
For&ccedil;a o sim; Esta &eacute; uma op&ccedil;&atilde;o perigosa que ir&aacute; fazer com que o apt continue sem avisar quando est&aacute; a fazer algo potencialmente prejudicial. N&atilde;o deve ser usado excepto em situa&ccedil;&otilde;es muito especiais. Usar o
force-yes
pode destruir potencialmente o seu sistema! Item de Configura&ccedil;&atilde;o:
APT::Get::force-yes. Isto est&aacute; descontinuado e foi substitu&iacute;do por
<B>--allow-unauthenticated</B>
,
<B>--allow-downgrades</B>
,
<B>--allow-remove-essential</B>
,
<B>--allow-change-held-packages</B>
em 1.1.
</DL>

<P>

<B>--print-uris</B>
<DL COMPACT><DT id="43"><DD>
Ao inv&eacute;s de ir buscar os ficheiros para instalar, escreve os seus URIs. Cada URI ir&aacute; ter o caminho, o nome de ficheiro de destino, o tamanho e o hash MD5 esperado. Note que o nome de ficheiro a escrever nem sempre ir&aacute; condizer com o nome do ficheiro no site remoto! Isto tamb&eacute;m funciona com os comandos
source
e
update. Quando usado com o comando
update
o MD5 e o tamanho n&atilde;o s&atilde;o inclu&iacute;dos, e cabe ao utilizador descomprimir quaisquer ficheiros comprimidos. Item de Configura&ccedil;&atilde;o:
APT::Get::Print-URIs.
</DL>

<P>

<B>--purge</B>
<DL COMPACT><DT id="44"><DD>
Usa purgar em vez de remo&ccedil;&atilde;o para tudo o que seja removido. Um asterisco (&quot;*&quot;) ser&aacute; mostrado junto dos pacotes que est&atilde;o agendados para serem purgados.
<B>remove --purge</B>
&eacute; equivalente ao comando
<B>purge</B>. Item de Configura&ccedil;&atilde;o:
APT::Get::Purge.
</DL>

<P>

<B>--reinstall</B>
<DL COMPACT><DT id="45"><DD>
Re-instala pacotes que j&aacute; est&atilde;o instalados e na vers&atilde;o mais recente. Item de Configura&ccedil;&atilde;o:
APT::Get::ReInstall.
</DL>

<P>

<B>--list-cleanup</B>
<DL COMPACT><DT id="46"><DD>
Esta op&ccedil;&atilde;o est&aacute; ligada por predefini&ccedil;&atilde;o; use
--no-list-cleanup
para a desligar. Quando ligada o
<B>apt-get</B>
ir&aacute; gerir automaticamente os conte&uacute;dos de
/var/lib/apt/lists
para assegurar que os ficheiros obsoletos s&atilde;o apagados. A &uacute;nica raz&atilde;o para desligar isto &eacute; no caso de voc&ecirc; alterar frequentemente a sua lista de fontes. Item de Configura&ccedil;&atilde;o:
APT::Get::List-Cleanup.
</DL>

<P>

<B>-t</B>, <B>--target-release</B>, <B>--default-release</B>
<DL COMPACT><DT id="47"><DD>
Esta op&ccedil;&atilde;o controla a entrada predefinida para o motor de pol&iacute;ticas, cria um pin predefinido na prioridade 990 usando a string de lan&ccedil;amento especificada. Isto sobrep&otilde;e as defini&ccedil;&otilde;es gerais em
/etc/apt/preferences. Os pacotes com pin espec&iacute;fico n&atilde;o s&atilde;o afectados pelo valor desta op&ccedil;&atilde;o. Em resumo, esta op&ccedil;&atilde;o permite-lhe ter controlo simples sobre de qual distribui&ccedil;&atilde;o os pacotes ser&atilde;o obtidos. Alguns exemplos comuns podem ser
<B>-t '2.1*'</B>,
<B>-t unstable</B>
ou
<B>-t sid</B>. Item de Configura&ccedil;&atilde;o:
APT::Default-Release; veja tamb&eacute;m o manual
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
</DL>

<P>

<B>--trivial-only</B>
<DL COMPACT><DT id="48"><DD>
Apenas executa opera&ccedil;&otilde;es 'triviais'. Na l&oacute;gica isto pode ser considerado relacionado ao
<B>--assume-yes</B>, onde
<B>--assume-yes</B>
ir&aacute; responder 'sim' a todos os avisos,
<B>--trivial-only</B>
ir&aacute; responder 'n&atilde;o'. Item de Configura&ccedil;&atilde;o:
APT::Get::Trivial-Only.
</DL>

<P>

<B>--no-remove</B>
<DL COMPACT><DT id="49"><DD>
Se quaisquer pacotes estiverem para ser removidos, o apt-get aborta imediatamente sem aviso. Item de Configura&ccedil;&atilde;o:
APT::Get::Remove.
</DL>

<P>

<B>--auto-remove</B>, <B>--autoremove</B>
<DL COMPACT><DT id="50"><DD>
Se o comando for
install
ou
remove, ent&atilde;o esta op&ccedil;&atilde;o age como se corresse o comando
autoremove, removendo os pacotes de depend&ecirc;ncias n&atilde;o utilizados. Item de Configura&ccedil;&atilde;o:
APT::Get::AutomaticRemove.
</DL>

<P>

<B>--only-source</B>
<DL COMPACT><DT id="51"><DD>
Apenas tem significado para os comandos
source
e
build-dep. Indica que os nomes de fontes fornecidos n&atilde;o s&atilde;o para serem mapeados atrav&eacute;s da tabela de bin&aacute;rios. Isto quer dizer que se esta op&ccedil;&atilde;o for especificada, estes comandos apenas ir&atilde;o aceitar nomes de pacotes fonte como argumentos, em vez de aceitarem nomes de pacotes bin&aacute;rios e procurar o pacote fonte correspondente. Item de Configura&ccedil;&atilde;o:
APT::Get::Only-Source.
</DL>

<P>

<B>--diff-only</B>, <B>--dsc-only</B>, <B>--tar-only</B>
<DL COMPACT><DT id="52"><DD>
Descarrega apenas o ficheiro diff, dsc, ou tar de um pacote fonte. Item de Configura&ccedil;&atilde;o:
APT::Get::Diff-Only,
APT::Get::Dsc-Only, e
APT::Get::Tar-Only.
</DL>

<P>

<B>--arch-only</B>
<DL COMPACT><DT id="53"><DD>
Apenas processa depend&ecirc;ncias de compila&ccedil;&atilde;o dependentes da arquitectura. Item de Configura&ccedil;&atilde;o:
APT::Get::Arch-Only.
</DL>

<P>

<B>--indep-only</B>
<DL COMPACT><DT id="54"><DD>
Apenas processa depend&ecirc;ncias de compila&ccedil;&atilde;o independentes da arquitectura. Item de Configura&ccedil;&atilde;o:
APT::Get::Indep-Only.
</DL>

<P>

<B>--allow-unauthenticated</B>
<DL COMPACT><DT id="55"><DD>
Ignora se os pacotes n&atilde;o podem autenticados e n&atilde;o avisa acerca disso. Isto pode ser &uacute;til enquanto se trabalha com reposit&oacute;rios locais, mas &eacute; um enorme risco de seguran&ccedil;a se a autenticidade dos dados n&atilde;o poder ser assegurada de outro modo pelo pr&oacute;prio utilizador. A utiliza&ccedil;&atilde;o da op&ccedil;&atilde;o
<B>Trusted</B>
para entradas da
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
deve normalmente ser preferida em vez desta sobreposi&ccedil;&atilde;o global. Item de configura&ccedil;&atilde;o:
APT::Get::AllowUnauthenticated.
</DL>

<P>

<B>--no-allow-insecure-repositories</B>
<DL COMPACT><DT id="56"><DD>
Pro&iacute;be o comando de actualiza&ccedil;&atilde;o de adquirir dados n&atilde;o verific&aacute;veis a partir de fontes configuradas O APT ir&aacute; falhar no comando de actualiza&ccedil;&atilde;o para reposit&oacute;rios sem assinaturas criptograficamente v&aacute;lidas. Veja tamb&eacute;m
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
para detalhes no conceito e nas implica&ccedil;&otilde;es. Item de Configura&ccedil;&atilde;o:
Acquire::AllowInsecureRepositories.
</DL>

<P>

<B>--allow-releaseinfo-change</B>
<DL COMPACT><DT id="57"><DD>
Permite ao comando update continuar a descarregar dados de um reposit&oacute;rio que alterou a sua informa&ccedil;&atilde;o do lan&ccedil;amento contido no reposit&oacute;rio indicando, por exemplo, um novo lan&ccedil;amento superior. O APT ir&aacute; falhar no comando update para tal reposit&oacute;rio at&eacute; que a altera&ccedil;&atilde;o seja confirmada para assegurar que o utilizador est&aacute; preparado para a altera&ccedil;&atilde;o. Veja tamb&eacute;m
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
para detalhes no conceito e configura&ccedil;&atilde;o.
<P>
Op&ccedil;&otilde;es especialistas (--allow-releaseinfo-change-<I>field</I>) existem para permitir altera&ccedil;&otilde;es apenas para certos campos como
origin,
label,
codename,
suite,
version
e
defaultpin. Veja tamb&eacute;m
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5). Item de Configura&ccedil;&atilde;o:
Acquire::AllowReleaseInfoChange.
</DL>

<P>

<B>--show-progress</B>
<DL COMPACT><DT id="58"><DD>
Mostra informa&ccedil;&atilde;o de progresso compreens&iacute;vel para o utilizador na janela de terminal quando os pacotes s&atilde;o instalados, actualizados ou removidos. Para uma vers&atilde;o &quot;analis&aacute;vel por m&aacute;quina&quot; destes dados veja o README.progress-reporting no direct&oacute;rio doc do apt. Itens de Configura&ccedil;&atilde;o:
Dpkg::Progress
e
Dpkg::Progress-Fancy.
</DL>

<P>

<B>--with-source</B> <B></B><I>nome_do_ficheiro</I>
<DL COMPACT><DT id="59"><DD>
Adiciona o ficheiro fornecido como uma fonte para meta-dados. Pode ser repetido para adicionar v&aacute;rios ficheiros. Veja a descri&ccedil;&atilde;o de
<B>--with-source</B>
em
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
para mais detalhes.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="60"><DD>
Mostra um sum&aacute;rio curto da utiliza&ccedil;&atilde;o.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="61"><DD>
Mostra a vers&atilde;o do programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="62"><DD>
Ficheiro de Configura&ccedil;&atilde;o; Especifica o ficheiro de configura&ccedil;&atilde;o a usar. O programa ir&aacute; ler o ficheiro de configura&ccedil;&atilde;o predefinido e depois este ficheiro de configura&ccedil;&atilde;o. Se as defini&ccedil;&otilde;es de configura&ccedil;&atilde;o precisarem de ser definidas antes, os ficheiros de configura&ccedil;&atilde;o predefinidos s&atilde;o analisados especificando um ficheiro com a vari&aacute;vel de ambiente
<B>APT_CONFIG</B>. Veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informa&ccedil;&atilde;o de sintaxe.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="63"><DD>
Define uma Op&ccedil;&atilde;o de Configura&ccedil;&atilde;o; Isto ir&aacute; definir uma op&ccedil;&atilde;o de configura&ccedil;&atilde;o arbitr&aacute;ria. A sintaxe &eacute;
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
e
<B>--option</B>
podem ser usadas v&aacute;rias vezes para definir op&ccedil;&otilde;es diferentes.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="64"><DD>
Localiza&ccedil;&otilde;es de onde obter pacotes. Item de Configura&ccedil;&atilde;o:
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="65"><DD>
Ficheiros fragmentados para localiza&ccedil;&otilde;es de onde obter pacotes. Item de Configura&ccedil;&atilde;o:
Dir::Etc::SourceParts.
</DL>

<P>

/etc/apt/apt.conf
<DL COMPACT><DT id="66"><DD>
Ficheiro de configura&ccedil;&atilde;o do APT. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Main.
</DL>

<P>

/etc/apt/apt.conf.d/
<DL COMPACT><DT id="67"><DD>
Ficheiros de configura&ccedil;&atilde;o fragmentados do APT. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Parts.
</DL>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="68"><DD>
Ficheiro de prefer&ecirc;ncias de vers&atilde;o. Isto &eacute; onde voc&ecirc; deve especificar &quot;pinning&quot;, isto &eacute;, uma prefer&ecirc;ncia para obter certos pacotes A partir de uma fonte separada ou a partir duma vers&atilde;o diferente de uma distribui&ccedil;&atilde;o. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="69"><DD>
Ficheiros fragmentados para as prefer&ecirc;ncias de vers&atilde;o. Item de Configura&ccedil;&atilde;o:
Dir::Etc::PreferencesParts.
</DL>

<P>

/var/cache/apt/archives/
<DL COMPACT><DT id="70"><DD>
&Aacute;rea de armazenamento para ficheiros de pacotes obtidos. Item de Configura&ccedil;&atilde;o:
Dir::Cache::Archives.
</DL>

<P>

/var/cache/apt/archives/partial/
<DL COMPACT><DT id="71"><DD>
&Aacute;rea de armazenamento para ficheiros de pacotes em curso. Item de Configura&ccedil;&atilde;o:
Dir::Cache::Archives
ser&aacute; implicitamente acrescentado (partial)
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="72"><DD>
&Aacute;rea de armazenamento para informa&ccedil;&atilde;o de estado para cada recurso de pacote especificado em
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
Tem de Configura&ccedil;&atilde;o:
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="73"><DD>
&Aacute;rea de armazenamento para informa&ccedil;&atilde;o de estado em tr&acirc;nsito. Item de Configura&ccedil;&atilde;o:
Dir::State::Lists
ser&aacute; implicitamente acrescentado (partial)
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8), O guia de utilizadores do The APT em /usr/share/doc/apt-doc/,
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5), o Howto do APT.
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt-get</B>
devolve zero na opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAI">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="74"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="75"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="76"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="77"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="78"><A HREF="#lbAB">NOME</A><DD>
<DT id="79"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="80"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="81"><A HREF="#lbAE">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="82"><A HREF="#lbAF">FICHEIROS</A><DD>
<DT id="83"><A HREF="#lbAG">VEJA TAMB&Eacute;M</A><DD>
<DT id="84"><A HREF="#lbAH">DIAGN&Oacute;STICO</A><DD>
<DT id="85"><A HREF="#lbAI">BUGS</A><DD>
<DT id="86"><A HREF="#lbAJ">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="87"><A HREF="#lbAK">AUTORES</A><DD>
<DT id="88"><A HREF="#lbAL">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
