
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-KEY</TITLE>
</HEAD><BODY>
<H1>APT-KEY</H1>
Section: APT (8)<BR>Updated: 04&nbsp;Abril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-key - Utilit&aacute;rio de gest&atilde;o de chaves do APT
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-key</B> [<B>--keyring&nbsp;</B><B></B><I>nome_do_ficheiro</I>] {add&nbsp;<I>nome_do_ficheiro</I> | del&nbsp;<I>id_de_chave</I> | export&nbsp;<I>id_de_chave</I> | exportall | list | finger | adv | update | net-update | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<B>apt-key</B>
&eacute; usado para gerir uma lista de chaves usadas pelo apt para autenticar pacotes. Os pacotes que foram autenticados com estas chaves ser&atilde;o considerados de confian&ccedil;a.
<P>

<DD>Note que se a utiliza&ccedil;&atilde;o do
<B>apt-key</B>
for desejada, &eacute; necess&aacute;ria a instala&ccedil;&atilde;o adicional da suite GNU Privacy Guard (empacotada no
gnupg). Apenas por esta raz&atilde;o a utiliza&ccedil;&atilde;o program&aacute;tica &eacute; fortemente desencorajada (especialmente no pacote maintainerscripts!). Mais ainda o formato de sa&iacute;da de todos os comandos n&atilde;o est&aacute; definido e pode alterar (e altera mesmo) sempre que os comandos subjacentes mudam. O
<B>apt-key</B>
ir&aacute; tentar detectar tal utiliza&ccedil;&atilde;o e gerar avisos no stderr nestes casos.
<A NAME="lbAE">&nbsp;</A>
<H2>FICHEIROS DE CHAVEIRO SUPORTADOS</H2>

<P>

O apt-key suporta apenas o formato bin&aacute;rio OpenPGP (tamb&eacute;m conhecido como &quot;GPG key public ring&quot;) em ficheiros com a extens&atilde;o &quot;gpg&quot;, n&atilde;o o formato de base de dados keybox introduzido em novas vers&otilde;es
<B><A HREF="/cgi-bin/man/man2html?1+gpg">gpg</A></B>(1)
como predefini&ccedil;&atilde;o para ficheiros de chaveiro. Os ficheiros chaveiro bin&aacute;rios que se destinam a ser usados com qualquer vers&atilde;o do apt devem por isto ser sempre criados com
<B>gpg --export</B>.
<P>

Como alternativa, se todos os sistemas que devem estar a usar o chaveiro criado t&ecirc;m pelo menos a vers&atilde;o de apt &gt;= 1.4 instalada, voc&ecirc; pode usar o formato blindado de ASCII com a extens&atilde;o &quot;asc&quot; em substitui&ccedil;&atilde;o o qual pode ser criado com
<B>gpg --armor --export</B>.
<A NAME="lbAF">&nbsp;</A>
<H2>COMANDOS</H2>

<P>

<B>add</B> <B></B><I>nome_do_ficheiro</I>
<DL COMPACT><DT id="2"><DD>
Adiciona uma chave nova &agrave; lista de chaves de confian&ccedil;a. A chave &eacute; lida a partir do nome de ficheiro dado com o par&acirc;metro
<I>nome_do_ficheiro</I>
ou se o nome do ficheiro for
-
a partir da entrada standard.
<P>
&Eacute; cr&iacute;tico que as chaves adicionadas manualmente via
<B>apt-key</B>
sejam verificadas que pertencem ao dono dos reposit&oacute;rios que elas afirmam ser, caso contr&aacute;rio a infraestrutura
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
fica completamente indeterminada.
<P>
<I>Note</I>: Em vez de se usar este comando, deve-se colocar um chaveiro directamente no direct&oacute;rio
/etc/apt/trusted.gpg.d/
com um nome descritivo e com &quot;gpg&quot; ou &quot;asc&quot; como extens&atilde;o de ficheiro.
</DL>

<P>

<B>del</B> <B></B><I>id_de_chave</I>
<DL COMPACT><DT id="3"><DD>
Remove uma chave da lista de chaves de confian&ccedil;a.
</DL>

<P>

<B>export</B> <B></B><I>id_de_chave</I>
<DL COMPACT><DT id="4"><DD>
Escreve o
<I>id_de_chave</I>
da chave na sa&iacute;da standard.
</DL>

<P>

<B>exportall</B>
<DL COMPACT><DT id="5"><DD>
Escreve todas as chaves de confian&ccedil;a na sa&iacute;da standard.
</DL>

<P>

<B>list</B>, <B>finger</B>
<DL COMPACT><DT id="6"><DD>
Lista as chaves de confian&ccedil;a com impress&otilde;es digitais.
</DL>

<P>

<B>adv</B>
<DL COMPACT><DT id="7"><DD>
Passa op&ccedil;&otilde;es avan&ccedil;adas ao gpg. Com
<B>adv --recv-key</B>
voc&ecirc; pode por exemplo descarregar uma chave de servidores de chaves directamente para o conjunto de chaves de confian&ccedil;a. Note que
<I>n&atilde;o</I>
s&atilde;o feitas verifica&ccedil;&otilde;es, portanto &eacute; f&aacute;cil enfraquecer completamente a infraestrutura
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
se for usado sem cuidado.
</DL>

<P>

<B>update</B> (descontinuado)
<DL COMPACT><DT id="8"><DD>
Actualiza o chaveiro local com o chaveiro do arquivo e remove do chaveiro local as chaves de arquivo que j&aacute; n&atilde;o s&atilde;o v&aacute;lidas. O chaveiro do arquivo &eacute; submetido no pacote
archive-keyring
da sua distribui&ccedil;&atilde;o, por exemplo o pacote
ubuntu-keyring
em Ubuntu.
<P>
Note que uma distribui&ccedil;&atilde;o n&atilde;o precisa e de facto nem deve usar mais este comando e em vez disso empacotar ficheiros chaveiro no direct&oacute;rio
/etc/apt/trusted.gpg.d
directamente pois isto evita uma depend&ecirc;ncia no
gnupg
e &eacute; mais f&aacute;cil gerir as chaves ao simplesmente adicionar e remover ficheiros para respons&aacute;veis e utilizadores de modo semelhante.
</DL>

<P>

<B>net-update</B>
<DL COMPACT><DT id="9"><DD>
Executa uma actualiza&ccedil;&atilde;o que funciona de modo semelhante ao comando
<B>update</B>
em cima, mas obt&eacute;m o chaveiro do arquivo a partir de um URI e valida-o com uma chave mestra. Isto requer um
<B><A HREF="/cgi-bin/man/man2html?1+wget">wget</A></B>(1)
instalado e uma compila&ccedil;&atilde;o de APT configurada para ter um servidor de onde obter e um chaveiro mestre para valida&ccedil;&atilde;o. O APT em Debian n&atilde;o suporta este comando, confiando em vez disso no
<B>update</B>, mas o APT do Ubuntu f&aacute;-lo.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Note que as op&ccedil;&otilde;es precisam ser definidas antes dos comandos descritos na sec&ccedil;&atilde;o pr&eacute;via.
<P>

<B>--keyring</B> <B></B><I>nome_do_ficheiro</I>
<DL COMPACT><DT id="10"><DD>
Com esta op&ccedil;&atilde;o &eacute; poss&iacute;vel especificar um ficheiro de chaveiro espec&iacute;fico com o qual o comando deve operar. A predefini&ccedil;&atilde;o &eacute; que um comando &eacute; executado no ficheiro
trusted.gpg
assim como em todas as partes do direct&oacute;rio
trusted.gpg.d, assim
trusted.gpg
&eacute; o chaveiro principal o que significa que, por exemplo, as novas chaves s&atilde;o adicionadas a este.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/etc/apt/trusted.gpg
<DL COMPACT><DT id="11"><DD>
Chaveiro de chaves de confian&ccedil;a locais, as novas chaves ser&atilde;o adicionadas aqui. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Trusted.
</DL>

<P>

/etc/apt/trusted.gpg.d/
<DL COMPACT><DT id="12"><DD>
Fragmentos de ficheiro para as chaves de confian&ccedil;a, chaveiros adicionais podem ser armazenados aqui (por outros pacotes ou pelo administrador). Item de Configura&ccedil;&atilde;o
Dir::Etc::TrustedParts.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
<A NAME="lbAJ">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>AUTOR</H2>

<P>

APT foi escrito pela equipa do APT
&lt;<A HREF="mailto:apt@packages.debian.org">apt@packages.debian.org</A>&gt;.
<A NAME="lbAL">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAM">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="13"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="14"><DD>
</DL>

<A NAME="lbAN">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="15"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="16"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="17"><A HREF="#lbAB">NOME</A><DD>
<DT id="18"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="19"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="20"><A HREF="#lbAE">FICHEIROS DE CHAVEIRO SUPORTADOS</A><DD>
<DT id="21"><A HREF="#lbAF">COMANDOS</A><DD>
<DT id="22"><A HREF="#lbAG">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="23"><A HREF="#lbAH">FICHEIROS</A><DD>
<DT id="24"><A HREF="#lbAI">VEJA TAMB&Eacute;M</A><DD>
<DT id="25"><A HREF="#lbAJ">BUGS</A><DD>
<DT id="26"><A HREF="#lbAK">AUTOR</A><DD>
<DT id="27"><A HREF="#lbAL">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="28"><A HREF="#lbAM">AUTORES</A><DD>
<DT id="29"><A HREF="#lbAN">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
