
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT</TITLE>
</HEAD><BODY>
<H1>APT</H1>
Section: APT (8)<BR>Updated: 05&nbsp;Abril&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt - interface de linha de comandos
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt</B> [<B>-h</B>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>ficheiro_de_configura&ccedil;&atilde;o</I>] [<B>-t=</B><B></B><I>lan&ccedil;amento-alvo</I>] [<B>-a=</B><B></B><I>arquitectura</I>] {list | search | show | update | install&nbsp;<I>pkg</I>&nbsp;[{=<I>n&uacute;mero_de_vers&atilde;o_do_pacote</I>&nbsp;|&nbsp;/<I>lan&ccedil;amento-alvo</I>}]...  | remove&nbsp;<I>pkg</I>...  | upgrade | full-upgrade | edit-sources | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<DD>O
<B>apt</B>
disponibiliza uma interface de linha de comandos de alto n&iacute;vel para o sistema de gest&atilde;o de pacotes. Destina-se a ser uma interface para utilizador final e disp&otilde;e algumas op&ccedil;&otilde;es mais apropriadas para utiliza&ccedil;&atilde;o interactiva por predefini&ccedil;&atilde;o em compara&ccedil;&atilde;o com ferramentas especializadas do APT como o
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
e o
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8).
<P>

Muito como o pr&oacute;prio
<B>apt</B>, o seu manual destina-se a ser uma interface de utilizador final e como tal apenas menciona os comandos mais usados e parte das op&ccedil;&otilde;es para n&atilde;o duplicar informa&ccedil;&atilde;o em m&uacute;ltiplos locais e em parte para evitar saturar os leitores com uma cornuc&oacute;pia de op&ccedil;&otilde;es e detalhes.
<P>

<B>update</B> apt-get
<DL COMPACT><DT id="2"><DD>
<B>update</B>
&eacute; usado para descarregar informa&ccedil;&atilde;o de pacotes de todas as fontes configuradas. Outros comandos operam com estes dados para , por ex, executar actualiza&ccedil;&otilde;es de pacotes ou procurar e mostrar detalhes acerta de todos os pacotes dispon&iacute;veis para instala&ccedil;&atilde;o.
</DL>

<P>

<B>upgrade</B> apt-get
<DL COMPACT><DT id="3"><DD>
upgrade
&eacute; usado para instalar actualiza&ccedil;&otilde;es dispon&iacute;veis de todos os pacotes actualmente instalados no sistema a partir das fontes configuradas via
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). Se necess&aacute;rio para satisfazer depend&ecirc;ncias ser&atilde;o instalados novos pacotes, mas pacotes existentes nunca ser&atilde;o removidos. Se a actualiza&ccedil;&atilde;o de um pacote necessitar da remo&ccedil;&atilde;o de um pacote instalado, a actualiza&ccedil;&atilde;o deste pacote n&atilde;o ser&aacute; executada.
</DL>

<P>

<B>full-upgrade</B> apt-get
<DL COMPACT><DT id="4"><DD>
full-upgrade
executa a fun&ccedil;&atilde;o de upgrade mas ir&aacute; remover pacotes actualmente instalados se tal for necess&aacute;rio para actualizar o sistema como um todo.
</DL>

<P>

<B>install</B>, <B>reinstall</B>, <B>remove</B>, <B>purge</B> apt-get
<DL COMPACT><DT id="5"><DD>
Executa a ac&ccedil;&atilde;o requisitada em um ou mais pacotes especificados via
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7),
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
ou por correspond&ecirc;ncia exacta. A ac&ccedil;&atilde;o requisitada pode ser sobreposta para pacotes espec&iacute;ficos ao acrescentar um mais (+) ao nome do pacote para instalar esse pacote ou um menos (-) para o remover.
<P>
Pode ser seleccionada para instala&ccedil;&atilde;o uma vers&atilde;o espec&iacute;fica de um pacote ao adicionar ao nome do pacote o s&iacute;mbolo igual (=) e a vers&atilde;o do pacote a seleccionar. Alternativamente a vers&atilde;o de um lan&ccedil;amento espec&iacute;fico pode ser seleccionada ao adicionar ao nome do pacote uma barra de divis&atilde;o (/) e o nome de c&oacute;digo (buster, bullseye, sid ...) ou o nome de suite (stable, testing, unstable). Isto ir&aacute; tamb&eacute;m seleccionar vers&otilde;es a partir deste lan&ccedil;amento para as depend&ecirc;ncias deste pacote se necess&aacute;rio para satisfazer o pedido.
<P>
Remover um pacote remove todos os dados empacotados, mas deixa ficar ficheiros (modificados) de configura&ccedil;&atilde;o do utilizador geralmente pequenos, para o caso da remo&ccedil;&atilde;o ter sido um acidente. Apenas fazer um pedido de instala&ccedil;&atilde;o para o pacote removido acidentalmente ir&aacute; restaurar a sua fun&ccedil;&atilde;o como estava anteriormente. Por outro lado voc&ecirc; pode ver-se livre desses restos ao chamar
<B>purge</B>
mesmo em pacotes j&aacute; removidos. Note que isto n&atilde;o afecta nenhuns dados ou configura&ccedil;&otilde;es armazenados no seu direct&oacute;rio home pessoal.
</DL>

<P>

<B>autoremove</B> apt-get
<DL COMPACT><DT id="6"><DD>
autoremove
&eacute; usado para remover pacotes que foram instalados automaticamente para satisfazer depend&ecirc;ncias de outros pacotes e que j&aacute; n&atilde;o s&atilde;o necess&aacute;rios porque as depend&ecirc;ncias alteraram ou porque os pacotes que precisavam delas foram entretanto removidos.
<P>
Voc&ecirc; deve verificar que a lista n&atilde;o inclua aplica&ccedil;&otilde;es de que passou a gostar apesar de terem sido instaladas apenas como uma depend&ecirc;ncia de outro pacote. Voc&ecirc; pode marcar tal pacote como instalado manualmente ao usar
<B><A HREF="/cgi-bin/man/man2html?8+apt-mark">apt-mark</A></B>(8). Os pacotes que voc&ecirc; instalou explicitamente via comando
<B>install</B>
tamb&eacute;m nunca s&atilde;o propostos para remo&ccedil;&atilde;o autom&aacute;tica.
</DL>

<P>

<B>satisfy</B> apt-get
<DL COMPACT><DT id="7"><DD>
<B>satisfy</B>
satisfies dependency strings, as used in Build-Depends. It also handles conflicts, by prefixing an argument with
&quot;Conflicts: &quot;.
<P>
Example:
apt satisfy &quot;foo, bar (&gt;= 1.0)&quot; &quot;Conflicts: baz, fuzz&quot;
</DL>

<P>

<B>search</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8))
<DL COMPACT><DT id="8"><DD>
<B>search</B>
pode ser usado para procurar por termo(s)
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7)
fornecidos na lista de pacotes dispon&iacute;veis e apresentar correspond&ecirc;ncias. Isto pode, por exemplo, ser &uacute;til se procura pacotes com uma caracter&iacute;stica espec&iacute;fica. Se est&aacute; &agrave; procura de um pacote que inclua um ficheiro espec&iacute;fico tente o
<B><A HREF="/cgi-bin/man/man2html?1+apt-file">apt-file</A></B>(1).
</DL>

<P>

<B>show</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8))
<DL COMPACT><DT id="9"><DD>
Mostra informa&ccedil;&atilde;o acerca do(s) pacote(s) indicados incluindo as suas depend&ecirc;ncias, tamanho de instala&ccedil;&atilde;o e de download, fontes a partir das quais o pacote est&aacute; dispon&iacute;vel, a descri&ccedil;&atilde;o do conte&uacute;do dos pacotes e muito mais. Pode, por exemplo, ser &uacute;til para ver esta informa&ccedil;&atilde;o antes de permitir ao
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
remover um pacote ou enquanto procura por novos pacotes para instalar.
</DL>

<P>

<B>list</B>
<DL COMPACT><DT id="10"><DD>
<B>list</B>
&eacute; de certa maneira semelhante a
<B>dpkg-query --list</B>
pois pode mostrar uma lista de pacotes que satisfa&ccedil;am certos crit&eacute;rios. Suporta padr&otilde;es
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
para coincidir com nomes de pacotes assim como op&ccedil;&otilde;es para listar instalados (<B>--installed</B>), actualiz&aacute;veis (<B>--upgradeable</B>) ou todas as vers&otilde;es dispon&iacute;veis (<B>--all-versions</B>).
</DL>

<P>

<B>edit-sources</B> (work-in-progress)
<DL COMPACT><DT id="11"><DD>
edit-sources
permite-lhe editar os seus ficheiros
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
no seu editor de texto preferido enquanto tamb&eacute;m disponibiliza verifica&ccedil;&otilde;es b&aacute;sicas aos mesmos.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>UTILIZA&Ccedil;&Atilde;O DE SCRIPTS E DIFEREN&Ccedil;AS COM OUTRAS FERRAMENTAS DO APT</H2>

<P>

A linha de comandos do
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
foi desenhada como ferramenta de utilizador final e pode variar o comportamento entre vers&otilde;es. Apesar de tentar n&atilde;o perder a compatibilidade com vers&otilde;es anteriores isto n&atilde;o &eacute; garantido se uma altera&ccedil;&atilde;o parecer ben&eacute;fica para uso interactivo.
<P>

Todas as funcionalidades do
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
est&atilde;o tamb&eacute;m dispon&iacute;veis em ferramentas dedicadas ao APT como
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
e
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8). O
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
apenas varia o valor predefinido de algumas op&ccedil;&otilde;es (veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
e especialmente o &acirc;mbito Bin&aacute;rio). Portanto voc&ecirc; dever&aacute; preferir usar estes comandos (potencialmente com algumas op&ccedil;&otilde;es adicionais activas) nos seus scripts pois eles mant&ecirc;m compatibilidade com vers&otilde;es anteriores sempre que poss&iacute;vel.
<A NAME="lbAF">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8), O guia de utilizadores do The APT em /usr/share/doc/apt-doc/,
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5), o Howto do APT.
<A NAME="lbAG">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt</B>
devolve zero na opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAH">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAI">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAJ">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="12"><DD>
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="13"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NOME</A><DD>
<DT id="16"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="17"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="18"><A HREF="#lbAE">UTILIZA&Ccedil;&Atilde;O DE SCRIPTS E DIFEREN&Ccedil;AS COM OUTRAS FERRAMENTAS DO APT</A><DD>
<DT id="19"><A HREF="#lbAF">VEJA TAMB&Eacute;M</A><DD>
<DT id="20"><A HREF="#lbAG">DIAGN&Oacute;STICO</A><DD>
<DT id="21"><A HREF="#lbAH">BUGS</A><DD>
<DT id="22"><A HREF="#lbAI">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="23"><A HREF="#lbAJ">AUTOR</A><DD>
<DT id="24"><A HREF="#lbAK">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
