
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-split</TITLE>
</HEAD><BODY>
<H1>dpkg-split</H1>
Section: użytki dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NAZWA</H2>

dpkg-split - narzędzie dzielenia/&#x142;ączenia pakiet&oacute;w Debiana
<A NAME="lbAC">&nbsp;</A>
<H2>SK&#x141;ADNIA</H2>

<B>dpkg-split</B> [<I>opcja</I>...] <I>polecenie</I>
<A NAME="lbAD">&nbsp;</A>
<H2>OPIS</H2>

<B>dpkg-split</B> dzieli pakiety binarne Debiana na mniejsze części oraz scala
je z powrotem, tak że możliwe jest przechowanie większych pakiet&oacute;w na ma&#x142;ych
nośnikach, takich jak dyskietki.
<P>
Program wywo&#x142;uje się ręcznie, wraz z opcją <B>--split</B>, <B>--join</B> lub
<B>--info</B>.
<P>
Możliwe jest także wywo&#x142;anie automatyczne, przez użycie opcji
<B>--auto</B>. Wtedy to tworzona jest kolejka części pakietu, a gdy wszystkie
części będą dostępne, ca&#x142;y pakiet zostanie odtworzony. Opcje <B>--listq</B> i
<B>--discard</B> pozwalają na zarządzanie kolejką.
<P>
Wszystkie dzia&#x142;ania, takie jak rozdzielanie, &#x142;ączenie, czy kolejkowanie,
powodują wyświetlenie informacji na standardowe wyjście. Informacje te można
zignorowa'c.
<A NAME="lbAE">&nbsp;</A>
<H2>POLECENIA</H2>

<DL COMPACT>
<DT id="1"><B>-s</B>, <B>--split</B> <I>kompletne-archiwum</I> [<I>przedrostek</I>]<DD>
Rozdzielenie pojedynczego pakietu binarnego na poszczeg&oacute;lne części.
<P>
Części mają nazwę <I>przyrostek</I><B>.</B><I>N</I><B>of</B><I>M</I><B>.deb</B> gdzie <I>N</I> jest
numerem części, rozpoczynając od 1, a <I>M</I> jest liczbą wszystkich części
(dziesiętnie).
<P>
Jeśli nie podano <I>przedrostka</I>, to użyta jest nazwa pliku
<I>pe&#x142;nego-archiwum</I>, wraz z katalogiem, gdy jest określony. Ponadto usunięta
jest końc&oacute;wka <B>.deb</B>.
<DT id="2"><B>-j</B>, <B>--join</B> <I>part</I>...<DD>
&#x141;ączenie części pakietu i odtworzenie oryginalnego pliku sprzed dzielenia.
<P>
Pliki podane jako argumenty muszą by'c częściami tego samego oryginalnego
pakietu. Każda częś'c musi pojawi'c się raz na liście argument&oacute;w, ale nie jest
konieczne zachowanie w&#x142;aściwej kolejności.
<P>
Części muszą by'c wygenerowane z użyciem tego samego rozmiaru, co oznacza, że
muszą to by'c te same części utworzone za pomocą polecenia <B>dpkg-split
--split</B>.
<P>
Nazwy plik&oacute;w części nie mają znaczenia dla procesu odtworzenia pakietu.
<P>
Domyślnie, plik wynikowy ma nazwę
<I>pakiet</I><B>_</B><I>wersja</I><B>_</B><I>architektura</I><B>.deb</B>.
<P>
<DT id="3"><B>-I</B>, <B>--info</B> <I>part</I>...<DD>
Wyświetlanie informacji, podanych w formacie czytelnym dla cz&#x142;owieka, o
częściach pakietu. Argumenty, kt&oacute;re nie są częścią pakietu, powodują
wyświetlenie informacji o tym fakcie na standardowym wyjściu.
<DT id="4"><B>-a</B>, <B>--auto -o</B> <I>pe&#x142;ne-archiwum częś'c</I><DD>
Automatyczne kolejkowanie części i odtworzenie pakietu, gdy to jest możliwe.
<P>
Podana <I>częś'c</I> zostaje sprawdzona i por&oacute;wnana z innymi częściami tego
samego pakietu, kt&oacute;re znajdują się w kolejce.
<P>
Jeśli wszystkie części pakietu są już dostępne, pakiet jest odtwarzany i
zapisywany do <I>pe&#x142;nego-archiwum</I>.
<P>
Jeśli jeszcze nie ma wszystkich części, podana <I>częś'c</I> jest kopiowana do
kolejki i <I>pe&#x142;ne-archiwum</I> nie jest odtwarzane.
<P>
Jeśli plik <I>częś'c</I> nie jest częścią pakietu binarnego, <B>dpkg-split</B>
zakończy się i zwr&oacute;ci kod b&#x142;ędu <B>1</B>, albo kod b&#x142;ędu <B>2</B> w przypadku
wystąpienia innych problem&oacute;w.
<P>
Opcja <B>--output</B> lub <B>-o</B> musi zosta'c podana w przypadku użycia
<B>--auto</B>. (W przeciwnym razie program nie wiedzia&#x142;by, jakiego spodziewa'c
się pliku wyjściowego.)
<DT id="5"><B>-l</B>, <B>--listq</B><DD>
Listowanie zawartości kolejki części pakietu do odtworzenia.
<P>
Dla każdego pliku części pakietu wyświetlana jest nazwa pakietu, częś'c w
kolejce, ca&#x142;kowita liczba bajt&oacute;w przechowywanych w kolejce.
<DT id="6"><B>-d</B>, <B>--discard</B> [<I>pakiet</I>...]<DD>
Usuwa części pakietu z kolejki.
<P>
Jeśli nie podano nazwy <I>pakietu</I>, czyszczona jest ca&#x142;a kolejka. Gdy nazwa
jest podana, usuwane są tylko części podanego pakietu.
<DT id="7"><B>-?</B>, <B>--help</B><DD>
Wyświetla informację o użytkowaniu i kończy dzia&#x142;anie.
<DT id="8"><B>--version</B><DD>
Wyświetla informację o wersji i pomyślnie kończy dzia&#x142;anie.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPCJE</H2>

<DL COMPACT>
<DT id="9"><B>--depotdir</B><I> katalog</I><DD>
Określenie alternatywnego katalogu dla kolejki części pakiet&oacute;w do
zrekonstruowania. Domyślnym jest <B>/var/lib/dpkg</B>.
<DT id="10"><B>-S</B>, <B>--partsize</B> <I>kibibajty</I><DD>
Określenie maksymalnego rozmiaru części pakietu w kibibajtach (KiB, 1024
bajt&oacute;w). Wartością domyślną jest 450 KiB.
<DT id="11"><B>-o</B>, <B>--output</B> <I>pe&#x142;ne-archiwum</I><DD>
Określenie nazwy pliku pe&#x142;nego archiwum.
<P>
Ta opcja nadpisuje domyślną nazwę przy odtwarzaniu pakietu (<B>--join</B>) oraz
jest wymagana przy automatycznym odtwarzaniu pakietu (<B>--auto</B>).
<DT id="12"><B>-Q</B>, <B>--npquiet</B><DD>
Gdy wykonywane jest automatyczne &#x142;ączenie części pakietu, <B>dpkg-split</B>
zwykle wyświetla informacje o b&#x142;ędzie, gdy dany plik <I>części</I> nie jest
częścią pakietu. Ta opcja zapobiega wyświetlaniu nadmiernej ilości
informacji przez programy takie jak <B>dpkg</B>.
<DT id="13"><B>--msdos</B><DD>
Pliki generowane przez <B>--split</B> są zapisywane w formacie odczytywanym
przez MSDOS.
<P>
Zmieniany jest przedrostek, zar&oacute;wno ten domyślny jak i ten podany w
argumencie: litery są zamieniane na ma&#x142;e, znak plusa zamieniany jest na
<B>x</B>, a pozosta&#x142;e znaki są pomijane.
<P>
Powsta&#x142;y przedrostek jest ucinany do niezbędnego rozmiaru. Powsta&#x142;a nazwa ma
posta'c <I>przedrostekN</I><B>of</B><I>M</I><B>.deb..</B>
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>KOD WYJŚCIA</H2>

<DL COMPACT>
<DT id="14"><B>0</B><DD>
Żądana operacja dzielenia, &#x142;ączenia czy jakakolwiek inna, zakończy&#x142;a się
sukcesem. Polecenie <B>--info</B> kończy się sukcesem nawet gdy podany plik nie
jest częścią pakietu.
<DT id="15"><B>1</B><DD>
Występuje tylko, jeśli użyto <B>--auto</B> i oznacza, że plik <I>części</I> nie by&#x142;
częścią pakietu binarnego.
<DT id="16"><B>2</B><DD>
Fatal or unrecoverable error due to invalid command-line usage, a file that
looked like a package part file but was corrupted, or interactions with the
system, such as accesses to the database, memory allocations, etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ŚRODOWISKO</H2>

<DL COMPACT>
<DT id="17"><B>DPKG_COLORS</B><DD>
Sets the color mode (since dpkg 1.18.5).  The currently accepted values are:
<B>auto</B> (default), <B>always</B> and <B>never</B>.
<DT id="18"><B>SOURCE_DATE_EPOCH</B><DD>
If set, it will be used as the timestamp (as seconds since the epoch) in the
<B><A HREF="/cgi-bin/man/man2html?5+deb-split">deb-split</A></B>(5)'s <B><A HREF="/cgi-bin/man/man2html?5+ar">ar</A></B>(5) container.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>PLIKI</H2>

<DL COMPACT>
<DT id="19"><I>/var/lib/dpkg/parts</I><DD>
Domyślny katalog kolejki części pakiet&oacute;w czekających na automatyczne
odtworzenie.
<P>
Nazwy plik&oacute;w w tym katalogu są wewnętrznie utworzone przez <B>dpkg-split</B> i
nie są użyteczne dla innych program&oacute;w.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>B&#x141;ĘDY</H2>

Pobranie pe&#x142;nej informacji o pakietach w kolejce jest niemożliwe, bez
przeszukania katalogu kolejki.
<P>
Nie ma prostego testu na sprawdzenie, czy dany plik jest na pewno częścią
pakietu.
<A NAME="lbAK">&nbsp;</A>
<H2>ZOBACZ TAKŻE</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<A NAME="lbAL">&nbsp;</A>
<H2>T&#x141;UMACZE</H2>

Piotr Roszatycki &lt;<A HREF="mailto:dexter@debian.org">dexter@debian.org</A>&gt;, 1999
<BR>

Bartosz Feński &lt;<A HREF="mailto:fenio@debian.org">fenio@debian.org</A>&gt;, 2004-2005
<BR>

Robert Luberda &lt;<A HREF="mailto:robert@debian.org">robert@debian.org</A>&gt;, 2006-2008
<BR>

Wiktor Wandachowicz &lt;<A HREF="mailto:siryes@gmail.com">siryes@gmail.com</A>&gt;, 2008
<BR>

Micha&#x142; Ku&#x142;ach &lt;<A HREF="mailto:michal.kulach@gmail.com">michal.kulach@gmail.com</A>&gt;, 2012
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="20"><A HREF="#lbAB">NAZWA</A><DD>
<DT id="21"><A HREF="#lbAC">SK&#x141;ADNIA</A><DD>
<DT id="22"><A HREF="#lbAD">OPIS</A><DD>
<DT id="23"><A HREF="#lbAE">POLECENIA</A><DD>
<DT id="24"><A HREF="#lbAF">OPCJE</A><DD>
<DT id="25"><A HREF="#lbAG">KOD WYJŚCIA</A><DD>
<DT id="26"><A HREF="#lbAH">ŚRODOWISKO</A><DD>
<DT id="27"><A HREF="#lbAI">PLIKI</A><DD>
<DT id="28"><A HREF="#lbAJ">B&#x141;ĘDY</A><DD>
<DT id="29"><A HREF="#lbAK">ZOBACZ TAKŻE</A><DD>
<DT id="30"><A HREF="#lbAL">T&#x141;UMACZE</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:20 GMT, March 31, 2021
</BODY>
</HTML>
