
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of update-alternatives</TITLE>
</HEAD><BODY>
<H1>update-alternatives</H1>
Section: użytki dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NAZWA</H2>

update-alternatives - zarządzanie dowiązaniami symbolicznymi określającymi
domyślne polecenia
<A NAME="lbAC">&nbsp;</A>
<H2>SK&#x141;ADNIA</H2>

<B>update-alternatives</B> [<I>opcja</I>...] <I>polecenie</I>
<A NAME="lbAD">&nbsp;</A>
<H2>OPIS</H2>

<B>update-alternatives</B> tworzy, usuwa, wyświetla informacje o dowiązaniach
symbolicznych sk&#x142;adających się na system alternatyw Debiana oraz nimi
zarządza.
<P>

Kilka program&oacute;w mających tę samą lub podobną funkcjonalnoś'c może zosta'c
zainstalowanych w systemie w tym samym czasie. Na przyk&#x142;ad w wielu systemach
jest zainstalowanych jednocześnie kilka edytor&oacute;w tekstu. Stanowi to
u&#x142;atwienie dla użytkownik&oacute;w takiego systemu, z kt&oacute;rych każdy może uruchomi'c
inny edytor, jeśli ma na to ochotę. Z drugiej strony jest to jednak
utrudnienie dla program&oacute;w chcących podją'c w&#x142;aściwą decyzję, kt&oacute;ry edytor
uruchomi'c, jeżeli użytkownik nie określi&#x142; swoich preferencji co do edytora.
<P>

Celem systemu alternatyw Debiana jest rozwiązanie tego problemu. Og&oacute;lna
nazwa w systemie plik&oacute;w jest wsp&oacute;&#x142;dzielona przez wszystkie pliki
dostarczające zmieniającą się funkcjonalnoś'c. System alternatyw oraz
administrator systemu określają, do kt&oacute;rego obecnego pliku prowadzi ta
og&oacute;lna nazwa. Na przyk&#x142;ad, jeżeli zainstalowano zar&oacute;wno edytor <B><A HREF="/cgi-bin/man/man2html?1+ed">ed</A></B>(1) jak
i <B><A HREF="/cgi-bin/man/man2html?1+nvi">nvi</A></B>(1), to system alternatyw spowoduje, że nazwa og&oacute;lna
<I>/usr/bin/editor</I> będzie się odnosi'c do <I>/usr/bin/nvi</I>. Administrator
systemu może zmieni'c to ustawienie na <I>/usr/bin/ed</I>, a system alternatyw
tego nie zmieni, chyba że administrator każe mu tak zrobi'c.
<P>

Nazwa og&oacute;lna nie jest bezpośrednim dowiązaniem symbolicznym do wybranej
alternatywy, ale jest dowiązaniem do pliku w <I>katalogu</I> <I>alternatyw</I>,
kt&oacute;re z kolei jest dowiązaniem do w&#x142;aściwego pliku. Jest tak zrobione
dlatego, żeby zmiany wprowadzane przez administratora systemu by&#x142;y
ograniczone do katalogu <I>/etc</I>: standard FHS wymienia powody, aby tak
zrobi'c.
<P>

When each package providing a file with a particular functionality is
installed, changed or removed, <B>update-alternatives</B> is called to update
information about that file in the alternatives system.
<B>update-alternatives</B> is usually called from the <B>postinst</B> (configure) or
<B>prerm</B> (remove and deconfigure) scripts in Debian packages.
<P>

Często użyteczne jest, aby pewna liczba alternatyw by&#x142;a zsynchronizowana,
tak żeby by&#x142;a zmieniana jako grupa. Na przyk&#x142;ad jeżeli jest zainstalowane
kilka wersji edytora <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1), to strona podręcznika
<I>/usr/share/man/man1/vi.1</I> powinna odpowiada'c wersji programu
zainstalowanego jako <I>/usr/bin/vi</I>. <B>update-alternatives</B> obs&#x142;uguje to
przy pomocy dowiązań <I>g&#x142;&oacute;wnych</I> i <I>podrzędnych</I> - zmiana dowiązania
g&#x142;&oacute;wnego powoduje zmianę skojarzonych dowiązań podrzędnych. Dowiązanie
g&#x142;&oacute;wne i skojarzone z nim dowiązania podrzędne tworzą <I>grupę</I> <I>dowiązań</I>.
<P>

Każda grupa dowiązań jest zawsze w jednym z dw&oacute;ch tryb&oacute;w: automatycznym lub
ręcznym. W trybie automatycznym podczas instalacji lub usuwania pakietu
system alternatyw automatycznie zdecyduje, czy i jak aktualizowa'c
dowiązania. W trybie ręcznym system alternatyw nie będzie zmienia&#x142; dowiązań
i zostawi wszystkie decyzje administratorowi systemu.
<P>

Grupa dowiązań jest trybie automatycznym, kiedy jest po raz pierwszy
wprowadzana do systemu. Jeżeli administrator systemu wprowadzi zmiany do
automatycznych ustawień, będą one wzięte pod uwagę podczas następnego
uruchomienia <B>update-alternatives</B> na takiej zmienionej grupie dowiązań, a
grupa ta automatycznie przejdzie w tryb ręczny.
<P>

Z każdą alternatywą skojarzony jest <I>priorytet</I>. Jeżeli grupa dowiązań jest
w trybie automatycznym, to wybraną alternatywą będzie ta, kt&oacute;ra ma najwyższy
priorytet.
<P>

When using the <B>--config</B> option, <B>update-alternatives</B> will list all of
the choices for the link group of which given <I>name</I> is the master
alternative name.  The current choice is marked with a '*'.  You will then
be prompted for your choice regarding this link group.  Depending on the
choice made, the link group might no longer be in <I>auto</I> mode. You will
need to use the <B>--auto</B> option in order to return to the automatic mode
(or you can rerun <B>--config</B> and select the entry marked as automatic).
<P>

Aby skonfigurowa'c nieinteraktywnie, można uży'c opcji <B>--set</B> (patrz niżej).
<P>

R&oacute;żne pakiety dostarczające tych samych plik&oacute;w powinny <B>wsp&oacute;&#x142;pracowa'c</B> ze
sobą w tym zakresie. Oznacza to, że używanie programu <B>update-alternatives</B>
jest <B>obowiązkowe</B> dla wszystkich takich pakiet&oacute;w - nie jest możliwe
nadpisanie pewnych plik&oacute;w w pakiecie, kt&oacute;ry nie używa mechanizmu
<B>update-alternatives</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>TERMINOLOGIA</H2>

Ponieważ operacje programu <B>update-alternatives</B> są doś'c z&#x142;ożone, poniżej
podane są terminy, kt&oacute;re pomogą je zrozumie'c.
<DL COMPACT>
<DT id="1">nazwa og&oacute;lna (lub dowiązanie alternatywy)<DD>
Nazwa, taka jak <I>/usr/bin/editor</I>, kt&oacute;ra odnosi się przez system alternatyw
do jednego z kilku plik&oacute;w o podobnej funkcjonalności.
<DT id="2">nazwa alternatywy<DD>
Nazwa dowiązania symbolicznego w katalogu alternatyw.
<DT id="3">alternatywa (lub ścieżka alternatywy)<DD>
Nazwa określonego pliku w systemie plik&oacute;w, kt&oacute;ry w systemie alternatyw może
by'c dostępny przez nazwę og&oacute;lną.
<DT id="4">katalog alternatyw<DD>
Katalog zawierający dowiązania symboliczne, domyślnie
<I>/etc/alternatives</I>.
<DT id="5">katalog administracyjny<DD>
Katalog zawierający informacje o stanie <B>update-alternatives</B>, domyślnie
<I>/var/lib/dpkg/alternatives</I>.
<DT id="6">grupa dowiązań<DD>
Zbi&oacute;r powiązanych dowiązań symbolicznych, zarządzany jako grupa.
<DT id="7">dowiązanie g&#x142;&oacute;wne<DD>
Dowiązanie alternatywy w grupie dowiązań, kt&oacute;re określa spos&oacute;b
konfigurowania innych dowiązań z tej grupy.
<DT id="8">dowiązanie podrzędne<DD>
Dowiązanie alternatywy w grupie dowiązań, kt&oacute;re jest kontrolowane przez
ustawienie g&#x142;&oacute;wnego dowiązania.
<DT id="9">tryb automatyczny<DD>
Kiedy grupa dowiązań jest w trybie automatycznym, system alternatyw zapewni,
że dowiązania z tej grupy wskazują na alternatywę o najwyższym priorytecie.
<DT id="10">tryb ręczny<DD>
Kiedy grupa dowiązań jest w trybie ręcznym, system alternatyw nic nie zmieni
w ustawieniach wprowadzonych przez administratora systemu.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>POLECENIA</H2>

<DL COMPACT>
<DT id="11"><B>--install</B> <I>dowiązanie nazwa ścieżka priorytet</I> [<B>--slave</B> <I>dowiązanie nazwa ścieżka</I>]...<DD>
Dodaje grupę alternatyw do systemu. <I>dowiązanie</I> jest og&oacute;lną nazwą g&#x142;&oacute;wnego
dowiązania, <I>nazwa</I> jest nazwą dowiązania symbolicznego w katalogu
alternatyw, a <I>ścieżka</I> jest wprowadzaną alternatywą dla g&#x142;&oacute;wnego
dowiązania. Argumentami opcji <B>--slave</B> są nazwa og&oacute;lna, nazwa dowiązania
symbolicznego w katalogu alternatyw i ścieżka alternatywy dla dowiązania
podrzędnego. Można poda'c zero lub więcej opcji <B>--slave</B>, po każdej muszą
następowa'c jej trzy argumenty. Należy zauważy'c, że g&#x142;&oacute;wna alternatywa musi
istnie'c, inaczej wywo&#x142;anie się nie powiedzie. Jednak jeśli nie będzie
istnie'c podrzędna alternatywa, odpowiednie dowiązanie podrzędne po prostu
nie zostanie zainstalowane (ale nadal będzie wyświetlane ostrzeżenie). Jeśli
w miejscu gdzie powinno by'c zainstalowane dowiązanie alternatywy istnieje
rzeczywisty plik, jest on zachowywany, chyba że użyta jest opcja <B>--force</B>.
<DT id="12"><DD>
Jeżeli określona nazwa alternatywy już istnieje w systemie alternatyw, to
podana informacja będzie dodana jako nowy zbi&oacute;r alternatyw dla tej grupy. W
przeciwnym wypadku zostanie utworzona nowa grupa, ustawiona w tryb
automatyczny. Jeżeli grupa jest w trybie automatycznym, a priorytet nowo
dodawanych alternatyw jest większy od priorytetu każdej z innych
zainstalowanych alternatyw w tej grupie, to dowiązania symboliczne będą
zaktualizowane tak, żeby prowadzi&#x142;y do nowo dodanych alternatyw.
<DT id="13"><B>--set</B> <I>nazwa ścieżka</I><DD>
Ustawia program <I>ścieżka</I> jako alternatywę dla <I>nazwy</I>. Jest to
nieinteraktywny, a więc możliwy do użycia w skryptach, odpowiednik opcji
<B>--config</B>.
<DT id="14"><B>--remove</B> <I>nazwa ścieżka</I><DD>
Usuwa alternatywę i wszystkie dowiązania podrzędne z nią
skojarzone. <I>nazwa</I> jest nazwą w katalogu alternatyw, <I>ścieżka</I> jest
absolutną nazwą pliku, do kt&oacute;rej <I>nazwa</I> mog&#x142;aby by'c dowiązaniem. Jeżeli
<I>nazwa</I> rzeczywiście jest dowiązaniem do <I>ścieżki</I>, to <I>nazwa</I> zostanie
zaktualizowana, tak żeby wskazywa&#x142;a na inną odpowiednią alternatywę (zaś
grupa jest ustawiana ponownie w tryb automatyczny), albo zostanie usunięta
jeżeli nie pozostanie ani jedna alternatywa. Skojarzone dowiązania podrzędne
zostaną odpowiednio zaktualizowane lub usunięte. Jeżeli dowiązanie nie
prowadzi obecnie do <I>ścieżki</I>, to żadne dowiązania nie będą aktualizowane;
zostanie tylko usunięta informacja o alternatywie.
<DT id="15"><B>--remove-all</B> <I>nazwa</I><DD>
Usuwa wszystkie dowiązania alternatyw i wszystkie skojarzone z nimi
dowiązania podrzędne. <I>nazwa</I> jest nazwą w katalogu alternatyw.
<DT id="16"><B>--all</B><DD>
Wywo&#x142;uje <B>--config</B> dla wszystkich alternatyw. Można to użytecznie po&#x142;ączy'c
z <B>--skip-auto</B> aby przejrze'c i skonfigurowa'c wszystkie alternatywy, kt&oacute;re
nie są skonfigurowane w tryb automatyczny. Wyświetlane są r&oacute;wnież
nieaktualne alternatywy. Dlatego prostym sposobem naprawienia uszkodzonych
alternatyw jest wywo&#x142;anie <B>yes '' | update-alternatives --force --all</B>.
<DT id="17"><B>--auto</B> <I>nazwa</I><DD>
Prze&#x142;ącza grupę dowiązań dla alternatywy w tryb automatyczny. Podczas tego
procesu, g&#x142;&oacute;wne dowiązanie wraz z jego dowiązaniami podrzędnymi będą
zaktualizowane tak, aby wskazywa'c na alternatywę o najwyższym priorytecie.
<DT id="18"><B>--display</B> <I>nazwa</I><DD>
Display information about the link group.  Information displayed includes
the group's mode (auto or manual), the master and slave links, which
alternative the master link currently points to, what other alternatives are
available (and their corresponding slave alternatives), and the highest
priority alternative currently installed.
<DT id="19"><B>--get-selections</B><DD>
List all master alternative names (those controlling a link group)  and
their status (since version 1.15.0).  Each line contains up to 3 fields
(separated by one or more spaces). The first field is the alternative name,
the second one is the status (either <B>auto</B> or <B>manual</B>), and the last one
contains the current choice in the alternative (beware: it's a filename and
thus might contain spaces).
<DT id="20"><B>--set-selections</B><DD>
Read configuration of alternatives on standard input in the format generated
by <B>--get-selections</B> and reconfigure them accordingly (since version
1.15.0).
<DT id="21"><B>--query</B> <I>nazwa</I><DD>
Display information about the link group like <B>--display</B> does, but in a
machine parseable way (since version 1.15.0, see section <B>QUERY FORMAT</B>
below).
<DT id="22"><B>--list</B> <I>nazwa</I><DD>
Wyświetla wszystkie cele w grupie dowiązań.
<DT id="23"><B>--config</B> <I>nazwa</I><DD>
Wyświetla dostępne alternatywy w grupie dowiązań i pozwala użytkownikowi
interaktywnie wybra'c, kt&oacute;rej należy uży'c. Grupa dowiązań zostanie
odpowiednio zaktualizowana.
<DT id="24"><B>--help</B><DD>
Wyświetla informację o użytkowaniu i kończy dzia&#x142;anie.
<DT id="25"><B>--version</B><DD>
Wyświetla informację o wersji i pomyślnie kończy dzia&#x142;anie.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>OPCJE</H2>

<DL COMPACT>
<DT id="26"><B>--altdir</B><I> katalog</I><DD>
Określa katalog alternatyw, jeżeli ma by'c inny niż domyślny.
<DT id="27"><B>--admindir</B><I> katalog</I><DD>
Określa katalog administracyjny, jeżeli ma by'c inny niż domyślny.
<DT id="28"><B>--log</B><I> plik</I><DD>
Specifies the log file (since version 1.15.0), when this is to be different
from the default (/var/log/alternatives.log).
<DT id="29"><B>--force</B><DD>
Allow replacing or dropping any real file that is installed where an
alternative link has to be installed or removed.
<DT id="30"><B>--skip-auto</B><DD>
Pomija pytania o konfigurację alternatyw, kt&oacute;re są w&#x142;aściwie skonfigurowane
w trybie automatycznym. Ta opcja ma znaczenie tylko przy <B>--config</B> lub
<B>--all</B>.
<DT id="31"><B>--quiet</B><DD>
Do not generate any comments unless errors occur.
<DT id="32"><B>--verbose</B><DD>
Generate more comments about what is being done.
<DT id="33"><B>--debug</B><DD>
Generate even more comments, helpful for debugging, about what is being done
(since version 1.19.3).
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>KOD WYJŚCIA</H2>

<DL COMPACT>
<DT id="34"><B>0</B><DD>
Akcja zakończy&#x142;a się powodzeniem.
<DT id="35"><B>2</B><DD>
Wystąpi&#x142;y problemy podczas przetwarzania linii poleceń lub wykonywania
akcji.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>ŚRODOWISKO</H2>

<DL COMPACT>
<DT id="36"><B>DPKG_ADMINDIR</B><DD>
Jeśli ustawione oraz nie podano opcji <B>--admindir</B>, to będzie użyte jako
bazowy katalog administracyjny.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>PLIKI</H2>

<DL COMPACT>
<DT id="37"><I>/etc/alternatives/</I><DD>
Domyślny katalog alternatyw. Można go zmieni'c opcją <B>-altdir</B>.
<DT id="38"><I>/var/lib/dpkg/alternatives/</I><DD>
Domyślny katalog administracyjny. Można go zmieni'c opcją <B>-admindir</B>.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>FORMAT ZAPYTANIA</H2>

The <B>--query</B> format is using an RFC822-like flat format. It's made of <I>n</I>
+ 1 blocks where <I>n</I> is the number of alternatives available in the queried
link group. The first block contains the following fields:
<DL COMPACT>
<DT id="39"><B>Name:</B><I> nazwa</I><DD>
Nazwa alternatywy w katalogu alternatyw.
<DT id="40"><B>Link:</B><I> dowiązanie</I><DD>
Nazwa og&oacute;lna alternatywy.
<DT id="41"><B>Slaves:</B><I> lista-alternatyw-podrzędnych</I><DD>
Gdy to pole jest obecne, <B>następne</B> wiersze zawierają wszystkie podrzędne
dowiązania związane z g&#x142;&oacute;wnym dowiązaniem alternatywy. W każdym wierszu
podana jest jedna podrzędna alternatywa. Każdy wiersz zawiera jedną spację,
og&oacute;lną nazwę alternatywy podrzędnej, kolejną spację i w końcu ścieżkę do
dowiązania podrzędnego.
<DT id="42"><B>Status:</B><I> status</I><DD>
Status alternatywy (<B>auto</B> lub <B>manual</B>).
<DT id="43"><B>Best:</B><I> najlepszy wyb&oacute;r</I><DD>
Ścieżka najlepszej alternatywy dla tej grupy dowiązań. Nie jest wyświetlana,
jeśli nie ma dostępnych żadnych alternatyw.
<DT id="44"><B>Value:</B><I> aktualnie wybrana alternatywa</I><DD>
Ścieżka aktualnie wybranej alternatywy. Może r&oacute;wnież przyjmowa'c specjalną
wartoś'c <B>none</B> - jest ona używana jeśli dowiązanie nie istnieje.
</DL>
<P>

Inne bloki opisują dostępne alternatywy w grupie dowiązań, do kt&oacute;rej odnosi
się zapytanie:
<DL COMPACT>
<DT id="45"><B>Alternative:</B><I> ścieżka-alternatywy</I><DD>
Ścieżka do alternatywy opisywanej w tym bloku.
<DT id="46"><B>Priority:</B><I> wartoś'c-priorytetu</I><DD>
Wartoś'c priorytetu alternatywy.
<DT id="47"><B>Slaves:</B><I> lista-alternatyw-podrzędnych</I><DD>
When this field is present, the <B>next</B> lines hold all slave alternatives
associated to the master link of the alternative. There is one slave per
line. Each line contains one space, the generic name of the slave
alternative, another space, and the path to the slave alternative.
</DL>
<A NAME="lbAL">&nbsp;</A>
<H3>Example</H3>

<PRE>
$ update-alternatives --query editor
Name: editor
Link: /usr/bin/editor
Slaves:
 editor.1.gz /usr/share/man/man1/editor.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/editor.1.gz
 editor.it.1.gz /usr/share/man/it/man1/editor.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/editor.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/editor.1.gz
Status: auto
Best: /usr/bin/vim.basic
Value: /usr/bin/vim.basic

Alternative: /bin/ed
Priority: -100
Slaves:
 editor.1.gz /usr/share/man/man1/ed.1.gz

Alternative: /usr/bin/vim.basic
Priority: 50
Slaves:
 editor.1.gz /usr/share/man/man1/vim.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/vim.1.gz
 editor.it.1.gz /usr/share/man/it/man1/vim.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/vim.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/vim.1.gz
</PRE>

<A NAME="lbAM">&nbsp;</A>
<H2>DIAGNOSTYKA</H2>

Po podaniu <B>--verbose</B>, <B>update-alternatives</B> wypisuje nieustannie
informacje o podejmowanych dzia&#x142;aniach na swoim standardowym wyjściu. Jeżeli
wystąpi b&#x142;ąd, <B>update-alternatives</B> wyświetla komunikaty b&#x142;ęd&oacute;w na
standardowym wyjściu b&#x142;ęd&oacute;w i kończy dzia&#x142;anie z kodem wyjścia 2. Wypisywana
diagnostyka powinna wszystko wyjaśnia'c, jeżeli tak nie jest, proszę zg&#x142;osi'c
to jako b&#x142;ąd.
<A NAME="lbAN">&nbsp;</A>
<H2>PRZYK&#x141;ADY</H2>

Istnieje klika pakiet&oacute;w, kt&oacute;re dostarczają edytora tekstu kompatybilnego z
edytorem <B>vi</B>, na przyk&#x142;ad <B>nvi</B> i <B>vim</B>. To, kt&oacute;ry pakiet będzie
używany, kontrolowane jest przez grupę dowiązań <B>vi</B>, zawierającą
dowiązania do samego programu i odpowiadających mu stron podręcznika.
<P>

Aby wyświetli'c listę dostępnych pakiet&oacute;w, kt&oacute;re dostarczają <B>vi</B> oraz jego
bieżące ustawienie, należy uży'c akcji <B>--display</B>:
<P>

<DL COMPACT><DT id="48"><DD>
<B>update-alternatives --display vi</B>
</DL>

<P>

Aby wybra'c określoną implementację edytora <B>vi</B>, należy uży'c tego polecenia
jako użytkownik root i wybra'c liczbę z listy:
<P>

<DL COMPACT><DT id="49"><DD>
<B>update-alternatives --config vi</B>
</DL>

<P>

Aby przywr&oacute;ci'c automatyczne wybieranie implementacji programu <B>vi</B>, należy
jako użytkownik root wykona'c:
<P>

<DL COMPACT><DT id="50"><DD>
<B>update-alternatives --auto vi</B>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>ZOBACZ TAKŻE</H2>

<B><A HREF="/cgi-bin/man/man2html?1+ln">ln</A></B>(1), FHS - standard hierarchii systemu plik&oacute;w.
<A NAME="lbAP">&nbsp;</A>
<H2>T&#x141;UMACZE</H2>

Piotr Roszatycki &lt;<A HREF="mailto:dexter@debian.org">dexter@debian.org</A>&gt;, 1999
<BR>

Bartosz Feński &lt;<A HREF="mailto:fenio@debian.org">fenio@debian.org</A>&gt;, 2004-2005
<BR>

Robert Luberda &lt;<A HREF="mailto:robert@debian.org">robert@debian.org</A>&gt;, 2006-2008
<BR>

Wiktor Wandachowicz &lt;<A HREF="mailto:siryes@gmail.com">siryes@gmail.com</A>&gt;, 2008
<BR>

Micha&#x142; Ku&#x142;ach &lt;<A HREF="mailto:michal.kulach@gmail.com">michal.kulach@gmail.com</A>&gt;, 2012
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="51"><A HREF="#lbAB">NAZWA</A><DD>
<DT id="52"><A HREF="#lbAC">SK&#x141;ADNIA</A><DD>
<DT id="53"><A HREF="#lbAD">OPIS</A><DD>
<DT id="54"><A HREF="#lbAE">TERMINOLOGIA</A><DD>
<DT id="55"><A HREF="#lbAF">POLECENIA</A><DD>
<DT id="56"><A HREF="#lbAG">OPCJE</A><DD>
<DT id="57"><A HREF="#lbAH">KOD WYJŚCIA</A><DD>
<DT id="58"><A HREF="#lbAI">ŚRODOWISKO</A><DD>
<DT id="59"><A HREF="#lbAJ">PLIKI</A><DD>
<DT id="60"><A HREF="#lbAK">FORMAT ZAPYTANIA</A><DD>
<DL>
<DT id="61"><A HREF="#lbAL">Example</A><DD>
</DL>
<DT id="62"><A HREF="#lbAM">DIAGNOSTYKA</A><DD>
<DT id="63"><A HREF="#lbAN">PRZYK&#x141;ADY</A><DD>
<DT id="64"><A HREF="#lbAO">ZOBACZ TAKŻE</A><DD>
<DT id="65"><A HREF="#lbAP">T&#x141;UMACZE</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:20 GMT, March 31, 2021
</BODY>
</HTML>
