
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-GET</TITLE>
</HEAD><BODY>
<H1>APT-GET</H1>
Section: APT (8)<BR>Updated: 15&nbsp;Januar&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-get - APT-Werkzeug f&uuml;r den Umgang mit Paketen -- Befehlszeilenschnittstelle
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<DL COMPACT>
<DT id="1">
<B>apt-get</B> [<B>-asqdyfmubV</B>] [<B>-o=</B><B></B><I>Konfigurationszeichenkette</I>] [<B>-c=</B><B></B><I>Konfigurationsdatei</I>] [<B>-t=</B><B></B><I>Ziel-Release</I>] [<B>-a=</B><B></B><I>Architektur</I>] {update | upgrade | dselect-upgrade | dist-upgrade | install&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | remove&nbsp;<I>Paket</I>...  | purge&nbsp;<I>Paket</I>...  | source&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | build-dep&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | download&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | check | clean | autoclean | autoremove | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

<B>apt-get</B>
<DD>ist ein Befehlszeilenwerkzeug zur Handhabung von Paketen und k&ouml;nnte als &raquo;Backend&laquo; anderer Werkzeuge betrachtet werden, die die APT-Bibliothek benutzen. Es existieren mehrere &raquo;Oberfl&auml;chenschnittstellen&laquo;, wie
<B><A HREF="/cgi-bin/man/man2html?8+aptitude">aptitude</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+synaptic">synaptic</A></B>(8)
und
<B><A HREF="/cgi-bin/man/man2html?1+wajig">wajig</A></B>(1).
<P>

Sofern nicht die
<B>-h</B>-, oder
<B>--help</B>-Option angegeben ist, muss einer der nachfolgend aufgef&uuml;hrten Befehle vorkommen.
<P>

<B>update</B>
<DL COMPACT><DT id="2"><DD>
update
wird benutzt, um die Paketindexdatei wieder mit ihren Quellen zu synchronisieren. Die Indexe verf&uuml;gbarer Pakete werden von den in
/etc/apt/sources.list
angegebenen Orten geladen. Wenn Sie zum Beispiel ein Debian-Archiv benutzen, ruft dieser Befehl die
Packages.gz-Dateien ab und wertet sie aus, so dass Informationen &uuml;ber neue und aktualisierte Pakete verf&uuml;gbar sind. Ein
update
sollte immer vor einem
upgrade
oder
dist-upgrade
ausgef&uuml;hrt werden. Bitte seien Sie sich bewusst, dass die Gesamtfortschrittsanzeige nicht richtig sein wird, da die Gr&ouml;&szlig;e der Pakete nicht im voraus bekannt ist.
</DL>

<P>

<B>upgrade</B>
<DL COMPACT><DT id="3"><DD>
upgrade
wird benutzt, um die neusten Versionen aller aktuell auf dem System installierten Pakete aus den in
/etc/apt/sources.list
aufgez&auml;hlten Quellen zu installieren. Aktuell installierte Pakete mit verf&uuml;gbaren neuen Versionen werden abgerufen und das Upgrade durchgef&uuml;hrt. Unter keinen Umst&auml;nden werden derzeit installierte Pakete entfernt oder nicht installierte Pakete heruntergeladen und installiert. Neue Versionen von aktuell installierten Paketen von denen kein Upgrade durchgef&uuml;hrt werden kann, ohne den Installationsstatus eines anderen Paketes zu &auml;ndern, werden in ihrer aktuellen Version bleiben. Zuerst muss ein
update
durchgef&uuml;hrt werden, so dass
<B>apt-get</B>
die neuen Versionen der verf&uuml;gbaren Pakete kennt.
</DL>

<P>

<B>dist-upgrade</B>
<DL COMPACT><DT id="4"><DD>
dist-upgrade
enth&auml;lt zus&auml;tzlich zu der Funktion von
upgrade
einen intelligenten Mechanismus zur Aufl&ouml;sung von ge&auml;nderten Paketabh&auml;ngigkeiten in den neuen Paketversionen.
<B>apt-get</B>
hat ein &raquo;intelligentes&laquo; Konfliktaufl&ouml;sungssystem und es wird versuchen, Upgrades der wichtigsten Pakete, wenn n&ouml;tig zu Lasten der weniger wichtigen, durchzuf&uuml;hren. Aufgrunddessen k&ouml;nnte der
dist-upgrade-Befehl einige Pakete entfernen. Die
/etc/apt/sources.list-Datei enth&auml;lt eine Liste von Orten, von denen gew&uuml;nschte Paketdateien abgerufen werden. Siehe auch
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)
f&uuml;r einen Mechanismus zum Au&szlig;erkraftsetzen der allgemeinen Einstellungen f&uuml;r einzelne Pakete.
</DL>

<P>

<B>dselect-upgrade</B>
<DL COMPACT><DT id="5"><DD>
dselect-upgrade
wird zusammen mit der traditionellen Debian-Oberfl&auml;che
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
benutzt.
dselect-upgrade
folgt den durch
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
am
Status-Feld verf&uuml;gbarer Pakete gemachten &Auml;nderungen und f&uuml;hrt die notwendigen Aktionen durch, um diesen Status zu realisieren (zum Beispiel das Entfernen von alten und Installieren von neuen Paketen).
</DL>

<P>

<B>install</B>
<DL COMPACT><DT id="6"><DD>
Auf
install
folgen ein oder mehrere Pakete, f&uuml;r die eine Installation oder ein Upgrade gew&uuml;nscht wird. Jedes Paket ist ein Paketname, kein vollst&auml;ndig zusammengesetzter Dateiname (zum Beispiel w&auml;re in einem Debian-System
apt-utils
das anzugebende Argument, nicht
apt-utils_2.0.4_amd64.deb). Alle Pakete, die von den zur Installation angegebenen Paketen ben&ouml;tigt werden, werden zus&auml;tzlich heruntergeladen und installiert. Die Datei
/etc/apt/sources.list
wird benutzt, um die gew&uuml;nschten Pakete zu finden. Wenn ein Bindestrich an den Paketnamen (ohne Leerzeichen dazwischen) angeh&auml;ngt ist, wird das erkannte Pakete entfernt, falls es installiert ist. &Auml;hnlich kann ein Pluszeichen benutzt werden, um ein Paket zum Installieren vorzumerken. Diese letzteren Funktionen k&ouml;nnen benutzt werden, um Entscheidungen au&szlig;er Kraft zu setzen, die vom Konfliktaufl&ouml;sungssystem von apt-get getroffen wurden.
<P>
Eine bestimmte Version eines Paketes kann durch den Paketnamen gefolgt von einem Gleichheitszeichen und der Version des Paketes zur Installation ausgew&auml;hlt werden. Dies bewirkt, dass diese Version gesucht und zum Installieren ausgew&auml;hlt wird. Alternativ kann eine bestimmte Distribution durch den Paketnamen gefolgt von einem Schr&auml;gstrich und der Version der Distribution oder des Archivnamens (&raquo;stable&laquo;, &raquo;testing&laquo;, &raquo;unstable&laquo;) ausgew&auml;hlt werden.
<P>
Beide Mechanismen der Versionsauswahl k&ouml;nnen ein Downgrade von Paketen ausl&ouml;sen und m&uuml;ssen mit Vorsicht gehandhabt werden.
<P>
Dies ist au&szlig;erdem das zu verwendende Ziel, wenn Sie ein Upgrade eines oder mehrerer bereits installierter Pakete durchf&uuml;hren m&ouml;chten, ohne ein Upgrade aller Pakete auf dem System durchzuf&uuml;hren. Anders als das Ziel &raquo;upgrade&laquo;, das die neusten Versionen aller aktuell installierten Pakete installiert, wird &raquo;install&laquo; nur die neusten Versionen der angegebenen Pakete installieren. Geben Sie einfach den Namen des Paketes an, von dem Sie ein Upgrade durchf&uuml;hren m&ouml;chten und wenn eine neuere Version verf&uuml;gbar ist, wird sie (mitsamt ihren Abh&auml;ngigkeiten, wie oben beschrieben) heruntergeladen und installiert.
<P>
Und zu guter Letzt erlaubt es Ihnen der
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)-Mechanismus, eine alternative Installationsrichtlinie f&uuml;r eigene Pakete zu erzeugen.
<P>
Wenn keine Pakete dem angegebenen Ausdruck entsprechen und der Ausdruck entweder &raquo;.&laquo;, &raquo;?&laquo; oder &raquo;*&laquo; enth&auml;lt, wird vermutet, dass es sich um einen regul&auml;ren POSIX-Ausdruck handelt und dieser wird auf alle Paketnamen in der Datenbank angewendet. Jeder Treffer wird dann installiert (oder entfernt). Beachten Sie, dass nach &uuml;bereinstimmenden Zeichenkettenteilen gesucht wird, so dass &raquo;lo.*&laquo; auf &raquo;how-lo&laquo; und &raquo;lowest&laquo; passt. Wenn dies nicht gew&uuml;nscht wird, h&auml;ngen Sie an den regul&auml;ren Ausdruck mit &raquo;^&laquo; oder &raquo;$&laquo; an, um einen genaueren regul&auml;ren Ausdruck zu erstellen.
<P>
In APT 2.0 ist ein R&uuml;ckgriff auf regul&auml;re Ausdr&uuml;cke missbilligt und wurde in
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
entfernt, au&szlig;er f&uuml;r verankerte Ausdr&uuml;cke. Es wird auch in einer zuk&uuml;nftigen Version von
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
entfernt. Nutzen Sie stattdessen
<B><A HREF="/cgi-bin/man/man2html?5+apt-patterns">apt-patterns</A></B>(5).
</DL>

<P>

<B>reinstall</B>
<DL COMPACT><DT id="7"><DD>
reinstall
ist ein Alias f&uuml;r
install --reinstall.
</DL>

<P>

<B>remove</B>
<DL COMPACT><DT id="8"><DD>
remove
ist identisch mit
install, mit dem Unterschied, dass Pakete entfernt anstatt installiert werden. Beachten Sie, dass das Entfernen von Paketen deren Konfigurationsdateien im System bel&auml;sst. Wenn ein Pluszeichen an den Paketnamen angeh&auml;ngt wird (ohne Leerzeichen dazwischen), wird das erkannte Paket installiert anstatt entfernt.
</DL>

<P>

<B>purge</B>
<DL COMPACT><DT id="9"><DD>
purge
entspricht
remove
mit dem Unterschied, dass Pakete entfernt und vollst&auml;ndig gel&ouml;scht werden (s&auml;mtliche Konfigurationsdateien werden ebenfalls gel&ouml;scht).
</DL>

<P>

<B>source</B>
<DL COMPACT><DT id="10"><DD>
source
veranlasst
<B>apt-get</B>
dazu, Paketquellen zu holen. APT wird die verf&uuml;gbaren Pakete &uuml;berpr&uuml;fen, um zu entscheiden, welche Paketquellen geholt werden. Es wird dann die neueste Version der Paketquelle finden und in das aktuelle Verzeichnis herunterladen. Dabei ber&uuml;cksichtigt es - falls m&ouml;glich - die Voreinstellung f&uuml;r die Version der Distribution, die &uuml;ber die Option
APT::Default-Release, die Option
<B>-t</B>
oder pro Paket mit der
Paket/Distribution-Syntax gesetzt wurde.
<P>
Die Argumente werden als Bin&auml;r- und Quellpaketnamen interpretiert. Falls Sie dies &auml;ndern m&ouml;chten, sehen Sie sich die Option
<B>--only-source</B>
an.
<P>
Paketquellen werden vom Bin&auml;rpaket getrennt &uuml;ber
deb-src-Zeilen in der
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Datei festgelegt. Das bedeutet, dass Sie f&uuml;r jedes Depot, aus dem Sie Quellen erhalten wollen, eine solche Zeile hinzuf&uuml;gen m&uuml;ssen; andernfalls werden Sie eventuell entweder die falschen Versionen (zu alte/zu neue) oder &uuml;berhaupt keine Quellpakete erhalten.
<P>
Falls die Option
<B>--compile</B>
angegeben ist, wird das Paket unter Benutzung von
<B>dpkg-buildpackage</B>
f&uuml;r die Architektur, die durch
<B>--host-architecture</B>
definiert ist, zu einem bin&auml;ren .deb kompiliert. Falls
<B>--download-only</B>
angegeben ist, wird das Quellpaket nicht entpackt.
<P>
Eine bestimmte Quellversion kann durch Anh&auml;ngen eines Gleichheitszeichens an den Paketnamen gefolgt von der Versionsnummer heruntergeladen werden, &auml;hnlich dem Mechanismus, der f&uuml;r die Bin&auml;rpakete benutzt wird. Dies erm&ouml;glicht exakte &Uuml;bereinstimmung von Quellpaketname und -version und impliziert das Aktivieren der
APT::Get::Only-Source-Option.
<P>
Beachten Sie, dass Quellpakete nicht wie normale Bin&auml;rpakete in der Datenbank von
<B>dpkg</B>
installiert und nachverfolgt werden; sie werden nur wie Quell-Tarball-Archive in das aktuelle Verzeichnis heruntergeladen.
</DL>

<P>

<B>build-dep</B>
<DL COMPACT><DT id="11"><DD>
build-dep
veranlasst apt-get, Pakete zu installieren/entfernen, um zu versuchen, die Bauabh&auml;ngigkeiten eines Quellpakets zu erf&uuml;llen. Standardm&auml;&szlig;ig werden die Abh&auml;ngigkeiten erf&uuml;llt, um das Paket auf native Art zu bauen. Falls gew&uuml;nscht, kann stattdessen eine Rechnerarchitektur mit der Option
<B>--host-architecture</B>
angegeben werden.
<P>
Die Argumente werden als Bin&auml;r- oder Quellpaketnamen interpretiert. Falls Sie dies &auml;ndern m&ouml;chten, sehen Sie sich die Option
<B>--only-source</B>
an.
</DL>

<P>

<B>satisfy</B>
<DL COMPACT><DT id="12"><DD>
satisfy
veranlasst apt-get, die angegebenen Abh&auml;ngigkeitszeichenketten zu erf&uuml;llen. Die Abh&auml;ngigkeitszeichenketten k&ouml;nnten Bauprofile und Architekturbeschr&auml;nkungslisten in ihren Bauabh&auml;ngigkeiten haben. Ihnen kann wahlweise
&quot;Conflicts: &quot;
vorangestellt sein, um die Abh&auml;ngigkeitszeichenkette nicht zu erf&uuml;llen. Es d&uuml;rfen mehrere Zeichenketten desselben Typs angegeben werden.
<P>
Beispiel:
apt-get satisfy &quot;foo&quot; &quot;Conflicts: bar&quot; &quot;baz (&gt;&gt; 1.0) | bar (= 2.0), moo&quot;
<P>
Der veraltete Operator &raquo;&lt;/&gt;&laquo; wird nicht unterst&uuml;tzt, benutzen Sie stattdessen &raquo;&lt;=/&gt;=&laquo;.
</DL>

<P>

<B>check</B>
<DL COMPACT><DT id="13"><DD>
check
ist ein Diagnosewerkzeug. Es aktualisiert den Paketzwischenspeicher und pr&uuml;ft, ob besch&auml;digte Abh&auml;ngigkeiten vorliegen.
</DL>

<P>

<B>download</B>
<DL COMPACT><DT id="14"><DD>
download
wird das angegebene Bin&auml;rpaket in das aktuelle Verzeichnis herunterladen.
</DL>

<P>

<B>clean</B>
<DL COMPACT><DT id="15"><DD>
clean
bereinigt das lokale Depot von heruntergeladenen Paketdateien. Es entfernt alles au&szlig;er der Sperrdatei aus
/var/cache/apt/archives/
und
/var/cache/apt/archives/partial/.
</DL>

<P>

<B>autoclean</B> (und der <B>auto-clean</B> Alias seit 1.1)
<DL COMPACT><DT id="16"><DD>
Wie
clean
bereinigt
autoclean
das lokale Depot von heruntergeladenen Paketdateien. Der Unterschied besteht darin, dass es nur Pakete entfernt, die nicht mehr heruntergeladen werden k&ouml;nnen und gr&ouml;&szlig;tenteils nutzlos sind. Dies erlaubt es, einen Zwischenspeicher &uuml;ber eine lange Zeitspanne zu betreiben, ohne dass er unkontrolliert anw&auml;chst. Die Konfigurationsoption
APT::Clean-Installed
wird installierte Pakete vor der L&ouml;schung bewahren, wenn sie auf &raquo;off&laquo; gesetzt ist.
</DL>

<P>

<B>autoremove</B> (und der <B>auto-remove</B> Alias seit 1.1)
<DL COMPACT><DT id="17"><DD>
autoremove
wird benutzt, um Pakete zu entfernen, die automatisch installiert wurden, um Abh&auml;ngigkeiten f&uuml;r andere Pakete zu erf&uuml;llen, und die nicht mehr ben&ouml;tigt werden.
</DL>

<P>

<B>changelog</B>
<DL COMPACT><DT id="18"><DD>
changelog
versucht, das Changelog eines Pakets herunterzuladen und mit
<B>sensible-pager</B>
anzuzeigen. Standardm&auml;&szlig;ig zeigt es das Changelog f&uuml;r die installierte Version. Sie k&ouml;nnen jedoch die gleichen Optionen wie f&uuml;r den Befehl
<B>install</B>
angeben.
</DL>

<P>

<B>indextargets</B>
<DL COMPACT><DT id="19"><DD>
zeigt standardm&auml;&szlig;ig ein Liste im Deb822-Format mit Informationen &uuml;ber alle Datendateien (auch als Indexziele bekannt) an, die
<B>apt-get update</B>
herunterladen w&uuml;rde. Es unterst&uuml;tzt eine
<B>--format</B>-Option, um das Ausgabeformat zu &auml;ndern und auch um Zeilen der Standardausgabe zum Filtern der Datens&auml;tze zu akzeptieren. Der Befehl wird haupts&auml;chlich als Schnittstelle f&uuml;r externe Werkzeuge benutzt, die mit APT arbeiten, um Informationen sowie Dateinamen f&uuml;r heruntergeladenen Dateien zu holen, um sie auch anstelle selbst heruntergeladener zu verwenden. Umfangreiche Dokumentation ist hier nicht enthalten, sondern stattdessen in der Datei
/usr/share/doc/apt-doc/acquire-additional-files.md.gz
im Paket
apt-doc
zu finden.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Alle Befehlszeilenoptionen k&ouml;nnen durch die Konfigurationsdatei gesetzt werden, die Beschreibung gibt die zu setzende Option an. F&uuml;r boolesche Optionen k&ouml;nnen Sie die Konfigurationsdatei au&szlig;er Kraft setzen, indem Sie etwas der Art
<B>-f-</B>,
<B>--no-f</B>,
<B>-f=no</B>
oder etliche weitere Varianten benutzen.
<P>

<B>--no-install-recommends</B>
<DL COMPACT><DT id="20"><DD>
betrachtet empfohlene Pakete nicht als Abh&auml;ngigkeit f&uuml;r die Installation. Konfigurationselement:
APT::Install-Recommends.
</DL>

<P>

<B>--install-suggests</B>
<DL COMPACT><DT id="21"><DD>
betrachtet vorgeschlagene Pakete als Abh&auml;ngigkeit f&uuml;r die Installation. Konfigurationselement:
APT::Install-Suggests.
</DL>

<P>

<B>-d</B>, <B>--download-only</B>
<DL COMPACT><DT id="22"><DD>
nur herunterladen; Paketdateien werden nur heruntergeladen, nicht entpackt oder installiert. Konfigurationselement:
APT::Get::Download-Only.
</DL>

<P>

<B>-f</B>, <B>--fix-broken</B>
<DL COMPACT><DT id="23"><DD>
Fehler beheben; versucht ein System von vorhandenen, besch&auml;digten Abh&auml;ngigkeiten zu befreien. Diese Option kann, wenn sie mit &raquo;install&laquo;/&raquo;remove&laquo; benutzt wird, einige Pakete weglassen, um es APT zu erlauben, eine wahrscheinliche L&ouml;sung herzuleiten. Falls Pakete angegeben wurden, m&uuml;ssen diese das Problem vollst&auml;ndig korrigieren. Die Option ist manchmal n&ouml;tig, wenn APT zum ersten Mal ausgef&uuml;hrt wird. APT selbst erlaubt es nicht, dass auf einem System besch&auml;digte Paketabh&auml;ngigkeiten existieren. Es ist m&ouml;glich, dass eine Abh&auml;ngigkeitsstruktur eines Systems so fehlerhaft ist, dass ein manuelles Eingreifen erforderlich ist (was normalerweise bedeutet, dass
<B>dpkg --remove</B>
benutzt wird, um einige der fehlerhaften Pakete zu beseitigen). Wenn Sie die Option zusammen mit
<B>-m</B>
benutzen, k&ouml;nnte das in einigen Situationen zu Fehlern f&uuml;hren. Konfigurationselement:
APT::Get::Fix-Broken.
</DL>

<P>

<B>-m</B>, <B>--ignore-missing</B>, <B>--fix-missing</B>
<DL COMPACT><DT id="24"><DD>
ignoriert fehlende Pakete; Wenn Pakete nicht heruntergeladen werden k&ouml;nnen oder die Integrit&auml;tspr&uuml;fung nach dem Herunterladen fehlschl&auml;gt (fehlerhafte Paketdateien), werden diese Pakete zur&uuml;ckgehalten und das Ergebnis verarbeitet. Die Benutzung dieser Option zusammen mit
<B>-f</B>
kann in einigen Situationen zu Fehlern f&uuml;hren. Wenn ein Paket zur Installation ausgew&auml;hlt ist (besonders, wenn es auf der Befehlszeile angegeben wurde) und nicht heruntergeladen werden kann, wird es stillschweigend zur&uuml;ckgehalten. Konfigurationselement:
APT::Get::Fix-Missing.
</DL>

<P>

<B>--no-download</B>
<DL COMPACT><DT id="25"><DD>
schaltet das Herunterladen von Paketen aus. Es ist am sinnvollsten, dies zusammen mit
<B>--ignore-missing</B>
zu verwenden, um APT zu zwingen, nur die .debs zu benutzten, die es bereits heruntergeladenen hat. Konfigurationselement:
APT::Get::Download.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="26"><DD>
still; erzeugt eine Ausgabe, die f&uuml;r Protokollierung geeignet ist und keine Fortschrittsanzeigen enth&auml;lt. Mehr &raquo;q&laquo;s unterdr&uuml;cken weitere Ausgaben, bis zu einem Maximum von 2. Sie k&ouml;nnen au&szlig;erdem
<B>-q=#</B>
benutzen, um die Stillestufe zu setzen, was die Konfigurationsdatei au&szlig;er Kraft setzt. Beachten Sie, dass Stillestufe 2
<B>-y</B>
impliziert. Sie sollten niemals -qq ohne einen keine-Aktion-Schalter, wie -d, --print-uris oder -s benutzen, da APT Entscheidungen treffen k&ouml;nnte, die Sie nicht erwarteten. Konfigurationselement:
quiet.
</DL>

<P>

<B>-s</B>, <B>--simulate</B>, <B>--just-print</B>, <B>--dry-run</B>, <B>--recon</B>, <B>--no-act</B>
<DL COMPACT><DT id="27"><DD>
keine Aktion; f&uuml;hrt eine Simulation von Ereignissen durch, die basierend auf dem aktuellen Systemstatus auftreten w&uuml;rden, ver&auml;ndert das System jedoch nicht wirklich. Sperren wird deaktiviert (<B>Debug::NoLocking</B>), daher kann sich der Systemstatus &auml;ndern, w&auml;hrend
<B>apt-get</B>
ausgef&uuml;hrt wird. Simulationen k&ouml;nnen auch von Nicht-Root-Benutzern ausgef&uuml;hrt werden, die m&ouml;glicherweise keinen Lesezugriff auf alle APT-Konfigurationsdateien haben, was die Simulation verf&auml;lschen k&ouml;nnte. Au&szlig;erdem wird standardm&auml;&szlig;ig Nicht-Root-Benutzern ein Hinweis mit einer entsprechenden Warnung angezeigt. (<B>APT::Get::Show-User-Simulation-Note</B>). Konfigurationselement:
APT::Get::Simulate.
<P>
Simulieren gibt eine Serie von Zeilen aus, von denen jede eine
<B>dpkg</B>-Aktion darstellt: Konfigurieren (Conf), Entfernen (Remv) oder Entpacken (Inst). Eckige Klammern zeigen besch&auml;digte Pakete an und ein leeres Paar eckiger Klammern steht f&uuml;r Besch&auml;digungen, die keine Folgen haben (selten).
</DL>

<P>

<B>-y</B>, <B>--yes</B>, <B>--assume-yes</B>
<DL COMPACT><DT id="28"><DD>
automatisches &raquo;Ja&laquo; auf Anfragen; versucht auf alle Anfragen mit &raquo;Ja&laquo; zu antworten und ohne Benutzerinteraktion zu laufen. Wenn eine unerw&uuml;nschte Situation eintritt, wie eine &Auml;nderung an einem gehaltenen Paket, die Installation eines nicht authentifizierten Pakets oder das Entfernen eines essenziellen Pakets, dann wird
apt-get
abgebrochen. Konfigurationselement:
APT::Get::Assume-Yes.
</DL>

<P>

<B>--assume-no</B>
<DL COMPACT><DT id="29"><DD>
automatisches &raquo;Nein&laquo; auf alle Anfragen. Konfigurationselement:
APT::Get::Assume-No.
</DL>

<P>

<B>--no-show-upgraded</B>
<DL COMPACT><DT id="30"><DD>
gibt keine Liste aller Pakete aus, f&uuml;r die ein Upgrade durchgef&uuml;hrt werden kann. Konfigurationselement:
APT::Get::Show-Upgraded.
</DL>

<P>

<B>-V</B>, <B>--verbose-versions</B>
<DL COMPACT><DT id="31"><DD>
zeigt vollst&auml;ndige Versionen f&uuml;r Pakete, von denen ein Upgrade durchgef&uuml;hrt oder die installiert wurden. Konfigurationselement:
APT::Get::Show-Versions.
</DL>

<P>

<B>-a</B>, <B>--host-architecture</B>
<DL COMPACT><DT id="32"><DD>
Diese Option steuert, wie die Architektur der durch
<B>apt-get source --compile</B>
gebauten Pakete und wie Cross-Bauabh&auml;ngigkeiten erf&uuml;llt werden. Standardm&auml;&szlig;ig ist sie nicht gesetzt, was bedeutet, dass die Rechnerarchitektur die gleiche wie die Bauarchitektur (die durch
APT::Architecture) definiert wird) ist. Konfigurationselement:
APT::Get::Host-Architecture.
</DL>

<P>

<B>-P</B>, <B>--build-profiles</B>
<DL COMPACT><DT id="33"><DD>
Diese Option steuert die aktivierten Bauprofile f&uuml;r die ein Quellpaket durch
<B>apt-get source --compile</B>
gebaut und wie Cross-Bauabh&auml;ngigkeiten erf&uuml;llt werden. Standardm&auml;&szlig;ig ist kein Bauprofil aktiv. Weitere Bauprofile k&ouml;nnen gleichzeitig aktiviert werden, indem sie durch Kommas getrennt angeh&auml;ngt werden. Konfigurationselement:
APT::Build-Profiles.
</DL>

<P>

<B>-b</B>, <B>--compile</B>, <B>--build</B>
<DL COMPACT><DT id="34"><DD>
kompiliert Quellpakete, nachdem sie heruntergeladen wurden. Konfigurationselement:
APT::Get::Compile.
</DL>

<P>

<B>--ignore-hold</B>
<DL COMPACT><DT id="35"><DD>
ignoriert Zur&uuml;ckhalten des Paketes; dies veranlasst
<B>apt-get</B>, ein f&uuml;r das Paket gesetztes &raquo;Halten&laquo; zu ignorieren. Dies kann zusammen mit
dist-upgrade
n&uuml;tzlich sein, um eine gro&szlig;e Anzahl ungew&uuml;nschter &raquo;Halten&laquo; au&szlig;er Kraft zu setzen. Konfigurationselement:
APT::Ignore-Hold.
</DL>

<P>

<B>--with-new-pkgs</B>
<DL COMPACT><DT id="36"><DD>
erlaubt das Installieren neuer Pakete, wenn es zusammen mit
upgrade
benutzt wird. Dies ist n&uuml;tzlich, falls das Aktualisieren eines installierten Pakets zur Installation neue Abh&auml;ngigkeiten erfordert. Anstatt das Paket zur&uuml;ckzuhalten, wird
upgrade
ein Upgrade des Pakets durchf&uuml;hren und die neuen Abh&auml;ngigkeiten installieren. Beachten Sie, dass
upgrade
mit dieser Option niemals Pakete entfernen, sondern nur das Hinzuf&uuml;gen neuer gestatten wird. Konfigurationselement:
APT::Get::Upgrade-Allow-New.
</DL>

<P>

<B>--no-upgrade</B>
<DL COMPACT><DT id="37"><DD>
kein Upgrade von Paketen durchf&uuml;hren; wenn es zusammen mit
install
benutzt wird, wird
no-upgrade
auf der Befehlszeile ein Upgrade von Paketen verhindern, die bereits installiert sind. Konfigurationselement:
APT::Get::Upgrade.
</DL>

<P>

<B>--only-upgrade</B>
<DL COMPACT><DT id="38"><DD>
keine neuen Pakete installieren; wenn es zusammen mit
install
benutzt wird, wird
only-upgrade
nur Upgrades bereits installierter Pakete durchf&uuml;hren und Anfragen zur Installation neuer Pakete ignorieren. Konfigurationselement:
APT::Get::Only-Upgrade.
</DL>

<P>

<B>--allow-downgrades</B>
<DL COMPACT><DT id="39"><DD>
Dies ist eine gef&auml;hrliche Option, die APT veranlasst, ohne Nachfrage fortzufahren, wenn es Downgrades durchf&uuml;hrt. Sie sollte nicht benutzt werden, au&szlig;er in ganz besonderen Situationen. Ihre Verwendung kann m&ouml;glicherweise Ihr System zerst&ouml;ren. Konfigurationselement:
APT::Get::allow-downgrades. Eingef&uuml;hrt mit APT 1.1.
</DL>

<P>

<B>--allow-remove-essential</B>
<DL COMPACT><DT id="40"><DD>
erzwingt &raquo;Ja&laquo;; dies ist eine gef&auml;hrliche Option, die APT veranlasst, ohne Nachfrage fortzufahren, wenn wesentliche Teile des Systems entfernt werden sollen. Sie sollte nicht benutzt werden, au&szlig;er in ganz besonderen Situationen. Ihre Verwendung kann m&ouml;glicherweise Ihr System zerst&ouml;ren. Konfigurationselement:
APT::Get::allow-remove-essential. Eingef&uuml;hrt mit APT 1.1.
</DL>

<P>

<B>--allow-change-held-packages</B>
<DL COMPACT><DT id="41"><DD>
erzwingt &raquo;Ja&laquo;; dies ist eine gef&auml;hrliche Option, die APT veranlasst, ohne Nachfrage fortzufahren, wenn gehaltene Pakete ge&auml;ndert werden sollen. Sie sollte nicht benutzt werden, au&szlig;er in ganz besonderen Situationen. Sie zu benutzen, kann m&ouml;glicherweise Ihr System zerst&ouml;ren! Konfigurationselement:
APT::Get::allow-change-held-packages. Eingef&uuml;hrt mit APT 1.1.
</DL>

<P>

<B>--force-yes</B>
<DL COMPACT><DT id="42"><DD>
erzwingt &raquo;Ja&laquo;; dies ist eine gef&auml;hrliche Option, die APT veranlasst, ohne Nachfrage fortzufahren, wenn es etwas m&ouml;glicherweise sch&auml;dliches tut. Es sollte nicht benutzt werden, au&szlig;er in ganz besonderen Situationen.
force-yes
zu benutzen, kann m&ouml;glicherweise Ihr System zerst&ouml;ren! Konfigurationselement:
APT::Get::force-yes. Dies ist veraltet und wurde in 1.1. durch
<B>--allow-unauthenticated</B>,
<B>--allow-downgrades</B>,
<B>--allow-remove-essential</B>
und
<B>--allow-change-held-packages</B>
ersetzt.
</DL>

<P>

<B>--print-uris</B>
<DL COMPACT><DT id="43"><DD>
Anstatt die Dateien herunterzuladen, werden ihre URIs ausgegeben. Jeder URI wird den Pfad, den Zieldateinamen, die Gr&ouml;&szlig;e und den erwarteten MD5-Hash enthalten. Beachten Sie, dass der zu schreibende Dateiname nicht immer dem Dateinamen auf der entfernt gelegenen Site entspricht. Dies funktioniert auch mit den Befehlen
source
und
update. Wenn es mit dem Befehl
update
benutzt wird, sind MD5 und Gr&ouml;&szlig;e nicht enthalten und es ist Aufgabe des Benutzers, komprimierte Dateien zu dekomprimieren. Konfigurationselement:
APT::Get::Print-URIs.
</DL>

<P>

<B>--purge</B>
<DL COMPACT><DT id="44"><DD>
&raquo;purge&laquo; anstelle von &raquo;remove&laquo; f&uuml;r alles zu entfernende benutzen. Ein Stern (&raquo;*&laquo;) wird bei Paketen angezeigt, die zum vollst&auml;ndigen Entfernen vorgemerkt sind.
<B>remove --purge</B>
entspricht dem Befehl
<B>purge</B>. Konfigurationselement:
APT::Get::Purge.
</DL>

<P>

<B>--reinstall</B>
<DL COMPACT><DT id="45"><DD>
installiert Pakete erneut, die bereits mit der neusten Version installiert sind. Konfigurationselement:
APT::Get::ReInstall.
</DL>

<P>

<B>--list-cleanup</B>
<DL COMPACT><DT id="46"><DD>
Diese Option ist standardm&auml;&szlig;ig eingeschaltet. Um sie auszuschalten, benutzen Sie
--no-list-cleanup. Wenn eingeschaltet, wird
<B>apt-get</B>
den Inhalt von
/var/lib/apt/lists
automatisch verwalten, um sicherzustellen, dass veraltete Dateien gel&ouml;scht werden. Nur das h&auml;ufige &Auml;ndern der Quelllisten stellt den einzigen Grund zum Ausschalten der Option dar. Konfigurationselement:
APT::Get::List-Cleanup.
</DL>

<P>

<B>-t</B>, <B>--target-release</B>, <B>--default-release</B>
<DL COMPACT><DT id="47"><DD>
Diese Option steuert die standardm&auml;&szlig;ige Eingabe an die Einheit zur Durchsetzung der Richtlinien (&raquo;policy&laquo;), sie erstellt eine Vorgabe-Pin mit Priorit&auml;t 990 unter Benutzung der angegebenen Release-Zeichenkette. Dies setzt die allgemeinen Einstellungen in
/etc/apt/preferences
au&szlig;er Kraft. Pakete mit speziellem Pinning sind nicht vom Wert dieser Option betroffen. Kurz gesagt, gibt Ihnen diese Option einfache Kontrolle dar&uuml;ber, aus welcher Distribution Pakete heruntergeladen werden sollen. Einige typische Beispiele k&ouml;nnten
<B>-t '2.1*'</B>,
<B>-t unstable</B>
oder
<B>-t sid</B>
sein. Konfigurationselement:
APT::Default-Release; lesen Sie auch die
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)-Handbuchseite.
</DL>

<P>

<B>--trivial-only</B>
<DL COMPACT><DT id="48"><DD>
f&uuml;hrt nur Aktionen aus, die &raquo;trivial&laquo; sind. Von der Logik her &auml;hnelt sie der
<B>--assume-yes</B>. An Stellen, an denen
<B>--assume-yes</B>
&raquo;ja&laquo; auf Fragen antwortet, antwortet
<B>--trivial-only</B>
&raquo;Nein&laquo;. Konfigurationselement:
APT::Get::Trivial-Only.
</DL>

<P>

<B>--no-remove</B>
<DL COMPACT><DT id="49"><DD>
Wenn irgendwelche Pakete entfernt werden sollen, bricht apt-get sofort ohne Nachfrage ab. Konfigurationselement:
APT::Get::Remove.
</DL>

<P>

<B>--auto-remove</B>, <B>--autoremove</B>
<DL COMPACT><DT id="50"><DD>
Wenn der Befehl entweder
install
oder
remove
lautet, dann bewirkt diese Option wie das Ausf&uuml;hren des
autoremove-Befehls das Entfernen der nicht mehr ben&ouml;tigten abh&auml;ngigen Pakete. Konfigurationselement:
APT::Get::AutomaticRemove.
</DL>

<P>

<B>--only-source</B>
<DL COMPACT><DT id="51"><DD>
hat nur eine Bedeutung f&uuml;r die Befehle
source
und
build-dep. Zeigt an, dass die angegebenen Quellnamen nicht durch die bin&auml;re Tabelle ermittelt werden. Dies bedeutet, dass dieser Befehl, wenn diese Option angegeben ist, nur Quellpaketnamen als Argumente akzeptiert, anstatt Bin&auml;rpaketnamen zu akzeptieren und das entsprechende Quellpaket nachzuschlagen. Konfigurationselement:
APT::Get::Only-Source.
</DL>

<P>

<B>--diff-only</B>, <B>--dsc-only</B>, <B>--tar-only</B>
<DL COMPACT><DT id="52"><DD>
l&auml;dt nur die diff-, dsc-, oder tar-Dateien eines Quellarchivs herunter. Konfigurationselemente:
APT::Get::Diff-Only,
APT::Get::Dsc-Only
und
APT::Get::Tar-Only.
</DL>

<P>

<B>--arch-only</B>
<DL COMPACT><DT id="53"><DD>
verarbeitet nur architekturabh&auml;ngige Bauabh&auml;ngigkeiten. Konfigurationselement:
APT::Get::Arch-Only.
</DL>

<P>

<B>--indep-only</B>
<DL COMPACT><DT id="54"><DD>
verarbeitet nur architekturunabh&auml;ngige Bauabh&auml;ngigkeiten. Konfigurationselement:
APT::Get::Indep-Only.
</DL>

<P>

<B>--allow-unauthenticated</B>
<DL COMPACT><DT id="55"><DD>
ignoriert, falls Pakete nicht authentifiziert werden k&ouml;nnen, und zeigt es nicht an. Dies kann bei der Arbeit mit lokalen Depots n&uuml;tzlich sein, ist jedoch ein gro&szlig;es Sicherheitsrisiko, falls die Echtheit der Daten nicht durch den Benutzer selbst auf eine andere Art sichergestellt ist. Die Benutzung der Option
<B>Trusted</B>
f&uuml;r
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;ge sollte normalerweise diesem globalen Au&szlig;er-Kraft-setzen vorgezogen werden. Konfigurationselement:
APT::Get::AllowUnauthenticated.
</DL>

<P>

<B>--no-allow-insecure-repositories</B>
<DL COMPACT><DT id="56"><DD>
verbietet dem Befehl &raquo;update&laquo; das Beschaffen nicht &uuml;berpr&uuml;fbarer Daten von konfigurierten Quellen. APT wird beim Befehl &raquo;update&laquo; f&uuml;r Depots ohne g&uuml;ltige kryptografische Signaturen fehlschlagen. Weiter Einzelheiten &uuml;ber das Konzept und dessen Folgen finden Sie unter
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8). Konfigurationselement:
Acquire::AllowInsecureRepositories.
</DL>

<P>

<B>--allow-releaseinfo-change</B>
<DL COMPACT><DT id="57"><DD>
erlaubt dem Aktualisierungsbefehl mit dem Herunterladen von Daten aus einem Depot fortzufahren, bei dem sich die Information ge&auml;ndert hat, welche Ver&ouml;ffentlichung im Depot enthalten ist, z.B. eine neue Hauptver&ouml;ffentlichung. APT wird beim Aktualisierungsbefehl f&uuml;r derartige Depots bis zur Best&auml;tigung scheitern, um sicherzustellen, dass der Benutzer auf die &Auml;nderung vorbereitet ist. Weitere Einzelheiten des Konzepts und der Konfiguration finden Sie unter
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
<P>
Es existieren Spezialoptionen (--allow-releaseinfo-change-<I>Feld</I>), um &Auml;nderungen nur f&uuml;r bestimmte Felder wie
origin,
label,
codename,
suite,
version
und
defaultpin
zu erlauben. Siehe auch
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5). Konfigurationselement:
Acquire::AllowReleaseInfoChange.
</DL>

<P>

<B>--show-progress</B>
<DL COMPACT><DT id="58"><DD>
zeigt benutzerfreundliche Fortschrittsinformationen im Terminalfenster, wenn Pakete installiert beziehungsweise entfernt werden oder ein Upgrade durchgef&uuml;hrt wird. Informationen &uuml;ber eine maschinell auswertbare Version dieser Daten finden Sie in README.progress-reporting im Dokumentationsverzeichnis apt/doc. Konfigurationselemente:
Dpkg::Progress
und
Dpkg::Progress-Fancy.
</DL>

<P>

<B>--with-source</B> <B></B><I>Dateiname</I>
<DL COMPACT><DT id="59"><DD>
f&uuml;gt die angegebene Datei als Quelle f&uuml;r Metadaten hinzu. Dies kann mehrfach verwendet werden, um mehrere Dateien hinzuzuf&uuml;gen. Weitere Einzelheiten der
<B>--with-source</B>-Beschreibung finden Sie unter
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8).
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="60"><DD>
eine kurze Aufrufzusammenfassung zeigen
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="61"><DD>
die Version des Programms anzeigen
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="62"><DD>
Konfigurationsdatei; hiermit wird die zu verwendende Konfigurationssdatei angegeben. Das Programm wird die Vorgabe-Konfigurationsdatei und dann diese Konfigurationsdatei lesen. Falls Konfigurationseinstellungen vor der Vorgabe-Konfiguration ausgewertet werden m&uuml;ssen, geben Sie eine Datei in der Umgebungsvariable
<B>APT_CONFIG</B>
an. Lesen Sie
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5), um Syntax-Informationen zu erhalten.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="63"><DD>
eine Konfigurationsoption setzen; hiermit wird eine beliebige Konfigurationsoption gesetzt. Die Syntax lautet
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
und
<B>--option</B>
kann mehrfach benutzt werden, um verschiedene Optionen zu setzen.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>DATEIEN</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="64"><DD>
Orte, von denen Pakete geladen werden. Konfigurationselement:
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="65"><DD>
Dateifragmente f&uuml;r Orte, von denen Pakete geladen werden. Konfigurationselement:
Dir::Etc::SourceParts.
</DL>

<P>

/etc/apt/apt.conf
<DL COMPACT><DT id="66"><DD>
APT-Konfigurationsdatei. Konfigurationselement:
Dir::Etc::Main.
</DL>

<P>

/etc/apt/apt.conf.d/
<DL COMPACT><DT id="67"><DD>
APT-Konfigurationsdatei-Fragmente. Konfigurationselement:
Dir::Etc::Parts.
</DL>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="68"><DD>
Version-Einstellungsdatei. Hier k&ouml;nnen Sie &quot;pinning&quot; festlegen, d.h. eine Einstellung, um bestimmte Pakete aus einer separaten Quelle oder von einer anderen Version einer Distribution zu erhalten. Konfigurationselement:
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="69"><DD>
Dateifragmente f&uuml;r die Versionseinstellungen. Konfigurationselement:
Dir::Etc::PreferencesParts.
</DL>

<P>

/var/cache/apt/archives/
<DL COMPACT><DT id="70"><DD>
Speicherbereich f&uuml;r abgerufene Paketdateien. Konfigurationselement:
Dir::Cache::Archives.
</DL>

<P>

/var/cache/apt/archives/partial/
<DL COMPACT><DT id="71"><DD>
Speicherbereich f&uuml;r Paketdateien auf dem Transportweg. Konfigurationselement:
Dir::Cache::Archives
(partial
wird implizit angeh&auml;ngt)
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="72"><DD>
Speicherbereich f&uuml;r Statusinformationen jeder in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
angegebenen Paketquelle Konfigurationselement:
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="73"><DD>
Speicherbereich f&uuml;r Statusinformationen auf dem Transportweg. Konfigurationselement:
Dir::State::Lists
(partial
wird implizit angeh&auml;ngt)
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8), die APT-Benutzeranleitung in /usr/share/doc/apt-doc/,
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5), das APT-Howto.
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGNOSE</H2>

<P>

<B>apt-get</B>
gibt bei normalen Aktionen 0 zur&uuml;ck, dezimal 100 bei Fehlern.
<A NAME="lbAI">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAJ">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="74"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="75"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="76"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="77"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="78"><A HREF="#lbAB">NAME</A><DD>
<DT id="79"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="80"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="81"><A HREF="#lbAE">OPTIONEN</A><DD>
<DT id="82"><A HREF="#lbAF">DATEIEN</A><DD>
<DT id="83"><A HREF="#lbAG">SIEHE AUCH</A><DD>
<DT id="84"><A HREF="#lbAH">DIAGNOSE</A><DD>
<DT id="85"><A HREF="#lbAI">FEHLER</A><DD>
<DT id="86"><A HREF="#lbAJ">&Uuml;BERSETZUNG</A><DD>
<DT id="87"><A HREF="#lbAK">AUTOREN</A><DD>
<DT id="88"><A HREF="#lbAL">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:58 GMT, March 31, 2021
</BODY>
</HTML>
