
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-SECURE</TITLE>
</HEAD><BODY>
<H1>APT-SECURE</H1>
Section: APT (8)<BR>Updated: 06&nbsp;August&nbsp;2016<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-secure - Archivauthentifizierungsunterst&uuml;tzung f&uuml;r APT
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

Beginnend mit Version 0.6 enth&auml;lt
<B>APT</B>
Code, der die Signatur der Release-Datei f&uuml;r alle Depots pr&uuml;ft. Dies stellt sicher, dass Daten wie Pakete im Archiv nicht von Leuten ge&auml;ndert werden k&ouml;nnen, die keinen Zugriff auf den Signierschl&uuml;ssel der Release-Datei haben. Beginnend mit Version 1.1 erfordert
<B>APT</B>
von Depots aktuelle Authentifizierungsinformationen f&uuml;r den ungest&ouml;rten Gebrauch des Depots bereitzustellen. Seit Version 1.5 m&uuml;ssen Informationen, die in der Release-Datei &uuml;ber das Depot enthalten sind, best&auml;tigt werden, bevor APT mit den Aktualisierungen aus diesem Depot fortf&auml;hrt.
<P>

Hinweis: Alle APT-basierten Paketverwaltungsoberfl&auml;chen wie
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+aptitude">aptitude</A></B>(8)
und
<B><A HREF="/cgi-bin/man/man2html?8+synaptic">synaptic</A></B>(8)
unterst&uuml;tzen diese Authentifizierungsfunktionalit&auml;t, daher verwendet diese Handbuchseite der Einfachheit halber exemplarisch f&uuml;r alle
APT.
<A NAME="lbAD">&nbsp;</A>
<H2>NICHT SIGNIERTE DEPOTS</H2>

<P>

Falls ein Archiv eine nicht signierte oder &uuml;berhaupt keine Release-Datei hat, werden alle aktuellen APT-Versionen das Herunterladen von Daten von dort standardm&auml;&szlig;ig in
<B>update</B>-Aktionen verweigern. Sogar wenn Oberfl&auml;chen wie
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
zum Herunterladen gezwungen werden, wird eine explizite Best&auml;tigung ben&ouml;tigt, falls eine Installationsanfrage ein Paket aus einem derartigen nicht authentifizierten Archiv enth&auml;lt.
<P>

Sie k&ouml;nnen erzwingen, dass alle APT-Clients nur Warnungen ausgeben, indem Sie die Konfigurationsoption
<B>Acquire::AllowInsecureRepositories</B>
auf
true
setzen. &Uuml;ber die
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Option
allow-insecure=yes
kann auch erlaubt werden, dass individuelle Depots unsicher sind. Beachten Sie, dass von unsicheren Depots eindringlich abgeraten wird und alle Optionen, die APT zwingen, sie weiterhin zu unterst&uuml;tzen, irgendwann entfernt werden. Benutzern steht auch die Option
<B>Trusted</B>
zur Verf&uuml;gung, um sogar Warnungen auszuschalten, seien Sie sich aber sicher, dass Sie die in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
erkl&auml;rten Konsequenzen verstanden haben.
<P>

Ein Depot, das vorher authentifiziert war, diesen Status jedoch bei einer
<B>update</B>-Aktion verlieren w&uuml;rde, gibt auf allen APT-Clients, ungeachtet der Option, die die Verwendung unsicherer Depots erlaubt oder verbietet, einen Fehler aus. Der Fehler kann durch zus&auml;tzliches Setzen von
<B>Acquire::AllowDowngradeToInsecureRepositories</B>
auf
true
oder f&uuml;r individuelle Depots mit der
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Option
allow-downgrade-to-insecure=yes
&uuml;bergangen werden.
<A NAME="lbAE">&nbsp;</A>
<H2>SIGNIERTE DEPOTS</H2>

<P>

Eine Kette des Vertrauens von einem APT-Archiv zum Endanwender wird durch verschiedene Schritte erreicht.
<B>apt-secure</B>
ist der letzte Schritt in dieser Kette. Einem Archiv zu vertrauen bedeutet nicht, dass Sie vertrauen, dass das Paket keinen schadhaften Code enth&auml;lt, aber es bedeutet, dass Sie dem Archivbetreuer vertrauen. Der Archivbetreuer ist daf&uuml;r verantwortlich, dass er die Korrektheit der Integrit&auml;t des Archivs aufrechterh&auml;lt.
<P>

apt-secure &uuml;berpr&uuml;ft keine Signaturen auf einer Stufe der Pakete. Falls Sie ein Werkzeug ben&ouml;tigen, das dies tut, sollten Sie einen Blick auf
<B>debsig-verify</B>
und
<B>debsign</B>
werfen (bereitgestellt von den Paketen debsig-verify beziehungsweise devscripts).
<P>

Die Kette des Vertrauens in Debian beginnt (z.B.), wenn ein Betreuer ein neues Paket oder eine neue Version eines Pakets in das Debian-Archiv hochl&auml;dt. Damit es in Kraft tritt muss dieses Hochladen mit einem Schl&uuml;ssel signiert werden, der sich in einem der Schl&uuml;sselbunde der Debian-Betreuer befindet (verf&uuml;gbar im Paket &raquo;debian-keyring&laquo;). Betreuerschl&uuml;ssel werden von anderen Betreuern gem&auml;&szlig; vorbestimmter Regeln signiert, um die Identit&auml;t des Schl&uuml;sselinhabers sicherzustellen. &Auml;hnliche Abl&auml;ufe existieren in allen Debian-basierten Distributionen.
<P>

Sobald das hochgeladene Paket &uuml;berpr&uuml;ft und dem Archiv hinzugef&uuml;gt wurde, wird die Betreuersignatur entfernt, Pr&uuml;fsummen des Pakets werden berechnet und in die Datei Packages abgelegt. Die Pr&uuml;fsummen aller Packages-Dateien werden berechnet und in der Release-Datei abgelegt. Dann wird die Release-Datei durch den Archivschl&uuml;ssel f&uuml;r diese Ubuntu-Ver&ouml;ffentlichung signiert und zusammen mit den Paketen und Packages-Dateien auf Ubuntu-Spiegel verteilt. Die Schl&uuml;ssel sind im Ubuntu-Archivschl&uuml;sselbund im Paket
ubuntu-keyring
verf&uuml;gbar.
<P>

Endanwender k&ouml;nnen die Signatur der Release-Datei pr&uuml;fen, die Pr&uuml;fsumme eines Paketes daraus entpacken und mit der Pr&uuml;fsumme des Pakets vergleichen, das sie manuell heruntergeladen haben - oder sich darauf verlassen, dass APT dies automatisch tut.
<P>

Beachten Sie, dass sich dies vom Pr&uuml;fen gvonn Signaturen auf Paketbasis unterscheidet. Es wurde entworfen, um zwei m&ouml;gliche Angriffe zu verhindern:
<P>
<DL COMPACT><DT id="1"><DD>
&bull;


&raquo;Man-in-the-middle&laquo;-Netzwerkangriffe. Ohne Signaturpr&uuml;fung kann ein sch&auml;dlicher Mittelsmann sich selbst in das Herunterladen von Paketen einbringen und Schadsoftware bereitstellen. Dies kann entweder durch Steuerung eines Netzwerkelements (Router, Switch, usw.) oder durch Umleiten des Netzverkehrs zu einem b&ouml;sartigen Server (durch ARP- oder DNS-Manipulationsangriffe) erfolgen.
</DL>

<P>
<DL COMPACT><DT id="2"><DD>
&bull;


Spiegelnetzwerk-Gef&auml;hrdung. Ohne Signaturpr&uuml;fung kann ein sch&auml;dlicher Mittelsmann einen Spiegelserver kompromittieren und die Dateien darauf ver&auml;ndern, um sch&auml;dliche Software an alle Benutzer zu verbreiten, die Pakete von diesem Rechner herunterladen.
</DL>

<P>

Es sch&uuml;tzt jedoch nicht gegen eine Kompromittierung des Hauptservers selbst (der die Pakete signiert) oder gegen eine Kompromittierung des Schl&uuml;ssels, der zum Signieren der Release-Dateien benutzt wird. In jedem Fall kann dieser Mechanismus eine paketbasierte Signatur erg&auml;nzen.
<A NAME="lbAF">&nbsp;</A>
<H2>INFORMATIONS&Auml;NDERUNGEN</H2>

<P>

Eine Release-Datei enth&auml;lt neben der Pr&uuml;fsumme f&uuml;r die Dateien in dem Depot auch allgemeine Informationen &uuml;ber das Depot wie die Herkunft, den Codenamen oder die Versionsnummer der Ver&ouml;ffentlichung.
<P>

Diese Informationen werden an verschiedenen Stellen angezeigt, daher sollte ein Depot-Besitzer immer die Richtigkeit sicherstellen k&ouml;nnen. Desweiteren kann weitere Benutzerkonfiguration wie
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5)
kann von diesen Informationen abh&auml;ngen und sie benutzen. Seit Version 1.5 muss der Benutzer daher &Auml;nderungen explizit best&auml;tigen, um erkennen zu lassen, dass er ausreichend darauf vorbereitet ist, z.B. auf das neue Major Release der Distribution, das im Depot ausgeliefert wird (z.B. durch den Codenamen angegeben).
<A NAME="lbAG">&nbsp;</A>
<H2>BENUTZERKONFIGURATION</H2>

<P>

<B>apt-key</B>
ist das Programm, das die Liste der von APT verwendeten Schl&uuml;ssel verwaltet, aufgrund derer es Depots vertraut. Es kann benutzt werden, um Schl&uuml;ssel hinzuzuf&uuml;gen oder zu entfernen, sowie um vertrauensw&uuml;rdige Schl&uuml;ssel aufzulisten. Welche(r) Schl&uuml;ssel welches Archiv signieren kann/k&ouml;nnen, kann per
<B>Signed-By</B>
in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
eingeschr&auml;nkt werden.
<P>

Beachten Sie, dass eine Standardinstallation bereits alle Schl&uuml;ssel zum sicheren Beschaffen von Paketen aus den Standarddepots enth&auml;lt, daher ist das Frickeln mit
<B>apt-key</B>
nur n&ouml;tig, wenn Drittanbieterdepots hinzugef&uuml;gt werden.
<P>

Um einen neuen Schl&uuml;ssel hinzuzuf&uuml;gen, m&uuml;ssen Sie ihn zuerst herunterladen (Sie sollten sicherstellen, dass Sie einen vertrauensw&uuml;rdigen Kommunikationskanal benutzen, wenn Sie ihn herunterladen), ihn mit
<B>apt-key</B>
hinzuf&uuml;gen und dann
<B>apt-get update</B>
ausf&uuml;hren, so dass APT die Dateien
InRelease
oder
Release.gpg
der von Ihnen konfigurierten Archive herunterladen und pr&uuml;fen kann.
<A NAME="lbAH">&nbsp;</A>
<H2>DEPOTKONFIGURATION</H2>

<P>

Wenn Sie Archivsignaturen in einem von Ihnen betreuten Archiv zur Verf&uuml;gung stellen m&ouml;chten, m&uuml;ssen Sie:
<P>
<DL COMPACT><DT id="3"><DD>
&bull;


<I>Eine Release-Datei der obersten Stufe erzeugen</I>, wenn sie nicht bereits existiert. Sie k&ouml;nnen dies erledigen, indem Sie
<B>apt-ftparchive release</B>
(aus apt-utils) ausf&uuml;hren.
</DL>

<P>
<DL COMPACT><DT id="4"><DD>
&bull;


<I>Sie signieren</I>. Sie k&ouml;nnen dies tun, indem Sie
<B>gpg --clearsign -o InRelease Release</B>
und
<B>gpg -abs -o Release.gpg Release</B>
ausf&uuml;hren.
</DL>

<P>
<DL COMPACT><DT id="5"><DD>
&bull;


<I>Den Schl&uuml;sselfingerabdruck ver&ouml;ffentlichen</I>, damit Ihre Benutzer wissen, welchen Schl&uuml;ssel sie importieren m&uuml;ssen, um die Dateien im Archiv zu authentifizieren. Am besten liefern Sie Ihren Schl&uuml;ssel in einem eigenen Paket aus, wie dies Ubuntu mit
ubuntu-keyring
macht, um sp&auml;ter automatisch Aktualisierungen und Schl&uuml;sselwechsel durchf&uuml;hren zu k&ouml;nnen.
</DL>

<P>
<DL COMPACT><DT id="6"><DD>
&bull;


<I>Anweisungen geben, wie Ihr Archiv und Ihr Schl&uuml;ssel hinzugef&uuml;gt werden k&ouml;nnen</I>. Falls Ihre Benutzer Ihren Schl&uuml;ssel nicht auf sichere Weise beschaffen k&ouml;nnen, ist die oben beschriebene Kette des Vertrauens unterbrochen. Wie Sie Benutzern helfen k&ouml;nnen, Ihren Schl&uuml;ssel hinzuzuf&uuml;gen, h&auml;ngt von Ihrem Archiv und Ihrer Zielgruppe ab und reicht von der Bereitstellung des Schl&uuml;sselrings als Teil eines anderen Archivs, das bei Ihren Benutzern bereits konfiguriert ist (wie den Standarddepots ihrer Distribution), bis hin zum Nutzen des Vertrauensnetzes.
</DL>

<P>

Immer wenn sich die Inhalte des Archivs &auml;ndern (neue Pakete hinzugef&uuml;gt oder entfernt werden), muss der Archivbetreuer den zwei ersten der oben skizzierten Schritten folgen.
<A NAME="lbAI">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-key">apt-key</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+debsign">debsign</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+debsig-verify">debsig-verify</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+gpg">gpg</A></B>(1)
<P>

Um weitere Hintergrundinformationen zu erhalten, k&ouml;nnen Sie das Kapitel
m[blue]<B>Die Infrastruktur f&uuml;r Sicherheit in Debian</B>m[]<FONT SIZE="-2">[1]</FONT>
des Handbuchs &raquo;Anleitung zum Absichern von Debian&laquo; (auch im Paket harden-doc verf&uuml;gbar) und das
m[blue]<B>Strong Distribution HOWTO</B>m[]<FONT SIZE="-2">[2]</FONT>
von V. Alex Brennen lesen.
<A NAME="lbAJ">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[3]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTOR</H2>

<P>

APT wurde vom APT-Team geschrieben
&lt;<A HREF="mailto:apt@packages.debian.org">apt@packages.debian.org</A>&gt;.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTOREN DER HANDBUCHSEITE</H2>

<P>

Diese Handbuchseite basiert auf der Arbeit von Javier Fern&aacute;ndez-Sanguino Pe&ntilde;a, Isaac Jones, Colin Walters, Florian Weimer und Michael Vogt.
<A NAME="lbAM">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="7"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="8"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="9"> 1.<DD>
Die Infrastruktur f&uuml;r Sicherheit in Debian
<DL COMPACT><DT id="10"><DD>
<A HREF="https://www.debian.org/doc/manuals/securing-debian-howto/ch7">https://www.debian.org/doc/manuals/securing-debian-howto/ch7</A>
</DL>

<DT id="11"> 2.<DD>
Strong Distribution HOWTO
<DL COMPACT><DT id="12"><DD>
<A HREF="http://www.cryptnet.net/fdp/crypto/strong_distro.html">http://www.cryptnet.net/fdp/crypto/strong_distro.html</A>
</DL>

<DT id="13"> 3.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NAME</A><DD>
<DT id="16"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="17"><A HREF="#lbAD">NICHT SIGNIERTE DEPOTS</A><DD>
<DT id="18"><A HREF="#lbAE">SIGNIERTE DEPOTS</A><DD>
<DT id="19"><A HREF="#lbAF">INFORMATIONS&Auml;NDERUNGEN</A><DD>
<DT id="20"><A HREF="#lbAG">BENUTZERKONFIGURATION</A><DD>
<DT id="21"><A HREF="#lbAH">DEPOTKONFIGURATION</A><DD>
<DT id="22"><A HREF="#lbAI">SIEHE AUCH</A><DD>
<DT id="23"><A HREF="#lbAJ">FEHLER</A><DD>
<DT id="24"><A HREF="#lbAK">AUTOR</A><DD>
<DT id="25"><A HREF="#lbAL">AUTOREN DER HANDBUCHSEITE</A><DD>
<DT id="26"><A HREF="#lbAM">&Uuml;BERSETZUNG</A><DD>
<DT id="27"><A HREF="#lbAN">AUTOREN</A><DD>
<DT id="28"><A HREF="#lbAO">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:58 GMT, March 31, 2021
</BODY>
</HTML>
