
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-KEY</TITLE>
</HEAD><BODY>
<H1>APT-KEY</H1>
Section: APT (8)<BR>Updated: 04&nbsp;April&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-key - APT-Schl&uuml;sselverwaltungsdienstprogramm
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<DL COMPACT>
<DT id="1">
<B>apt-key</B> [<B>--keyring&nbsp;</B><B></B><I>Dateiname</I>] {add&nbsp;<I>Dateiname</I> | del&nbsp;<I>Schl&uuml;sselkennung</I> | export&nbsp;<I>Schl&uuml;sselkennung</I> | exportall | list | finger | adv | update | net-update | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

<B>apt-key</B>
<DD>wird benutzt, um eine Liste von Schl&uuml;sseln zu verwalten, die APT benutzt, um Pakete zu authentifizieren. Pakete, die durch Benutzung dieser Schl&uuml;ssel authentifiziert wurden, werden als vertrauensw&uuml;rdig betrachtet.
<P>

Falls die Benutzung von
<B>apt-key</B>
gew&uuml;nscht wird, beachten Sie, dass die Installation der GNU-Privacy-Guard-Programmsammlung (paketiert in
gnupg) erforderlich ist. Allein aus diesem Grund wird vom programmatischen Gebrauch (insbesondere in Betreuerskripten) eindringlich abgeraten. Dar&uuml;berhinaus ist das Ausgabeformat aller Befehle undefiniert und kann und wird sich immer dann &auml;ndern, wenn sich die darunterliegenden Befehle &auml;ndern.
<B>apt-key</B>
wird versuchen, derartige Benutzung zu erkennen und in diesen F&auml;llen Warnungen auf der Standardfehlerausgabe erzeugen.
<A NAME="lbAE">&nbsp;</A>
<H2>UNTERST&Uuml;TZTE SCHL&Uuml;SSELBUNDDATEIEN</H2>

<P>

Apt-key unterst&uuml;tzt als Voreinstellung f&uuml;r Schl&uuml;sselbunddateien nur das bin&auml;re OpenPGP-Format (auch als &ouml;ffentlicher GPG-Schl&uuml;sselbund bekannt) in den Dateien mit der Erweiterung &raquo;gpg&laquo;, nicht das Schl&uuml;sselkastendatenbankformat, das in neueren
<B><A HREF="/cgi-bin/man/man2html?1+gpg">gpg</A></B>(1)-Versionen eingef&uuml;hrt wurde. Daher sollten bin&auml;re Schl&uuml;sselbunddateien, die mit allen APT-Versionen benutzt werden sollen, immer mit
<B>gpg --export</B>
erstellt werden.
<P>

Falls auf allen Systeme, die den erzeugten Schl&uuml;sselbund verwenden sollen, mindestens eine APT-Version &gt;= 1.4 installiert ist, k&ouml;nnen Sie alternativ das ASCII-gesch&uuml;tzte Format mit der Erweiterung &raquo;asc&laquo; verwenden, das mit
<B>gpg --armor --export</B>
erstellt wird.
<A NAME="lbAF">&nbsp;</A>
<H2>BEFEHLE</H2>

<P>

<B>add</B> <B></B><I>Dateiname</I>
<DL COMPACT><DT id="2"><DD>
f&uuml;gt einen neuen Schl&uuml;ssel zur Liste der vertrauensw&uuml;rdigen Schl&uuml;ssel hinzu. Der Schl&uuml;ssel wird aus
<I>Dateiname</I>
gelesen oder, wenn der Dateiname
-
ist, von der Standardeingabe.
<P>
Es ist kritisch, dass &uuml;berpr&uuml;ft wird, ob diese manuell per
<B>apt-key</B>
hinzugef&uuml;gten Schl&uuml;ssel wirklich dem Eigent&uuml;mer des Depots geh&ouml;ren, andernfalls wird die
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)-Infrastruktur komplett ausgeh&ouml;hlt.
<P>
<I>Hinweis</I>: Anstatt diesen Befehl zu benutzen, sollte ein Schl&uuml;sselbund mit einem aussagekr&auml;ftigen Namen und entweder &raquo;gpg&laquo; oder &raquo;asc&laquo; als Dateinamenserweiterung direkt im Verzeichnis
/etc/apt/trusted.gpg.d/
abgelegt werden.
</DL>

<P>

<B>del</B> <B></B><I>Schl&uuml;sselkennung</I>
<DL COMPACT><DT id="3"><DD>
entfernt einen Schl&uuml;ssel aus der Liste der vertrauensw&uuml;rdigen Schl&uuml;ssel.
</DL>

<P>

<B>export</B> <B></B><I>Schl&uuml;sselkennung</I>
<DL COMPACT><DT id="4"><DD>
gibt den Schl&uuml;ssel
<I>Schl&uuml;sselkennung</I>
auf der Standardausgabe aus.
</DL>

<P>

<B>exportall</B>
<DL COMPACT><DT id="5"><DD>
gibt alle vertrauensw&uuml;rdigen Schl&uuml;ssel auf der Standardausgabe aus.
</DL>

<P>

<B>list</B>, <B>finger</B>
<DL COMPACT><DT id="6"><DD>
listet vertrauensw&uuml;rdige Schl&uuml;ssel mit Fingerabdr&uuml;cken auf.
</DL>

<P>

<B>adv</B>
<DL COMPACT><DT id="7"><DD>
reicht erweiterte Optionen an GPG weiter. Mit
<B>adv --recv-key</B>
k&ouml;nnen Sie z.B. Schl&uuml;ssel direkt vom Schl&uuml;sselserver in Ihre vertrauensw&uuml;rdige Schl&uuml;sselsammlung herunterladen. Beachten Sie, dass dabei
<I>keine</I>
Pr&uuml;fungen durchgef&uuml;hrt werden. Es ist daher einfach, die
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)-Infrastruktur komplett auszuh&ouml;hlen, falls dies ohne Sorgfalt benutzt wird.
</DL>

<P>

<B>update</B> (missbilligt)
<DL COMPACT><DT id="8"><DD>
aktualisiert den lokalen Schl&uuml;sselbund mit dem Archivschl&uuml;sselbund und entfernt die Archivschl&uuml;ssel, die nicht l&auml;nger g&uuml;ltig sind, aus dem lokalen Schl&uuml;sselbund. Der Archivschl&uuml;sselbund wird im Paket
archive-keyring
Ihrer Distribution mitgeliefert, z.B. dem Paket
ubuntu-keyring
in Ubuntu.
<P>
Beachten Sie, dass eine Distribution diesen Befehl nicht ben&ouml;tigt und tats&auml;chlich nicht l&auml;nger nutzen sollte. Sie sollte stattdessen Schl&uuml;sselbunddateien im Verzeichnis
/etc/apt/trusted.gpg.d/
direkt mitliefern, da dies eine Abh&auml;ngigkeit von
gnupg
vermeidet und die Verwaltung von Schl&uuml;sseln durch einfaches Hinzuf&uuml;gen und Entfernen von Dateien f&uuml;r Paketbetreuer und Benutzer gleicherma&szlig;en erleichtert.
</DL>

<P>

<B>net-update</B>
<DL COMPACT><DT id="9"><DD>
funktioniert &auml;hnlich dem vorhergehenden Befehl
<B>update</B>, bezieht aber den Archivschl&uuml;sselbund stattdessen von einem URI und best&auml;tigt ihn anhand eines Master-Schl&uuml;ssels. Dies erfordert ein installiertes
<B><A HREF="/cgi-bin/man/man2html?1+wget">wget</A></B>(1)
und eine derart gebautes APT, bei dem ein Server konfiguriert ist, um den Master-Schl&uuml;sselbund zur Best&auml;tigung abzuholen. APT unterst&uuml;tzt in Debian diesen Befehl nicht und beruht stattdessen auf
<B>update</B>, in Ubuntu funktioniert dies aber.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Beachten Sie, dass Optionen vor den im vorherigen Abschnitt beschriebenen Befehlen definiert sein m&uuml;ssen.
<P>

<B>--keyring</B> <B></B><I>Dateiname</I>
<DL COMPACT><DT id="10"><DD>
Mit dieser Option ist es m&ouml;glich, eine spezielle Schl&uuml;sselbunddatei anzugeben, mit der der Befehl arbeitet. Vorgabe ist, dass ein Befehl mit der Datei
trusted.gpg
ausgef&uuml;hrt wird, ebenso wie alle Teile im Verzeichnis
trusted.gpg.d, wobei
trusted.gpg
der prim&auml;re Schl&uuml;sselbund wird, d.h. neue Schl&uuml;ssel werden zu diesem hinzugef&uuml;gt.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>DATEIEN</H2>

<P>

/etc/apt/trusted.gpg
<DL COMPACT><DT id="11"><DD>
Schl&uuml;sselbund lokaler vertrauensw&uuml;rdiger Schl&uuml;ssel, neue Schl&uuml;ssel werden hier hinzugef&uuml;gt. Konfigurationselement:
Dir::Etc::Trusted.
</DL>

<P>

/etc/apt/trusted.gpg.d/
<DL COMPACT><DT id="12"><DD>
Dateifragmente f&uuml;r vertrauensw&uuml;rdige Schl&uuml;ssel, zus&auml;tzliche Schl&uuml;sselbunde k&ouml;nnen hier (von anderen Paketen oder dem Administrator) gespeichert werden. Konfigurationselement:
Dir::Etc::TrustedParts.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
<A NAME="lbAJ">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTOR</H2>

<P>

APT wurde vom APT-Team geschrieben
&lt;<A HREF="mailto:apt@packages.debian.org">apt@packages.debian.org</A>&gt;.
<A NAME="lbAL">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAM">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="13"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="14"><DD>
</DL>

<A NAME="lbAN">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="15"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="16"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="17"><A HREF="#lbAB">NAME</A><DD>
<DT id="18"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="19"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="20"><A HREF="#lbAE">UNTERST&Uuml;TZTE SCHL&Uuml;SSELBUNDDATEIEN</A><DD>
<DT id="21"><A HREF="#lbAF">BEFEHLE</A><DD>
<DT id="22"><A HREF="#lbAG">OPTIONEN</A><DD>
<DT id="23"><A HREF="#lbAH">DATEIEN</A><DD>
<DT id="24"><A HREF="#lbAI">SIEHE AUCH</A><DD>
<DT id="25"><A HREF="#lbAJ">FEHLER</A><DD>
<DT id="26"><A HREF="#lbAK">AUTOR</A><DD>
<DT id="27"><A HREF="#lbAL">&Uuml;BERSETZUNG</A><DD>
<DT id="28"><A HREF="#lbAM">AUTOREN</A><DD>
<DT id="29"><A HREF="#lbAN">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:58 GMT, March 31, 2021
</BODY>
</HTML>
