
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CACHE</TITLE>
</HEAD><BODY>
<H1>APT-CACHE</H1>
Section: APT (8)<BR>Updated: 04&nbsp;April&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-cache - den APT-Zwischenspeicher abfragen
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cache</B> [<B>-agipns</B>] [<B>-o=</B><B></B><I>Konfigurationszeichenkette</I>] [<B>-c=</B><B></B><I>Konfigurationsdatei</I>] {gencaches | showpkg&nbsp;<I>Paket</I>...  | showsrc&nbsp;<I>Paket</I>...  | stats | dump | dumpavail | unmet | search&nbsp;<I>regul&auml;rer_Ausdruck</I>...  | show&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | depends&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | rdepends&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | pkgnames&nbsp;[<I>Pr&auml;fix</I>]  | dotty&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | xvcg&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | policy&nbsp;[<I>Paket</I>...]  | madison&nbsp;<I>Paket</I>...  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

<B>apt-cache</B>
<DD>f&uuml;hrt eine Vielzahl von Aktionen auf dem Paketzwischenspeicher von APT durch.
<B>apt-cache</B>
ver&auml;ndert nicht den Status des Systems, stellt aber Aktionen zum Suchen und Erzeugen von interessanten Ausgaben der Paket-Metadaten bereit. Die Metadaten werden mittels des Befehls &raquo;update&laquo; z.B. von
<B>apt-get</B>
beschafft und aktualisiert, so dass sie veraltet sein k&ouml;nnen, falls die letzte Aktualisierung zu lange her ist. Im Gegenzug funktioniert
<B>apt-cache</B>
unabh&auml;ngig davon, ob die konfigurierten Quellen verf&uuml;gbar sind (z.B. offline).
<P>

Sofern nicht die
<B>-h</B>-, oder
<B>--help</B>-Option angegeben ist, muss einer der nachfolgend aufgef&uuml;hrten Befehle vorkommen.
<P>

<B>gencaches</B>
<DL COMPACT><DT id="2"><DD>
gencaches
erzeugt den Paketzwischenspeicher von APT. Dies wird implizit durch alle Befehle erledigt, die diesen Zwischenspeicher ben&ouml;tigen, falls er fehlt oder veraltet ist.
</DL>

<P>

<B>showpkg</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="3"><DD>
showpkg
zeigt Informationen &uuml;ber die auf der Befehlszeile aufgelisteten Pakete. Die &uuml;brigen Argumente sind Paketnamen. Die verf&uuml;gbaren Versionen und R&uuml;ckw&auml;rtsabh&auml;ngigkeiten jedes aufgef&uuml;hrten Paketes werden ebenso aufgelistet, wie die Vorw&auml;rtsabh&auml;ngigkeiten jeder Version. Vorw&auml;rtsabh&auml;ngigkeiten (normale Abh&auml;ngigkeiten) sind jene Pakete, von denen das betreffende Paket abh&auml;ngt. R&uuml;ckw&auml;rtsabh&auml;ngigkeiten sind jene Pakete, die von dem betreffenden Paket abh&auml;ngen. Deshalb m&uuml;ssen Vorw&auml;rtsabh&auml;ngigkeiten f&uuml;r das Paket erf&uuml;llt werden, R&uuml;ckw&auml;rtsabh&auml;ngigkeiten allerdings nicht.
<B>apt-cache showpkg libreadline2</B>
w&uuml;rde zum Beispiel eine Ausgabe &auml;hnlich der folgenden erzeugen:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Package: libreadline2
Versions: 2.1-12(/var/state/apt/lists/foo_Packages),
Reverse Depends: 
  libreadlineg2,libreadline2
  libreadline2-altdev,libreadline2
Dependencies:
2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null))
Provides:
2.1-12 - 
Reverse Provides: 
</PRE>

</DL>




Dadurch wird sichtbar, dass libreadline2, Version 2.1-12, von libc5 und ncurses3.0 abh&auml;ngt, die installiert sein m&uuml;ssen, damit libreadline2 funktioniert. libreadlineg2 und libreadline2-altdev h&auml;ngen wiederum von libreadline2 ab. Wenn libreadline2 installiert ist, m&uuml;ssen au&szlig;erdem libc5 und ncurses3.0 (und ldso) installiert sein, libreadlineg2 und libreadline2-altdev nicht. F&uuml;r die spezielle Bedeutung der restlichen Ausgabe ist es am besten, den APT-Quelltext zu konsultieren.
</DL>

<P>

<B>stats</B>
<DL COMPACT><DT id="5"><DD>
stats
zeigt einige Statistiken &uuml;ber den Zwischenspeicher. Es werden keine weiteren Argumente erwartet. Berichtete Statistiken sind:
<P>
<DL COMPACT><DT id="6"><DD>
&bull;


Gesamtzahl der Paketnamen
ist die Gesamtzahl der im Zwischenspeicher gefundenen Pakete.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Gew&ouml;hnliche Pakete
ist die Anzahl der regul&auml;ren, gew&ouml;hnlichen Paketnamen. Diese sind Pakete, die eine Eins-zu-Eins-Entsprechung zwischen ihren Namen und den Namen, die andere Pakete f&uuml;r ihre Abh&auml;ngigkeiten benutzen, tragen. Die Mehrzahl der Pakete f&auml;llt in diese Kategorie.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Rein virtuelle Pakete
ist die Anzahl der Pakete, die nur als ein virtueller Paketname existieren. Das kommt vor, wenn Pakete nur den virtuellen Paketnamen &raquo;bereitstellen&laquo; und aktuell kein Paket den Namen benutzt. Zum Beispiel ist im Debian-GNU/Linux-System &raquo;mail-transport-agent&laquo; ein rein virtuelles Paket. Mehrere Pakete stellen &raquo;mail-transport-agent&laquo; bereit, aber es gibt kein Paket mit dem Namen &raquo;mail-transport-agent&laquo;.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Eeinzelne virtuelle Pakete
ist die Anzahl der Pakete mit nur einem Paket, das ein bestimmtes virtuelles Paket bereitstellt. &raquo;X11-text-viewer&laquo; ist zum Beispiel im Debian-GNU/Linux-System ein virtuelles Paket, aber nur ein Paket, xless, stellt &raquo;X11-text-viewer&laquo; bereit.
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Gemischte virtuelle Pakete
ist die Anzahl der Pakete, die entweder ein bestimmtes virtuelles Paket bereitstellen oder den virtuellen Paketnamen als Paketnamen haben. &raquo;debconf&laquo; ist zum Beispiel sowohl ein tats&auml;chliches Paket, wird aber auch vom Paket debconf-tiny bereitgestellt.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


Fehlend
ist die Anzahl der Paketnamen, auf die eine Abh&auml;ngigkeit verweist, die aber von keinem Paket bereitgestellt wird. Fehlende Pakete k&ouml;nnten auftauchen, wenn nicht auf eine vollst&auml;ndige Distribution zugegriffen oder ein (echtes oder virtuelles) Paket aus einer Distribution entfernt wurde. Normalerweise wird auf sie von Conflicts oder Breaks-Angaben Bezug genommen.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


Gesamtzahl an unterschiedlichen
Versionen ist die Anzahl der im Zwischenspeicher gefundenen Paketversionen. Wenn auf mehr als eine Distribution zugegriffen wird (zum Beispiel Stable und Unstable), kann dieser Wert deutlich gr&ouml;&szlig;er als die gesamte Anzahl der Paketnamen sein.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Gesamtzahl an Abh&auml;ngigkeiten
ist die Anzahl der Abh&auml;ngigkeitsbeziehungen, den alle Pakete im Zwischenspeicher beanspruchen.
</DL>

<P>
</DL>

<P>

<B>showsrc</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="14"><DD>
showsrc
zeigt alle Quellpaketdatens&auml;tze, die den angegebenen Paketnamen entsprechen. Alle Versionen werden ebenso angezeigt, wie alle Datens&auml;tze, die den Namen f&uuml;r ein Bin&auml;rpaket angeben. Verwenden Sie die Option
<B>--only-source</B>, um nur Quellpaketnamen anzuzeigen.
</DL>

<P>

<B>dump</B>
<DL COMPACT><DT id="15"><DD>
dump
zeigt eine kurze Programmauflistung von jedem Paket im Zwischenspeicher. Es dient in erster Linie der Fehlersuche.
</DL>

<P>

<B>dumpavail</B>
<DL COMPACT><DT id="16"><DD>
dumpavail
gibt eine Liste der verf&uuml;gbaren Pakete auf der Standardausgabe aus. Dies ist f&uuml;r die Benutzung mit
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
geeignet und wird von der
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)-Methode benutzt.
</DL>

<P>

<B>unmet</B>
<DL COMPACT><DT id="17"><DD>
unmet
zeigt die Zusammenfassung aller unerf&uuml;llten Abh&auml;ngigkeiten im Paketzwischenspeicher.
</DL>

<P>

<B>show</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="18"><DD>
show
f&uuml;hrt eine Funktion aus, die
<B>dpkg --print-avail</B>
&auml;hnlich ist. Es zeigt die Paketdatens&auml;tze f&uuml;r die genannten Pakete.
</DL>

<P>

<B>search</B> <B></B><I>regul&auml;rer_Ausdruck</I><B>...</B>
<DL COMPACT><DT id="19"><DD>
search
f&uuml;hrt eine Volltextsuche in der Liste aller verf&uuml;gbaren Pakete f&uuml;r das angegebene regul&auml;re Muster gem&auml;&szlig; POSIX durch, siehe
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7). Es durchsucht die Paketnamen und die Beschreibungen nach einem Vorkommen des regul&auml;ren Ausdrucks und gibt den Paketnamen mit einer kurzen Beschreibung, einschlie&szlig;lich virtueller Paketnamen, aus. Wenn
<B>--full</B>
angegeben wurde, ist die Ausgabe gleich der, die
show
f&uuml;r jedes passende Paket erzeugt. Wenn
<B>--names-only</B>
angegeben wurde, wird die lange Beschreibung nicht durchsucht, sondern nur der Paketname und die bereitgestellten Pakete.
<P>
Separate Argumente k&ouml;nnen benutzt werden, um mehrere Suchmuster anzugeben, die &raquo;und&laquo;-verkn&uuml;pft werden.
</DL>

<P>

<B>depends</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="20"><DD>
depends
zeigt eine Liste von jeder Abh&auml;ngigkeit, die ein Paket hat und alle m&ouml;glichen anderen Pakete, die die Abh&auml;ngigkeit erf&uuml;llen k&ouml;nnen.
</DL>

<P>

<B>rdepends</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="21"><DD>
rdepends
zeigt eine Liste von jeder R&uuml;ckw&auml;rtsabh&auml;ngigkeit, die ein Paket hat.
</DL>

<P>

<B>pkgnames</B> [<I>Pr&auml;fix</I>]
<DL COMPACT><DT id="22"><DD>
Dieser Befehl gibt den Namen jedes Paketes aus, das APT kennt. Das optionale Argument ist ein passendes Pr&auml;fix, um die Namensliste zu filtern. Die Ausgabe ist f&uuml;r die Benutzung in der Tabulatorvervollst&auml;ndigung in der Shell geeignet. Die Ausgabe wird extrem schnell generiert. Dieser Befehl wird am besten mit der
<B>--generate</B>-Option benutzt.
<P>
Beachten Sie, dass ein Paket, das APT kennt, nicht notwendigerweise zum Herunterladen verf&uuml;gbar, installierbar oder installiert ist, virtuelle Pakete sind z.B. auch in der generierten Liste aufgef&uuml;hrt.
</DL>

<P>

<B>dotty</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="23"><DD>
dotty
nimmt eine Paketliste auf der Befehlszeile entgegen und generiert eine Ausgabe, die f&uuml;r die Benutzung durch dotty aus dem Paket
m[blue]<B>GraphViz</B>m[]<FONT SIZE="-2">[1]</FONT>
geeignet ist. Das Ergebnis ist eine Zusammenstellung von Knoten und Kanten, die die Beziehung zwischen Paketen darstellen. Standardm&auml;&szlig;ig werden alle abh&auml;ngigen Pakete ausfindig gemacht. Dies kann zu einem sehr gro&szlig;en Schaubild f&uuml;hren. Um die Ausgabe auf die Pakete zu beschr&auml;nken, die auf der Befehlszeile eingegeben wurden, setzen Sie die Option
APT::Cache::GivenOnly.
<P>
Die resultierenden Knoten haben mehrere Formen: Normale Pakete sind K&auml;stchen, rein virtuelle Pakete sind Dreiecke, gemischt virtuelle Pakete sind Rauten, fehlende Pakete sind Sechsecke. Orange K&auml;stchen bedeuten, dass die Rekursion beendet wurde (Pakete auf Bl&auml;ttern), blaue Linien sind Vorabh&auml;ngigkeiten, gr&uuml;ne Linien sind Konflikte.
<P>
Vorsicht, dotty kann keine gr&ouml;&szlig;eren Zusammenstellungen von Paketen grafisch darstellen.
</DL>

<P>

<B>xvcg</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="24"><DD>
Das gleiche wie
dotty, nur f&uuml;r xvcg vom
m[blue]<B>VCG-Werkzeug</B>m[]<FONT SIZE="-2">[2]</FONT>.
</DL>

<P>

<B>policy</B> [<I>Paket</I>...]
<DL COMPACT><DT id="25"><DD>
policy
ist dazu gedacht, bei Fragen der Fehlersuche, die sich auf die Einstellungsdatei beziehen, zu helfen. Ohne Argumente gibt es die Priorit&auml;ten von jeder Quelle aus. Ansonsten gibt es umfangreiche Informationen &uuml;ber die Priorit&auml;tenauswahl der genannten Pakete aus.
</DL>

<P>

<B>madison</B> <B></B><I>Paket</I><B>...</B>
<DL COMPACT><DT id="26"><DD>
apt-caches
madison-Befehl versucht, das Ausgabeformat und eine Untermenge der Funktionalit&auml;t des Debian-Archivververwaltungswerkzeuges
madison
nachzuahmen. Es zeigt verf&uuml;gbare Versionen eines Pakets in Tabellenform. Anders als das eigentliche
madison
kann es nur Informationen f&uuml;r die Architektur anzeigen, f&uuml;r die APT Paketlisten heruntergeladen hat (APT::Architecture).
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Alle Befehlszeilenoptionen k&ouml;nnen durch die Konfigurationsdatei gesetzt werden, die Beschreibung gibt die zu setzende Option an. F&uuml;r boolesche Optionen k&ouml;nnen Sie die Konfigurationsdatei au&szlig;er Kraft setzen, indem Sie etwas der Art
<B>-f-</B>,
<B>--no-f</B>,
<B>-f=no</B>
oder etliche weitere Varianten benutzen.
<P>

<B>-p</B>, <B>--pkg-cache</B>
<DL COMPACT><DT id="27"><DD>
w&auml;hlt die Datei zum Speichern des Paketzwischenspeichers. Der Paketzwischenspeicher ist der prim&auml;re Zwischenspeicher, der von allen Aktionen benutzt wird. Konfigurationselement:
Dir::Cache::pkgcache.
</DL>

<P>

<B>-s</B>, <B>--src-cache</B>
<DL COMPACT><DT id="28"><DD>
w&auml;hlt die Datei zum Speichern des Quellenzwischenspeichers. Die Quelle wird nur von
gencaches
benutzt und sie speichert eine ausgewertete Version der Paketinformationen von entfernt liegenden Quellen. Wenn der Paketzwischenspeicher gebildet wird, wird der Quellenzwischenspeicher benutzt, um ein erneutes Auswerten aller Paketdateien zu vermeiden. Konfigurationselement:
Dir::Cache::srcpkgcache.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="29"><DD>
still; erzeugt eine Ausgabe, die f&uuml;r Protokollierung geeignet ist und Fortschrittsanzeiger wegl&auml;sst. Mehr &raquo;q&laquo;s unterdr&uuml;cken mehr Ausgaben, bis zu einem Maximum von 2. Sie k&ouml;nnen au&szlig;erdem
<B>-q=#</B>
benutzen, um die Stillestufe zu setzen, was die Konfigurationsdatei au&szlig;er Kraft setzt. Konfigurationselement:
quiet.
</DL>

<P>

<B>-i</B>, <B>--important</B>
<DL COMPACT><DT id="30"><DD>
nur wichtige Abh&auml;ngigkeiten ausgeben. Zur Benutzung mit
unmet
und
depends. Veranlasst, dass nur Depends- und Pre-Depends-Beziehungen ausgegeben werden. Konfigurationselement:
APT::Cache::Important.
</DL>

<P>

<B>--no-pre-depends</B>, <B>--no-depends</B>, <B>--no-recommends</B>, <B>--no-suggests</B>, <B>--no-conflicts</B>, <B>--no-breaks</B>, <B>--no-replaces</B>, <B>--no-enhances</B>
<DL COMPACT><DT id="31"><DD>
Standardm&auml;&szlig;ig geben
<B>depends</B>
und
<B>rdepends</B>
alle Abh&auml;ngigkeiten aus. Dies kann mit diesen Schaltern optimiert werden, die den angegebenen Abh&auml;ngigkeitstyp weglassen. Konfigurationselement:
APT::Cache::Show<I>Abh&auml;ngigkeitstyp</I>
z.B.
APT::Cache::ShowRecommends.
</DL>

<P>

<B>--implicit</B>
<DL COMPACT><DT id="32"><DD>
Standardm&auml;&szlig;ig geben
<B>depends</B>
und
<B>rdepends</B>
nur Abh&auml;ngigkeiten aus, die explizit in den Metadaten angegeben werden. Mit diesem Schalter werden auch Abh&auml;ngigkeiten angezeigt, die implizit basierend auf den vorgefundenen Daten hinzugef&uuml;gt werden. Ein
Conflicts: foo
sagt z.B. implizit, dass dieses Paket auch einen Konflikt mit dem Paket &raquo;foo&laquo; von jeder anderen Architektur hat. Konfigurationselement:
APT::Cache::ShowImplicit.
</DL>

<P>

<B>-f</B>, <B>--full</B>
<DL COMPACT><DT id="33"><DD>
gibt die vollst&auml;ndigen Paketdatens&auml;tze beim Suchen aus. Konfigurationselement:
APT::Cache::ShowFull.
</DL>

<P>

<B>-a</B>, <B>--all-versions</B>
<DL COMPACT><DT id="34"><DD>
gibt die vollst&auml;ndigen Datens&auml;tze f&uuml;r alle verf&uuml;gbaren Versionen aus. Dies ist die Vorgabe. Um sie auszuschalten, benutzen Sie
<B>--no-all-versions</B>. Wenn
<B>--no-all-versions</B>
angegeben ist, wird nur die Anw&auml;rterversion angezeigt (die, die zur Installation ausgew&auml;hlt w&uuml;rde). Diese Option ist nur f&uuml;r den
show-Befehl anwendbar. Konfigurationselement:
APT::Cache::AllVersions.
</DL>

<P>

<B>-g</B>, <B>--generate</B>
<DL COMPACT><DT id="35"><DD>
f&uuml;hrt das Neuerstellen des Paketzwischenspeichers aus, anstatt den Zwischenspeicher so zu benutzen, wie er ist. Das ist die Vorgabe. Um sie auszuschalten, benutzen Sie
<B>--no-generate</B>. Konfigurationselement:
APT::Cache::Generate.
</DL>

<P>

<B>--names-only</B>, <B>-n</B>
<DL COMPACT><DT id="36"><DD>
durchsucht nur das Paket und die bereitgestellten Paketnamen, nicht die Langbeschreibungen. Konfigurationselement:
APT::Cache::NamesOnly.
</DL>

<P>

<B>--all-names</B>
<DL COMPACT><DT id="37"><DD>
l&auml;sst
pkgnames
alle Namen, einschlie&szlig;lich virtueller Pakete und fehlender Abh&auml;ngigkeiten, ausgeben. Konfigurationselement:
APT::Cache::AllNames.
</DL>

<P>

<B>--recurse</B>
<DL COMPACT><DT id="38"><DD>
macht
depends
und
rdepends
rekursiv, so dass alle erw&auml;hnten Pakete einmal ausgegeben werden. Konfigurationselement:
APT::Cache::RecurseDepends.
</DL>

<P>

<B>--installed</B>
<DL COMPACT><DT id="39"><DD>
begrenzt die Ausgabe von
depends
und
rdepends
auf Pakete, die aktuell installiert sind. Konfigurationselement:
APT::Cache::Installed.
</DL>

<P>

<B>--with-source</B> <B></B><I>Dateiname</I>
<DL COMPACT><DT id="40"><DD>
f&uuml;gt die angegebene Datei als Quelle f&uuml;r Metadaten hinzu. Dies kann wiederholt werden, um mehrere Dateien hinzuzuf&uuml;gen. Unterst&uuml;tzt werden derzeit
*.deb-,
*.dsc-,
*.changes-,
Sources- und
Packages-Dateien sowie Quellpaketverzeichnisse. Dateien werden nur basierend auf ihren Dateinamen abgeglichen, nicht auf ihrem Inhalt!
<P>
Sources
und
Packages
k&ouml;nnen in jedes von APT unterst&uuml;tzte Format komprimiert werden, so lange sie die korrekte Erweiterung haben. Falls Sie mehrere dieser Dateien in einem Verzeichnis speichern m&uuml;ssen, k&ouml;nnen Sie einen Namen Ihrer Wahl, bei dem das letzte Zeichen ein Unterstrich (&raquo;_&laquo;) ist, voranstellen. Beispiel: mein.beispiel_Packages.xz
<P>
Beachten Sie, dass diese Quellen als vertrauensw&uuml;rdig angesehen werden (siehe
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)). Konfigurationselement:
APT::Sources::With.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="41"><DD>
eine kurze Aufrufzusammenfassung zeigen
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="42"><DD>
die Version des Programms anzeigen
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="43"><DD>
Konfigurationsdatei; hiermit wird die zu verwendende Konfigurationssdatei angegeben. Das Programm wird die Vorgabe-Konfigurationsdatei und dann diese Konfigurationsdatei lesen. Falls Konfigurationseinstellungen vor der Vorgabe-Konfiguration ausgewertet werden m&uuml;ssen, geben Sie eine Datei in der Umgebungsvariable
<B>APT_CONFIG</B>
an. Lesen Sie
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5), um Syntax-Informationen zu erhalten.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="44"><DD>
eine Konfigurationsoption setzen; hiermit wird eine beliebige Konfigurationsoption gesetzt. Die Syntax lautet
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
und
<B>--option</B>
kann mehrfach benutzt werden, um verschiedene Optionen zu setzen.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>DATEIEN</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="45"><DD>
Orte, von denen Pakete geladen werden. Konfigurationselement:
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="46"><DD>
Dateifragmente f&uuml;r Orte, von denen Pakete geladen werden. Konfigurationselement:
Dir::Etc::SourceParts.
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="47"><DD>
Speicherbereich f&uuml;r Statusinformationen jeder in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
angegebenen Paketquelle Konfigurationselement:
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="48"><DD>
Speicherbereich f&uuml;r Statusinformationen auf dem Transportweg. Konfigurationselement:
Dir::State::Lists
(partial
wird implizit angeh&auml;ngt)
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGNOSE</H2>

<P>

<B>apt-cache</B>
gibt bei normalen Aktionen 0 zur&uuml;ck, dezimal 100 bei Fehlern.
<A NAME="lbAI">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[3]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAJ">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="49"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="50"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="51"> 1.<DD>
GraphViz
<DL COMPACT><DT id="52"><DD>
<A HREF="http://www.research.att.com/sw/tools/graphviz/">http://www.research.att.com/sw/tools/graphviz/</A>
</DL>

<DT id="53"> 2.<DD>
VCG-Werkzeug
<DL COMPACT><DT id="54"><DD>
<A HREF="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html</A>
</DL>

<DT id="55"> 3.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="56"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="57"><A HREF="#lbAB">NAME</A><DD>
<DT id="58"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="59"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="60"><A HREF="#lbAE">OPTIONEN</A><DD>
<DT id="61"><A HREF="#lbAF">DATEIEN</A><DD>
<DT id="62"><A HREF="#lbAG">SIEHE AUCH</A><DD>
<DT id="63"><A HREF="#lbAH">DIAGNOSE</A><DD>
<DT id="64"><A HREF="#lbAI">FEHLER</A><DD>
<DT id="65"><A HREF="#lbAJ">&Uuml;BERSETZUNG</A><DD>
<DT id="66"><A HREF="#lbAK">AUTOREN</A><DD>
<DT id="67"><A HREF="#lbAL">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:58 GMT, March 31, 2021
</BODY>
</HTML>
