
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT</TITLE>
</HEAD><BODY>
<H1>APT</H1>
Section: APT (8)<BR>Updated: 05&nbsp;April&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt - Befehlszeilenschnittstelle
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<DL COMPACT>
<DT id="1">
<B>apt</B> [<B>-h</B>] [<B>-o=</B><B></B><I>Konfigurationszeichenkette</I>] [<B>-c=</B><B></B><I>Konfigurationsdatei</I>] [<B>-t=</B><B></B><I>Ziel-Release</I>] [<B>-a=</B><B></B><I>Architektur</I>] {list | search | show | update | install&nbsp;<I>Paket</I>&nbsp;[{=<I>Paketversionsnummer</I>&nbsp;|&nbsp;/<I>Ziel-Release</I>}]...  | remove&nbsp;<I>Paket</I>...  | upgrade | full-upgrade | edit-sources | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

<B>apt</B>
<DD>stellt eine hoch abstrahierte Befehlszeilenschnittstelle f&uuml;r das Paketverwaltungssystem zur Verf&uuml;gung. Es ist als Endanwenderschnittstelle gedacht und aktiviert verglichen mit spezialisierteren Werkzeugen wie
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
und
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
standardm&auml;&szlig;ig einige f&uuml;r den interaktiven Gebrauch besser geeignete Optionen.
<P>

Ganz wie
<B>apt</B>
selbst ist seine Handbuchseite als Endanwenderschnittstelle gedacht und erw&auml;hnt als solche nur die am h&auml;ufigsten benutzten Befehle sowie Optionen. Dies geschieht zum Teil, um keine Informationen an mehreren Stellen zu duplizieren und zum Teil, um Leser nicht mit einem &Uuml;berfluss an Optionen und Einzelheiten zu &uuml;berw&auml;ltigen.
<P>

<B>update</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8))
<DL COMPACT><DT id="2"><DD>
<B>update</B>
wird verwendet, um von allen konfigurierten Quellen Paketinformationen herunterzuladen. Andere Befehle arbeiten mit diesen Daten, zum Beispiel, um Paket-Upgrades durchzuf&uuml;hren oder um darin zu suchen und um Einzelheiten &uuml;ber alle zur Installation verf&uuml;gbaren Pakete anzuzeigen.
</DL>

<P>

<B>upgrade</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8))
<DL COMPACT><DT id="3"><DD>
upgrade
wird verwendet, um verf&uuml;gbare Upgrades f&uuml;r alle derzeit auf dem System installierten Pakete von den in der
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
konfigurierten Quellen zu installieren. Neue Pakete werden installiert, falls dies n&ouml;tig ist, um Abh&auml;ngigkeiten zu erf&uuml;llen, existierende werden jedoch nie entfernt. Falls das Upgrade f&uuml;r ein Paket verlangt, dass ein installiertes Paket entfernt wird, wird dieses Upgrade nicht durchgef&uuml;hrt.
</DL>

<P>

<B>full-upgrade</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8))
<DL COMPACT><DT id="4"><DD>
full-upgrade
verrichtet die Funktion von &raquo;upgrade&laquo;, wird aber auch installierte Pakete entfernen, falls dies erforderlich ist, um ein Upgrade des Systems als Ganzes durchzuf&uuml;hren.
</DL>

<P>

<B>install</B>, <B>reinstall</B>, <B>remove</B>, <B>purge</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8))
<DL COMPACT><DT id="5"><DD>
f&uuml;hrt die angefragte Aktion f&uuml;r eines oder mehrere Pakete durch, die &uuml;ber
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7),
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
oder exakten Treffer angegeben wurden. Die angefragte Aktion kann f&uuml;r spezielle Pakete au&szlig;er Kraft gesetzt werden, indem ein Plus (+) an den Paketnamen angeh&auml;ngt wird, um dieses Paket zu installieren oder ein Minus (-), um es zu entfernen.
<P>
Eine bestimmte Version eines Paketes kann durch den Paketnamen gefolgt von einem Gleichheitszeichen (=) und der Version des Paketes zur Installation ausgew&auml;hlt werden. Alternativ kann die Version aus einer bestimmten Ver&ouml;ffentlichung ausgew&auml;hlt werden, indem dem Paketnamen ein Vorw&auml;rtsschr&auml;gstrich und Codename ((buster, bullseye, sid ...) oder Name der Programmsammlung (stable, testing, unstable) folgt. Dies wird au&szlig;erdem Versionen aus dieser Ver&ouml;ffentlichung f&uuml;r Abh&auml;ngigkeiten dieses Pakets ausw&auml;hlen, falls dies zum Erf&uuml;llen der Anfrage n&ouml;tig ist.
<P>
Entfernen eines Pakets entfernt alle paketierten Daten, hinterl&auml;sst jedoch &uuml;blicherweise kleine (ver&auml;nderte) Benutzerkonfigurationsdateien f&uuml;r den Fall, dass das Entfernen unbeabsichtigt geschah. Das blo&szlig;e Eingeben einer Installationsanfrage f&uuml;r das versehentlich entfernte Paket wird seine Funktionen wieder so herstellen, wie sie vorher waren. Andererseits k&ouml;nnen Sie diese &Uuml;berbleibsel durch den Aufruf von
<B>purge</B>
loswerden, sogar bei bereits entfernten Paketen. Beachten Sie, dass dies keine Daten oder Konfigurationsdateien betrifft, die in Ihrem Home-Verzeichnis gespeichert sind.
</DL>

<P>

<B>autoremove</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8))
<DL COMPACT><DT id="6"><DD>
autoremove
wird benutzt, um Pakete zu entfernen, die automatisch installiert wurden, um Abh&auml;ngigkeiten f&uuml;r andere Pakete zu erf&uuml;llen und die nicht mehr ben&ouml;tigt werden, da sich die Abh&auml;ngigkeiten ge&auml;ndert haben oder die Pakete, die sie ben&ouml;tigten, in der Zwischenzeit entfernt wurden.
<P>
Sie sollten pr&uuml;fen, ob die Liste keine Anwendungen enth&auml;lt, die sie zu sch&auml;tzen gelernt haben, obwohl sie nur als Abh&auml;ngigkeit eines anderen Pakets installiert wurden. Sie k&ouml;nnen solch ein Paket mittels
<B><A HREF="/cgi-bin/man/man2html?8+apt-mark">apt-mark</A></B>(8)
als manuell installiert markieren. Pakete, die Sie explizit per
<B>install</B>
installiert haben, werden niemals zum automatischen Entfernen vorgeschlagen.
</DL>

<P>

<B>satisfy</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8))
<DL COMPACT><DT id="7"><DD>
<B>satisfy</B>
erf&uuml;llt Abh&auml;ngigkeitszeichenketten, wie sie in Build-Depends benutzt werden. Es handhabt auch Konflikte, indem es einem Argument ein
&quot;Conflicts: &quot;
voranstellt.
<P>
Beispiel:
apt satisfy &quot;foo, bar (&gt;= 1.0)&quot; &quot;Conflicts: baz, fuzz&quot;
</DL>

<P>

<B>search</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8))
<DL COMPACT><DT id="8"><DD>
<B>search</B>
kann zur Suche nach den angegebenen
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7)-Begriffen in der Liste verf&uuml;gbarer Pakete und zur Anzeige der Treffer benutzt werden. Dies kann z.B. n&uuml;tzlich sein, wenn Sie nach Paketen suchen, die eine bestimmte Funktionalit&auml;t bieten. Falls Sie nach einem Paket suchen, das eine bestimmte Datei enth&auml;lt, probieren Sie es mit
<B><A HREF="/cgi-bin/man/man2html?1+apt-file">apt-file</A></B>(1).
</DL>

<P>

<B>show</B> (<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8))
<DL COMPACT><DT id="9"><DD>
zeigt Informationen &uuml;ber die angegebenen Pakete einschlie&szlig;lich ihrer Abh&auml;ngigkeiten, Installations- und Herunterladegr&ouml;&szlig;e, Quellen, in denen das Paket verf&uuml;gbar ist, der Beschreibung des Paketinhalts und vieles mehr. Es kann z.B. hilfreich sein, einen Blick auf diese Informationen zu werfen, bevor Sie
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
gestatten, ein Paket zu entfernen oder wenn Sie neue Pakete zur Installation suchen.
</DL>

<P>

<B>list</B>
<DL COMPACT><DT id="10"><DD>
list
ist
<B>dpkg-query --list</B>
insofern ziemlich &auml;hnlich, als dass es eine Liste von Paketen anzeigen kann, die bestimmte Kriterien erf&uuml;llen. Es unterst&uuml;tzt
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)-Muster zum Abgleich von Paketnamen ebenso wie Optionen zum Auflisten von installierten (<B>--installed</B>) Versionen, solchen, von denen ein Upgrade durchgef&uuml;hrt werden kann (<B>--upgradeable</B>) oder allen verf&uuml;gbaren (<B>--all-versions</B>).
</DL>

<P>

<B>edit-sources</B> (in Arbeit)
<DL COMPACT><DT id="11"><DD>
edit-sources
erm&ouml;glicht die Bearbeitung Ihrer
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Dateien in Ihrem bevorzugten Texteditor und stellt au&szlig;erdem grundlegende Plausibilit&auml;tspr&uuml;fungen bereit.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>SKRIPTAUFRUF UND UNTERSCHIEDE ZU ANDEREN APT-WERKZEUGEN</H2>

<P>

Die
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)-Befehlszeile wurde als Endanwenderwerkzeug entworfen und kann bei Versionswechseln ihr Verhalten &auml;ndern. Obwohl sie versucht, nicht die Abw&auml;rtskompatibilit&auml;t zu besch&auml;digen, kann dies nicht garantiert werden, wenn eine &Auml;nderung vorteilhaft f&uuml;r den interaktiven Gebrauch zu sein scheint.
<P>

Alle Funktionalit&auml;ten von
<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
sind in APT-zugeh&ouml;rigen Werkzeugen wie
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
und
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
ebenfalls verf&uuml;gbar.<B><A HREF="/cgi-bin/man/man2html?8+apt">apt</A></B>(8)
&auml;ndert nur den Vorgabewert einiger Optionen (siehe
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
und insbesondere den Geltungsbereich des Programms). Daher sollten Sie vorzugsweise diese Befehle (unter Umst&auml;nden mit einigen zus&auml;tzlichen aktivierten Optionen) in Ihren Skripten verwenden, da sie die Abw&auml;rtskompatibilit&auml;t so weit wie m&ouml;glich aufrechterhalten.
<A NAME="lbAF">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8), die APT-Benutzeranleitung in /usr/share/doc/apt-doc/,
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5), das APT-Howto.
<A NAME="lbAG">&nbsp;</A>
<H2>DIAGNOSE</H2>

<P>

<B>apt</B>
gibt bei normalen Aktionen 0 zur&uuml;ck, dezimal 100 bei Fehlern.
<A NAME="lbAH">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAI">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAJ">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="12"><DD>
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="13"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NAME</A><DD>
<DT id="16"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="17"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="18"><A HREF="#lbAE">SKRIPTAUFRUF UND UNTERSCHIEDE ZU ANDEREN APT-WERKZEUGEN</A><DD>
<DT id="19"><A HREF="#lbAF">SIEHE AUCH</A><DD>
<DT id="20"><A HREF="#lbAG">DIAGNOSE</A><DD>
<DT id="21"><A HREF="#lbAH">FEHLER</A><DD>
<DT id="22"><A HREF="#lbAI">&Uuml;BERSETZUNG</A><DD>
<DT id="23"><A HREF="#lbAJ">AUTOR</A><DD>
<DT id="24"><A HREF="#lbAK">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:58 GMT, March 31, 2021
</BODY>
</HTML>
