
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-HTTP</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-HTTP</H1>
Section: APT (1)<BR>Updated: 11&nbsp;mai&nbsp;2018<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-transport-https - Le transport d'APT pour t&eacute;l&eacute;charger par HTTPS (protocole de transfert hypertexte s&eacute;curis&eacute;)
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Ce transport d'APT permet d'utiliser les d&eacute;p&ocirc;ts auxquels on acc&egrave;de au moyen de HTTPS (protocole HTTP Secure), aussi appel&eacute; HTTP sur TLS. Il est disponible par d&eacute;faut depuis apt&nbsp;1.5 et &eacute;tait disponible auparavant dans lepaquet
apt-transport-https. Veuillez noter qu'un transport n'est jamais appel&eacute; directement par l'utilisateur, maisutilis&eacute; par les outils d'APT s'appuyant sur la configuration de l'utilisateur.
<P>

HTTP est un protocole de transport non chiffr&eacute; (comparez avec
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)), qui, comme l'indique le S ajout&eacute;, est envelopp&eacute; dans une couche chiffr&eacute;e, connue sous le nom de &laquo;&nbsp;Transport Layer Security&nbsp;&raquo; (TLS), pour fournir un chiffrement de bout en bout. Un attaquant suffisamment comp&eacute;tent peut encore observer les partenaires de la communication et une analyse approfondie de la communication chiffr&eacute;e pourrait toujours r&eacute;v&eacute;ler des d&eacute;tails importants. Un aper&ccedil;u des m&eacute;thodes de transport alternatives disponibles est donn&eacute; dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAD">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Le protocole HTTPS est bas&eacute; sur le protocole HTTP, aussi toutes les options prises en charge par
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
sont aussi disponibles au moyen de
Acquire::https
et ont par d&eacute;faut les m&ecirc;me valeurs que celles sp&eacute;cifi&eacute;es pour
Acquire::http. Cette page de manuel ne documentera que les options
<I>propres &agrave; https</I>.
<A NAME="lbAE">&nbsp;</A>
<H3>Accr&eacute;ditations du serveur</H3>

<P>

Par d&eacute;faut, tous les certificats de confiance du syst&egrave;me (voir le paquet
ca-certificates
sont utilis&eacute;s pour la v&eacute;rification du certificat du serveur. Une autre autorit&eacute; de certification (CA) peut &ecirc;tre configur&eacute;e avec l'option
Acquire::https::CAInfo
et son option sp&eacute;cifique de l'h&ocirc;te
Acquire::https::CAInfo::<I>h&ocirc;te</I>. L'option CAInfo sp&eacute;cifie un fichier compos&eacute; des certificats de CA (au format PEM) concat&eacute;n&eacute;s pour cr&eacute;er la cha&icirc;ne qu'APT peut utiliser pour v&eacute;rifier le chemin &agrave; partir du certificat racine auto-sign&eacute;e. Si le serveur distant fournit toute la cha&icirc;ne pendant l'&eacute;change, le fichier ne doit contenir que le certificat racine. Autrement, toute la cha&icirc;ne est requise. Si la gestion de plusieurs autorit&eacute;s est n&eacute;cessaire, le seul moyen est de tout concat&eacute;ner.
<P>

Une liste de r&eacute;vocation de certificats (CRL) personnalis&eacute;e peut &ecirc;tre configur&eacute;e avec l'option
Acquire::https::CRLFile
et
Acquire::https::CRLFile::<I>h&ocirc;te</I>. Comme avec l'option pr&eacute;c&eacute;dente, il faut sp&eacute;cifier un fichier au format PEM.
<A NAME="lbAF">&nbsp;</A>
<H3>D&eacute;sactiver la s&eacute;curit&eacute;</H3>

<P>

Durant l'authentification du serveur, si la v&eacute;rification du certificat &eacute;choue pour une raison quelconque (expir&eacute;, r&eacute;voqu&eacute;, homme du milieu,&nbsp;etc.), la connexion &eacute;choue. C'est certainement ce que vous souhaitez dans tous les cas et ce que fournit la valeur par d&eacute;faut (&laquo;&nbsp;true&nbsp;&raquo;) de l'option
Acquire::https::Verify-Peer
et de ses variantes sp&eacute;cifiques &agrave; l'h&ocirc;te. Si vous savez
<I>exactement</I>
ce que vous faites, la configuration de cette option &agrave; &laquo;&nbsp;false&nbsp;&raquo; vous permet d'ignorer la v&eacute;rification du certificat du pair et de faire r&eacute;ussir l'&eacute;change. Une fois de plus, cette option est seulement destin&eacute;e au test ou au d&eacute;bogage dans la mesure o&ugrave; elle supprime toute la s&eacute;curit&eacute; apport&eacute;e par l'utilisation de HTTPS.
<P>

De la m&ecirc;me fa&ccedil;on, l'option
Acquire::https::Verify-Host
et sa variante sp&eacute;cifique &agrave; l'h&ocirc;te peuvent &ecirc;tre utilis&eacute;es pour d&eacute;sactiver la fonction de s&eacute;curit&eacute;. Le certificat fourni par le serveur comprend l'identit&eacute; du serveur qui devrait correspondre au nom de DNS utilis&eacute; pour y acc&eacute;der. Par d&eacute;faut, comme cela est requis par la RFC&nbsp;2818, le nom du miroir est v&eacute;rifi&eacute; par rapport &agrave; l'identit&eacute; trouv&eacute;e dans le certificat. Ce comportement par d&eacute;faut est s&ucirc;r et ne devrait pas &ecirc;tre modifi&eacute;, mais si vous savez que le serveur que vous utilisez &agrave; un nom de DNS qui ne correspond pas &agrave; l'identit&eacute; de son certificat, il est possible de r&eacute;gler l'option &agrave; &quot;false&quot;, ce qui emp&ecirc;chera la r&eacute;alisation de la comparaison.
<A NAME="lbAG">&nbsp;</A>
<H3>Authentification du client</H3>

<P>

Outre la gestion de l'authentification bas&eacute;e sur les mots de passe (voir
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)) HTTPS prend aussi en charge l'authentification bas&eacute;e sur les certificats du client avec
Acquire::https::SSLCert
et
Acquire::https::SSLKey. Leurs valeurs doivent &ecirc;tre respectivement celle du nom de fichier du certificat X.509 du client et celle de la cl&eacute; priv&eacute;e (non chiffr&eacute;e) associ&eacute;e, toutes les deux au format PEM. En pratique, l'utilisation des variantes sp&eacute;cifiques &agrave; l'h&ocirc;te des deux options est fortement recommand&eacute;e.
<A NAME="lbAH">&nbsp;</A>
<H2>EXEMPLES</H2>

<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
Acquire::https {
        Proxy::example.org &quot;DIRECT&quot;;
        Proxy &quot;socks5h://apt:<A HREF="mailto:pass@127.0.0.1">pass@127.0.0.1</A>:9050&quot;;
        Proxy-Auto-Detect &quot;/usr/local/bin/apt-https-proxy-auto-detect&quot;;
        No-Cache &quot;true&quot;;
        Max-Age &quot;3600&quot;;
        No-Store &quot;true&quot;;
        Timeout &quot;10&quot;;
        Dl-Limit &quot;42&quot;;
        Pipeline-Depth &quot;0&quot;;
        AllowRedirect &quot;false&quot;;
        User-Agent &quot;My APT-HTTPS&quot;;
        SendAccept &quot;false&quot;;

        CAInfo &quot;/path/to/ca/certs.pem&quot;;
        CRLFile &quot;/path/to/all/crl.pem&quot;;
        Verify-Peer &quot;true&quot;;
        Verify-Host::broken.example.org &quot;false&quot;;
        SSLCert::example.org &quot;/path/to/client/cert.pem&quot;;
        SSLKey::example.org &quot;/path/to/client/key.pem&quot;
};
</PRE>

</DL>




<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAJ">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTEUR</H2>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="2"><DD>
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="3"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="4"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NOM</A><DD>
<DT id="6"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="7"><A HREF="#lbAD">OPTIONS</A><DD>
<DL>
<DT id="8"><A HREF="#lbAE">Accr&eacute;ditations du serveur</A><DD>
<DT id="9"><A HREF="#lbAF">D&eacute;sactiver la s&eacute;curit&eacute;</A><DD>
<DT id="10"><A HREF="#lbAG">Authentification du client</A><DD>
</DL>
<DT id="11"><A HREF="#lbAH">EXEMPLES</A><DD>
<DT id="12"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="13"><A HREF="#lbAJ">BOGUES</A><DD>
<DT id="14"><A HREF="#lbAK">TRADUCTEURS</A><DD>
<DT id="15"><A HREF="#lbAL">AUTEUR</A><DD>
<DT id="16"><A HREF="#lbAM">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:00 GMT, March 31, 2021
</BODY>
</HTML>
