
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-HTTP</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-HTTP</H1>
Section: APT (1)<BR>Updated: 04&nbsp;avril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-transport-http - Transport d'APT pour t&eacute;l&eacute;chargement par HTTP (protocole de transfert hypertexte)
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Ce transport d'APT permet d'utiliser les d&eacute;p&ocirc;ts auxquels on acc&egrave;de au moyen de HTTP (Hypertext Transfer Protocol). Il est disponible par d&eacute;faut et il est probablement le transport le plus utilis&eacute; de tous. Veuillez noter qu'un transport n'est jamais appel&eacute; directement par l'utilisateur, mais utilis&eacute; par les outils d'APT s'appuyant sur la configuration de l'utilisateur.
<P>

HTTP est un protocole de transport non chiffr&eacute; ce qui veut dire que toutes les communications avec le serveur distant (ou le mandataire) peuvent &ecirc;tre observ&eacute;es par un attaquant suffisamment comp&eacute;tent appel&eacute; couramment &laquo;&nbsp;homme du milieu&nbsp;&raquo; (MITM). Cependant, un tel attaquant ne peut
<I>pas</I>
modifier la communication pour compromettre la s&eacute;curit&eacute; du syst&egrave;me dans la mesure o&ugrave; le mod&egrave;le de s&eacute;curit&eacute; des donn&eacute;es d'APT est ind&eacute;pendant de la m&eacute;thode de transport choisie. Cela est expliqu&eacute; en d&eacute;tail dans
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8). Un aper&ccedil;u des m&eacute;thodes de transport disponibles est donn&eacute; dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAD">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Diverses options peuvent &ecirc;tre r&eacute;gl&eacute;es dans un fichier
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
pour modifier son comportement depuis la configuration d'un mandataire &agrave; des contournements pour les limites d'un serveur particulier.
<A NAME="lbAE">&nbsp;</A>
<H3>Configuration du mandataire</H3>

<P>

La variable d'environnement
<B>http_proxy</B>
est prise en charge pour une configuration au niveau du syst&egrave;me. Les mandataires particuliers &agrave; APT peuvent &ecirc;tre configur&eacute;s gr&acirc;ce &agrave; l'option
Acquire::http::Proxy. Les mandataires qui devraient &ecirc;tre utilis&eacute;s seulement pour certains h&ocirc;tes peuvent &ecirc;tre sp&eacute;cifi&eacute;s avec
Acquire::http::Proxy::<I>h&ocirc;te</I>. Un contr&ocirc;le encore plus fin peut &ecirc;tre obtenu avec l'autod&eacute;tection du mandataire, d&eacute;taill&eacute;e ci-dessous. Toutes ces options utilisent le format d'URI
<I>sch&eacute;ma</I>://[[<I>utilisateur</I>][:<I>mot_de_passe</I>]@]<I>h&ocirc;te</I>[:<I>port</I>]/. Les sch&eacute;mas d'URI pris en charge sont
socks5h
(SOCKS5 avec r&eacute;solution distante de DNS),
http
et
https. Les d&eacute;tails d'authentification peuvent &ecirc;tre fournis avec
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
plut&ocirc;t que de les inclure directement dans l'URI.
<P>

Les diverses options de configuration d'APT prennent en charge la valeur particuli&egrave;re
DIRECT
signifiant qu'aucun mandataire ne doit &ecirc;tre utilis&eacute;. La variable d'environnement
<B>no_proxy</B>
est aussi prise en charge dans le m&ecirc;me but.
<P>

De plus, il y a trois options de configuration fournies pour le contr&ocirc;le des caches mandataire compatibles avec HTTP/1.1&nbsp;:
Acquire::http::No-Cache
dit au mandataire de ne jamais utiliser les r&eacute;ponses qu'il a stock&eacute;es.
Acquire::http::Max-Age
&eacute;tablit l'anciennet&eacute; maximale (en secondes) d'un fichier d'index dans le cache du mandataire.
Acquire::http::No-Store
indique que le mandataire ne doit pas mettre en cache les fichiers d'archive, ce qui peut &eacute;viter de polluer un cache mandataire avec des fichiers .deb tr&egrave;s grands.
<A NAME="lbAF">&nbsp;</A>
<H3>Configuration automatique du mandataire</H3>

<P>

L'option
Acquire::http::Proxy-Auto-Detect
peut &ecirc;tre utilis&eacute;e pour indiquer une commande externe pour d&eacute;couvrir le mandataire HTTP &agrave; utiliser. Le premier et seul param&egrave;tre est un URI indiquant l'h&ocirc;te &agrave; contacter pour permettre une configuration propre &agrave; l'h&ocirc;te. Apt s'attend &agrave; ce que la commande indique le mandataire sur la sortie standard sur une seule ligne dans le format d'URI pr&eacute;c&eacute;demment d&eacute;fini ou le mot
DIRECT
si aucun mandataire ne doit &ecirc;tre utilis&eacute;. Aucune sortie indique que le mandataire g&eacute;n&eacute;rique doit &ecirc;tre utilis&eacute;.
<P>

Notez que l'auto-d&eacute;tection ne sera pas ex&eacute;cut&eacute;e si une configuration sp&eacute;cifique de mandataire h&ocirc;te a d&eacute;j&agrave; &eacute;t&eacute; &eacute;tablie par
Acquire::http::Proxy::<I>h&ocirc;te</I>.
<P>

Voir les paquets
<B><A HREF="/cgi-bin/man/man2html?1+squid-deb-proxy-client">squid-deb-proxy-client</A></B>(1)
et
<B><A HREF="/cgi-bin/man/man2html?1+auto-apt-proxy">auto-apt-proxy</A></B>(1)
pour des exemples d'impl&eacute;mentation.
<P>

Cette option prend le pas sur l'ancien nom d'option
Acquire::http::ProxyAutoDetect.
<A NAME="lbAG">&nbsp;</A>
<H3>Configuration de connexion</H3>

<P>

L'option
Acquire::http::Timeout
positionne le compteur d'expiration du d&eacute;lai (timeout) utilis&eacute; par la m&eacute;thode. Cela s'applique aussi bien &agrave; la connexion qu'aux donn&eacute;es.
<P>

La bande passante utilis&eacute;e peut &ecirc;tre limit&eacute;e avec
Acquire::http::Dl-Limit
qui peut prendre une valeur enti&egrave;re, l'unit&eacute; utilis&eacute;e &eacute;tant le kilo-octet par seconde. La valeur par d&eacute;faut est&nbsp;0, ce qui correspond &agrave; aucune limitation de bande passante. Veuillez noter que cette option d&eacute;sactive implicitement le t&eacute;l&eacute;chargement simultan&eacute; depuis plusieurs serveurs.
<P>

Le r&eacute;glage
Acquire::http::Pipeline-Depth
permet d'utiliser l'encha&icirc;nement HTTP (&laquo;&nbsp;HTTP pipelining&nbsp;&raquo;, RFC&nbsp;2616 section&nbsp;8.1.2.2) ce qui peut &ecirc;tre utile par exemple avec des connexions &agrave; latence &eacute;lev&eacute;e. Il indique le nombre de requ&ecirc;tes envoy&eacute;es dans le tuyau. APT tente de d&eacute;tecter et de contourner les serveurs web et les mandataires qui se comportent mal &agrave; l'ex&eacute;cution, mais si vous savez que vos serveurs ne respectent pas la norme HTTP/1.1, l'encha&icirc;nement peut &ecirc;tre d&eacute;sactiv&eacute; en d&eacute;finissant cette valeur &agrave;&nbsp;0. Il est activ&eacute; par d&eacute;faut avec une valeur de&nbsp;10.
<P>

Acquire::http::AllowRedirect
contr&ocirc;le le fait qu'APT suive les redirections. Ce r&eacute;glage est activ&eacute; par d&eacute;faut.
<P>

L'option
Acquire::http::User-Agent
peut &ecirc;tre utilis&eacute;e pour envoyer une valeur User-Agent modifi&eacute;e pour les t&eacute;l&eacute;chargements HTTP, ce qui peut par exemple &ecirc;tre utile avec certains mandataires HTTP qui n'autorisent l'acc&egrave;s qu'aux clients s'identifiant de mani&egrave;re sp&eacute;cifique.
<P>

Acquire::http::SendAccept
est activ&eacute; par d&eacute;faut et envoie un champ d'en-t&ecirc;te
Accept: text/*
au serveur pourles requ&ecirc;tes sans extension de fichier pour &eacute;viter que le serveur ne tente une n&eacute;gociation de contenu.
<A NAME="lbAH">&nbsp;</A>
<H2>EXEMPLES</H2>

<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
Acquire::http {
        Proxy::example.org &quot;DIRECT&quot;;
        Proxy &quot;socks5h://apt:<A HREF="mailto:pass@127.0.0.1">pass@127.0.0.1</A>:9050&quot;;
        Proxy-Auto-Detect &quot;/usr/local/bin/apt-http-proxy-auto-detect&quot;;
        No-Cache &quot;true&quot;;
        Max-Age &quot;3600&quot;;
        No-Store &quot;true&quot;;
        Timeout &quot;10&quot;;
        Dl-Limit &quot;42&quot;;
        Pipeline-Depth &quot;0&quot;;
        AllowRedirect &quot;false&quot;;
        User-Agent &quot;My APT-HTTP&quot;;
        SendAccept &quot;false&quot;;
};
</PRE>

</DL>




<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAJ">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTEUR</H2>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="2"><DD>
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="3"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="4"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NOM</A><DD>
<DT id="6"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="7"><A HREF="#lbAD">OPTIONS</A><DD>
<DL>
<DT id="8"><A HREF="#lbAE">Configuration du mandataire</A><DD>
<DT id="9"><A HREF="#lbAF">Configuration automatique du mandataire</A><DD>
<DT id="10"><A HREF="#lbAG">Configuration de connexion</A><DD>
</DL>
<DT id="11"><A HREF="#lbAH">EXEMPLES</A><DD>
<DT id="12"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="13"><A HREF="#lbAJ">BOGUES</A><DD>
<DT id="14"><A HREF="#lbAK">TRADUCTEURS</A><DD>
<DT id="15"><A HREF="#lbAL">AUTEUR</A><DD>
<DT id="16"><A HREF="#lbAM">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:00 GMT, March 31, 2021
</BODY>
</HTML>
