
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-FTPARCHIVE</TITLE>
</HEAD><BODY>
<H1>APT-FTPARCHIVE</H1>
Section: APT (1)<BR>Updated: 10&nbsp;mai&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-ftparchive - Outil de cr&eacute;ation de fichiers d'index
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>apt-ftparchive</B> [<B>-dsq</B>] [<B>--md5</B>] [<B>--delink</B>] [<B>--readonly</B>] [<B>--contents</B>] [<B>--arch&nbsp;</B><B></B><I>architecture</I>] [<B>-o=</B><B></B><I>cha&icirc;ne_de_configuration</I>] [<B>-c=</B><B></B><I>fichier_de_configuration</I>] {packages&nbsp;<I>chemin</I>...&nbsp;[<I>fichier-override</I>&nbsp;[<I>pr&eacute;fixe_de_chemin</I>]]  | sources&nbsp;<I>chemin</I>...&nbsp;[<I>fichier-override</I>&nbsp;[<I>pr&eacute;fixe_de_chemin</I>]]  | contents&nbsp;<I>chemin</I>  | release&nbsp;<I>chemin</I>  | generate&nbsp;<I>fichier_de_configuration</I>&nbsp;<I>section</I>...  | clean&nbsp;<I>fichier_de_configuration</I>  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

<B>apt-ftparchive</B>
<DD>est l'outil en ligne de commande qui cr&eacute;e les index dont APT se sert pour acc&eacute;der aux sources des distributions. Un index doit &ecirc;tre cr&eacute;&eacute; pour un site et bas&eacute; sur le contenu de ce site.
<P>

<B>apt-ftparchive</B>
est un ensemble comprenant le programme
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1)
et toutes ses fonctionnalit&eacute;s via la commande
packages&nbsp;; il comprend aussi un g&eacute;n&eacute;rateur de fichier &laquo;&nbsp;Contents&nbsp;&raquo;, la commande
contents, et une technique &eacute;labor&eacute;e pour automatiser le processus de cr&eacute;ation d'une archive compl&egrave;te.
<P>

<B>Apt-ftparchive</B>
peut utiliser lui-m&ecirc;me des bases de donn&eacute;es binaires pour &laquo;&nbsp;cacher&nbsp;&raquo; le contenu d'un fichier .deb&nbsp;; il n'a pas besoin de programmes ext&eacute;rieurs, sauf
<B><A HREF="/cgi-bin/man/man2html?1+gzip">gzip</A></B>(1). Lors d'une ex&eacute;cution, il v&eacute;rifie les changements dans les fichiers et cr&eacute;e les fichiers compress&eacute;s voulus.
<P>

&Agrave; moins que l'option
<B>-h</B>
ou
<B>--help</B>
ne soit donn&eacute;e, l'une des commandes suivantes doit &ecirc;tre pr&eacute;sente.
<P>

<B>packages</B>
<DL COMPACT><DT id="2"><DD>
La commande packages cr&eacute;e un fichier &laquo;&nbsp;Packages&nbsp;&raquo; &agrave; partir d'une arborescence. Elle recherche r&eacute;cursivement &agrave; travers le r&eacute;pertoire donn&eacute; les fichiers .deb et, pour chaque fichier trouv&eacute;, envoie une entr&eacute;e pour ce paquet sur la sortie standard. Cette commande est approximativement &eacute;quivalente &agrave;
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1).
<P>
On peut se servir de l'option
<B>--db</B>
pour demander un cache binaire.
</DL>

<P>

<B>sources</B>
<DL COMPACT><DT id="3"><DD>
La commande
sources
cr&eacute;e un index des sources &agrave; partir d'une arborescence. Elle recherche r&eacute;cursivement &agrave; travers le r&eacute;pertoire donn&eacute; les fichiers .dsc et, pour chaque fichier trouv&eacute;, envoie une entr&eacute;e pour ce paquet sur la sortie standard. Cette commande est approximativement &eacute;quivalente &agrave;
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scansources">dpkg-scansources</A></B>(1).
<P>
Quand on pr&eacute;cise un fichier &laquo;&nbsp;override&nbsp;&raquo;, c'est un fichier source avec une extension .src qui est recherch&eacute;. On peut se servir de l'option --source-override pour changer de fichier source d'&laquo;&nbsp;override&nbsp;&raquo;.
</DL>

<P>

<B>contents</B>
<DL COMPACT><DT id="4"><DD>
La commande
contents
cr&eacute;e un fichier &laquo;&nbsp;Contents&nbsp;&raquo; &agrave; partir d'une arborescence. Elle recherche r&eacute;cursivement &agrave; travers le r&eacute;pertoire donn&eacute; les fichiers .deb et, pour chaque fichier trouv&eacute;, lit la liste des fichiers. Elle trie la liste des fichiers correspondant &agrave; des paquets et l'envoie sur la sortie standard. Les r&eacute;pertoires ne font pas partie du r&eacute;sultat. Quand un fichier appartient &agrave; plusieurs paquets, une virgule s&eacute;pare les paquets.
<P>
On peut se servir de l'option
<B>--db</B>
pour demander un cache binaire.
</DL>

<P>

<B>release</B>
<DL COMPACT><DT id="5"><DD>
La commande
release
cr&eacute;e un fichier Release &agrave; partir d'une arborescence. Elle recherche r&eacute;cursivement dans le r&eacute;pertoire indiqu&eacute; des fichiers
Packages,
Sources,
Contents,
Components
et
icons
non compress&eacute;s et compress&eacute;s ainsi que des fichiers
Release,
Index
et
md5sum.txt
par d&eacute;faut (APT::FTPArchive::Release::Default-Patterns). Des motifs suppl&eacute;mentaires pour les noms de fichiers peuvent &ecirc;tre ajout&eacute;s en les mentionnant dans
APT::FTPArchive::Release::Patterns. Le fichier
Release
est ensuite affich&eacute; sur la sortie standard et comporte (par d&eacute;faut) des sommes de contr&ocirc;le MD5, SHA1 et SHA256 et SHA512 pour chaque fichier.
<P>
La valeur des autres champs de m&eacute;tadonn&eacute;es du fichier Release sont tir&eacute;es de la valeur correspondante dans
APT::FTPArchive::Release, p. ex.
APT::FTPArchive::Release::Origin. Les champs reconnus sont&nbsp;:
Origin,
Label,
Suite,
Version,
Codename,
Date,
NotAutomatic,
ButAutomaticUpgrades,
Acquire-By-Hash,
Valid-Until,
Signed-By,
Architectures,
Components,
Description.
</DL>

<P>

<B>generate</B>
<DL COMPACT><DT id="6"><DD>
La commande
generate
est con&ccedil;ue pour &ecirc;tre ex&eacute;cutable par le programme cron et elle cr&eacute;e un index en suivant le fichier de configuration donn&eacute;. Le langage de configuration fournit un moyen souple de pr&eacute;ciser index et r&eacute;pertoires aussi bien que les param&egrave;tres requis.
</DL>

<P>

<B>clean</B>
<DL COMPACT><DT id="7"><DD>
La commande
clean
nettoie les bases de donn&eacute;es utilis&eacute;es par le fichier de configuration en supprimant les enregistrements qui ne sont plus n&eacute;cessaires.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>CONFIGURATION DE LA COMMANDE GENERATE</H2>

<P>

La commande
generate
utilise un fichier de configuration pour d&eacute;crire l'archive qui va &ecirc;tre cr&eacute;&eacute;e. Le format de ce fichier est le format ISC classique utilis&eacute; par des outils ISC comme bind 8 et dhcpd. Le fichier
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
d&eacute;crit ce format. Il faut noter que l'analyse de ce fichier se fait par section tandis que celle d'<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
se fait par arborescence. Cela n'affecte que l'usage de l'&eacute;tiquette de vis&eacute;e (scope tag).
<P>

Ce fichier de configuration poss&egrave;de quatre sections, d&eacute;crites ci-dessous.
<A NAME="lbAF">&nbsp;</A>
<H3>La section Dir</H3>

<P>

La section
Dir
d&eacute;finit les r&eacute;pertoires standards o&ugrave; situer les fichiers n&eacute;cessaires au processus de cr&eacute;ation. Ces r&eacute;pertoires sont pr&eacute;c&eacute;d&eacute;s de chemins relatifs d&eacute;finis dans les sections suivantes de mani&egrave;re &agrave; produire un chemin absolu et complet.
<P>

<B>ArchiveDir</B>
<DL COMPACT><DT id="8"><DD>
Indique la racine de l'archive FTP&nbsp;; Pour une configuration Debian classique, c'est le r&eacute;pertoire qui contient le fichier
ls-LR
et les noeuds des distributions.
</DL>

<P>

<B>OverrideDir</B>
<DL COMPACT><DT id="9"><DD>
Indique l'emplacement des fichiers d'&laquo;&nbsp;override&nbsp;&raquo;.
</DL>

<P>

<B>CacheDir</B>
<DL COMPACT><DT id="10"><DD>
Indique l'emplacement des fichiers de cache.
</DL>

<P>

<B>FileListDir</B>
<DL COMPACT><DT id="11"><DD>
Indique l'emplacement des fichiers contenant la liste des fichiers (si on se sert de la valeur
FileList
d&eacute;finie plus bas).
</DL>

<A NAME="lbAG">&nbsp;</A>
<H3>La section Default</H3>

<P>

La section
Default
pr&eacute;cise les valeurs par d&eacute;faut et les param&egrave;tres qui contr&ocirc;lent la marche du g&eacute;n&eacute;rateur. Ces valeurs peuvent &ecirc;tre annul&eacute;es dans d'autres sections (param&egrave;trage par section).
<P>

<B>Packages::Compress</B>
<DL COMPACT><DT id="12"><DD>
Indique comment sont compress&eacute;s les fichiers d'index. C'est une cha&icirc;ne qui contient une liste s&eacute;par&eacute;e par des espaces qui contient au moins l'un des compresseurs configur&eacute; &agrave; travers le champ d'action de configuration
<B>APT::Compressor</B>. La valeur par d&eacute;faut pour tous les sch&eacute;mas de compression est &laquo;&nbsp;.&nbsp;gzip&nbsp;&raquo;.
</DL>

<P>

<B>Packages::Extensions</B>
<DL COMPACT><DT id="13"><DD>
Indique la liste par d&eacute;faut des extensions de fichier qui constituent des paquets. Par d&eacute;faut, c'est &laquo;&nbsp;.deb&nbsp;&raquo;.
</DL>

<P>

<B>Sources::Compress</B>
<DL COMPACT><DT id="14"><DD>
Identique &agrave;
Packages::Compress
mais pr&eacute;cise comment sont compress&eacute;s les fichiers sources.
</DL>

<P>

<B>Sources::Extensions</B>
<DL COMPACT><DT id="15"><DD>
Indique la liste par d&eacute;faut des extensions de fichier qui constituent des fichiers sources. Par d&eacute;faut, c'est &laquo;&nbsp;.dsc&nbsp;&raquo;.
</DL>

<P>

<B>Contents::Compress</B>
<DL COMPACT><DT id="16"><DD>
Identique &agrave;
Packages::Compress
mais pr&eacute;cise comment sont compress&eacute;s les fichiers &laquo;&nbsp;Contents&nbsp;&raquo;.
</DL>

<P>

<B>Translation::Compress</B>
<DL COMPACT><DT id="17"><DD>
Identique &agrave;
Packages::Compress
mais pr&eacute;cise comment est compress&eacute; le fichier ma&icirc;tre Translations-en.
</DL>

<P>

<B>DeLinkLimit</B>
<DL COMPACT><DT id="18"><DD>
Indique le nombre de kilo-octets &agrave; d&eacute;lier (et &agrave; remplacer par des liens en dur) pour chaque ex&eacute;cution. On s'en sert, pour chaque section, avec le param&egrave;tre
External-Links.
</DL>

<P>

<B>FileMode</B>
<DL COMPACT><DT id="19"><DD>
Indique le syst&egrave;me de permissions des fichiers d'index cr&eacute;&eacute;s. Par d&eacute;faut, c'est le mode&nbsp;0644. Tous les fichiers d'index ont ce mode et le masque utilisateur (umasq) est ignor&eacute;.
</DL>

<P>

<B>LongDescription</B>
<DL COMPACT><DT id="20"><DD>
D&eacute;finit si les descriptions longues doivent &ecirc;tre incluses dans le fichier
Packages
ou d&eacute;plac&eacute;es dans un fichier ma&icirc;tre
Translation-en.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H3>La section TreeDefault</H3>

<P>

Indique les valeurs par d&eacute;faut particuli&egrave;res &agrave; la section
Tree. Toutes ces variables sont des variables de substitution&nbsp;; les cha&icirc;nes $(DIST), $(SECTION) et $(ARCH) sont remplac&eacute;es par leur valeur respective.
<P>

<B>MaxContentsChange</B>
<DL COMPACT><DT id="21"><DD>
Indique le nombre de kilo-octets de fichiers &laquo;&nbsp;Contents&nbsp;&raquo; qui sont cr&eacute;&eacute;s chaque jour. Les fichiers &laquo;&nbsp;Contents&nbsp;&raquo; sont choisis selon le syst&egrave;me &laquo;&nbsp;round-robin&nbsp;&raquo; de mani&egrave;re que, sur plusieurs jours, tous soient reconstruits.
</DL>

<P>

<B>ContentsAge</B>
<DL COMPACT><DT id="22"><DD>
Contr&ocirc;le le nombre de jours pendant lequel un fichier &laquo;&nbsp;Contents&nbsp;&raquo; peut &ecirc;tre utilis&eacute; sans actualisation. Quand cette limite est franchie, le &laquo;&nbsp;mtime&nbsp;&raquo; du fichier &laquo;&nbsp;Contents&nbsp;&raquo; est mis &agrave; jour. Cela peut arriver quand un fichier est modifi&eacute; sans que cela modifie le fichier &laquo;&nbsp;Contents&nbsp;&raquo; (modification par &laquo;&nbsp;override&nbsp;&raquo; par exemple). Un d&eacute;lai est permis dans l'espoir que de nouveaux &laquo;&nbsp;.deb&nbsp;&raquo; seront install&eacute;s, exigeant un nouveau &laquo;&nbsp;Contents&nbsp;&raquo;. Par d&eacute;faut ce nombre vaut&nbsp;10, l'unit&eacute; &eacute;tant le jour.
</DL>

<P>

<B>Directory</B>
<DL COMPACT><DT id="23"><DD>
Indique la racine de l'arborescence des &laquo;&nbsp;.deb&nbsp;&raquo;. Par d&eacute;faut, c'est
$(DIST)/$(SECTION)/binary-$(ARCH)/.
</DL>

<P>

<B>SrcDirectory</B>
<DL COMPACT><DT id="24"><DD>
Indique la racine de l'arborescence des paquets source. Par d&eacute;faut, c'est
$(DIST)/$(SECTION)/source/.
</DL>

<P>

<B>Packages</B>
<DL COMPACT><DT id="25"><DD>
Indique le fichier &laquo;&nbsp;Packages&nbsp;&raquo; cr&eacute;&eacute;. Par d&eacute;faut, c'est
$(DIST)/$(SECTION)/binary-$(ARCH)/Packages.
</DL>

<P>

<B>Sources</B>
<DL COMPACT><DT id="26"><DD>
Indique le fichier &laquo;&nbsp;Sources&nbsp;&raquo; cr&eacute;&eacute;. Par d&eacute;faut, c'est
$(DIST)/$(SECTION)/source/Sources.
</DL>

<P>

<B>Translation</B>
<DL COMPACT><DT id="27"><DD>
D&eacute;finit le fichier ma&icirc;tre Translation-en qui comporte les descriptions longues si elles ne sont pas incluses dans le fichier Packages. Valeur par d&eacute;faut&nbsp;:&nbsp;$(DIST)/$(SECTION)/i18n/Translation-en
</DL>

<P>

<B>InternalPrefix</B>
<DL COMPACT><DT id="28"><DD>
Indique un pr&eacute;fixe de chemin&nbsp;; ce pr&eacute;fixe fait qu'un lien symbolique sera consid&eacute;r&eacute; comme un lien interne plut&ocirc;t que comme un lien externe. Par d&eacute;faut, c'est
$(DIST)/$(SECTION)/.
</DL>

<P>

<B>Contents</B>
<DL COMPACT><DT id="29"><DD>
Indique le fichier &laquo;&nbsp;Contents&nbsp;&raquo; cr&eacute;&eacute;. Par d&eacute;faut, c'est
$(DIST)/Contents-$(ARCH). Quand le param&egrave;trage fait que diff&eacute;rents fichiers &laquo;&nbsp;Packages&nbsp;&raquo; se r&eacute;f&egrave;rent &agrave; un seul fichier &laquo;&nbsp;Contents&nbsp;&raquo;,
<B>apt-ftparchive</B>
les int&egrave;gre automatiquement.
</DL>

<P>

<B>Contents::Header</B>
<DL COMPACT><DT id="30"><DD>
Indique l'en-t&ecirc;te &agrave; pr&eacute;fixer au fichier &laquo;&nbsp;Contents&nbsp;&raquo; cr&eacute;&eacute;.
</DL>

<P>

<B>BinCacheDB</B>
<DL COMPACT><DT id="31"><DD>
Indique la base de donn&eacute;es binaire servant de cache pour cette section. Diff&eacute;rentes sections peuvent partager cette base de donn&eacute;es.
</DL>

<P>

<B>FileList</B>
<DL COMPACT><DT id="32"><DD>
Indique qu'au lieu de lire l'arborescence,
<B>apt-ftparchive</B>
doit lire la liste de fichiers dans le fichier donn&eacute; en param&egrave;tre. Les noms relatifs sont pr&eacute;fix&eacute;s par le r&eacute;pertoire de l'archive.
</DL>

<P>

<B>SourceFileList</B>
<DL COMPACT><DT id="33"><DD>
Indique qu'au lieu de lire l'arborescence,
<B>apt-ftparchive</B>
doit lire la liste de fichiers dans le fichier donn&eacute; en param&egrave;tre. Les noms relatifs sont pr&eacute;fix&eacute;s par le r&eacute;pertoire de l'archive. On s'en sert pour traiter les index de sources.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H3>La section Tree</H3>

<P>

La section
Tree
d&eacute;finit une arborescence debian classique avec un r&eacute;pertoire de base, diff&eacute;rentes sections dans ce r&eacute;pertoire et diff&eacute;rentes architectures dans chaque section. Le chemin exact est d&eacute;fini par la variable de substitution
Directory.
<P>

La section
Tree
accepte une &eacute;tiquette de vis&eacute;e (scope tag) qui d&eacute;termine la variable
$(DIST)
et la racine de l'arborescence (le chemin est pr&eacute;fix&eacute; par
ArchiveDir). C'est par exemple&nbsp;:
dists/buster.
<P>

Tous les param&egrave;tres d&eacute;finis dans la section
TreeDefault
peuvent s'utiliser dans la section
Tree
ainsi que les trois nouvelles variables suivantes.
<P>

Quand il ex&eacute;cute la section
Tree,
<B>apt-ftparchive</B>
effectue une op&eacute;ration analogue &agrave;&nbsp;:
<P>
<DL COMPACT><DT id="34"><DD>



<PRE>
for i in Sections do 
   for j in Architectures do
      Generate for DIST=scope SECTION=i ARCH=j
     
</PRE>

</DL>




<P>
<P>

<B>Sections</B>
<DL COMPACT><DT id="35"><DD>
C'est une liste de sections s&eacute;par&eacute;es par des espaces qui appartiennent &agrave; une distribution&nbsp;; classiquement, on trouve
main contrib non-free.
</DL>

<P>

<B>Architectures</B>
<DL COMPACT><DT id="36"><DD>
C'est une liste de toutes les architectures s&eacute;par&eacute;es par des espaces qui appartiennent &agrave; chaque section. L'architecture sp&eacute;ciale &laquo;&nbsp;source&nbsp;&raquo; indique que l'arborescence est une arborescence de sources. L'architecture &laquo;&nbsp;all&nbsp;&raquo; indique que les fichiers sp&eacute;cifiques &agrave; l'architecture comme
Packages
ne devraient pas inclure d'informations sur les paquets de l'architecture
all
dans tous les fichiers comme elles devraient &ecirc;tre disponibles dans un fichier d&eacute;di&eacute;.
</DL>

<P>

<B>LongDescription</B>
<DL COMPACT><DT id="37"><DD>
D&eacute;finit si les descriptions longues doivent &ecirc;tre incluses dans le fichier
Packages
ou d&eacute;plac&eacute;es dans un fichier ma&icirc;tre
Translation-en.
</DL>

<P>

<B>BinOverride</B>
<DL COMPACT><DT id="38"><DD>
Indique le fichier binaire d'&laquo;&nbsp;override&nbsp;&raquo;. Ce fichier contient des informations sur la section, la priorit&eacute; et le responsable du paquet.
</DL>

<P>

<B>SrcOverride</B>
<DL COMPACT><DT id="39"><DD>
Indique le fichier source d'&laquo;&nbsp;override&nbsp;&raquo;. Ce fichier contient des informations sur la section.
</DL>

<P>

<B>ExtraOverride</B>
<DL COMPACT><DT id="40"><DD>
Indique un autre fichier d'&laquo;&nbsp;override&nbsp;&raquo; pour les binaires.
</DL>

<P>

<B>SrcExtraOverride</B>
<DL COMPACT><DT id="41"><DD>
Indique un autre fichier d'&laquo;&nbsp;override&nbsp;&raquo; pour les sources.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H3>La section BinDirectory</H3>

<P>

La section
bindirectory
d&eacute;finit une arborescence binaire sans structure particuli&egrave;re. L'&eacute;tiquette de vis&eacute;e (scope tag) indique l'emplacement du r&eacute;pertoire binaire et le param&egrave;trage est identique &agrave; celui pour la section
Tree
sans substitution de variables ou au param&egrave;trage de
SectionArchitecture.
<P>

<B>Packages</B>
<DL COMPACT><DT id="42"><DD>
D&eacute;finit le fichier &laquo;&nbsp;Packages&nbsp;&raquo; cr&eacute;&eacute;.
</DL>

<P>

<B>Sources</B>
<DL COMPACT><DT id="43"><DD>
D&eacute;finit le fichier &laquo;&nbsp;Sources&nbsp;&raquo; cr&eacute;&eacute;. L'un des deux fichiers,
Packages
ou
Sources
est n&eacute;cessaire.
</DL>

<P>

<B>Contents</B>
<DL COMPACT><DT id="44"><DD>
D&eacute;finit le fichier &laquo;&nbsp;Contents&nbsp;&raquo; cr&eacute;&eacute;.
</DL>

<P>

<B>BinOverride</B>
<DL COMPACT><DT id="45"><DD>
D&eacute;finit le fichier d'&laquo;&nbsp;override&nbsp;&raquo; pour les binaires.
</DL>

<P>

<B>SrcOverride</B>
<DL COMPACT><DT id="46"><DD>
D&eacute;finit le fichier d'&laquo;&nbsp;override&nbsp;&raquo; pour les sources.
</DL>

<P>

<B>ExtraOverride</B>
<DL COMPACT><DT id="47"><DD>
Indique un autre fichier d'&laquo;&nbsp;override&nbsp;&raquo; pour les binaires.
</DL>

<P>

<B>SrcExtraOverride</B>
<DL COMPACT><DT id="48"><DD>
Indique un autre fichier d'&laquo;&nbsp;override&nbsp;&raquo; pour les sources.
</DL>

<P>

<B>BinCacheDB</B>
<DL COMPACT><DT id="49"><DD>
D&eacute;finit la base de donn&eacute;es cache.
</DL>

<P>

<B>PathPrefix</B>
<DL COMPACT><DT id="50"><DD>
Ajoute un chemin &agrave; tous les chemins cr&eacute;&eacute;s.
</DL>

<P>

<B>FileList</B>, <B>SourceFileList</B>
<DL COMPACT><DT id="51"><DD>
D&eacute;finit le fichier contenant la liste des fichiers.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>LE FICHIER D&laquo;&nbsp;OVERRIDE&nbsp;&raquo; POUR LES BINAIRES.</H2>

<P>

Le fichier d'&laquo;&nbsp;Override&nbsp;&raquo; est pleinement compatible avec
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1). Il contient quatre champs s&eacute;par&eacute;s par des espaces. Le premier est le nom du paquet&nbsp;; le deuxi&egrave;me est la priorit&eacute; &agrave; donner &agrave; ce paquet&nbsp;; le troisi&egrave;me est sa section et le dernier champ est un champ pour changer le nom du responsable de paquet.
<P>

Le champ du responsable est de cette forme&nbsp;:
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
old [// oldn]* =&gt; new
</PRE>

</DL>




<P>
ou simplement,
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
new
</PRE>

</DL>




<P>
La premi&egrave;re forme permet de sp&eacute;cifier de vieilles adresses dans une liste (le s&eacute;parateur est la double barre oblique). Si l'une de ces deux formes est rencontr&eacute;e, la valeur de new remplace la valeur du champ. La deuxi&egrave;me forme remplace inconditionnellement le champ.
<A NAME="lbAL">&nbsp;</A>
<H2>LE FICHIER D&laquo;&nbsp;OVERRIDE&nbsp;&raquo; POUR LES SOURCES</H2>

<P>

Le fichier d'&laquo;&nbsp;Override&nbsp;&raquo; est pleinement compatible avec
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scansources">dpkg-scansources</A></B>(1). Il contient deux champs. Le premier est le nom du paquet source&nbsp;; le second, sa section.
<A NAME="lbAM">&nbsp;</A>
<H2>LE FICHIER SUPPL&Eacute;MENTAIRE D&laquo;&nbsp;OVERRIDE&nbsp;&raquo;</H2>

<P>

Le fichier suppl&eacute;mentaire d'&laquo;&nbsp;Override&nbsp;&raquo; permet d'ajouter ou de remplacer des &eacute;tiquettes sur la sortie. Il poss&egrave;de trois colonnes&nbsp;: la premi&egrave;re repr&eacute;sente le paquet, la seconde est une &eacute;tiquette et la troisi&egrave;me en fin de ligne est la nouvelle valeur.
<A NAME="lbAN">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Toutes les options de la ligne de commande peuvent &ecirc;tre d&eacute;finies dans le fichier de configuration, les descriptions indiquant l'option de configuration concern&eacute;e. Pour les options bool&eacute;ennes, vous pouvez inverser les r&eacute;glages du fichiers de configuration avec
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
et d'autres variantes analogues.
<P>

<B>--md5</B>, <B>--sha1</B>, <B>--sha256</B>, <B>--sha512</B>
<DL COMPACT><DT id="54"><DD>
Cr&eacute;e la somme de contr&ocirc;le indiqu&eacute;e. Si ces options sont actives par d&eacute;faut. Quand elles sont d&eacute;sactiv&eacute;es, les fichiers d'index cr&eacute;&eacute;s n'auront pas de champ de somme de contr&ocirc;le l&agrave; o&ugrave; cela &eacute;tait possible. &Eacute;l&eacute;ments de configuration&nbsp;:APT::FTPArchive::<I>Checksum</I>
et
APT::FTPArchive::<I>Index</I>::<I>Checksum</I>
o&ugrave;
<I>Index</I>
peut &ecirc;tre
Packages,
Sources
ou
Release
et
<I>Checksum</I>
peut &ecirc;tre
MD5,
SHA1,
SHA256
ou
SHA512.
</DL>

<P>

<B>-d</B>, <B>--db</B>
<DL COMPACT><DT id="55"><DD>
Utiliser une base de donn&eacute;es binaire pour cache. Cela n'a aucun effet sur la commande generate. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::FTPArchive::DB.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="56"><DD>
Mode silencieux&nbsp;; cette commande produit une sortie destin&eacute;e &agrave; l'enregistrement dans un fichier-journal en omettant les indicateurs de progression. Un plus grand nombre de &laquo;&nbsp;q&nbsp;&raquo; (2 au plus) rend le programme de plus en plus silencieux. On peut aussi utiliser
<B>-q=#</B>
pour d&eacute;finir ce &laquo;&nbsp;niveau de silence&nbsp;&raquo;, et ne plus tenir compte des r&eacute;glages du fichier de configuration. &Eacute;l&eacute;ment de configuration&nbsp;:
quiet.
</DL>

<P>

<B>--delink</B>
<DL COMPACT><DT id="57"><DD>
D&eacute;faire une liaison. Si
External-Links
est activ&eacute;, cette option permet r&eacute;ellement de d&eacute;lier les fichiers. Par d&eacute;faut, elle est activ&eacute;e mais elle peut &ecirc;tre d&eacute;sactiv&eacute;e avec l'option
<B>--no-delink</B>. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::FTPArchive::DeLinkAct.
</DL>

<P>

<B>--contents</B>
<DL COMPACT><DT id="58"><DD>
Permettre la cr&eacute;ation d'un fichier &laquo;&nbsp;Contents&nbsp;&raquo;. Quand cette option est activ&eacute;e et que les index sont cr&eacute;&eacute;s sous forme de base de donn&eacute;es binaire, la liste des fichiers est aussi extraite et conserv&eacute;e dans la base de donn&eacute;es pour un usage futur. Avec la commande generate, cette option permet la cr&eacute;ation de fichiers &laquo;&nbsp;Contents&nbsp;&raquo;. Par d&eacute;faut, elle est activ&eacute;e. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::FTPArchive::Contents.
</DL>

<P>

<B>-s</B>, <B>--source-override</B>
<DL COMPACT><DT id="59"><DD>
Indique le fichier d'&laquo;&nbsp;override&nbsp;&raquo; &agrave; utiliser avec la commande
sources. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::FTPArchive::SourceOverride.
</DL>

<P>

<B>--readonly</B>
<DL COMPACT><DT id="60"><DD>
N'autoriser que la lecture pour les bases de donn&eacute;es de cache. &Eacute;l&eacute;ment de configuration&nbsp;:
APT::FTPArchive::ReadOnlyDB.
</DL>

<P>

<B>-a</B>, <B>--arch</B>
<DL COMPACT><DT id="61"><DD>
N'accepte dans les commandes
packages
et
contents
que les fichiers de paquets correspondant &agrave;
*_arch.deb
ou
*_all.deb
au lieu de tous les fichiers de paquets du chemin indiqu&eacute;.&Eacute;l&eacute;ment de configuration&nbsp;:
APT::FTPArchive::Architecture.
</DL>

<P>

<B>APT::FTPArchive::AlwaysStat</B>
<DL COMPACT><DT id="62"><DD>
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1)
met le plus de m&eacute;tadonn&eacute;es possible en cache dans une base de donn&eacute;es. Si les paquets sont recompil&eacute;s ou republi&eacute;s avec &agrave; nouveau la m&ecirc;me version, cela pourra causer des probl&egrave;mes car, alors, les m&eacute;tadonn&eacute;es en cache (p.&nbsp;ex. les tailles et les sommes de contr&ocirc;le) seront utilis&eacute;es. Si cette option est choisie, cela n'arrivera plus car le fichier sera contr&ocirc;l&eacute; pour v&eacute;rifier s'il a &eacute;t&eacute; modifi&eacute;. Veuillez noter que cette option n'est pas activ&eacute;e par d&eacute;faut car il est d&eacute;conseill&eacute; d'envoyer dans les archives des versions identiques. En th&eacute;orie, donc, ces probl&egrave;me ne devraient pas survenir et l'ensemble de ces contr&ocirc;les devient inutile.
</DL>

<P>

<B>APT::FTPArchive::LongDescription</B>
<DL COMPACT><DT id="63"><DD>
Cette option de configuration a &laquo;&nbsp;true&nbsp;&raquo; comme valeur par d&eacute;faut et ne devrait &ecirc;tre plac&eacute;e sur &laquo;&nbsp;false&nbsp;&raquo; que si l'archive cr&eacute;&eacute;e avec
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1)
fournit &eacute;galement des fichiers
Translation. Veuillez noter que le fichier ma&icirc;tre
Translation-en
ne peut &ecirc;tre cr&eacute;&eacute; que par la commande generate.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="64"><DD>
Afficher un bref r&eacute;sum&eacute; de l'utilisation.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="65"><DD>
Afficher la version du programme.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="66"><DD>
Fichier de configuration ; indique le fichier de configuration &agrave; utiliser. Le programme lira le fichier de configuration par d&eacute;faut puis le fichier indiqu&eacute; ici. Si les r&eacute;glages de configuration doivent &ecirc;tre &eacute;tablis avant l'analyse des fichiers de configuration par d&eacute;faut, un fichier peut &ecirc;tre indiqu&eacute; avec la variable d'environnement
<B>APT_CONFIG</B>. Veuillez consulter
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
pour des informations sur la syntaxe d'utilisation.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="67"><DD>
D&eacute;finir une option de configuration ; permet de r&eacute;gler une option de configuration donn&eacute;e. La syntaxe est
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
et
<B>--option</B>
peuvent &ecirc;tre utilis&eacute;es plusieurs fois pour d&eacute;finir des options diff&eacute;rentes.
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>EXEMPLES</H2>

<P>

Cr&eacute;ation d'un fichier &laquo;&nbsp;Packages&nbsp;&raquo; compress&eacute; pour un r&eacute;pertoire contenant des paquets binaires (.deb):
<P>
<DL COMPACT><DT id="68"><DD>



<PRE>
<B>apt-ftparchive</B> packages <I>r&eacute;pertoire</I> | <B>gzip</B> &gt; Packages.gz
</PRE>

</DL>




<A NAME="lbAP">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>DIAGNOSTICS</H2>

<P>

<B>apt-ftparchive</B>
retourne z&eacute;ro si tout se passe bien, le nombre&nbsp;100 en cas d'erreur.
<A NAME="lbAR">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAS">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAT">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="69"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="70"><DD>
</DL>

<A NAME="lbAU">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="71"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="72"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="73"><A HREF="#lbAB">NOM</A><DD>
<DT id="74"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="75"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="76"><A HREF="#lbAE">CONFIGURATION DE LA COMMANDE GENERATE</A><DD>
<DL>
<DT id="77"><A HREF="#lbAF">La section Dir</A><DD>
<DT id="78"><A HREF="#lbAG">La section Default</A><DD>
<DT id="79"><A HREF="#lbAH">La section TreeDefault</A><DD>
<DT id="80"><A HREF="#lbAI">La section Tree</A><DD>
<DT id="81"><A HREF="#lbAJ">La section BinDirectory</A><DD>
</DL>
<DT id="82"><A HREF="#lbAK">LE FICHIER D&laquo;&nbsp;OVERRIDE&nbsp;&raquo; POUR LES BINAIRES.</A><DD>
<DT id="83"><A HREF="#lbAL">LE FICHIER D&laquo;&nbsp;OVERRIDE&nbsp;&raquo; POUR LES SOURCES</A><DD>
<DT id="84"><A HREF="#lbAM">LE FICHIER SUPPL&Eacute;MENTAIRE D&laquo;&nbsp;OVERRIDE&nbsp;&raquo;</A><DD>
<DT id="85"><A HREF="#lbAN">OPTIONS</A><DD>
<DT id="86"><A HREF="#lbAO">EXEMPLES</A><DD>
<DT id="87"><A HREF="#lbAP">VOIR AUSSI</A><DD>
<DT id="88"><A HREF="#lbAQ">DIAGNOSTICS</A><DD>
<DT id="89"><A HREF="#lbAR">BOGUES</A><DD>
<DT id="90"><A HREF="#lbAS">TRADUCTEURS</A><DD>
<DT id="91"><A HREF="#lbAT">AUTEURS</A><DD>
<DT id="92"><A HREF="#lbAU">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:00 GMT, March 31, 2021
</BODY>
</HTML>
