
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-MIRR</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-MIRR</H1>
Section: APT (1)<BR>Updated: 09&nbsp;d&eacute;cembre&nbsp;2017<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt-transport-mirror - Transport d'APT pour une s&eacute;lection plus automatique du miroir
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Ce transport d'APT ne met pas en &oelig;uvre un protocole pour acc&eacute;der tout seul &agrave; des d&eacute;p&ocirc;ts locaux ou distants, mais obtenir une liste de miroirs et redirige toutes les requ&ecirc;tes vers le(s) miroir(s) choisi(s) dans cette liste, en y acc&eacute;dant gr&acirc;ce &agrave; d'autres transports tels que
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1). La fonctionnalit&eacute; de base est disponible depuis apt&nbsp;0.7.24, mais n'a &eacute;t&eacute; document&eacute;e qu'&agrave; partir d'apt&nbsp;1.6 qui fournit une version totalement retravaill&eacute;e du transport et des fonctionnalit&eacute;s prises en charge. Veuillez noter qu'un transport n'est jamais appel&eacute; directement par l'utilisateur, mais utilis&eacute; par les outils d'APT s'appuyant sur la configuration de l'utilisateur.
<P>

Si la r&eacute;cup&eacute;ration d'un fichier &agrave; partir d'un miroir &eacute;choue, la m&eacute;thode assure qu'un autre miroir possible de la liste est automatiquement essay&eacute; jusqu'&agrave; ce que le fichier soit r&eacute;cup&eacute;r&eacute; ou qu'il ne reste plus de miroir sur la liste, g&eacute;rant de fa&ccedil;on transparente les indisponibilit&eacute;s de serveur ou d'autres probl&egrave;mes similaires.
<P>

Les implications de s&eacute;curit&eacute; du transport d&eacute;pendent des consid&eacute;rations de s&eacute;curit&eacute;, associ&eacute;es au transport, qui ont pr&eacute;sid&eacute; &agrave; l'acquisition de la liste de miroirs et des transports impliqu&eacute;s dans l'accession au(x) miroir(s) choisi(s) par le transport.
<A NAME="lbAD">&nbsp;</A>
<H2>OPTIONS</H2>

<P>

Ce transport ne poss&egrave;de pas d'option de configuration pour le moment. La s&eacute;lection du miroir est bas&eacute;e uniquement sur les miroirs offerts dans la liste de miroirs et des fichiers qu'APT doit se procurer.
<A NAME="lbAE">&nbsp;</A>
<H3>Format de la liste de miroirs</H3>

<P>

Une liste de miroirs contient une ou plusieurs lignes qui sp&eacute;cifient chacune l'URI d'un miroir. Les lignes vides et celles commen&ccedil;ant par un caract&egrave;re di&egrave;se (#) sont ignor&eacute;es. Un URI d&eacute;bute toujours par un sch&egrave;me d'URI qui d&eacute;finit le transport utilis&eacute; pour ce miroir. Si, par exemple, l'URI d&eacute;bute par
http:, le transport responsable est
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
qui pourrait avoir des exigences particuli&egrave;res pour le format du reste de l'URI.
<P>

Les m&eacute;tadonn&eacute;es d'un miroir peuvent &ecirc;tre plac&eacute;es sur la m&ecirc;me ligne, s&eacute;par&eacute;es de l'URI par une tabulation. De multiples &eacute;l&eacute;ments de m&eacute;tadonn&eacute;es peuvent &ecirc;tre eux-m&ecirc;mes s&eacute;par&eacute;s par des tabulations ou des espaces. (C'est une fonctionnalit&eacute; avanc&eacute;e seulement disponible avec apt&nbsp;&gt;=&nbsp;1.6. Les versions d'APT ant&eacute;rieures &eacute;choueront &agrave; analyser les listes de miroirs utilisant cette fonctionnalit&eacute;.)
<P>

Depuis apt&nbsp;1.6, l'utilisation de listes de miroirs compress&eacute;es est aussi g&eacute;r&eacute;e. Veuillez noter que le nom de fichier de la liste de miroirs doit sp&eacute;cifier l'algorithme de compression utilis&eacute;&nbsp;; il n'y a pas d'auto-d&eacute;tection bas&eacute;e sur le contenu du fichier.
<A NAME="lbAF">&nbsp;</A>
<H3>S&eacute;lection du miroir par les m&eacute;tadonn&eacute;es</H3>

<P>

Comme cela est sp&eacute;cifi&eacute; dans le format, un miroir peut avoir des m&eacute;tadonn&eacute;es suppl&eacute;mentaires attach&eacute;es pour &eacute;viter qu'il soit s&eacute;lectionn&eacute; pour la r&eacute;cup&eacute;ration d'un fichier qui ne correspond pas &agrave; ces m&eacute;tadonn&eacute;es. De cette fa&ccedil;on, la liste de miroirs peut contenir par exemple des miroirs partiels fournissant seulement certaines architectures et APT choisira automatiquement un autre miroir pour les fichiers requ&eacute;rant une architecture non list&eacute;e. Sont prises en charge les limites li&eacute;es &agrave; l'architecture (arch), au nom de code de la version (codename), aux composants du d&eacute;p&ocirc;t o&ugrave; se trouve le fichier (component), &agrave; la langue &agrave; laquelle le fichier s'applique (lang), au nom de la suite de la version
suite) et au type du fichier (type).
<A NAME="lbAG">&nbsp;</A>
<H3>Ordre de repli pour les miroirs</H3>

<P>

Si aucune priorit&eacute; n'est donn&eacute;e &agrave; un miroir par la cl&eacute; de m&eacute;tadonn&eacute;e
priority, l'ordre de contact des miroirs est al&eacute;atoire. Si un ensemble particulier de miroirs doit &ecirc;tre essay&eacute; avant que n'importe lequel des autres ensembles ne le soit, une priorit&eacute; peut &ecirc;tre sp&eacute;cifi&eacute;e explicitement. Les miroirs avec les num&eacute;ros les plus bas sont essay&eacute;s en premier. Les miroirs qui n'ont pas de priorit&eacute; explicite portent par d&eacute;faut le num&eacute;ro le plus &eacute;lev&eacute; possible, et donc, sont essay&eacute;s en dernier. Le choix entre les miroirs de m&ecirc;me priorit&eacute; est aussi al&eacute;atoire.
<A NAME="lbAH">&nbsp;</A>
<H3>Transports permis dans une liste de miroir</H3>

<P>

La disponibilit&eacute; et le choix des transports dans une liste de miroirs sont limit&eacute;s par la mani&egrave;re dont le client APT acc&egrave;de &agrave; la liste des miroirs. Si un transport local comme
file
ou
copy
est utilis&eacute;, la liste de miroirs peut aussi inclure des sources locales, alors qu'une liste de miroirs atteinte par
http
ne le peut pas. Par ailleurs, une liste de miroirs ne peut pas contenir une liste de miroirs ou d'autres transports enveloppants (comme
apt-transport-tor). Voir la documentation sur ces transports pour conna&icirc;tre la mani&egrave;re de les utiliser avec la m&eacute;thode miroir.
<P>

Veuillez noter que les versions d'APT ant&eacute;rieures &agrave;&nbsp;1.6 ne prennent pas en charge d'autres transports que
http.
<A NAME="lbAI">&nbsp;</A>
<H2>EXEMPLES</H2>

<A NAME="lbAJ">&nbsp;</A>
<H3>Exemple basique</H3>

<P>

Voici un exemple basique de liste de miroirs prise en charge par toutes les versions d'APT avec une m&eacute;thode de miroir (&gt;=&nbsp;0.7.24) dans lequel le client choisira n'importe lequel des trois miroirs&nbsp;:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<A HREF="http://ftp.de.debian.org/debian/">http://ftp.de.debian.org/debian/</A>
<A HREF="http://ftp.us.debian.org/debian/">http://ftp.us.debian.org/debian/</A>
<A HREF="http://deb.debian.org/debian/">http://deb.debian.org/debian/</A>
</PRE>

</DL>




<P>

Si un fichier avec ce contenu est stock&eacute; sur la machine sous le nom de
/etc/apt/mirrorlist.txt, il peut &ecirc;tre utilis&eacute; comme cela dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
(&agrave; partir d'apt&nbsp;1.6)&nbsp;:
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
deb mirror+file:/etc/apt/mirrorlist.txt buster main
</PRE>

</DL>




<P>

Toutes les versions de la m&eacute;thode miroir prennent en charge une liste de miroirs accessible par HTTP, aussi, dans la mesure o&ugrave; elle est disponible &agrave; l'adresse
<A HREF="http://apt.example.org/mirror.lst,">http://apt.example.org/mirror.lst,</A> l'entr&eacute;e de sources.list ci-dessus peut &ecirc;tre &eacute;crite plut&ocirc;t ainsi&nbsp;:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
deb <A HREF="mirror://apt.example.org/mirror.lst">mirror://apt.example.org/mirror.lst</A> buster main
</PRE>

</DL>




<P>

Veuillez noter que depuis apt&nbsp;1.6, l'utilisation de
mirror+http
est pr&eacute;f&eacute;rable &agrave;
mirror
pour uniformiser. La fonctionnalit&eacute; est la m&ecirc;me.
<A NAME="lbAK">&nbsp;</A>
<H3>Exemple de s&eacute;lection du miroir avec des m&eacute;tadonn&eacute;es am&eacute;lior&eacute;es</H3>

<P>

Comme cela est expliqu&eacute; dans la d&eacute;finition de format, les versions d'APT ant&eacute;rieures &agrave;&nbsp;1.6 ne prennent pas cela en charge et &eacute;choueront &agrave; analyser la liste de miroirs. L'exemple de liste de miroirs est complexe intentionnellement pour montrer certains aspects de la s&eacute;lection. La configuration suivante est suppos&eacute;e&nbsp;: le premier miroir est un miroir local accessible par la m&eacute;thode &laquo;&nbsp;file&nbsp;&raquo;, mais possiblement incomplet&nbsp;; le second miroir poss&egrave;de une excellente connexion, c'est un miroir partiel dans la mesure o&ugrave; il ne contient que des fichiers li&eacute;s aux architectures
amd64
et
all. Les miroirs restants sont des miroirs ordinaires qui devraient &ecirc;tre contact&eacute;s seulement si les pr&eacute;c&eacute;dents ne fonctionnent pas.
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
file:/srv/local/debian/mirror/  priority:1 type:index
<A HREF="http://partial.example.org/mirror/">http://partial.example.org/mirror/</A>      priority:2 arch:amd64 arch:all type:deb
<A HREF="http://ftp.us.debian.org/debian/">http://ftp.us.debian.org/debian/</A>        type:deb
<A HREF="http://ftp.de.debian.org/debian/">http://ftp.de.debian.org/debian/</A>        type:deb
<A HREF="https://deb.debian.org/debian/">https://deb.debian.org/debian/</A>
</PRE>

</DL>




<P>

Dans une configuration avec cette liste de miroirs, le premier miroir sera utilis&eacute; pour t&eacute;l&eacute;charger tous les fichiers d'index en supposant que la liste de miroirs elle-m&ecirc;me est atteinte par un transport local comme
file. Si ce n'est pas le cas, si le miroir est inaccessible ou s'il ne contient pas le fichier requis, un autre miroir sera utilis&eacute; pour r&eacute;cup&eacute;rer le fichier, choisi selon le type du fichier&nbsp;: un fichier d'index sera servi par le dernier miroir de la liste, tandis qu'un paquet de l'architecture
amd64
est servi par le second et ceux, par exemple, de l'architecture
i386
par un des trois derniers.
<A NAME="lbAL">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAM">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTEUR</H2>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="5"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="6"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="7"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="8"><A HREF="#lbAB">NOM</A><DD>
<DT id="9"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="10"><A HREF="#lbAD">OPTIONS</A><DD>
<DL>
<DT id="11"><A HREF="#lbAE">Format de la liste de miroirs</A><DD>
<DT id="12"><A HREF="#lbAF">S&eacute;lection du miroir par les m&eacute;tadonn&eacute;es</A><DD>
<DT id="13"><A HREF="#lbAG">Ordre de repli pour les miroirs</A><DD>
<DT id="14"><A HREF="#lbAH">Transports permis dans une liste de miroir</A><DD>
</DL>
<DT id="15"><A HREF="#lbAI">EXEMPLES</A><DD>
<DL>
<DT id="16"><A HREF="#lbAJ">Exemple basique</A><DD>
<DT id="17"><A HREF="#lbAK">Exemple de s&eacute;lection du miroir avec des m&eacute;tadonn&eacute;es am&eacute;lior&eacute;es</A><DD>
</DL>
<DT id="18"><A HREF="#lbAL">BOGUES</A><DD>
<DT id="19"><A HREF="#lbAM">TRADUCTEURS</A><DD>
<DT id="20"><A HREF="#lbAN">AUTEUR</A><DD>
<DT id="21"><A HREF="#lbAO">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:00 GMT, March 31, 2021
</BODY>
</HTML>
