
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-divert</TITLE>
</HEAD><BODY>
<H1>dpkg-divert</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-divert - Remplacer la version d'un fichier contenu dans un paquet.
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-divert</B> [<I>option</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-divert</B> sert &agrave; cr&eacute;er et &agrave; mettre &agrave; jour la liste des d&eacute;tournements.
<P>

Le <I>d&eacute;tournement</I> de fichier est un moyen d'obliger <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1) &agrave; installer
un fichier non pas dans l'emplacement pr&eacute;vu mais dans un autre. Les scripts
des paquets Debian se servent du d&eacute;tournement pour d&eacute;placer les fichiers qui
cr&eacute;ent des conflits. Les administrateurs s'en servent, lors de
l'installation d'une version plus r&eacute;cente d'un paquet, pour remplacer les
fichiers de configuration de certains paquets ou bien &agrave; chaque fois que des
fichiers (qui ne sont pas des &laquo;&nbsp;conffiles&nbsp;&raquo;) doivent &ecirc;tre pr&eacute;serv&eacute;s par
<B>dpkg</B>.
<P>
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1">[<B>--add</B>] <I>fichier</I><DD>
Ajoute un d&eacute;tournement pour <I>fichier</I>. Le fichier n'est pas renomm&eacute;
actuellement, voir <B>--rename</B>.
<DT id="2"><B>--remove</B><I> fichier</I><DD>
Supprime un d&eacute;tournement pour <I>fichier</I>. Le fichier n'est pas renomm&eacute;
actuellement, voir <B>--rename</B>.
<DT id="3"><B>--list</B> <I>motif-global</I><DD>
Liste les d&eacute;tournements qui correspondent &agrave; <I>motif-global</I>.
<DT id="4"><B>--listpackage</B><I> fichier</I><DD>
Affiche le nom du paquet qui d&eacute;tourne <I>fichier</I> (depuis
dpkg&nbsp;1.15.0). Affiche LOCAL si <I>fichier</I> est d&eacute;tourn&eacute; localement et
n'affiche rien si <I>fichier</I> n'est pas d&eacute;tourn&eacute;.
<DT id="5"><B>--truename</B><I> fichier</I><DD>
Affiche le vrai nom d'un fichier d&eacute;tourn&eacute;.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="6"><B>--admindir</B><I> r&eacute;pertoire</I><DD>
D&eacute;finit le r&eacute;pertoire d'administration comme <I>r&eacute;pertoire</I>. Par d&eacute;faut c'est
&laquo;&nbsp;<I>/var/lib/dpkg</I>&nbsp;&raquo;.
<DT id="7"><B>--instdir</B> <I>r&eacute;pertoire</I><DD>
D&eacute;finit le r&eacute;pertoire d'installation qui d&eacute;signe le r&eacute;pertoire o&ugrave; les
paquets sont install&eacute;s (depuis dpkg&nbsp;1.19.2). Par d&eacute;faut c'est &laquo;&nbsp;<I>/</I>&nbsp;&raquo;.
<DT id="8"><B>--root</B> <I>r&eacute;pertoire</I><DD>
D&eacute;finit le r&eacute;pertoire root &agrave; <B>directory</B>, ce qui d&eacute;finit le r&eacute;pertoire
d'installation &agrave; &laquo;&nbsp;<I>r&eacute;pertoire</I>&nbsp;&raquo; et le r&eacute;pertoire d'administration &agrave;
&laquo;&nbsp;<I>r&eacute;pertoire</I><B>/var/lib/dpkg</B>&nbsp;&raquo; (depuis dpkg&nbsp;1.19.2).
<DT id="9"><B>--divert</B><I> d&eacute;tourner-dans</I><DD>
<I>d&eacute;tourner-dans</I> est l'emplacement vers lequel les versions de <I>fichier</I>,
tel qu'il est donn&eacute; par d'autres paquets, seront d&eacute;tourn&eacute;es.
<DT id="10"><B>--local</B><DD>
Indique que toutes les versions de ce fichier sont d&eacute;tourn&eacute;es. Cela signifie
qu'il n'y a pas d'exception et quel que soit le paquet install&eacute;, ce fichier
sera d&eacute;tourn&eacute;. Un administrateur peut par exemple installer une version
modifi&eacute;e localement.
<DT id="11"><B>--package</B><I> paquet</I><DD>
<I>paquet</I> est le nom du paquet dont la copie de <I>fichier</I> ne sera pas
d&eacute;tourn&eacute;e. Autrement dit, <I>fichier</I> sera d&eacute;tourn&eacute; sauf s'il appartient &agrave;
<I>paquet</I>.
<DT id="12"><B>--quiet</B><DD>
Mode silencieux, pas de bavardage.
<DT id="13"><B>--rename</B><DD>
Met en fait le fichier de c&ocirc;t&eacute;. Quand le fichier de destination existe,
<B>dpkg-divert</B> interrompt l'op&eacute;ration. C'est le comportement courant utilis&eacute;
pour les d&eacute;tournements de fichiers &agrave; partir de l'ensemble de paquets
non-<B>Essential</B> (voir <B>--no-rename</B> pour plus de d&eacute;tails).
<DT id="14"><B>--no-rename</B><DD>
Indique que le fichier ne doit pas &ecirc;tre renomm&eacute; lors de l'ajout ou du
retrait d'un d&eacute;tournement de la base de donn&eacute;es (depuis dpkg&nbsp;1.19.1). Cela
est destin&eacute; au d&eacute;tournement de fichiers de l'ensemble de paquets
<B>essential</B>, o&ugrave; la disparition temporaire du fichier original n'est pas
acceptable, car il rend non fonctionnel le syst&egrave;me. C'est le comportement
par d&eacute;faut, mais cela changera durant le cycle de dpkg&nbsp;1.20.x.
<DT id="15"><B>--test</B><DD>
Mode de test, ne modifie rien r&eacute;ellement, montre seulement.
<DT id="16"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="17"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="18"><B>0</B><DD>
L'action demand&eacute;e s'est correctement d&eacute;roul&eacute;e.
<DT id="19"><B>2</B><DD>
Erreur fatale ou irr&eacute;cup&eacute;rable due &agrave; l'utilisation d'une ligne de commande
non valable, ou interactions avec le syst&egrave;me, telles que des acc&egrave;s &agrave; la base
de donn&eacute;es, des allocations de m&eacute;moire,&nbsp;etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="20"><B>DPKG_ROOT</B><DD>
Si cette variable est positionn&eacute;e et que les options <B>--admindir</B> ou
<B>--root</B> ne sont pas pr&eacute;cis&eacute;es, ce r&eacute;pertoire sera utilis&eacute; comme r&eacute;pertoire
racine du syst&egrave;me de fichiers (depuis dpkg&nbsp;1.19.2).
<DT id="21"><B>DPKG_ADMINDIR</B><DD>
Si cette variable est positionn&eacute;e et que les options <B>--admindir</B> ou
<B>--root</B> ne sont pas pr&eacute;cis&eacute;es, ce r&eacute;pertoire sera utilis&eacute; comme r&eacute;pertoire
de donn&eacute;es pour <B>dpkg</B>.
<DT id="22"><B>DPKG_MAINTSCRIPT_PACKAGE</B><DD>
Si cette variable est positionn&eacute;e et que les options <B>--local</B> et
<B>--package</B> ne le sont pas, <B>dpkg-divert</B> en utilisera la valeur comme nom
de paquet.
<DT id="23"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="24"><I>/var/lib/dpkg/diversions</I><DD>
Ce fichier contient la liste des d&eacute;tournements en &oelig;uvre sur le syst&egrave;me. Il
se trouve dans le r&eacute;pertoire d'administration de <B>dpkg</B>, avec d'autres
fichiers importants comme <I>status</I> ou <I>available</I>.
<BR>

Note&nbsp;: <B>dpkg-divert</B> pr&eacute;serve l'ancienne copie de ce fichier, avec
l'extension <I>-old</I>, avant de la remplacer par la nouvelle.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>NOTES</H2>

Pour l'ajout, le d&eacute;faut est <B>--local</B> et <B>--divert</B>
<I>original</I><B>.distrib</B>. Pour la suppression, <B>--package</B> ou <B>--local</B> et
<B>--divert</B> doivent correspondre quand ils sont pr&eacute;cis&eacute;s.
<P>
On ne peut pas d&eacute;tourner des r&eacute;pertoires avec <B>dpkg-divert</B>.
<P>
Il faut faire attention quand une biblioth&egrave;que partag&eacute;e est
d&eacute;tourn&eacute;e. <B><A HREF="/cgi-bin/man/man2html?8+ldconfig">ldconfig</A></B>(8) cr&eacute;e un lien symbolique &agrave; partir du champ
DT_SONAME embarqu&eacute; dans la biblioth&egrave;que. <B>ldconfig</B> ne conna&icirc;t pas les
d&eacute;tournements (seul <B>dpkg</B> le fait), et si une biblioth&egrave;que d&eacute;tourn&eacute;e
poss&egrave;de le m&ecirc;me SONAME que la biblioth&egrave;que non d&eacute;tourn&eacute;e, le lien symbolique
peut pointer en fin de compte sur la biblioth&egrave;que d&eacute;tourn&eacute;e.
<A NAME="lbAK">&nbsp;</A>
<H2>EXEMPLES</H2>

Pour d&eacute;tourner toutes les copies de <I>/usr/bin/example</I> vers
<I>/usr/bin/example.foo</I>, c'est-&agrave;-dire demander aux paquets qui fournissent
<I>/usr/bin/example</I> de l'installer dans <I>/usr/bin/example.foo</I>, en
effectuant le changement de nom si n&eacute;cessaire&nbsp;:
<DL COMPACT>
<DT id="25">
<DD>dpkg-divert --divert /usr/bin/example.foo --rename /usr/bin/example
</DL>
<P>

Pour supprimer ce d&eacute;tournement&nbsp;:
<DL COMPACT>
<DT id="26">
<DD>dpkg-divert --rename --remove /usr/bin/example
<P>
</DL>
<P>

Pour d&eacute;tourner n'importe quel paquet qui veut installer <I>/usr/bin/example</I>
dans <I>/usr/bin/example.foo</I>, sauf votre propre paquet <I>wibble</I>&nbsp;:
<DL COMPACT>
<DT id="27">
<DD>dpkg-divert --package wibble --divert /usr/bin/example.foo --rename
/usr/bin/example
</DL>
<P>

Pour supprimer ce d&eacute;tournement&nbsp;:
<DL COMPACT>
<DT id="28">
<DD>dpkg-divert --package wibble --rename --remove /usr/bin/example
</DL>
<A NAME="lbAL">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<A NAME="lbAM">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="29"><A HREF="#lbAB">NOM</A><DD>
<DT id="30"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="31"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="32"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="33"><A HREF="#lbAF">OPTIONS</A><DD>
<DT id="34"><A HREF="#lbAG">CODE DE SORTIE</A><DD>
<DT id="35"><A HREF="#lbAH">ENVIRONNEMENT</A><DD>
<DT id="36"><A HREF="#lbAI">FICHIERS</A><DD>
<DT id="37"><A HREF="#lbAJ">NOTES</A><DD>
<DT id="38"><A HREF="#lbAK">EXEMPLES</A><DD>
<DT id="39"><A HREF="#lbAL">VOIR AUSSI</A><DD>
<DT id="40"><A HREF="#lbAM">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
