
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-deb</TITLE>
</HEAD><BODY>
<H1>dpkg-deb</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-deb - Outil pour la manipulation des archives (.deb) des paquets Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-deb</B> [<I>options</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-deb</B> cr&eacute;e un paquet, d&eacute;paquette une archive ou donne des
renseignements sur les archives Debian
<P>

<B>dpkg</B> sert &agrave; installer ou &agrave; supprimer des paquets sur le syst&egrave;me.
<P>

Il est possible d'ex&eacute;cuter <B>dpkg-deb</B> en appelant <B>dpkg</B> avec les options
de <B>dpkg-deb</B>. <B>dpkg</B> comprend que <B>dpkg-deb</B> est appel&eacute; et le lance.
<P>

Pour la plupart des commandes recevant un argument d'entr&eacute;e d'archive,
l'archive peut &ecirc;tre lue &agrave; partir de l'entr&eacute;e standard si le nom d'archive
est donn&eacute; sous la forme d'un caract&egrave;re moins (&laquo;<B>-</B>&raquo;) unique&nbsp;; sinon,
l'absence de prise en charge sera document&eacute;e dans leurs descriptions de
commande respectives.
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1"><B>-b</B>, <B>--build</B> <I>r&eacute;pertoire-binaire</I> [<I>archive</I>|<I>r&eacute;pertoire</I>]<DD>
Cr&eacute;e une archive Debian avec l'arborescence contenue dans
<I>r&eacute;pertoire-binaire</I>. <I>r&eacute;pertoire-binaire</I> doit poss&eacute;der un
sous-r&eacute;pertoire <B>DEBIAN</B> qui contient les fichiers de contr&ocirc;le tels que le
fichier &laquo;&nbsp;control&nbsp;&raquo; lui-m&ecirc;me. Ce r&eacute;pertoire <I>n'appara&icirc;t pas</I> dans l'archive
de l'arborescence du paquet binaire&nbsp;; mais les fichiers qu'il contient sont
mis dans la zone de contr&ocirc;le du paquet binaire.
<P>
&Agrave; moins de pr&eacute;ciser <B>--nocheck</B>, <B>dpkg-deb</B> lit <B>DEBIAN/control</B> et
l'analyse. Il cherche dans le fichier les erreurs de syntaxe et d'autres
probl&egrave;mes existants&nbsp;; puis il affiche le nom du paquet binaire qu'il
construit. <B>dpkg-deb</B> v&eacute;rifie aussi les permissions des scripts du
responsable et des autres fichiers qu'il trouve dans le r&eacute;pertoire de
contr&ocirc;le <B>DEBIAN</B>.
<P>
Quand aucune <I>archive</I> n'est donn&eacute;e, <B>dpkg-deb</B> &eacute;crit le paquet
dans<I>r&eacute;pertoire-binaire</I><B>.deb</B>.
<P>
Si l'archive qui doit &ecirc;tre cr&eacute;&eacute;e existe d&eacute;j&agrave;, elle est remplac&eacute;e.
<P>
Quand le second argument est un r&eacute;pertoire, <B>dpkg-deb</B> &eacute;crira dans le
fichier <I>r&eacute;pertoire</I><B>/</B><I>paquet</I><B>_</B><I>version</I><B>_</B><I>arch</I><B>.deb</B>. Quand un
r&eacute;pertoire cible est pr&eacute;cis&eacute; &agrave; la place d'un fichier, l'option <B>--nocheck</B>
ne doit pas &ecirc;tre utilis&eacute;e (puisque <B>dpkg-deb</B> a besoin de lire et
d'analyser le fichier de contr&ocirc;le du paquet pour conna&icirc;tre le nom de fichier
&agrave; utiliser).
<DT id="2"><B>-I</B>, <B>--info</B> <I>archive</I> [<I>nom-fichier-control</I>...]<DD>
Donne des renseignements sur une archive de paquet binaire.
<P>
Quand aucun argument <I>fichier-control</I> n'est pr&eacute;cis&eacute;, un r&eacute;sum&eacute; du contenu
du paquet ainsi que son fichier &laquo;&nbsp;control&nbsp;&raquo; sont affich&eacute;s.
<P>
Quand un argument <I>fichier-control</I> est pr&eacute;cis&eacute;, <B>dpkg-deb</B> affiche les
&eacute;l&eacute;ments dans l'ordre d'apparition&nbsp;; quand l'un des &eacute;l&eacute;ments n'est pas
pr&eacute;sent, il affiche un message d'erreur sur &laquo;&nbsp;stderr&nbsp;&raquo; et quitte avec un
code &eacute;gal &agrave; <B>2</B>.
<DT id="3"><B>-W</B>, <B>--show</B> <I>archive</I><DD>
Cette option donne des informations sur l'archive d'un paquet binaire selon
le format sp&eacute;cifi&eacute; par l'argument <B>--showformat</B>. Le format par d&eacute;faut
affiche le nom et la version du paquet sur une seule ligne, s&eacute;par&eacute;s par une
tabulation.
<DT id="4"><B>-f</B>, <B>--field</B> <I>archive</I> [<I>nom-du-champ-de-control</I>...]<DD>
Extrait les renseignements du fichier &laquo;&nbsp;control&nbsp;&raquo; de l'archive du paquet
binaire.
<P>
Quand aucun <I>nom-du-champ-de-control</I> n'est pr&eacute;cis&eacute;, le fichier &laquo;&nbsp;control&nbsp;&raquo;
est affich&eacute; en entier.
<P>
Quand il y en a un, <B>dpkg-deb</B> affiche ses &eacute;l&eacute;ments en suivant leur ordre
d'apparition dans le fichier &laquo;&nbsp;control&nbsp;&raquo;. Quand il y a plus d'un argument
<I>nom-champ-control</I>, <B>dpkg-deb</B> fait pr&eacute;c&eacute;der chacun par le nom de son
champ (puis par un &laquo;&nbsp;deux-points&nbsp;&raquo; et une espace).
<P>
L'absence des champs demand&eacute;s ne provoque pas de message d'erreur.
<DT id="5"><B>-c</B>, <B>--contents</B> <I>archive</I><DD>
Liste la partie arborescence des fichiers d'une archive de paquet. Elle est
actuellement produite dans le format g&eacute;n&eacute;r&eacute; par un listing verbeux de
<B>tar</B>.
<DT id="6"><B>-x</B>, <B>--extract</B> <I>archive r&eacute;pertoire</I><DD>
Extrait l'arborescence des fichiers d'un paquet archive dans le r&eacute;pertoire
sp&eacute;cifi&eacute;.
<P>
Il faut remarquer que l'extraction d'un paquet dans le r&eacute;pertoire root <I>ne
produit pas</I> une installation correcte&nbsp;! Utilisez <B>dpkg</B> pour
l'installation des paquets.
<P>
<I>r&eacute;pertoire</I> est cr&eacute;&eacute; si n&eacute;cessaire (mais pas ses r&eacute;pertoires parents) et
ses permissions sont modifi&eacute;es pour correspondre au contenu du paquet.
<DT id="7"><B>-X</B>, <B>--vextract</B> <I>archive r&eacute;pertoire</I><DD>
Comme <B>--extract</B> (<B>-x</B>) avec <B>--verbose</B> (<B>-v</B>), ce qui affiche la
liste des fichiers au fur et &agrave; mesure qu'ils sont extraits.
<DT id="8"><B>-R</B>, <B>--raw-extract</B> <I>archive r&eacute;pertoire</I><DD>
Extrait l'arborescence des fichiers d'un paquet archive dans le r&eacute;pertoire
sp&eacute;cifi&eacute; et les fichiers d'information de contr&ocirc;le dans un sous-r&eacute;pertoire
nomm&eacute; <B>DEBIAN</B> de ce r&eacute;pertoire (depuis dpkg&nbsp;1.16.1).
<P>
Le r&eacute;pertoire cible est cr&eacute;&eacute; si n&eacute;cessaire (mais pas ses r&eacute;pertoires
parents).
<P>
L'archive d'entr&eacute;e n'est pas actuellement trait&eacute;e de fa&ccedil;on s&eacute;quentielle,
aussi, sa lecture &agrave; partir de l'entr&eacute;e standard (&laquo;&nbsp;<B>-</B>&nbsp;&raquo;) n'est <B>pas</B>
prise en charge.
<DT id="9"><B>--ctrl-tarfile</B> <I>archive</I><DD>
Extrait les donn&eacute;es de contr&ocirc;le d'un paquet binaire et les envoie sur la
sortie standard dans le format propre &agrave; la commande <B>tar</B> (depuis
dpkg&nbsp;1.17.14). En combinant cette option avec la commande <B><A HREF="/cgi-bin/man/man2html?1+tar">tar</A></B>(1), on peut
ainsi extraire un fichier de contr&ocirc;le pr&eacute;cis d'une archive de
paquet. L'archive d'entr&eacute;e sera toujours trait&eacute;e s&eacute;quentiellement.
<DT id="10"><B>--fsys-tarfile</B> <I>archive</I><DD>
Extrait les donn&eacute;es de l'arborescence d'un paquet binaire et les envoie sur
la sortie standard dans le format propre &agrave; la commande <B>tar</B>. En combinant
cette option avec la commande <B><A HREF="/cgi-bin/man/man2html?1+tar">tar</A></B>(1), on peut ainsi extraire un fichier
pr&eacute;cis d'une archive de paquet. L'archive d'entr&eacute;e sera toujours trait&eacute;e
s&eacute;quentiellement.
<DT id="11"><B>-e</B>, <B>--control</B> <I>archive</I> [<I>r&eacute;pertoire</I>]<DD>
Extrait les fichiers de contr&ocirc;le d'une archive de paquet dans le r&eacute;pertoire
sp&eacute;cifi&eacute;.
<P>
Quand aucun r&eacute;pertoire n'est pr&eacute;cis&eacute;, on utilise un sous-r&eacute;pertoire
<B>DEBIAN</B> du r&eacute;pertoire actuel.
<P>
Le r&eacute;pertoire cible est cr&eacute;&eacute; si n&eacute;cessaire (mais pas ses r&eacute;pertoires
parents).
<DT id="12"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="13"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="14"><B>--showformat=</B><I>format</I><DD>
Cette option sert &agrave; sp&eacute;cifier le format de sortie de l'option <B>--show</B>. Ce
format sera utilis&eacute; pour chaque paquet list&eacute;.
<P>
Cet argument est une cha&icirc;ne qui peut r&eacute;f&eacute;rencer tout champ avec la forme
&laquo;&nbsp;${<I>field-name</I>}&nbsp;&raquo;&nbsp;; une liste des champs valables peut &ecirc;tre facilement
produite avec l'option <B>-I</B> sur le m&ecirc;me paquet. Une explication compl&egrave;te
des options de formatage (avec les s&eacute;quences d'&eacute;chappement et les espaces
entre les champs) se trouve dans la page <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1), option
<B>--showformat</B>.
<P>
Par d&eacute;faut, la valeur de ce champ est &laquo;&nbsp;${Package}\t${Version}\n&nbsp;&raquo;.
<DT id="15"><B>-z</B><I>niveau_compression</I><DD>
Indique le niveau de compression &agrave; fournir au logiciel de compression appel&eacute;
en sous-main lors de la compression du paquet. La valeur par d&eacute;faut est&nbsp;9
pour gzip et&nbsp;6 pour xz. Les valeurs possibles sont les entiers compris
entre&nbsp;0 et&nbsp;9&nbsp;: 0&nbsp;correspond &agrave; aucune compression pour gzip. Avant la
version&nbsp;1.16.2, la valeur&nbsp;0 correspondait &agrave; &laquo;&nbsp;aucune compression&nbsp;&raquo; pour tous
les logiciels de compression.
<DT id="16"><B>-S</B><I>strat&eacute;gie-compression</I><DD>
Indique la strat&eacute;gie de compression &agrave; fournir au logiciel de compression
appel&eacute; en sous-main lors de la construction du paquet (depuis
dpkg&nbsp;1.16.2). Les valeurs autoris&eacute;es sont <B>none</B> (depuis dpkg&nbsp;1.16.4),
<B>filtered</B>, <B>huffman</B>, <B>rle</B> et <B>fixed</B> pour gzip (depuis dpkg&nbsp;1.17.0)
et <B>extreme</B> pour xz.
<DT id="17"><B>-Z</B><I>type_compression</I><DD>
Indique le type de compression &agrave; utiliser lors de la construction d'un
paquet. Les valeurs autoris&eacute;es sont <B>gzip</B>, <B>xz</B> (depuis dpkg&nbsp;1.15.6) et
<B>none</B> (<B>xz</B> est la valeur par d&eacute;faut).
<DT id="18"><B>--[no-]uniform-compression</B><DD>
Indique que les m&ecirc;mes param&egrave;tres de compression doivent &ecirc;tre utilis&eacute;s pour
tous les membres de l'archive (c'est-&agrave;-dire <B>control.tar</B> et <B>data.tar</B>&nbsp;;
depuis dpkg&nbsp;1.17.6). Sinon, seul le membre <B>data.tar</B> utilisera ces
param&egrave;tres. <B>none</B>, <B>gzip</B> et <B>xz</B> sont les seuls types de compression
pris en charge pour cette option d'uniformit&eacute; (depuis dpkg&nbsp;1.19.0). La
compression uniforme est l'option par d&eacute;faut (depuis dpkg&nbsp;1.19.0).
<DT id="19"><B>--root-owner-group</B><DD>
Fixe le propri&eacute;taire et le groupe de chaque entr&eacute;e dans les donn&eacute;es de
l'arborescence du syst&egrave;me de fichiers &agrave; root avec l'identit&eacute;&nbsp;0 (depuis
dpkg&nbsp;1.19.0).
<P>
<B>Note</B>&nbsp;: cette option peut &ecirc;tre utile pour les constructions sans root
(voir <I>rootless-builds.txt</I>) mais ne devrait <B>pas</B> &ecirc;tre utilis&eacute;e si les
entr&eacute;es ont un propri&eacute;taire ou un groupe qui n'est pas root. Leur prise en
charge sera ajout&eacute;e plus tard sous la forme d'un m&eacute;ta-manifeste.
<DT id="20"><B>--deb-format=</B><I>format</I><DD>
Indique la version du format d'archive utilis&eacute; lors de la construction
(depuis dpkg&nbsp;1.17.0). Les valeurs autoris&eacute;es sont <B>2.0</B> pour le nouveau
format et <B>0.939000</B> pour l'ancien (la valeur par d&eacute;faut est <B>2.0</B>).
<P>
L'ancien format d'archive, moins facilement compris par les outils
non-Debian, est maintenant d&eacute;pass&eacute;. On l'utilise seulement quand on
construit des paquets qui doivent &ecirc;tre analys&eacute;s par des versions de dpkg
plus anciennes que la version&nbsp;0.93.76 (septembre 1995), qui fut produite
uniquement pour le format &laquo;&nbsp;i386 a.out&nbsp;&raquo;.
<DT id="21"><B>--nocheck</B><DD>
Emp&ecirc;che les v&eacute;rifications normales de <B>dpkg-deb --build</B> quant au contenu
propos&eacute; d'une archive. De cette fa&ccedil;on, on peut construire n'importe quelle
archive, aussi d&eacute;fectueuse soit-elle.
<DT id="22"><B>-v</B>, <B>--verbose</B><DD>
Active l'affichage bavard (depuis dpkg&nbsp;1.16.1). Cela n'affecte actuellement
que <B>--extract</B> et le rend analogue &agrave; <B>--vextract</B>.
<DT id="23"><B>-D</B>, <B>--debug</B><DD>
Permet les messages de d&eacute;bogage. Ce n'est pas tr&egrave;s int&eacute;ressant.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="24"><B>0</B><DD>
L'action demand&eacute;e s'est correctement d&eacute;roul&eacute;e.
<DT id="25"><B>2</B><DD>
Erreur fatale ou irr&eacute;cup&eacute;rable due &agrave; l'utilisation d'une ligne de commande
non valable, ou interactions avec le syst&egrave;me, telles que des acc&egrave;s &agrave; la base
de donn&eacute;es, des allocations de m&eacute;moire,&nbsp;etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="26"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="27"><B>TMPDIR</B><DD>
Si cette option est utilis&eacute;e, <B>dpkg-deb</B> l'utilisera comme r&eacute;pertoire pour
cr&eacute;er les fichiers et r&eacute;pertoires temporaires.
<DT id="28"><B>SOURCE_DATE_EPOCH</B><DD>
Si cette option est utilis&eacute;e, elle sera utilis&eacute;e comme horodatage (en
seconde &agrave; partir de &laquo;&nbsp;l'epoch&nbsp;&raquo;) dans le conteneur <B><A HREF="/cgi-bin/man/man2html?5+ar">ar</A></B>(5) de <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), et
pour fixer le &laquo;&nbsp;mtime&nbsp;&raquo; dans les entr&eacute;es du fichier <B><A HREF="/cgi-bin/man/man2html?5+tar">tar</A></B>(5).
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>NOTES</H2>

N'essayez pas d'installer un logiciel avec <B>dpkg-deb</B>&nbsp;! Vous devez utiliser
<B>dpkg</B> pour &ecirc;tre s&ucirc;r que tous ses fichiers sont correctement mis en place,
que les scripts du paquet sont ex&eacute;cut&eacute;s et que son contenu et son &eacute;tat sont
enregistr&eacute;s.
<A NAME="lbAJ">&nbsp;</A>
<H2>BOGUES</H2>

<B>dpkg-deb -I</B> <I>paquet1</I><B>.deb</B> <I>paquet2</I><B>.deb</B> se trompe.
<P>
Il n'existe pas d'authentification des fichiers <B>.deb</B>. Il n'existe m&ecirc;me
pas de syst&egrave;me de somme de contr&ocirc;le imm&eacute;diat. Les outils de haut niveau
comme APT g&egrave;rent l'authentification des paquets <B>.deb</B> r&eacute;cup&eacute;r&eacute;s depuis un
d&eacute;p&ocirc;t donn&eacute; et la plupart des paquets fournissent d&eacute;sormais une somme de
contr&ocirc;le MD5 cr&eacute;&eacute;e par debian/rules. Cependant, cela n'est pas directement
g&eacute;r&eacute; par les outils de plus bas niveau.
<A NAME="lbAK">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1).
<A NAME="lbAL">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="29"><A HREF="#lbAB">NOM</A><DD>
<DT id="30"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="31"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="32"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="33"><A HREF="#lbAF">OPTIONS</A><DD>
<DT id="34"><A HREF="#lbAG">CODE DE SORTIE</A><DD>
<DT id="35"><A HREF="#lbAH">ENVIRONNEMENT</A><DD>
<DT id="36"><A HREF="#lbAI">NOTES</A><DD>
<DT id="37"><A HREF="#lbAJ">BOGUES</A><DD>
<DT id="38"><A HREF="#lbAK">VOIR AUSSI</A><DD>
<DT id="39"><A HREF="#lbAL">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
