
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-maintscript-helper</TITLE>
</HEAD><BODY>
<H1>dpkg-maintscript-helper</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-maintscript-helper - Contournement des limitations connues de dpkg dans
les scripts du responsable
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-maintscript-helper</B> <I>commande</I> [<I>param&egrave;tre</I>...] <B>--</B>
<I>param&egrave;tre-script-responsable</I>...
<A NAME="lbAD">&nbsp;</A>
<H2>COMMANDES ET PARAM&Egrave;TRES</H2>

<P>

<B>supports</B> <I>commande</I>
<P>

<B>rm_conffile</B> <I>fichier-de-configuration</I> [<I>version-pr&eacute;c&eacute;dente</I>
[<I>paquet</I>]]
<P>

<B>mv_conffile</B> <I>ancien-fichier-de-configuration</I>
<I>nouveau-fichier-de-configuration</I> [<I>derni&egrave;re-version</I> [<I>paquet</I>]]
<P>

<B>symlink_to_dir</B> <I>nom-de-chemin</I> <I>ancienne-cible</I> [<I>version-pr&eacute;c&eacute;dente</I>
[<I>paquet</I>]]
<P>

<B>dir_to_symlink</B> <I>nom-de-chemin</I> <I>nouvelle-cible</I> [<I>version-pr&eacute;c&eacute;dente</I>
[<I>paquet</I>]]
<A NAME="lbAE">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Ce programme est pr&eacute;vu pour &ecirc;tre ex&eacute;cut&eacute; dans les scripts du responsable
afin de r&eacute;aliser certaines t&acirc;ches que <B>dpkg</B> ne peut pas (encore) prendre
en charge directement &agrave; cause de limites de conception ou de limitations
actuelles.
<P>

La plupart de ces t&acirc;ches n&eacute;cessitent la coordination de plusieurs scripts du
responsable (<B>preinst</B>, <B>postinst</B>, <B>prerm</B>, <B>postrm</B>). Pour &eacute;viter des
erreurs, le m&ecirc;me appel a simplement besoin d'&ecirc;tre plac&eacute; dans tous les
scripts. Le programme adaptera alors son comportement en fonction de la
variable d'environnement <B>DPKG_MAINTSCRIPT_NAME</B> et des param&egrave;tres des
scripts du responsable qui doivent &ecirc;tre pass&eacute;s avec un double tiret.
<A NAME="lbAF">&nbsp;</A>
<H2>PARAM&Egrave;TRES COMMUNS</H2>

<DL COMPACT>
<DT id="1"><I>version-pr&eacute;c&eacute;dente</I><DD>
Indique la derni&egrave;re version du paquet pour laquelle la mise &agrave; niveau doit
provoquer l'op&eacute;ration. Il est important de d&eacute;terminer correctement
<I>version-pr&eacute;c&eacute;dente</I> afin que les op&eacute;rations s'accomplissent correctement
m&ecirc;me si l'utilisateur reconstruit le paquet avec une version locale. Si le
param&egrave;tre <I>version-pr&eacute;c&eacute;dente</I> est vide ou omis, l'op&eacute;ration sera tent&eacute;e &agrave;
chaque mise &agrave; niveau (il est toutefois plus s&ucirc;r d'indiquer la version afin
que l'op&eacute;ration n'ait lieu qu'une fois).
<P>
Si le fichier de configuration n'&eacute;tait pas fourni pour une raison ou une
autre dans plusieurs versions et que vous modifiez les scripts du
responsable pour nettoyer l'ancien fichier, <I>version-pr&eacute;c&eacute;dente</I> doit &ecirc;tre
bas&eacute; sur la version actuellement pr&eacute;par&eacute;e et non la premi&egrave;re version qui ne
fournissait plus ce fichier de configuration. Cela s'applique &agrave; toutes les
autres actions de la m&ecirc;me mani&egrave;re
<P>
Par exemple, pour un fichier de configuration supprim&eacute; dans la version
<B>2.0-1</B> d'un paquet, <I>version-pr&eacute;c&eacute;dente</I> doit &ecirc;tre <B>2.0-1~</B>. Cela
provoquera la suppression du fichier m&ecirc;me si la version pr&eacute;c&eacute;dente <B>1.0-1</B>
a &eacute;t&eacute; reconstruite avec <B>1.0-1local1</B> comme num&eacute;ro de version. Ou bien, si
un paquet substitue un chemin d'un lien symbolique (fourni dans la version
<B>1.0-1</B>) &agrave; un r&eacute;pertoire (fourni dans la version <B>2.0-1</B>), mais ne r&eacute;alise
r&eacute;ellement la substitution que dans les scripts du responsable dans la
version <B>3.0-1</B>, <I>version-pr&eacute;c&eacute;dente</I> doit &ecirc;tre <B>3.0-1~</B>.
<DT id="2"><I>paquet</I><DD>
Le nom du paquet propri&eacute;taire du (des) nom(s) de chemin. Si le paquet est
&laquo;&nbsp;Multi-Arch: same&nbsp;&raquo; ce param&egrave;tre doit inclure le type d'architecture,
sinon, il ne devrait <B>pas</B> habituellement inclure le type d'architecture
(parce qu'il pourrait interdire les cat&eacute;gories crois&eacute;es, ou le passage d'une
architecture sp&eacute;cifique &agrave; architecture <B>all</B> ou vice-versa). Si le
param&egrave;tre est vide ou omis, les variables d'environnement
<B>DPKG_MAINTSCRIPT_PACKAGE</B> et <B>DPKG_MAINTSCRIPT_ARCH</B> (telles que d&eacute;finies
par <B>dpkg</B> lors de l'ex&eacute;cution des scripts du responsable) seront utilis&eacute;es
pour cr&eacute;er un nom de paquet avec une qualification d'architecture.
<DT id="3"><B>--</B><DD>
Tous les param&egrave;tres des scripts du responsable doivent &ecirc;tre pass&eacute;s au
programme apr&egrave;s <B>--</B>.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>T&Acirc;CHES LI&Eacute;ES AUX FICHIERS DE CONFIGURATION</H2>

<P>

Lors de la mise &agrave; niveau d'un paquet, <B>dpkg</B> ne supprime pas un fichier de
configuration automatiquement (comportant des modifications locales &agrave;
pr&eacute;server) s'il n'est pas pr&eacute;sent dans la nouvelle version. Il existe deux
raisons principales &agrave; cela. En premier lieu, le fichier de configuration
peut avoir &eacute;t&eacute; supprim&eacute; par accident, &ecirc;tre r&eacute;int&eacute;gr&eacute; dans la version
suivante et il peut &ecirc;tre n&eacute;cessaire de retrouver les modifications
locales. Ensuite, l'objectif est &eacute;galement de permettre d'effectuer la
transition depuis des fichiers de configuration g&eacute;r&eacute;s par dpkg vers un
fichier g&eacute;r&eacute; &agrave; l'aide des scripts du responsable, en g&eacute;n&eacute;ral &agrave; l'aide d'un
outil comme debconf ou ucf.
<P>

Cela signifie que si un paquet a besoin de renommer ou supprimer un fichier
de configuration, il doit le faire explicitement. L'objectif de
<B>dpkg-maintscript-helper</B> est donc de fournir des m&eacute;thodes de suppression
ou renommage de fichiers de configuration &agrave; l'aide de scripts du
responsable.
<A NAME="lbAH">&nbsp;</A>
<H3>Supprimer un fichier de configuration</H3>

<P>

Si un fichier de configuration est compl&egrave;tement supprim&eacute;, il doit &ecirc;tre
effac&eacute; du disque sauf si l'administrateur local l'a modifi&eacute;. Les &eacute;ventuelles
modifications locales doivent &ecirc;tre conserv&eacute;es. Si la mise &agrave; jour du paquet
est interrompue, le fichier de configuration rendu obsol&egrave;te ne doit pas
avoir disparu.
<P>

L'ensemble de ces pr&eacute;-requis est mis en &oelig;uvre en utilisant les commandes
shell suivantes dans les scripts <B>preinst</B>, <B>postinst</B> et <B>postrm</B>&nbsp;:
<P>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;dpkg-maintscript-helper&nbsp;rm_conffile&nbsp;\
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<I>fichier-de-configuration</I>&nbsp;<I>version-pr&eacute;c&eacute;dente</I>&nbsp;<I>paquet</I>&nbsp;--&nbsp;&quot;$@&quot;
<P>

<I>fichier-de-configuration</I> est le nom du fichier de configuration &agrave;
supprimer.
<P>

D&eacute;tails de la mise en &oelig;uvre actuelle&nbsp;:&nbsp;dans le script <B>preinst</B>, il est
v&eacute;rifi&eacute; si le fichier de configuration a &eacute;t&eacute; modifi&eacute;. Celui-ci est alors
renomm&eacute;, soit en <I>fichier-de-configuration</I><B>.dpkg-remove</B> s'il n'a pas &eacute;t&eacute;
modifi&eacute;, soit en <I>fichier-de-configuration</I><B>.dpkg-backup</B> s'il l'a
&eacute;t&eacute;. Dans le script <B>postinst</B>, ce dernier fichier est ensuite renomm&eacute; en
<I>fichier-de-configuration</I><B>.dpkg-bak</B> et conserv&eacute; pour r&eacute;f&eacute;rence puisqu'il
contient des modifications locales, mais le premier est supprim&eacute;. Si la mise
&agrave; jour du paquet est interrompue, le script <B>postrm</B> remet en place le
fichier de configuration d'origine. &Agrave; la purge du paquet, le script
<B>postrm</B> supprimera &eacute;galement le fichier <B>.dpkg-bak</B> qui avait &eacute;t&eacute;
conserv&eacute; jusque l&agrave;.
<A NAME="lbAI">&nbsp;</A>
<H3>Renommer un fichier de configuration</H3>

<P>

Si un fichier de configuration est d&eacute;plac&eacute; &agrave; un autre endroit, il est
n&eacute;cessaire de garantir la pr&eacute;servation des modifications locales. &Agrave; premi&egrave;re
vue, cela peut sembler &ecirc;tre une simple modification dans le script
<B>preinst</B>, mais cela risque de r&eacute;sulter en une demande, par <B>dpkg</B>,
d'approbation de modifications locales qui n'existent pas r&eacute;ellement.
<P>

Un renommage &eacute;l&eacute;gant peut &ecirc;tre mis en &oelig;uvre avec les extraits shell qui
suivent, dans les scripts <B>preinst</B>, <B>postinst</B> et <B>postrm</B>&nbsp;:
<P>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;dpkg-maintscript-helper&nbsp;mv_conffile&nbsp;\
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<I>ancien-fichier-configuration</I>&nbsp;<I>nouveau-fichier-configuration</I>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<I>version-pr&eacute;c&eacute;dente</I>&nbsp;<I>paquet</I>&nbsp;--&nbsp;&quot;$@&quot;
<P>

<I>ancien-fichier-configuration</I> et <I>nouveau-fichier-configuration</I> sont
l'ancien et le nouveau nom du fichier de configuration &agrave; renommer.
<P>

D&eacute;tails de la mise en &oelig;uvre actuelle&nbsp;:&nbsp;dans le script <B>preinst</B>, il est
v&eacute;rifi&eacute; si le fichier de configuration a &eacute;t&eacute; modifi&eacute;. Celui-ci est alors
soit laiss&eacute; en place s'il a &eacute;t&eacute; modifi&eacute;, soit renomm&eacute; en
<I>ancien-fichier-configuration</I><B>.dpkg-remove</B> s'il ne l'a pas &eacute;t&eacute;. Lors de
la configuration, le script <B>postinst</B> supprime
<I>ancien-fichier-configuration</I><B>.dpkg-remove</B> et renomme
<I>ancien-fichier-configuration</I> et <I>nouveau-fichier-configuration</I> si
<I>ancien-fichier-configuration</I> existe toujours. Si la mise &agrave; jour ou
l'installation sont interrompues, le script <B>postrm</B> renomme
<I>ancien-fichier-configuration</I><B>.dpkg-remove</B> en
<I>ancien-fichier-configuration</I> si c'est indispensable.
<A NAME="lbAJ">&nbsp;</A>
<H2>SUBSTITUTIONS DE LIENS SYMBOLIQUES ET DE R&Eacute;PERTOIRES</H2>

Lors de la mise &agrave; niveau d'un paquet, <B>dpkg</B> ne substitue pas
automatiquement un lien symbolique &agrave; un r&eacute;pertoire ou le contraire. Les
retours &agrave; une version inf&eacute;rieure ne sont pas pris en charge et le chemin
sera laiss&eacute; comme il est.
<A NAME="lbAK">&nbsp;</A>
<H3>Substituer un lien symbolique &agrave; un r&eacute;pertoire</H3>

Si un lien symbolique est substitu&eacute; &agrave; un r&eacute;pertoire r&eacute;el, il est n&eacute;cessaire
de garantir qu'avant le d&eacute;paquetage le lien symbolique est retir&eacute;. &Agrave;
premi&egrave;re vue, cela peut sembler &ecirc;tre une simple modification dans le script
<B>preinst</B>, mais cela risque de r&eacute;sulter en probl&egrave;mes si l'administrateur
local a personnalis&eacute; le lien symbolique ou si l'on revient &agrave; une version
ant&eacute;rieure du paquet.
<P>

Un renommage &eacute;l&eacute;gant peut &ecirc;tre mis en &oelig;uvre avec les extraits shell qui
suivent, dans les scripts <B>preinst</B>, <B>postinst</B> et <B>postrm</B>&nbsp;:
<P>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;dpkg-maintscript-helper&nbsp;symlink_to_dir&nbsp;\
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<I>nom-de-chemin</I>&nbsp;<I>ancienne-cible</I>&nbsp;<I>version-pr&eacute;c&eacute;dente</I>&nbsp;<I>paquet</I>&nbsp;--&nbsp;&quot;$@&quot;
<P>

<I>nom-de-chemin</I> est le nom absolu de l'ancien lien symbolique (le chemin
sera un r&eacute;pertoire &agrave; la fin de l'installation) et <I>ancienne-cible</I> la cible
de l'ancien lien symbolique vers <I>nom-de-chemin</I>. Cela peut &ecirc;tre un chemin
absolu ou relatif vers le r&eacute;pertoire contenant <I>nom-de-chemin</I>.
<P>

D&eacute;tails de la mise en &oelig;uvre actuelle&nbsp;: dans le script <B>preinst</B>, il est
v&eacute;rifi&eacute; si le lien symbolique existe et pointe vers <I>ancienne-cible</I>. Si ce
n'est pas le cas, il est alors soit laiss&eacute; en place, soit renomm&eacute; en
<I>nom-de-chemin</I><B>.dpkg-backup</B>. Lors de la configuration, le script
<B>postinst</B> supprime <I>nom-de-chemin</I><B>.dpkg-backup</B> si
<I>nom-de-chemin</I><B>.dpkg-backup</B> est encore un lien symbolique. Si la mise &agrave;
niveau ou l'installation sont interrompues, le script <B>postrm</B> renomme
<I>nom-de-chemin</I><B>.dpkg-backup</B> en <I>nom-de-chemin</I> si c'est indispensable.
<A NAME="lbAL">&nbsp;</A>
<H3>Substituer un r&eacute;pertoire &agrave; un lien symbolique</H3>

Si un r&eacute;pertoire r&eacute;el est substitu&eacute; &agrave; un lien symbolique, il est n&eacute;cessaire
de garantir qu'avant le d&eacute;paquetage le r&eacute;pertoire est retir&eacute;. &Agrave; premi&egrave;re
vue, cela peut sembler &ecirc;tre une simple modification dans le script
<B>preinst</B>, mais cela risque de r&eacute;sulter en probl&egrave;mes si le r&eacute;pertoire
contient des fichiers de configuration, des noms de chemins qui
appartiennent &agrave; d'autres paquets, des noms de chemin cr&eacute;&eacute;s localement ou si
l'on revient &agrave; une version ant&eacute;rieure du paquet.
<P>

Une substitution &eacute;l&eacute;gante peut &ecirc;tre mise en &oelig;uvre avec les extraits shell
qui suivent, dans les scripts <B>preinst</B>, <B>postinst</B> et <B>postrm</B>&nbsp;:
<P>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;dpkg-maintscript-helper&nbsp;dir_to_symlink&nbsp;\
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<I>nom-de-chemin</I>&nbsp;<I>nouvelle-cible</I>&nbsp;<I>version-pr&eacute;c&eacute;dente</I>&nbsp;<I>paquet</I>&nbsp;--&nbsp;&quot;$@&quot;
<P>

<I>nom-de-chemin</I> est le nom absolu de l'ancien r&eacute;pertoire (le chemin sera un
lien symbolique &agrave; la fin de l'installation) et <I>nouvelle-cible</I> la cible du
nouveau lien symbolique vers <I>nom-de-chemin</I>. Cela peut &ecirc;tre un chemin
absolu ou relatif vers le r&eacute;pertoire contenant <I>nom-de-chemin</I>.
<P>

D&eacute;tails de la mise en &oelig;uvre actuelle&nbsp;: dans le script <B>preinst</B>, il est
v&eacute;rifi&eacute; si le r&eacute;pertoire existe et ne contient pas de fichiers de
configuration, de noms de chemin qui appartiennent &agrave; d'autres paquets, de
noms de chemin cr&eacute;&eacute;s localement. Si ce n'est pas le cas, il est alors soit
laiss&eacute; en place, soit renomm&eacute; en <I>nom-de-chemin</I><B>.dpkg-backup</B> et un
r&eacute;pertoire vide provisoire nomm&eacute; <I>nom-de-chemin</I> est cr&eacute;&eacute;, marqu&eacute; par un
fichier pour que dpkg le suive. Lors de la configuration, le script
<B>postinst</B> ach&egrave;ve la substitution si <I>nom-de-chemin</I><B>.dpkg-backup</B>  est
encore un r&eacute;pertoire et si <I>nom-de-chemin</I> est le r&eacute;pertoire provisoire. Il
supprime le fichier qui marque le fichier provisoire et d&eacute;place les fichiers
nouvellement cr&eacute;&eacute;s dans le r&eacute;pertoire provisoire vers la cible du lien
symbolique <I>nouvelle-cible</I>, remplace le r&eacute;pertoire provisoire
<I>nom-de-chemin</I>, maintenant vide, par un lien symbolique vers la
<I>nouvelle-cible</I> et, enfin supprime <I>nom-de-chemin</I><B>.dpkg-backup</B>. Si la
mise &agrave; niveau ou l'installation sont interrompues, le script <B>postrm</B>
renomme <I>nom-de-chemin</I><B>.dpkg-backup</B> en <I>nom-de-chemin</I> si c'est
indispensable.
<A NAME="lbAM">&nbsp;</A>
<H2>INT&Eacute;GRATION DANS LES PAQUETS</H2>

<P>

Lors de l'utilisation d'un assistant d'empaquetage, veuillez v&eacute;rifier s'il
ne dispose pas d'une int&eacute;gration native de <B>dpkg-maintscript-helper</B> ce qui
vous facilitera la t&acirc;che. Voir par exemple <B><A HREF="/cgi-bin/man/man2html?1+dh_installdeb">dh_installdeb</A></B>(1).
<P>

Comme <B>dpkg-maintscript-helper</B> est utilis&eacute; dans le script <B>preinst</B>,
l'utiliser sans conditions impose une pr&eacute;-d&eacute;pendance afin de garantir que la
version minimale n&eacute;cessaire de <B>dpkg</B> ait bien &eacute;t&eacute; pr&eacute;alablement
configur&eacute;e. La version minimale d&eacute;pend de la commande utilis&eacute;e&nbsp;: ainsi pour
<B>rm_conffile</B> et <B>mv_conffile</B>, cette version est&nbsp;1.15.7.2, pour
<B>symlink_to_dir</B> et <B>dir_to_symlink</B>, c'est&nbsp;1.17.14&nbsp;:
<P>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>Pre-Depends:</B>&nbsp;dpkg&nbsp;(&gt;=&nbsp;1.17.14)
<P>

Cependant, dans de nombreux cas, l'op&eacute;ration r&eacute;alis&eacute;e par le programme n'est
pas critique pour le paquet et au lieu d'utiliser une pr&eacute;-d&eacute;pendance, il est
possible de ne lancer le programme que si on a la certitude que la commande
n&eacute;cessaire est g&eacute;r&eacute;e par la version actuellement install&eacute;e de <B>dpkg</B>&nbsp;:
<P>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;if&nbsp;dpkg-maintscript-helper&nbsp;supports&nbsp;<I>commande</I>;&nbsp;then
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;dpkg-maintscript-helper&nbsp;<I>commande</I>&nbsp;...
<BR>&nbsp;&nbsp;&nbsp;&nbsp;fi
<P>

La commande <B>supports</B> retournera <B>0</B> en cas de r&eacute;ussite, <B>1</B>
autrement. Elle v&eacute;rifiera si les variables d'environnement telles que
d&eacute;finies par <B>dpkg</B> et requises par le script sont pr&eacute;sentes, et
consid&eacute;rera que c'est un &eacute;chec si l'environnement n'est pas suffisant.
<A NAME="lbAN">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="4"><B>DPKG_COLORS</B><DD>
Fixe le mode de couleur (depuis dpkg&nbsp;1.19.1). Les valeurs admises
actuellement sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
</DL>
<A NAME="lbAO">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?1+dh_installdeb">dh_installdeb</A></B>(1)
<A NAME="lbAP">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NOM</A><DD>
<DT id="6"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="7"><A HREF="#lbAD">COMMANDES ET PARAM&Egrave;TRES</A><DD>
<DT id="8"><A HREF="#lbAE">DESCRIPTION</A><DD>
<DT id="9"><A HREF="#lbAF">PARAM&Egrave;TRES COMMUNS</A><DD>
<DT id="10"><A HREF="#lbAG">T&Acirc;CHES LI&Eacute;ES AUX FICHIERS DE CONFIGURATION</A><DD>
<DL>
<DT id="11"><A HREF="#lbAH">Supprimer un fichier de configuration</A><DD>
<DT id="12"><A HREF="#lbAI">Renommer un fichier de configuration</A><DD>
</DL>
<DT id="13"><A HREF="#lbAJ">SUBSTITUTIONS DE LIENS SYMBOLIQUES ET DE R&Eacute;PERTOIRES</A><DD>
<DL>
<DT id="14"><A HREF="#lbAK">Substituer un lien symbolique &agrave; un r&eacute;pertoire</A><DD>
<DT id="15"><A HREF="#lbAL">Substituer un r&eacute;pertoire &agrave; un lien symbolique</A><DD>
</DL>
<DT id="16"><A HREF="#lbAM">INT&Eacute;GRATION DANS LES PAQUETS</A><DD>
<DT id="17"><A HREF="#lbAN">ENVIRONNEMENT</A><DD>
<DT id="18"><A HREF="#lbAO">VOIR AUSSI</A><DD>
<DT id="19"><A HREF="#lbAP">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
