
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-source</TITLE>
</HEAD><BODY>
<H1>dpkg-source</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-source - Outil de manipulation des paquets sources Debian (.dsc).
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-source</B> [<I>option</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-source</B> empaquette ou d&eacute;paquette une archive source Debian.
<P>
Aucune de ces commandes ne permet la combinaison de plusieurs options en une
seule et elles ne permettent pas d'indiquer la valeur d'une option dans un
argument s&eacute;par&eacute;.
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1"><B>-x </B>, <B>--extract</B> <I>nom-de-fichier</I>.dsc [<I>r&eacute;pertoire-de-sortie</I>]<DD>
Cette option sert &agrave; extraire un paquet source (<B>--extract</B> depuis
dpkg&nbsp;1.17.14). Un seul argument sans option doit &ecirc;tre donn&eacute;&nbsp;: le nom du
fichier de contr&ocirc;le des sources Debian (<B>.dsc</B>). Un deuxi&egrave;me argument sans
option peut &eacute;galement &ecirc;tre donn&eacute; pour indiquer le r&eacute;pertoire o&ugrave; extraire le
paquet source&nbsp;: ce r&eacute;pertoire ne doit pas d&eacute;j&agrave; exister. Quand aucun
r&eacute;pertoire n'est indiqu&eacute;, le paquet source est extrait dans un r&eacute;pertoire
<I>source</I>-<I>version</I> du r&eacute;pertoire courant.
<P>
<B>dpkg-source</B> lit, dans le fichier de contr&ocirc;le, les noms des fichiers qui
composent le paquet source&nbsp;; il suppose qu'ils sont dans le m&ecirc;me r&eacute;pertoire
que le fichier <B>.dsc</B>.
<P>
Les fichiers extraits du paquet auront leurs propri&eacute;taires et permissions
d&eacute;finis &agrave; ceux attendus s'ils avaient &eacute;t&eacute; simplement cr&eacute;&eacute;s. Les r&eacute;pertoires
et les fichiers ex&eacute;cutables auront une permission &eacute;gale &agrave; 0777 et les
simples fichiers &agrave; 0666, les deux &eacute;tant modifi&eacute;es par le masque (umask) de
celui qui fait l'extraction. Si le r&eacute;pertoire parent est &laquo;&nbsp;setgid&nbsp;&raquo;, les
r&eacute;pertoires extraits le seront aussi et tous les fichiers et r&eacute;pertoires
h&eacute;riteront de sa propri&eacute;t&eacute; de groupe.
<P>
Si le paquet source utilise un format non standard (actuellement, cela
signifie tous les formats sauf le &laquo;&nbsp;1.0&nbsp;&raquo;), son nom sera enregistr&eacute; dans
<B>debian/source/format</B> de sorte que la construction du paquet source
utilise le m&ecirc;me format par d&eacute;faut.
<P>
<DT id="2"><B>-b</B>, <B>--build</B> <I>r&eacute;pertoire</I> [<I>param&egrave;tres-dans-un-format-sp&eacute;cifique</I>]<DD>
Construit un paquet source (<B>--build</B> depuis dpkg&nbsp;1.17.14). Le premier
argument sans option est pris comme nom du r&eacute;pertoire contenant
l'arborescence des sources debianis&eacute;e (c'est-&agrave;-dire avec un sous-r&eacute;pertoire
debian et peut-&ecirc;tre des modifications sur les fichiers d'origine). Selon le
format du paquet source utilis&eacute; pour construire le paquet, d'autres
param&egrave;tres peuvent &ecirc;tre accept&eacute;s.
<P>
<B>dpkg-source</B> va construire le paquet source dans le premier format trouv&eacute;
dans la liste suivante&nbsp;: le(s) format(s) indiqu&eacute;(s) avec le param&egrave;tre de la
ligne de commande <I>--format</I>, le format indiqu&eacute; dans
<B>debian/source/format</B>, &laquo;&nbsp;1.0&nbsp;&raquo;. L'utilisation de &laquo;&nbsp;1.0&nbsp;&raquo; comme dernier
recours est obsol&egrave;te et sera retir&eacute;e dans le futur. Le format source devrait
toujours &ecirc;tre indiqu&eacute; dans <B>debian/source/format</B>. Voir la section
<B>FORMATS DE PAQUET SOURCE</B> pour une description plus d&eacute;taill&eacute;e des
diff&eacute;rents formats de paquet source.
<P>
<DT id="3"><B>--print-format</B> <I>r&eacute;pertoire</I><DD>
Affiche le format source qui serait utilis&eacute; pour construire le paquet source
si <B>dpkg-source --build </B><I>r&eacute;pertoire</I> &eacute;tait utilis&eacute; (dans les m&ecirc;mes
conditions et avec les m&ecirc;mes options&nbsp;; depuis dpkg&nbsp;1.15.5).
<P>
<DT id="4"><B>--before-build</B> <I>r&eacute;pertoire</I><DD>
Ex&eacute;cute le point d'entr&eacute;e correspondant du format de paquet source (depuis
dpkg&nbsp;1.15.8). Ce point d'entr&eacute;e doit &ecirc;tre utilis&eacute; avant toute construction
du paquet (<B>dpkg-buildpackage</B> l'utilise tr&egrave;s t&ocirc;t, avant m&ecirc;me
<B>debian/rules clean</B>). Cette commande est idempotente et peut &ecirc;tre lanc&eacute;e
plusieurs fois. Tous les formats source ne mettent pas en &oelig;uvre ce
branchement et ceux qui le font pr&eacute;parent l'arborescence source pour la
construction, par exemple en garantissant que les correctifs Debian sont
appliqu&eacute;s.
<P>
<DT id="5"><B>--after-build</B> <I>r&eacute;pertoire</I><DD>
Ex&eacute;cute le point d'entr&eacute;e correspondant du format de paquet source (depuis
dpkg&nbsp;1.15.8). Ce point d'entr&eacute;e doit &ecirc;tre utilis&eacute; apr&egrave;s toute construction
du paquet (<B>dpkg-buildpackage</B> l'utilise en dernier). Cette commande est
idempotente et peut &ecirc;tre lanc&eacute;e plusieurs fois. Tous les formats source ne
mettent pas en &oelig;uvre ce branchement et ceux qui le font s'en servent pour
d&eacute;faire ce qui a &eacute;t&eacute; fait par <B>--before-build</B>.
<P>
<DT id="6"><B>--commit</B> [<I>r&eacute;pertoire</I>] ...<DD>
Enregistre les modifications dans l'arborescence source d&eacute;compress&eacute;e dans
<I>r&eacute;pertoire</I> (depuis dpkg&nbsp;1.16.1). Cette commande peut accepter des
param&egrave;tres suppl&eacute;mentaires selon le format source. Elle provoquera une
erreur pour les formats o&ugrave; cette op&eacute;ration n'a pas de signification.
<P>
<DT id="7"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte. Les options de construction et
d'extraction sp&eacute;cifiques au format peuvent &ecirc;tre montr&eacute;es avec l'option
<B>--format</B>.
<DT id="8"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<A NAME="lbAG">&nbsp;</A>
<H3>Options de construction g&eacute;n&eacute;rique</H3>

<DL COMPACT>
<DT id="9"><B>-c</B><I>fichier-de-contr&ocirc;le</I><DD>
Indique le principal fichier de contr&ocirc;le des sources o&ugrave; trouver les
renseignements. Par d&eacute;faut, c'est le fichier <B>debian/control</B>. Lorsqu'un
chemin relatif est fourni, on consid&egrave;re qu'il est relatif au r&eacute;pertoire le
plus &eacute;lev&eacute; de l'arborescence source.
<DT id="10"><B>-l</B><I>fichier-des-changements</I><DD>
Indique le journal des modifications o&ugrave; trouver des renseignements. Par
d&eacute;faut, c'est le fichier <B>debian/changelog</B>. Lorsqu'un chemin relatif est
fourni, on consid&egrave;re qu'il est relatif au r&eacute;pertoire le plus &eacute;lev&eacute; de
l'arborescence source.
<DT id="11"><B>-F</B><I>format-du-fichier-des-changements</I><DD>
Indique le format du fichier des changements. Voir <B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1)
pour plus d'informations &agrave; propos des formats g&eacute;r&eacute;s.
<DT id="12"><B>--format=</B><I>valeur</I><DD>
Utilise le format indiqu&eacute; pour la construction du paquet source (depuis
dpkg&nbsp;1.14.17). Ce choix remplace le format indiqu&eacute; dans
<B>debian/source/format</B>.
<DT id="13"><B>-V</B><I>nom</I><B>=</B><I>valeur</I><DD>
Fixe la valeur d'une variable de substitution. Consultez <B><A HREF="/cgi-bin/man/man2html?5+deb-substvars">deb-substvars</A></B>(5)
pour une discussion sur la valeur de substitution.
<DT id="14"><B>-T</B><I>fichier-substvars</I><DD>
Lit les variables de substitution dans <I>fichier-substvars</I>&nbsp;; par d&eacute;faut
aucun fichier n'est lu. Cette option peut &ecirc;tre utilis&eacute;e plusieurs fois pour
lire des variables de substitution depuis plusieurs fichiers (depuis
dpkg&nbsp;1.15.6).
<DT id="15"><B>-D</B><I>champ</I><B>=</B><I>valeur</I><DD>
Remplace ou ajoute en sortie un champ dans le fichier de contr&ocirc;le.
<DT id="16"><B>-U</B><I>champ</I><DD>
Supprime en sortie un champ dans le fichier de contr&ocirc;le.
<DT id="17"><B>-Z</B><I>compression</I>, <B>--compression</B>=<I>compression</I><DD>
Sp&eacute;cifie le niveau de compression &agrave; utiliser pour les fichiers archive et
diff cr&eacute;&eacute;s (<B>--compression</B> depuis dpkg&nbsp;1.15.5). Notez que cette option ne
causera pas la recompression des archives existantes, cela ne concerne que
les nouveaux fichiers. Les valeurs accept&eacute;es sont les suivantes&nbsp;: <I>gzip</I>,
<I>bzip2</I>, <I>lzma</I> et <I>xz</I>. L'option par d&eacute;faut est <I>xz</I> pour les
formats&nbsp;2.0 et plus r&eacute;cents, et <I>gzip</I> pour le format&nbsp;1.0. <I>xz</I> n'est g&eacute;r&eacute;
que depuis dpkg&nbsp;1.15.5.
<DT id="18"><B>-z</B><I>niveau</I>, <B>--compression-level</B>=<I>niveau</I><DD>
Niveau de compression &agrave; utiliser (<B>--compression-level</B> depuis
dpkg&nbsp;1.15.5). Comme avec <B>-Z</B> cela ne concerne que les fichiers
nouvellement cr&eacute;&eacute;s. Les valeurs prises possibles sont les suivantes&nbsp;: <I>1</I> &agrave;
<I>9</I>, <I>best</I> et <I>fast</I>. La valeur par d&eacute;faut est <I>9</I> pour gzip et bzip2,
<I>6</I> pour xz et lzma.
<DT id="19"><B>-i</B>[<I>expression-rationnelle</I>], <B>--diff-ignore</B>[=<I>expression-rationnelle</I>]<DD>
Il est possible de donner une expression rationnelle Perl pour filtrer les
fichiers qui doivent &ecirc;tre &eacute;limin&eacute;s de la liste des fichiers pour le &laquo;&nbsp;diff&nbsp;&raquo;
(<B>--diff-ignore</B> depuis dpkg&nbsp;1.15.6). Cette liste est cr&eacute;&eacute;e avec une
commande &laquo;&nbsp;find&nbsp;&raquo;. Si le fichier source en construction est un fichier
source de version&nbsp;3 utilisant un syst&egrave;me de suivi de versions, cette option
est utile pour ignorer les modifications non envoy&eacute;es. Utiliser <B>-i</B><I>.*</I>
les ignorera toutes.
<P>
L'option <B>-i</B> active cette fonction avec une expression rationnelle par
d&eacute;faut (en pr&eacute;servant toutes les modifications faites avec l'expression
rationnelle par d&eacute;faut par une utilisation pr&eacute;c&eacute;dente de
<B>--extend-diff-ignore</B>) qui couvre les fichiers de contr&ocirc;le des plus usuels
syst&egrave;mes de gestion de version, les fichiers de sauvegarde, les fichiers
d'&eacute;change et les r&eacute;pertoires utilis&eacute;s par Libtool. Il ne peut y avoir qu'une
seule expression rationnelle active&nbsp;; avec de multiples options <B>-i</B>, seule
la derni&egrave;re mentionn&eacute;e sera prise en compte.
<P>
C'est tr&egrave;s utile pour supprimer des fichiers qui sont inclus dans le diff,
par exemple, si vous maintenez un source avec un syst&egrave;me de contr&ocirc;le de
version et que voulez construire un paquet source sans inclure des fichiers
et r&eacute;pertoires additionnels qu'il contient g&eacute;n&eacute;ralement (par exemple CVS/,
.cvsignore, .svn/). L'expression rationnelle par d&eacute;faut est d&eacute;j&agrave; tr&egrave;s
exhaustive, mais si avez besoin de la remplacer, veuillez noter que par
d&eacute;faut, il sait v&eacute;rifier n'importe quelle partie d'un chemin, donc si vous
voulez trouver le d&eacute;but d'un nom de fichier ou des noms de fichiers
complets, vous devrez fournir les caract&egrave;res sp&eacute;ciaux vous-m&ecirc;me (par exemple
&laquo;&nbsp;(^|/)&nbsp;&raquo;, &laquo;&nbsp;($|/)&nbsp;&raquo;).
<DT id="20"><B>--extend-diff-ignore</B>=<I>expression-rationnelle</I><DD>
L'expression rationnelle Perl indiqu&eacute;e compl&eacute;tera la valeur par d&eacute;faut
utilis&eacute;e par <B>--diff-ignore</B> et sa valeur courante si elle est d&eacute;finie
(depuis dpkg&nbsp;1.15.6). Cela est effectu&eacute; en concat&eacute;nant
&laquo;&nbsp;<B>|</B><I>expression-rationnelle</I>&nbsp;&raquo; &agrave; la valeur existante. Cette option est
pratique dans <B>debian/source/options</B> pour exclure certains fichiers
auto-cr&eacute;&eacute;s de la cr&eacute;ation automatique de correctifs.
<DT id="21"><B>-I</B>[<I>motif-fichier</I>], <B>--tar-ignore</B>[=<I>motif-fichier</I>]<DD>
Avec cette option, le fichier est pass&eacute; &agrave; l'option <B>--exclude</B> de <B><A HREF="/cgi-bin/man/man2html?1+tar">tar</A></B>(1)
quand on veut cr&eacute;er un fichier .orig.tar ou .tar (<B>--tar-ignore</B> depuis
dpkg&nbsp;1.15.6). Par exemple, <B>-I</B>CVS fera que tar sautera les r&eacute;pertoires du
CVS quand il doit cr&eacute;er un fichier .tar.gz. On peut r&eacute;p&eacute;ter cette option
pour exclure &agrave; partir de plusieurs motifs.
<P>
<B>-I</B> ajoute par d&eacute;faut des options <B>--exclude</B> qui &eacute;limineront les
fichiers et les r&eacute;pertoires de contr&ocirc;les des syst&egrave;mes les plus connus de
contr&ocirc;le de version, les fichiers d'&eacute;change et de sauvegarde et les
r&eacute;pertoires utilis&eacute;s par Libtool.
</DL>
<P>

<B>Note</B>&nbsp;: m&ecirc;me si elles ont des r&ocirc;les similaires, <B>-i</B> et <B>-I</B> ont une
syntaxe et une s&eacute;mantique tr&egrave;s diff&eacute;rentes. <B>-i</B> ne peut &ecirc;tre sp&eacute;cifi&eacute;
qu'une fois et re&ccedil;oit une expression rationnelle compatible avec le langage
Perl qui est appliqu&eacute;e sur chaque chemin relatif complet de chaque
fichier. <B>-I</B> peut &ecirc;tre sp&eacute;cifi&eacute; plusieurs fois et prend un motif de nom de
fichier avec les m&eacute;ta-caract&egrave;res du shell. Le motif est appliqu&eacute; au chemin
relatif complet mais aussi &agrave; chaque partie du chemin individuellement. La
s&eacute;mantique exacte de l'option <B>--exclude</B> de tar est un peu compliqu&eacute;e,
voir <A HREF="https://www.gnu.org/software/tar/manuel/tar.html#wildcards">https://www.gnu.org/software/tar/manuel/tar.html#wildcards</A> pour une
documentation plus compl&egrave;te.
<P>
L'expression rationnelle et le motif par d&eacute;faut pour les deux options
peuvent &ecirc;tre trouv&eacute;s dans la sortie de la commande <B>--help</B>.
<A NAME="lbAH">&nbsp;</A>
<H3>Options d'extraction g&eacute;n&eacute;riques</H3>

<DL COMPACT>
<DT id="22"><B>--no-copy</B><DD>
Ne copie pas l'archive d'origine &agrave; c&ocirc;t&eacute; de l'extraction du paquet source
(depuis dpkg&nbsp;1.14.17).
<DT id="23"><B>--no-check</B><DD>
Ne v&eacute;rifie pas les signatures et les sommes de contr&ocirc;le avant de
d&eacute;paqueter(depuis dpkg&nbsp;1.14.17).
<DT id="24"><B>--no-overwrite-dir</B><DD>
Ne pas remplacer le r&eacute;pertoire d'extraction s'il existe d&eacute;j&agrave; (depuis
dpkg&nbsp;1.18.8)
<DT id="25"><B>--require-valid-signature</B><DD>
Refuse de d&eacute;compresser le paquet source s'il ne contient pas de signature
OpenPGP pouvant &ecirc;tre v&eacute;rifi&eacute;e (depuis dpkg&nbsp;1.15.0) soit avec le fichier de
cl&eacute;s <I>trustedkeys.gpg</I> de l'utilisateur, un des fichiers de cl&eacute;s propre &agrave;
un distributeur ou un des fichiers de cl&eacute;s officiels de Debian
(<I>/usr/share/keyrings/debian-keyring.gpg</I> et
<I>/usr/share/keyrings/debian-maintainers.gpg</I>).
<DT id="26"><B>--require-strong-checksums</B><DD>
Refuse de d&eacute;compresser le paquet source s'il ne contient pas de somme de
contr&ocirc;le robuste (depuis dpkg&nbsp;1.18.7). Actuellement, <B>SHA-256</B> est le seul
type de somme de contr&ocirc;le consid&eacute;r&eacute; comme robuste.
<DT id="27"><B>--ignore-bad-version</B><DD>
Transforme la v&eacute;rification des mauvaises versions des paquets source en
avertissement non fatal (since dpkg&nbsp;1.17.7). Cette option sera seulement
n&eacute;cessaire quand on extrait des anciens paquets source avec des versions
cass&eacute;es, pour pr&eacute;server la compatibilit&eacute; avec les versions pr&eacute;c&eacute;dentes.
<P>
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>FORMATS DE PAQUET SOURCE</H2>

Si vous ne savez pas quel format source utiliser, il est conseill&eacute; de
choisir soit &laquo;&nbsp;3.0 (quilt)&nbsp;&raquo; soit &laquo;&nbsp;3.0 (native)&nbsp;&raquo;. Voir
<A HREF="https://wiki.debian.org/Projects/DebSrc3.0">https://wiki.debian.org/Projects/DebSrc3.0</A> pour plus d'informations sur la
mise en &oelig;uvre de ces formats dans Debian.
<P>
<A NAME="lbAJ">&nbsp;</A>
<H3>Format&nbsp;: 1.0</H3>

Un paquet source dans ce format se compose soit d'un <B>.orig.tar.gz</B> associ&eacute;
&agrave; un <B>.diff.gz</B> ou un simple <B>.tar.gz</B> (dans ce cas, le paquet est appel&eacute;
natif <I>native</I>). L'archive tar originale pourrait &ecirc;tre accompagn&eacute;e de fa&ccedil;on
facultative d'une signature amont s&eacute;par&eacute;e <B>.orig.tar.gz.asc</B>, extraction
prise en charge depuis dpkg&nbsp;1.18.5.
<P>
<B>Extraction</B>
<P>
Extraire un paquet natif revient &agrave; une simple extraction de l'archive tar
dans le r&eacute;pertoire cible. L'extraction d'un paquet non natif consiste au
d&eacute;paquetage du <B>.orig.tar.gz</B> puis l'application des correctifs contenus
dans le <B>.diff.gz</B>. La date de tous les fichiers correctifs est r&eacute;gl&eacute;e &agrave;
celle du moment de l'extraction depuis le paquet source (cela &eacute;vite les
horodatages faux menant &agrave; des probl&egrave;mes lorsque des fichiers g&eacute;n&eacute;r&eacute;s
automatiquement sont modifi&eacute;s). Le diff peut cr&eacute;er de nouveaux fichiers
(tout le r&eacute;pertoire debian est cr&eacute;&eacute; de cette fa&ccedil;on) mais ne peut pas
supprimer de fichiers (les fichiers vides seront laiss&eacute;s l&agrave;).
<P>
<B>Construction</B>
<P>
Construire un paquet natif revient simplement &agrave; cr&eacute;er une archive tar avec
le r&eacute;pertoire du source. La cr&eacute;ation d'un paquet non natif consiste &agrave;
extraire l'archive d'origine dans un r&eacute;pertoire s&eacute;par&eacute; &laquo;&nbsp;.orig&nbsp;&raquo; puis &agrave;
r&eacute;g&eacute;n&eacute;rer le <B>.diff.gz</B> en comparant le <I>r&eacute;pertoire</I> du paquet source avec
le r&eacute;pertoire &laquo;&nbsp;.orig&nbsp;&raquo;.
<P>
<B>Options de construction (avec --build)</B>&nbsp;:
<P>
Si l'on donne un second argument, ce sera le nom du r&eacute;pertoire source
d'origine ou le nom du fichier tar ou bien une cha&icirc;ne vide si le paquet est
un &laquo;&nbsp;Debian pure souche&nbsp;&raquo; et n'a donc pas de fichiers &laquo;&nbsp;diffs&nbsp;&raquo; pour sa
&laquo;&nbsp;debianisation&nbsp;&raquo;. S'il n'y a pas de second argument, <B>dpkg-source</B> cherche
le fichier tar des sources d'origine
<I>paquet</I><B>_</B><I>version-amont</I><B>.orig.tar.gz</B> ou bien le r&eacute;pertoire source
d'origine <I>r&eacute;pertoire</I><B>.orig</B> selon les param&egrave;tres <B>-sX</B>.
<P>
Les options <B>-sa</B>, <B>-sp</B>, <B>-sk</B>, <B>-su</B> et <B>-sr</B> ne remplacent pas les
fichiers tar ou les r&eacute;pertoires existants. Pour cela, il faut utiliser les
options <B>-sA</B>, <B>-sP</B>, <B>-sK</B>, <B>-sU</B> et <B>-sR.</B>
<P>

<DL COMPACT>
<DT id="28"><B>-sk</B><DD>
Sp&eacute;cifie que le source d'origine est attendu sous forme tar&nbsp;; par d&eacute;faut,
<I>paquet</I><B>_</B><I>version-amont</I><B>.orig.tar</B><I>extension</I>. Il le laisse en place
en tant que fichier tar ou le copie dans le r&eacute;pertoire en cours s'il n'y est
pas d&eacute;j&agrave;. Le fichier sera d&eacute;paquet&eacute; dans <I>r&eacute;pertoire</I><B>.orig</B> pour la
g&eacute;n&eacute;ration du fichier diff.
<DT id="29"><B>-sp</B><DD>
Comme <B>-sk</B> mais supprimera le r&eacute;pertoire &agrave; nouveau par la suite.
<DT id="30"><B>-su</B><DD>
Quand on sp&eacute;cifie que le source d'origine est un r&eacute;pertoire&nbsp;; la valeur par
d&eacute;faut est le r&eacute;pertoire <I>paquet</I><B>-</B><I>version-amont</I><B>.orig</B> et
<B>dpkg-source</B> cr&eacute;e une nouvelle archive du source d'origine.
<DT id="31"><B>-sr</B><DD>
Comme <B>-su</B> mais supprimera ce r&eacute;pertoire apr&egrave;s utilisation.
<DT id="32"><B>-ss</B><DD>
Indique que le source d'origine est disponible &agrave; la fois comme un r&eacute;pertoire
et comme un fichier tar. <B>dpkg-source</B> se servira du r&eacute;pertoire pour cr&eacute;er
le &laquo;&nbsp;diff&nbsp;&raquo;, mais du fichier tar pour cr&eacute;er le fichier <B>.dsc</B>. Aussi, faire
attention avec cette option. Si le r&eacute;pertoire et le fichier tar ne
correspondent pas, il en r&eacute;sulte une mauvaise archive source.
<DT id="33"><B>-sn</B><DD>
Indique de ne pas chercher de source d'origine et de ne pas cr&eacute;er de
&laquo;&nbsp;diff&nbsp;&raquo;. Le second argument, s'il existe, doit &ecirc;tre une cha&icirc;ne vide. Cela
sert pour les paquets Debian pure souche qui n'ont pas un source d'origine
distincte et donc pas de fichier &laquo;&nbsp;diff&nbsp;&raquo; de debianisation.
<DT id="34"><B>-sa</B> or <B>-sA</B><DD>
Indique comme source d'origine soit un fichier tar, soit un r&eacute;pertoire ---&nbsp;le
deuxi&egrave;me argument, s'il existe, doit &ecirc;tre l'un d'eux ou bien une cha&icirc;ne vide
(cela revient &agrave; utiliser l'option <B>-sn)</B>. Quand un fichier tar existe, il
est d&eacute;paquet&eacute; pour cr&eacute;er le fichier &laquo;&nbsp;diff&nbsp;&raquo;&nbsp;; ensuite il est supprim&eacute; (cela
revient &agrave; utiliser l'option <B>-sp)</B>&nbsp;; quand un r&eacute;pertoire est trouv&eacute;, il est
empaquet&eacute; et <B>dpkg-source</B> cr&eacute;e le source d'origine et supprime ensuite ce
r&eacute;pertoire (cela revient &agrave; utiliser l'option <B>-sr)</B>&nbsp;; quand ni l'un ni
l'autre n'est trouv&eacute;, <B>dpkg-source</B> suppose que le paquet ne poss&egrave;de pas de
fichier &laquo;&nbsp;diff&nbsp;&raquo; de debianisation, mais seulement une simple archive source
(cela revient &agrave; utiliser l'option <B>-sn</B>). Quand les deux sont trouv&eacute;s,
<B>dpkg-source</B> ignore le r&eacute;pertoire et le remplace si l'option <B>-sA</B> a &eacute;t&eacute;
sp&eacute;cifi&eacute;e (cela revient &agrave; utiliser l'option <B>-sP)</B> ou il provoque une
erreur si l'option <B>-sa</B> a &eacute;t&eacute; sp&eacute;cifi&eacute;e. L'option par d&eacute;faut est <B>-sa</B>.
<DT id="35"><B>--abort-on-upstream-changes</B><DD>
Ce processus &eacute;choue si le fichier de diff&eacute;rences contient des modifications
apport&eacute;es &agrave; des fichiers en dehors du sous-r&eacute;pertoire debian (depuis
dpkg&nbsp;1.15.8). Cette option n'est pas autoris&eacute;e dans <B>debian/source/options</B>
mais peut &ecirc;tre utilis&eacute;e dans <B>debian/source/local-options</B>.
</DL>
<P>

<P>
<B>options d'extraction (avec --extract)</B>&nbsp;:
<P>
Dans tous ces cas, l'arborescence existante des sources d'origine est
supprim&eacute;e.
<DL COMPACT>
<DT id="36"><B>-sp</B><DD>
Quand on extrait le r&eacute;pertoire source d'origine (s'il existe), il est
conserv&eacute; en tant que fichier tar. S'il n'est pas d&eacute;j&agrave; dans le r&eacute;pertoire
courant ou si ce r&eacute;pertoire contient un fichier diff&eacute;rent, le fichier tar
est copi&eacute; dans ce r&eacute;pertoire. (<B>Cela est le comportement par d&eacute;faut</B>).
<DT id="37"><B>-su</B><DD>
D&eacute;paquetage de l'arborescence du r&eacute;pertoire source d'origine.
<DT id="38"><B>-sn</B><DD>
Assure que le r&eacute;pertoire source d'origine ne sera ni copi&eacute; dans le
r&eacute;pertoire en cours, ni d&eacute;paquet&eacute;. Si une arborescence source d'origine est
pr&eacute;sente dans le r&eacute;pertoire courant, elle est toujours supprim&eacute;e.
</DL>
<P>

Toutes les options <B>-s</B><I>X</I> s'excluent mutuellement. Si vous en indiquez
plusieurs, seule la derni&egrave;re sera prise en compte.
<DL COMPACT>
<DT id="39"><B>--skip-debianization</B><DD>
Passe l'&eacute;tape d'application du fichier de diff&eacute;rences Debian aux sources
amont (depuis dpkg&nbsp;1.15.1).
</DL>
<A NAME="lbAK">&nbsp;</A>
<H3>Format&nbsp;: 2.0</H3>

Extraction prise en charge depuis dpkg&nbsp;1.13.9, construction depuis
dpkg&nbsp;1.14.8. Aussi connu sous le nom de &laquo;&nbsp;wig&amp;pen&nbsp;&raquo;. Ce format n'est pas
recommand&eacute; pour une utilisation massive, le format &laquo;&nbsp;3.0 (quilt)&nbsp;&raquo; le
remplace. Wig&amp;pen a &eacute;t&eacute; la premi&egrave;re sp&eacute;cification d'une nouvelle g&eacute;n&eacute;ration
de format de paquet source.
<P>
Le comportement de ce format est le m&ecirc;me que pour le format &laquo;&nbsp;3.0 (quilt)&nbsp;&raquo;
sauf qu'il n'utilise pas de liste explicite de correctifs. Tous les fichiers
dans <B>debian/patches/</B> correspondant &agrave; l'expression rationnelle Perl
<B>[\w-]+</B> doivent &ecirc;tre des correctifs valables&nbsp;: ils sont appliqu&eacute;s au
moment de l'extraction.
<P>
Lors de la construction d'un nouveau paquet source, toute modification
apport&eacute;e au source amont est enregistr&eacute;e dans un correctif nomm&eacute;
<B>zz_debian-diff-auto</B>.
<A NAME="lbAL">&nbsp;</A>
<H3>Format&nbsp;: 3.0 (native)</H3>

Pris en charge depuis dpkg&nbsp;1.14.17. Ce format est une extension du format de
paquet natif tel que d&eacute;fini dans le format&nbsp;1.0. Il g&egrave;re toutes les m&eacute;thodes
de compression et ignore par d&eacute;faut tout fichier et r&eacute;pertoire sp&eacute;cifique &agrave;
VCS ainsi que de nombreux fichiers temporaires (voir la valeur par d&eacute;faut
associ&eacute;e &agrave; l'option <B>-I</B> dans la sortie de <B>--help</B>).
<A NAME="lbAM">&nbsp;</A>
<H3>Format&nbsp;: 3.0 (quilt)</H3>

Pris en charge depuis&nbsp;1.14.17. Un paquet source dans ce format contient au
moins une archive tar d'origine (<B>.orig.tar.</B><I>ext</I> o&ugrave; <I>ext</I> peut &ecirc;tre
<B>gz</B>, <B>bz2</B> <B>lzma</B> et <B>xz</B>) et une archive tar debian
(<B>.debian.tar.</B><I>ext</I>). Il peut &eacute;galement contenir d'autres archives tar
d'origine (<B>.orig-</B><I>composant</I><B>.tar.</B><I>ext</I>). <I>composant</I> ne peut &ecirc;tre
constitu&eacute; que de caract&egrave;res alphanum&eacute;riques (&laquo;&nbsp;a-zA-Z0-9&nbsp;&raquo;) et de tirets
(&laquo;&nbsp;-&nbsp;&raquo;). Chaque archive tar originale peut &ecirc;tre accompagn&eacute;e de fa&ccedil;on
facultative d'une signature amont s&eacute;par&eacute;e (<B>.orig.tar.</B><I>ext</I><B>.asc</B> et
<B>.orig-</B><I>composant</I><B>.tar.</B><I>ext</I><B>.asc</B>), extraction prise en charge
depuis dpkg&nbsp;1.17.20, construction depuis dpkg&nbsp;1.18.5.
<P>
<P>

<B>Extraction</B>
<P>

L'archive principale tar d'origine est extraite tout d'abord, puis toutes
les autres archives tar d'origine sont extraites dans des sous-r&eacute;pertoires
dont le nom est form&eacute; &agrave; partir de la partie <I>composant</I> de leur
nom. L'archive tar Debian est extraite du r&eacute;pertoire source, apr&egrave;s la
suppression de tout r&eacute;pertoire <B>debian</B> existant. Notez que l'archive tar
Debian doit contenir un sous-r&eacute;pertoire <B>debian</B>, mais elle peut &eacute;galement
contenir des fichiers binaires en dehors de ce r&eacute;pertoire (voir l'option
<B>--include-binaries</B>).
<P>

Toutes les modifications figurant dans
<B>debian/patches/</B><I>distributeur</I><B>.series</B> ou <B>debian/patches/series</B> sont
alors appliqu&eacute;es, o&ugrave; <I>distributeur</I> sera le nom en minuscules du
distributeur actuel, ou Debian s'il n'y a pas de distributeur d&eacute;fini. Si
l'ancien fichier est utilis&eacute; et qu'il n'y en a pas de plus r&eacute;cent (ou si
c'est un lien symbolique), alors celui-ci est remplac&eacute; par un lien
symbolique vers l'ancien. Cette disposition vise &agrave; simplifier l'utilisation
de <B>quilt</B> pour g&eacute;rer l'ensemble des correctifs. Les fichiers de s&eacute;ries
propres au distributeur sont destin&eacute;s &agrave; permettre de s&eacute;rialiser plusieurs
branches de d&eacute;veloppement en se basant sur le distributeur, d'une mani&egrave;re
d&eacute;clarative, de pr&eacute;f&eacute;rence au codage ouvert de cette gestion dans
<B>debian/rules</B>. Cela est particuli&egrave;rement utile quand le source &agrave; besoin de
correctifs de mani&egrave;re conditionnelle car les fichiers affect&eacute;s n'ont pas de
gestion interne d'inclusion conditionnelle. Notez toutefois que si
<B>dpkg-source</B> analyse correctement les fichiers de s&eacute;ries avec les options
utilis&eacute;es pour l'application du correctif (stock&eacute;es sur chaque ligne apr&egrave;s
le nom du correctif et une ou plusieurs espaces), il n'ignore pas ces
options et s'attendra toujours &agrave; ce que les correctifs puissent &ecirc;tre
appliqu&eacute;s avec l'option <B>-p1</B> de <B>patch</B>. Il va donc &eacute;mettre un
avertissement lorsqu'il rencontrera ces options, et la construction est
susceptible d'&eacute;chouer.
<P>

Notez que <B><A HREF="/cgi-bin/man/man2html?1+lintian">lintian</A></B>(1) &eacute;mettra des avertissements sans condition lors de
l'utilisation de s&eacute;ries de distributeur du fait d'une r&egrave;gle controvers&eacute;e
particuli&egrave;re de Debian qui ne devrait pas affecter une utilisation externe&nbsp;;
pour les faire taire, le profil lintian de dpkg peut &ecirc;tre utilis&eacute; en passant
l'option &laquo;<B>--profile dpkg</B>&raquo; &agrave; <B><A HREF="/cgi-bin/man/man2html?1+lintian">lintian</A></B>(1).
<P>

La date de tous les fichiers correctifs est celle du moment o&ugrave; se d&eacute;roule
l'extraction du paquet source (cela &eacute;vite les horodatages faux menant &agrave; des
probl&egrave;mes lorsque des fichiers g&eacute;n&eacute;r&eacute;s automatiquement sont modifi&eacute;s).
<P>

Au contraire du comportement par d&eacute;faut de <B>quilt</B>, les correctifs doivent
s'appliquer sans d&eacute;calage (&laquo;&nbsp;fuzz&nbsp;&raquo;). Quand cela n'est pas le cas, il est
sugg&eacute;r&eacute; de les rafra&icirc;chir avec <B>quilt</B> sinon <B>dpkg-source</B> se terminera
avec une erreur en tentant de les appliquer.
<P>

Similaire au comportement par d&eacute;faut de <B>quilt</B>, les modifications peuvent
aussi supprimer des fichiers.
<P>

Le fichier <B>.pc/applied-patches</B> est cr&eacute;&eacute; si certains correctifs ont &eacute;t&eacute;
appliqu&eacute;s au cours de l'extraction.
<P>

<B>Construction</B>
<P>

Les originaux de toutes les archives tar trouv&eacute;es dans le r&eacute;pertoire courant
sont extraits dans un r&eacute;pertoire temporaire en suivant la m&ecirc;me logique que
pour le d&eacute;paquetage, le r&eacute;pertoire debian est copi&eacute; dans le r&eacute;pertoire
temporaire, et tous les correctifs except&eacute; le correctif automatique
<B>debian-changes-</B><I>version</I> ou <B>debian-changes</B>, selon
<B>--single-debian-patch</B>) sont appliqu&eacute;es. Le r&eacute;pertoire temporaire est
compar&eacute; &agrave; celui du paquet source. Si le fichier de diff&eacute;rences n'est pas
vide, la construction &eacute;choue &agrave; moins que <B>--single-debian-patch</B> ou
<B>--auto-commit</B>  aient &eacute;t&eacute; utilis&eacute;s, et dans ce cas le diff est stock&eacute; dans
le correctif automatique. Si le correctif automatique est cr&eacute;&eacute; ou supprim&eacute;,
il est ajout&eacute; ou supprim&eacute; dans le fichier &laquo;&nbsp;series&nbsp;&raquo; et les m&eacute;tadonn&eacute;es de
<B>quilt</B>.
<P>
Tout changement dans un fichier binaire ne peut &ecirc;tre indiqu&eacute; dans le diff et
va d&eacute;boucher sur un &eacute;chec &agrave; moins que le responsable ne d&eacute;cide d&eacute;lib&eacute;r&eacute;ment
d'inclure cette modification binaire dans l'archive tar Debian (en le
listant dans <B>debian/source/include-binaries</B>). La construction pourra
&eacute;galement &eacute;chouer si des fichiers binaires sont trouv&eacute;s dans le
sous-r&eacute;pertoire debian sans &ecirc;tre indiqu&eacute; dans la liste blanche de
<B>debian/source/include-binaries</B>.
<P>
Le r&eacute;pertoire debian mis &agrave; jour et la liste des binaires modifi&eacute;s sont
ensuite utilis&eacute;s pour recr&eacute;er l'archive tar debian.
<P>
Le diff g&eacute;n&eacute;r&eacute; automatiquement n'inclut pas les changements sp&eacute;cifiques sur
les fichiers VCS ainsi sur que de nombreux fichiers temporaires (pour la
valeur par d&eacute;faut associ&eacute;e &agrave; l'option <B>-i</B>, voir la sortie de
<B>--help</B>). En particulier, le r&eacute;pertoire <B>.pc</B> utilis&eacute; par <B>quilt</B> est
ignor&eacute; lors de la g&eacute;n&eacute;ration automatique du correctif.
<P>
Note&nbsp;: <B>dpkg-source</B> <B>--before-build</B> (et <B>--build</B>) prendront soin
d'appliquer les correctifs indiqu&eacute;s dans le fichier series afin qu'un paquet
soit toujours construit avec toutes les corrections appliqu&eacute;es. Pour
effectuer cette d&eacute;tection, il recherche la liste des correctifs non
appliqu&eacute;s (ils sont mentionn&eacute;s dans le fichier <B>series</B> mais pas dans
<B>.pc/applied-patches</B>) et si le premier de cette liste peut &ecirc;tre appliqu&eacute;
sans erreur, il les applique tous. L'option <B>--no-preparation</B> peut &ecirc;tre
utilis&eacute;e pour d&eacute;sactiver ce comportement.
<P>
<P>

<B>Enregistrement des modifications</B>
<DL COMPACT>
<DT id="40"><B>--commit</B> [<I>r&eacute;pertoire</I>] [<I>nom-du-correctif</I>] [<I>fichier-de-correctif</I>]<DD>
Cr&eacute;e un correctif correspondant aux modifications locales non g&eacute;r&eacute;es par le
syst&egrave;me de gestion de correctifs <B>quilt</B> et les int&egrave;gre dans la liste des
correctifs sous le nom <I>nom-du-correctif</I>. Si le nom est omis, il sera
demand&eacute; interactivement. Si <I>fichier-de-correctifs</I> est indiqu&eacute;, il est
utilis&eacute; comme fichier de modifications locales &agrave; int&eacute;grer. Une fois int&eacute;gr&eacute;,
un &eacute;diteur est lanc&eacute; afin de permettre d'ajouter des m&eacute;ta-informations dans
l'en-t&ecirc;te du correctif.
<P>
Le fait de passer <I>fichier-de-correctifs</I> est essentiellement utile apr&egrave;s
un &eacute;chec de construction qui pr&eacute;g&eacute;n&egrave;re ce fichier. Sur ces bases, le fichier
est supprim&eacute; apr&egrave;s int&eacute;gration. Veuillez &eacute;galement noter que les
modifications contenues dans le fichier de correctifs doivent d&eacute;j&agrave; &ecirc;tre
appliqu&eacute;es dans l'arborescence et que les fichiers modifi&eacute;s par le correctif
ne doivent pas comporter de modifications suppl&eacute;mentaires.
<P>
Si la cr&eacute;ation de correctif d&eacute;tecte des fichiers binaires modifi&eacute;s, ils
seront ajout&eacute;s automatiquement &agrave; <B>debian/source/include-binaries</B> afin de
pouvoir &ecirc;tre inclus dans l'archive debian (de fa&ccedil;on analogue &agrave; ce que ferait
<B>dpkg-source --include-binaries --build</B>).
</DL>
<P>

<B>Options de construction</B>
<DL COMPACT>
<DT id="41"><B>--allow-version-of-quilt-db=</B><I>version</I><DD>
Autorise <B>dpkg-source</B> &agrave; construire le fichier si la version des
m&eacute;tadonn&eacute;es de <B>quilt</B> est celle indiqu&eacute;e, m&ecirc;me si <B>dpkg-source</B> n'en n'a
pas connaissance (depuis dpkg&nbsp;1.15.5.4). En fait, cela indique que la
version indiqu&eacute;e des m&eacute;tadonn&eacute;es de <B>quilt</B> est compatible avec la
version&nbsp;2 que <B>dpkg-source</B> g&egrave;re. La version des m&eacute;tadonn&eacute;es de <B>quilt</B>
est conserv&eacute;e dans <B>.pc/.version</B>.
<DT id="42"><B>--include-removal</B><DD>
N'ignore pas les fichiers supprim&eacute;s et les inclut dans le fichier de
modifications g&eacute;n&eacute;r&eacute; automatiquement.
<DT id="43"><B>--include-timestamp</B><DD>
Inclut la date dans le correctif g&eacute;n&eacute;r&eacute; automatiquement.
<DT id="44"><B>--include-binaries</B><DD>
Ajoute tous les binaires modifi&eacute;s dans l'archive tar debian. Les ajoute
aussi &agrave; <B>debian/source/include-binaries</B>&nbsp;: elles seront ajout&eacute;es par d&eacute;faut
dans les constructions suivantes aussi cette option n'est donc plus
n&eacute;cessaire.
<DT id="45"><B>--no-preparation</B><DD>
N'essaye pas de pr&eacute;parer l'arbre de la construction en appliquant les
correctifs qui ne sont apparemment pas appliqu&eacute;s (depuis dpkg&nbsp;1.14.8).
<DT id="46"><B>--single-debian-patch</B><DD>
Utilise <B>debian/patches/debian-changes</B> au lieu de
<B>debian/patches/debian-changes-</B><I>version</I> comme nom du correctif
automatique cr&eacute;&eacute; au cours de la construction (depuis dpkg&nbsp;1.15.5.4). Cette
option est particuli&egrave;rement pratique lorsque le paquet est g&eacute;r&eacute; avec un
outil de gestion de versions et qu'un jeu de correctifs ne peut &ecirc;tre cr&eacute;&eacute; de
fa&ccedil;on fiable. Dans ce cas, les diff&eacute;rences avec la version amont doivent
&ecirc;tre conserv&eacute;es dans un correctif unique. Cette option serait indiqu&eacute;e dans
<B>debian/source/local-options</B> et accompagn&eacute;e par un fichier
<B>debian/source/local-patch-header</B> qui explique la meilleure m&eacute;thode pour
revoir les corrections sp&eacute;cifiques &agrave; Debian, par exemple dans le
gestionnaire de versions utilis&eacute;.
<DT id="47"><B>--create-empty-orig</B><DD>
Cr&eacute;e automatiquement l'archive principale tar d'origine vide si elle est
manquante et qu'il existe des archives tar d'origine additionnelles (depuis
dpkg&nbsp;1.15.6). Cette option peut &ecirc;tre utilis&eacute;e lorsque le paquet source est
une collection de diff&eacute;rents sources amont et qu'il n'existe pas de logiciel
&laquo;&nbsp;principal&nbsp;&raquo;.
<DT id="48"><B>--no-unapply-patches, --unapply-patches</B><DD>
Par d&eacute;faut, <B>dpkg-source</B> retire automatiquement les correctifs dans le
point d'entr&eacute;e <B>--after-build</B> s'ils ont &eacute;t&eacute; appliqu&eacute;s pendant
<B>--before-build</B> (<B>--unapply-patches</B> depuis dpkg&nbsp;1.15.8,
<B>--no-unapply-patches</B> depuis dpkg&nbsp;1.16.5). Ces options permettent de
d&eacute;sactiver ou activer unilat&eacute;ralement ce retrait des correctifs. Elles ne
sont permises que dans <B>debian/source/local-options</B> afin que tous les
paquets source cr&eacute;&eacute;s aient le m&ecirc;me comportement par d&eacute;faut.
<DT id="49"><B>--abort-on-upstream-changes</B><DD>
Ce processus &eacute;chouera si un correctif automatique a &eacute;t&eacute; cr&eacute;&eacute; (depuis
dpkg&nbsp;1.15.8). Cette option peut servir &agrave; v&eacute;rifier que toutes les
modifications ont &eacute;t&eacute; enregistr&eacute;es correctement dans des correctifs <B>quilt</B>
distincts avant la construction du paquet source. Elle n'est pas autoris&eacute;e
dans <B>debian/source/options</B> mais peut prendre place dans
<B>debian/source/local-options</B>.
<DT id="50"><B>--auto-commit</B><DD>
Pas d'&eacute;chec du processus de construction si un correctif automatique a &eacute;t&eacute;
cr&eacute;&eacute;&nbsp;: il est enregistr&eacute; automatiquement dans le fichier series de <B>quilt</B>.
<P>
</DL>
<P>

<B>Options d'extraction</B>
<DL COMPACT>
<DT id="51"><B>--skip-debianization</B><DD>
Passe l'&eacute;tape d'extraction de l'archive tar debian des sources amont (depuis
dpkg&nbsp;1.15.1).
<DT id="52"><B>--skip-patches</B><DD>
Ne pas appliquer des correctifs &agrave; la fin de l'extraction (depuis
dpkg&nbsp;1.14.18).
</DL>
<A NAME="lbAN">&nbsp;</A>
<H3>Format&nbsp;: 3.0 (custom)</H3>

Pris en charge depuis dpkg&nbsp;1.14.17. Ce format est particulier. Il ne
repr&eacute;sente pas un r&eacute;el format de paquet source mais peut &ecirc;tre utilis&eacute; pour
cr&eacute;er des paquets sources avec des fichiers arbitraires.
<P>

<B>Options de construction</B>
<P>

Tous les arguments qui ne sont pas des options sont pris pour des fichiers &agrave;
int&eacute;grer dans le paquet source g&eacute;n&eacute;r&eacute;. Ils doivent exister et &ecirc;tre de
pr&eacute;f&eacute;rence dans le r&eacute;pertoire courant. Au moins un fichier doit &ecirc;tre donn&eacute;.
<DL COMPACT>
<DT id="53"><B>--target-format=</B><I>valeur</I><DD>
<B>Required</B>. D&eacute;finit le format r&eacute;el du paquet source g&eacute;n&eacute;r&eacute;. Le fichier
g&eacute;n&eacute;r&eacute; .dsc contiendra cette valeur dans son champ <B>format</B> et non &laquo;&nbsp;3.0
(custom)&nbsp;&raquo;.
</DL>
<A NAME="lbAO">&nbsp;</A>
<H3>Format&nbsp;: 3.0 (git)</H3>

Pris en charge depuis dpkg&nbsp;1.14.17. Ce format est exp&eacute;rimental.
<P>

Un paquet source qui utilise ce format est constitu&eacute; d'un seul ensemble d'un
d&eacute;p&ocirc;t git <B>.git</B> qui contient les sources du paquet. Il peut &eacute;galement
exister un fichier <I>.gitshallow</I> qui donne les r&eacute;visions d'un clone git
&laquo;&nbsp;shallow&nbsp;&raquo;.
<P>

<B>Extraction</B>
<P>

Cet ensemble est clon&eacute; sous forme d'un d&eacute;p&ocirc;t git dans le r&eacute;pertoire
cible. S'il existe un fichier <I>.gitshallow</I>, il est install&eacute; en tant que
<I>.git/shallow</I> dans le d&eacute;p&ocirc;t git clon&eacute;.
<P>

Veuillez noter que, par d&eacute;faut, le nouveau d&eacute;p&ocirc;t aura la m&ecirc;me branche
r&eacute;cup&eacute;r&eacute;e que celle qui &eacute;tait r&eacute;cup&eacute;r&eacute;e dans les sources d'origine (souvent
&laquo;&nbsp;master&nbsp;&raquo; mais cela peut &ecirc;tre tout &agrave; fait autre chose). Toutes les autres
branches seront disponibles sous <I>remotes/origin</I>.
<P>

<B>Construction</B>
<P>

Avant d'aller plus loin, quelques v&eacute;rifications sont effectu&eacute;es afin de
s'assurer qu'il n'existe aucun changement non ignor&eacute; non soumis.
<P>

<B><A HREF="/cgi-bin/man/man2html?1+git-bundle">git-bundle</A></B>(1) permet de cr&eacute;er un ensemble &agrave; partir du d&eacute;p&ocirc;t git. Par
d&eacute;faut, toutes les branches et &eacute;tiquettes du d&eacute;p&ocirc;t sont incluses dans cet
ensemble.
<P>

<B>Options de construction</B>
<DL COMPACT>
<DT id="54"><B>--git-ref=</B><I>r&eacute;f</I><DD>
Permet d'indiquer une r&eacute;f&eacute;rence git &agrave; inclure dans l'ensemble
git. L'utilisation de cette option d&eacute;sactive le comportement par d&eacute;faut qui
est d'inclure toutes les branches et &eacute;tiquettes. Cette option peut &ecirc;tre
utilis&eacute;e plusieurs fois. Le param&egrave;tre <I>r&eacute;f</I> peut &ecirc;tre le nom d'une branche
ou une &eacute;tiquette &agrave; inclure. Il peut &eacute;galement &ecirc;tre tout param&egrave;tre que l'on
peut passer &agrave; <B><A HREF="/cgi-bin/man/man2html?1+git-rev-list">git-rev-list</A></B>(1). Par exemple, pour n'inclure que la branche
&laquo;&nbsp;master&nbsp;&raquo;, on peut utiliser <B>--git-ref=</B>master. Pour inclure toutes les
&eacute;tiquettes et toutes les branches, sauf la branche priv&eacute;e, on peut utiliser
-<B>git-ref=</B>--all <B>-- git-ref=</B>^private.
<DT id="55"><B>--git-depth=</B><I>nombre</I><DD>
Cr&eacute;e un clone &laquo;&nbsp;shallow&nbsp;&raquo; dont l'historique est tronqu&eacute; au nombre indiqu&eacute; de
r&eacute;visions.
</DL>
<A NAME="lbAP">&nbsp;</A>
<H3>Format&nbsp;: 3.0 (bzr)</H3>

Pris en charge depuis dpkg&nbsp;1.14.17. Ce format est exp&eacute;rimental. Il cr&eacute;e une
archive tar contenant le d&eacute;p&ocirc;t bzr correspondant.
<P>

<B>Extraction</B>
<P>

L'archive tar est d&eacute;compress&eacute;e puis bzr est utilis&eacute; afin de r&eacute;cup&eacute;rer la
branche courante.
<P>

<B>Construction</B>
<P>

Avant d'aller plus loin, quelques v&eacute;rifications sont effectu&eacute;es afin de
s'assurer qu'il n'existe aucun changement non ignor&eacute; non soumis.
<P>

Ensuite, la partie sp&eacute;cifique du r&eacute;pertoire source du gestionnaire de
versions est copi&eacute;e dans un r&eacute;pertoire temporaire. Avant que ce r&eacute;pertoire
temporaire ne soit empaquet&eacute; dans une archive tar, divers nettoyages sont
effectu&eacute;s pour &eacute;conomiser de l'espace.
<A NAME="lbAQ">&nbsp;</A>
<H2>DIAGNOSTICS</H2>

<A NAME="lbAR">&nbsp;</A>
<H3>aucun format source indiqu&eacute; dans debian/source/format</H3>

Le fichier <B>debian/source/format</B> devrait toujours exister et indiquer le
format source souhait&eacute;. Pour pr&eacute;server la compatibilit&eacute; avec d'anciennes
versions, le format &laquo;&nbsp;1.0&nbsp;&raquo; est implicite quand le fichier n'existe pas. Il
est d&eacute;conseill&eacute; de d&eacute;pendre de ce comportement qui pourrait &ecirc;tre modifi&eacute;
dans de futures versions de <B>dpkg-source</B>, qui &eacute;choueront alors en
l'absence d'une mention explicite de format.
<P>
Cela est d&ucirc; au fait que le format &laquo;&nbsp;1.0&nbsp;&raquo; n'est plus le format recommand&eacute;,
qu'il est conseill&eacute; de choisir un des formats les plus r&eacute;cents (&laquo;&nbsp;3.0
(quilt)&nbsp;&raquo; ou &laquo;&nbsp;3.0 (native)&nbsp;&raquo;) mais que dpkg-source ne le fera pas
automatiquement. Si vous souhaitez continuer &agrave; utiliser l'ancien format, il
est n&eacute;cessaire d'&ecirc;tre explicite et indiquer &laquo;&nbsp;1.0&nbsp;&raquo; dans
<B>debian/source/format</B>.
<A NAME="lbAS">&nbsp;</A>
<H3>le fichier de diff&eacute;rences modifie les fichiers amont suivants</H3>

Lors de l'utilisation du format source &laquo;&nbsp;1.0&nbsp;&raquo;, il est d&eacute;conseill&eacute; de
modifier directement les fichiers amont car les modifications restent alors
cach&eacute;es et souvent non document&eacute;es dans le fichier diff.gz. Au contraire, il
est conseill&eacute; de conserver les modifications sous forme de correctifs dans
le r&eacute;pertoire debian et de les appliquer au moment de la construction. Pour
&eacute;viter ces op&eacute;rations plus complexes, vous pouvez &eacute;galement choisir le
format &laquo;&nbsp;3.0 (quilt)&nbsp;&raquo; qui permet ces op&eacute;rations de mani&egrave;re native.
<A NAME="lbAT">&nbsp;</A>
<H3>impossible d'identifier les changements de <I>fichier</I></H3>

Les modifications des sources amont sont en g&eacute;n&eacute;ral conserv&eacute;es dans des
fichiers de correctifs mais certaines modifications ne peuvent &ecirc;tre
repr&eacute;sent&eacute;es sous forme de tels fichiers qui ne peuvent modifier que des
fichiers texte. Si vous essayez de remplacer un fichier avec un objet d'un
type diff&eacute;rent (par exemple remplacer un fichier par un lien ou un
r&eacute;pertoire), ce message d'erreur s'affichera.
<A NAME="lbAU">&nbsp;</A>
<H3>le fichier <I>fichier</I>, nouvellement cr&eacute;&eacute;, ne sera pas repr&eacute;sent&eacute; dans le fichier de diff&eacute;rences</H3>

Les fichiers vides ne peuvent pas &ecirc;tre cr&eacute;&eacute;s avec des correctifs. En
cons&eacute;quence, la modification n'est pas enregistr&eacute;e dans le paquet source, ce
qui provoque cet avertissement.
<A NAME="lbAV">&nbsp;</A>
<H3>le mode ex&eacute;cutable <I>permissions</I> de <I>fichier</I> ne sera pas repr&eacute;sent&eacute; dans le fichier de diff&eacute;rences</H3>

Les fichiers de correctifs n'enregistrent pas les permissions de fichiers
et, en cons&eacute;quence, les permissions des ex&eacute;cutables ne sont pas enregistr&eacute;es
dans le paquet source, ce qui provoque cet avertissement.
<A NAME="lbAW">&nbsp;</A>
<H3>le mode sp&eacute;cial <I>permissions</I> de <I>fichier</I> ne sera pas repr&eacute;sent&eacute; dans le fichier de diff&eacute;rences</H3>

Les fichiers correctifs n'enregistrent pas les permissions de fichiers et,
en cons&eacute;quence, les permissions modifi&eacute;es ne sont pas enregistr&eacute;es dans le
paquet source, ce qui provoque cet avertissement.
<A NAME="lbAX">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="56"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="57"><B>DPKG_NLS</B><DD>
Si cette variable est d&eacute;finie, elle sera utilis&eacute;e pour d&eacute;cider l'activation
de la prise en charge des langues (NLS -&nbsp;Native Language Support), connu
aussi comme la gestion de l'internationalisation (ou i18n) (depuis
dpkg&nbsp;1.19.0). Les valeurs permises sont&nbsp;: <B>0</B> et <B>1</B> (par d&eacute;faut).
<DT id="58"><B>SOURCE_DATE_EPOCH</B><DD>
Si cette option est utilis&eacute;e, elle sera utilis&eacute;e comme horodatage (en
seconde &agrave; partir de &laquo;&nbsp;l'epoch&nbsp;&raquo;) pour fixer le &laquo;&nbsp;mtime&nbsp;&raquo; dans les entr&eacute;es du
fichier <B><A HREF="/cgi-bin/man/man2html?5+tar">tar</A></B>(5).
<DT id="59"><B>VISUAL</B><DD>

<B>EDITOR</B>
Utilis&eacute; par les modules de format source &laquo;&nbsp;2.0&nbsp;&raquo; et &laquo;&nbsp;3.0 (quilt)&nbsp;&raquo;.
<DT id="60"><B>GIT_DIR</B><DD>

<B>GIT_INDEX_FILE</B>

<B>GIT_OBJECT_DIRECTORY</B>

<B>GIT_ALTERNATE_OBJECT_DIRECTORIES</B>

<B>GIT_WORK_TREE</B>
Utilis&eacute;s par les modules de format source &laquo;&nbsp;3.0 (git)&nbsp;&raquo;.
</DL>
<A NAME="lbAY">&nbsp;</A>
<H2>FICHIERS</H2>

<A NAME="lbAZ">&nbsp;</A>
<H3>debian/source/format</H3>

Ce fichier contient sur une seule ligne le format &agrave; utiliser pour construire
le paquet source (les formats accept&eacute;s sont d&eacute;crits plus haut). Il ne doit
pas contenir d'espace avant ou apr&egrave;s l'indication du format.
<A NAME="lbBA">&nbsp;</A>
<H3>debian/source/include-binaries</H3>

Ce fichier contient une liste de fichiers binaires (un par ligne) qui
doivent &ecirc;tre inclus dans l'archive tar debian. Les espaces plac&eacute;es avant ou
apr&egrave;s ces noms sont supprim&eacute;es. Les lignes commen&ccedil;ant par &laquo;&nbsp;<B>#</B>&nbsp;&raquo; sont des
commentaires et sont ignor&eacute;es, ainsi que les lignes vides.
<A NAME="lbBB">&nbsp;</A>
<H3>debian/source/options</H3>

Ce fichier contient la liste des options qui seront automatiquement ajout&eacute;es
au jeu d'options de ligne de commande lors de l'appel &agrave; <B>dpkg-source
--build</B> ou <B>dpkg-source --print-format</B>. Des options comme
<B>--compression</B> et <B>--compression-level</B> conviennent bien pour ce fichier.
<P>

Chaque option doit &ecirc;tre plac&eacute;e sur une ligne distincte. Les lignes vides et
les lignes commen&ccedil;ant par le caract&egrave;re &laquo;&nbsp;<B>#</B>&nbsp;&raquo; sont ignor&eacute;es. Les
caract&egrave;res initiaux &laquo;&nbsp;<B>--</B>&nbsp;&raquo; doivent &ecirc;tre retir&eacute;s et les options courtes ne
peuvent pas &ecirc;tre utilis&eacute;es. Des espaces optionnelles sont autoris&eacute;es autour
du symbole &laquo;&nbsp;<B>=</B>&nbsp;&raquo;, ainsi que des guillemets optionnels autour de la valeur
d'une option donn&eacute;e. Voici un exemple d'un tel fichier&nbsp;:
<P>

<BR>&nbsp;&nbsp;#&nbsp;autoriser&nbsp;dpkg-source&nbsp;&agrave;&nbsp;cr&eacute;er&nbsp;un&nbsp;fichier&nbsp;debian.tar.bz2&nbsp;avec&nbsp;la
<BR>&nbsp;&nbsp;#compression&nbsp;maximale
<BR>&nbsp;&nbsp;compression&nbsp;=&nbsp;&quot;bzip2&quot;
<BR>&nbsp;&nbsp;compression-level&nbsp;=&nbsp;9
<BR>&nbsp;&nbsp;#&nbsp;utiliser&nbsp;debian/patches/debian-changes&nbsp;comme&nbsp;correctif&nbsp;automatique
<BR>&nbsp;&nbsp;single-debian-patch
<BR>&nbsp;&nbsp;#&nbsp;ignorer&nbsp;les&nbsp;modifications&nbsp;dans&nbsp;config.{sub,guess}
<BR>&nbsp;&nbsp;extend-diff-ignore&nbsp;=&nbsp;&quot;(^|/)(config.sub|config.guess)$&quot;
<P>

Note&nbsp;: les options de <B>format</B> ne sont pas accept&eacute;es dans ce fichier. Vous
devriez utiliser <B>debian/source/format</B> &agrave; la place.
<A NAME="lbBC">&nbsp;</A>
<H3>debian/source/local-options</H3>

Identique &agrave; <B>debian/source/options</B> mais n'est pas enregistr&eacute; dans le
paquet source cr&eacute;&eacute;. Ce fichier peut &ecirc;tre utile pour conserver une pr&eacute;f&eacute;rence
propre au responsable ou au d&eacute;p&ocirc;t de gestionnaire de versions o&ugrave; le paquet
source est g&eacute;r&eacute;.
<A NAME="lbBD">&nbsp;</A>
<H3>debian/source/local-patch-header et debian/source/patch-header</H3>

Texte en format libre qui sera ajout&eacute; au d&eacute;but du correctif automatique cr&eacute;&eacute;
dans les formats &laquo;&nbsp;2.0&nbsp;&raquo; et &laquo;&nbsp;3.0 (quilt)&nbsp;&raquo;. <B>local-patch-header</B> n'est pas
inclus dans le paquet source cr&eacute;&eacute; alors que <B>patch-header</B> l'est.
<A NAME="lbBE">&nbsp;</A>
<H3>debian/patches/<I>distributeur</I>.series</H3>

<A NAME="lbBF">&nbsp;</A>
<H3>debian/patches/series</H3>

Ce fichier comporte la liste de toutes les correctifs qui ont &eacute;t&eacute; appliqu&eacute;s
(dans l'ordre indiqu&eacute;) aux sources amont. Les espaces situ&eacute;es avant et apr&egrave;s
les noms sont ignor&eacute;es. L'argument <I>distributeur</I> sera le nom en minuscules
du distributeur ou <B>debian</B> si aucun distributeur n'est d&eacute;fini. Si le
fichier de s&eacute;ries propre au distributeur n'existe pas, le fichier de s&eacute;ries
sans distributeur sera utilis&eacute;. Les lignes commen&ccedil;ant par &laquo;&nbsp;<B>#</B>&nbsp;&raquo; sont des
commentaires et sont ignor&eacute;es, ainsi que les lignes vides. Les autres lignes
d&eacute;butent par le nom du fichier de correctifs (relatif au r&eacute;pertoire
<B>debian/patches/</B>) et se terminent &agrave; la premi&egrave;re espace ou &agrave; la fin de la
ligne. Des options facultatives de <B>quilt</B> peuvent &ecirc;tre ajout&eacute;es jusqu'&agrave; la
fin de la ligne ou jusqu'au premier caract&egrave;re &laquo;&nbsp;<B>#</B>&nbsp;&raquo; pr&eacute;c&eacute;d&eacute; par une ou
plusieurs espaces (ce qui indique le d&eacute;but d'un commentaire se terminant &agrave;
la fin de la ligne).
<A NAME="lbBG">&nbsp;</A>
<H2>BOGUES</H2>

Le moment o&ugrave; se d&eacute;roule le remplacement d'un champ par rapport &agrave; certaines
d&eacute;terminations de champ affich&eacute;es sur la sortie standard est plut&ocirc;t
embrouill&eacute;.
<A NAME="lbBH">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-changelog">deb-changelog</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+dsc">dsc</A></B>(5).
<A NAME="lbBI">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="61"><A HREF="#lbAB">NOM</A><DD>
<DT id="62"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="63"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="64"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="65"><A HREF="#lbAF">OPTIONS</A><DD>
<DL>
<DT id="66"><A HREF="#lbAG">Options de construction g&eacute;n&eacute;rique</A><DD>
<DT id="67"><A HREF="#lbAH">Options d'extraction g&eacute;n&eacute;riques</A><DD>
</DL>
<DT id="68"><A HREF="#lbAI">FORMATS DE PAQUET SOURCE</A><DD>
<DL>
<DT id="69"><A HREF="#lbAJ">Format&nbsp;: 1.0</A><DD>
<DT id="70"><A HREF="#lbAK">Format&nbsp;: 2.0</A><DD>
<DT id="71"><A HREF="#lbAL">Format&nbsp;: 3.0 (native)</A><DD>
<DT id="72"><A HREF="#lbAM">Format&nbsp;: 3.0 (quilt)</A><DD>
<DT id="73"><A HREF="#lbAN">Format&nbsp;: 3.0 (custom)</A><DD>
<DT id="74"><A HREF="#lbAO">Format&nbsp;: 3.0 (git)</A><DD>
<DT id="75"><A HREF="#lbAP">Format&nbsp;: 3.0 (bzr)</A><DD>
</DL>
<DT id="76"><A HREF="#lbAQ">DIAGNOSTICS</A><DD>
<DL>
<DT id="77"><A HREF="#lbAR">aucun format source indiqu&eacute; dans debian/source/format</A><DD>
<DT id="78"><A HREF="#lbAS">le fichier de diff&eacute;rences modifie les fichiers amont suivants</A><DD>
<DT id="79"><A HREF="#lbAT">impossible d'identifier les changements de <I>fichier</I></A><DD>
<DT id="80"><A HREF="#lbAU">le fichier <I>fichier</I>, nouvellement cr&eacute;&eacute;, ne sera pas repr&eacute;sent&eacute; dans le fichier de diff&eacute;rences</A><DD>
<DT id="81"><A HREF="#lbAV">le mode ex&eacute;cutable <I>permissions</I> de <I>fichier</I> ne sera pas repr&eacute;sent&eacute; dans le fichier de diff&eacute;rences</A><DD>
<DT id="82"><A HREF="#lbAW">le mode sp&eacute;cial <I>permissions</I> de <I>fichier</I> ne sera pas repr&eacute;sent&eacute; dans le fichier de diff&eacute;rences</A><DD>
</DL>
<DT id="83"><A HREF="#lbAX">ENVIRONNEMENT</A><DD>
<DT id="84"><A HREF="#lbAY">FICHIERS</A><DD>
<DL>
<DT id="85"><A HREF="#lbAZ">debian/source/format</A><DD>
<DT id="86"><A HREF="#lbBA">debian/source/include-binaries</A><DD>
<DT id="87"><A HREF="#lbBB">debian/source/options</A><DD>
<DT id="88"><A HREF="#lbBC">debian/source/local-options</A><DD>
<DT id="89"><A HREF="#lbBD">debian/source/local-patch-header et debian/source/patch-header</A><DD>
<DT id="90"><A HREF="#lbBE">debian/patches/<I>distributeur</I>.series</A><DD>
<DT id="91"><A HREF="#lbBF">debian/patches/series</A><DD>
</DL>
<DT id="92"><A HREF="#lbBG">BOGUES</A><DD>
<DT id="93"><A HREF="#lbBH">VOIR AUSSI</A><DD>
<DT id="94"><A HREF="#lbBI">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
