
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-checkbuilddeps</TITLE>
</HEAD><BODY>
<H1>dpkg-checkbuilddeps</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-checkbuilddeps - V&eacute;rifier les d&eacute;pendances et les conflits de
construction
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-checkbuilddeps</B> [<I>option</I>...] [<I>fichier-control</I>]
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Ce programme v&eacute;rifie si les d&eacute;pendances et les conflits de construction
list&eacute;s dans le fichier control existent dans les paquets install&eacute;s sur le
syst&egrave;me. S'il en existe, il les affiche et se termine avec un code de retour
diff&eacute;rent de <B>0</B>.
<P>

Par d&eacute;faut, le fichier <I>debian/control</I> est lu, mais un autre nom de
fichier peut &ecirc;tre indiqu&eacute; sur la ligne de commande.
<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="1"><B>--admindir</B>=<I>r&eacute;pertoire</I><DD>
Changer l'endroit o&ugrave; se trouve la base de donn&eacute;es de <B>dpkg</B> (depuis
dpkg&nbsp;1.14.0). Par d&eacute;faut, c'est <I>/var/lib/dpkg</I>.
<DT id="2"><B>-A</B><DD>
Ignore les lignes <B>Build-Depends-Arch</B> et <B>Build-Conflicts-Arch</B> (depuis
dpkg&nbsp;1.16.4). &Agrave; utiliser lorsque seuls des paquets ind&eacute;pendants d'une
architecture seront construits ou &agrave; combiner avec <B>-B</B> si seul un paquet
source est construit.
<DT id="3"><B>-B</B><DD>
Ignore les lignes <B>Build-Depends-Indep</B> et <B>Build-Conflicts-Indep</B>. &Agrave;
utiliser lorsque seuls des paquets d&eacute;pendants de l'architecture sont
construits ou &agrave; combiner avec <B>-A</B> si seul un paquet source est construit.
<DT id="4"><B>-I</B><DD>
Ignore les d&eacute;pendances et les conflits de construction internes (depuis
dpkg&nbsp;1.18.2). Ce sont les d&eacute;pendances implicites qui sont habituellement
demand&eacute;es sur une distribution particuli&egrave;re, c'est l'ensemble de paquets
appel&eacute; Build-Essentiel.
<DT id="5"><B>-d </B><I>chaine-des-d&eacute;pendances-pour-la-construction</I><DD>
<DT id="6"><B>-c </B><I>cha&icirc;ne-des-conflits-de-construction</I><DD>
Utilise les d&eacute;pendances et conflits de construction donn&eacute;s au lieu de ceux
indiqu&eacute;s dans le fichier <I>debian/control</I> (depuis dpkg&nbsp;1.14.17).
<DT id="7"><B>-a </B><I>arch</I><DD>
V&eacute;rifie les d&eacute;pendances et conflits de construction en supposant que le
paquet d&eacute;crit dans le fichier de contr&ocirc;le doit &ecirc;tre construit pour
l'architecture h&ocirc;te indiqu&eacute;e au lieu de celle du syst&egrave;me (depuis
dpkg&nbsp;1.16.2).
<DT id="8"><B>-P </B><I>profil</I>[<B>,</B>...]<DD>
V&eacute;rifie les d&eacute;pendances et conflits de construction en supposant que le
paquet d&eacute;crit dans le fichier de contr&ocirc;le doit &ecirc;tre construit pour le ou les
profils donn&eacute;s (depuis dpkg&nbsp;1.17.2). L'argument est une liste s&eacute;par&eacute;e par
des virgules des noms de profil.
<DT id="9"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="10"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="11"><B>DEB_BUILD_PROFILES</B><DD>
Si cette option est utilis&eacute;e, elle sera utilis&eacute;e comme profil(s) de
construction actif(s) pour le paquet &agrave; construire. C'est une liste s&eacute;par&eacute;e
par des espaces de noms de profil. Cette option est outrepass&eacute;e par l'option
<B>-P</B>.
<DT id="12"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="13"><B>DPKG_NLS</B><DD>
Si cette variable est d&eacute;finie, elle sera utilis&eacute;e pour d&eacute;cider l'activation
de la prise en charge des langues (NLS -&nbsp;Native Language Support), connu
aussi comme la gestion de l'internationalisation (ou i18n) (depuis
dpkg&nbsp;1.19.0). Les valeurs permises sont&nbsp;: <B>0</B> et <B>1</B> (par d&eacute;faut).
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="14"><A HREF="#lbAB">NOM</A><DD>
<DT id="15"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="16"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="17"><A HREF="#lbAE">OPTIONS</A><DD>
<DT id="18"><A HREF="#lbAF">ENVIRONNEMENT</A><DD>
<DT id="19"><A HREF="#lbAG">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
