
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-trigger</TITLE>
</HEAD><BODY>
<H1>dpkg-trigger</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-trigger - Un utilitaire pour activer les actions diff&eacute;r&eacute;es de paquets
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-trigger</B> [<I>option</I>...] <I>nom-action-diff&eacute;r&eacute;e</I>
<BR>

<B>dpkg-trigger</B> [<I>option</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-trigger</B> est un outil pour activer explicitement les actions
diff&eacute;r&eacute;es et pour v&eacute;rifier leur gestion dans le fonctionnement de <B>dpkg</B>.
<P>

Utilisable par les scripts du responsable dans certaines situations
complexes o&ugrave; un fichier d'actions diff&eacute;r&eacute;es (&laquo;&nbsp;triggers&nbsp;&raquo;) ou la directive
<B>activate</B> du fichier de contr&ocirc;le des actions diff&eacute;r&eacute;es ne sont pas
suffisants. Peut &eacute;galement &ecirc;tre utilis&eacute; pour des essais ou par les
administrateurs syst&egrave;me (noter que les actions diff&eacute;r&eacute;es ne seront alors pas
ex&eacute;cut&eacute;es par <B>dpkg-trigger</B>).
<P>

Les syntaxes non reconnues pour le nom des actions diff&eacute;r&eacute;es constituent une
erreur pour <B>dpkg-trigger</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1"><B>--check-supported</B><DD>
V&eacute;rifie si <B>dpkg</B> sait g&eacute;rer les actions diff&eacute;r&eacute;es (g&eacute;n&eacute;ralement appel&eacute;es
depuis un script de post-installation). Retourne en sortie <B>0</B> si c'est le
cas, ou <B>1</B> avec un message d'erreur sur stderr si ce n'est pas le
cas. Toutefois, en r&egrave;gle g&eacute;n&eacute;rale, il est pr&eacute;f&eacute;rable de simplement activer
l'action diff&eacute;r&eacute;e d&eacute;sir&eacute;e &agrave; l'aide de <B>dpkg-trigger</B>.
<DT id="2"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="3"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="4"><B>--admindir</B>=<I>r&eacute;pertoire</I><DD>
Change l'endroit o&ugrave; se trouve la base de donn&eacute;es de <B>dpkg</B>. Par d&eacute;faut,
c'est <I>/var/lib/dpkg</I>.
<DT id="5"><B>--by-package=</B><I>paquet</I><DD>
Indique le paquet qui sera marqu&eacute; en attente de l'ex&eacute;cution de l'action
diff&eacute;r&eacute;e (normalement d&eacute;fini par la variable d'environnement
<B>DPKG_MAINTSCRIPT_PACKAGE</B> dans les scripts du responsable, qui nomme le
paquet auquel le script appartient, et qui constitue la valeur par d&eacute;faut).
<DT id="6"><B>--no-await</B><DD>
Cette option fait en sorte que le paquet appelant T (s'il existe) n'a pas
besoin d'attendre l'ex&eacute;cution de cette action diff&eacute;r&eacute;e&nbsp;; I, le(s) paquet(s)
associ&eacute;(s) &agrave; l'action diff&eacute;r&eacute;e, ne sera pas ajout&eacute; &agrave; liste des paquets dont
le traitement des actions diff&eacute;r&eacute;es est attendu par T et l'&eacute;tat de T reste
inchang&eacute;. T peut &ecirc;tre consid&eacute;r&eacute; install&eacute; m&ecirc;me si les actions diff&eacute;r&eacute;es de I
n'ont pas encore &eacute;t&eacute; ex&eacute;cut&eacute;es.
<DT id="7"><B>--await</B><DD>
Cette option a l'effet inverse de <B>--no-await</B> (depuis dpkg&nbsp;1.17.21). Si le
paquet int&eacute;ress&eacute; a d&eacute;clar&eacute; une directive &laquo;noawait&nbsp;&raquo;, cette option ne sera
pas effective. C'est actuellement le comportement par d&eacute;faut.
<DT id="8"><B>--no-act</B><DD>
Teste uniquement, n'apporte aucun changement.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="9"><B>0</B><DD>
L'action demand&eacute;e s'est correctement d&eacute;roul&eacute;e. Ou bien une commande de
v&eacute;rification ou de d&eacute;claration renvoie &laquo;&nbsp;true&nbsp;&raquo;.
<DT id="10"><B>1</B><DD>
Une commande de v&eacute;rification ou de d&eacute;claration renvoie &laquo;&nbsp;false&nbsp;&raquo;.
<DT id="11"><B>2</B><DD>
Erreur fatale ou irr&eacute;cup&eacute;rable due &agrave; l'utilisation d'une ligne de commande
non valable, ou interactions avec le syst&egrave;me, telles que des acc&egrave;s &agrave; la base
de donn&eacute;es, des allocations de m&eacute;moire,&nbsp;etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="12"><B>DPKG_ADMINDIR</B><DD>
Si cette variable est positionn&eacute;e et que l'option <B>--admindir</B> n'est pas
pr&eacute;cis&eacute;e, ce r&eacute;pertoire sera utilis&eacute; comme r&eacute;pertoire de donn&eacute;es pour
<B>dpkg</B>.
<DT id="13"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?5+deb-triggers">deb-triggers</A></B>(5), <B>/usr/share/doc/dpkg-dev/triggers.txt.gz</B>.
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="14"><A HREF="#lbAB">NOM</A><DD>
<DT id="15"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="16"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="17"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="18"><A HREF="#lbAF">OPTIONS</A><DD>
<DT id="19"><A HREF="#lbAG">CODE DE SORTIE</A><DD>
<DT id="20"><A HREF="#lbAH">ENVIRONNEMENT</A><DD>
<DT id="21"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="22"><A HREF="#lbAJ">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
