
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-architecture</TITLE>
</HEAD><BODY>
<H1>dpkg-architecture</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-architecture - Fixer et d&eacute;terminer l'architecture pour la construction
d'un paquet
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-architecture</B> [<I>option</I>...] [<I>commande</I>]
<P>

<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-architecture</B> aide &agrave; d&eacute;terminer et &agrave; fixer l'architecture de
construction et l'architecture h&ocirc;te pour la cr&eacute;ation d'un paquet.
<P>

L'architecture de construction est toujours d&eacute;termin&eacute;e par un appel externe
&agrave; <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Elle ne peut pas &ecirc;tre sp&eacute;cifi&eacute;e en ligne de commande.
<P>

Vous pouvez sp&eacute;cifier une architecture h&ocirc;te en utilisant une des options
<B>--host-arch</B> et <B>--host-type</B> (ou les deux). Par d&eacute;faut, la valeur est
d&eacute;termin&eacute;e par un appel &agrave; <B><A HREF="/cgi-bin/man/man2html?1+gcc">gcc</A></B>(1), ou en utilisant l'architecture de
construction si <B>CC</B> ou gcc ne sont pas disponibles. Utiliser une seule des
options <B>--host-arch</B> et <B>--host-type</B> est suffisant, la valeur de l'une
est utilis&eacute;e comme valeur par d&eacute;faut de l'autre. Bien s&ucirc;r, il est pr&eacute;f&eacute;rable
de n'en pr&eacute;ciser qu'une seule, puisque <B>dpkg-architecture</B> affichera un
avertissement si le choix ne correspond pas &agrave; la valeur par d&eacute;faut.
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1"><B>-l</B>, <B>--list</B><DD>
Affiche les variables d'environnement, une par ligne, en utilisant le format
<I>VARIABLE=valeur</I>. C'est l'action par d&eacute;faut.
<DT id="2"><B>-e</B>, <B>--equal</B> <I>architecture</I><DD>
V&eacute;rifie l'&eacute;galit&eacute; d'architectures (depuis dpkg&nbsp;1.13.13). Cela compare
l'architecture Debian en cours (ou celle sp&eacute;cifi&eacute;e) &agrave; <I>architecture</I> afin
de v&eacute;rifier leur &eacute;galit&eacute;. Cette action ne g&egrave;re pas les architectures
joker. La commande quitte avec un code de retour de <B>0</B> si l'architecture
correspond et de <B>1</B> dans le cas contraire.
<P>
<DT id="3"><B>-i</B>, <B>--is</B> <I>architecture-joker</I><DD>
V&eacute;rifie l'identit&eacute; des architectures (depuis dpkg&nbsp;1.13.13). Cela compare
l'architecture Debian en cours (ou celle sp&eacute;cifi&eacute;e) &agrave; <I>architecture-joker</I>
(apr&egrave;s expansion de celle-ci) afin de v&eacute;rifier leur correspondance. La
commande quitte avec un code de retour de <B>0</B> si l'architecture correspond
et de <B>1</B> dans le cas contraire.
<DT id="4"><B>-q</B>, <B>--query</B> <I>nom-de-variable</I><DD>
Affiche la valeur d'une seule variable.
<DT id="5"><B>-s</B>, <B>--print-set</B><DD>
Produit une commande, qui peut &ecirc;tre utilis&eacute;e pour positionner les variables
d'environnement avec &laquo;&nbsp;eval&nbsp;&raquo;.
<DT id="6"><B>-u</B>, <B>--print-unset</B><DD>
Affiche une commande similaire &agrave; celle produite par <B>--print-unset</B>, mais
pour supprimer toutes les variables.
<DT id="7"><B>-c</B>, <B>--command</B> <I>cha&icirc;ne-de-commande</I><DD>
Ex&eacute;cute une <I>cha&icirc;ne-de-commande</I> dans un environnement o&ugrave; toutes les
variables sont positionn&eacute;es aux valeurs sp&eacute;cifi&eacute;es.
<DT id="8"><B>-L</B>, <B>--list-known</B><DD>
Affiche une liste des architectures valables. Elle peut &ecirc;tre restreinte par
une ou plusieurs des options correspondantes <B>--match-wildcard</B>,
<B>--match-bits</B> ou <B>--match-endian</B> (depuis dpkg&nbsp;1.17.14).
<DT id="9"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="10"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="11"><B>-a</B>, <B>--host-arch</B> <I>architecture</I><DD>
D&eacute;finit l'architecture Debian en cours.
<DT id="12"><B>-t</B>, <B>--host-type</B> <I>type-de-syst&egrave;me-gnu</I><DD>
D&eacute;finit le type de syst&egrave;me GNU en cours.
<DT id="13"><B>-A</B>, <B>--target-arch</B> <I>architecture</I><DD>
D&eacute;finit l'architecture Debian de la cible (depuis dpkg&nbsp;1.17.14).
<DT id="14"><B>-T</B>, <B>--target-type</B> <I>type-de-syst&egrave;me-gnu</I><DD>
D&eacute;finit le type de syst&egrave;me GNU de la cible (depuis dpkg&nbsp;1.17.14).
<DT id="15"><B>-W</B>, <B>--match-wildcard</B> <I>architecture-joker</I><DD>
Restreindre les architectures list&eacute;es par <B>--list-known</B> &agrave; celles
correspondant &agrave; l'architecture-joker (depuis dpkg&nbsp;1.17.14).
<DT id="16"><B>-B</B>, <B>--match-bits</B> <I>bits-de-l'architecture</I><DD>
Restreindre les architectures list&eacute;es par <B>--list-known</B> &agrave; celles employant
un CPU disposant du nombre de bits indiqu&eacute;s (depuis dpkg&nbsp;1.17.14). Soit
<B>32</B>, soit&nbsp;<B>64</B>.
<DT id="17"><B>-E</B>, <B>--match-endian</B> <I>boutisme-d'architecture</I><DD>
Restreindre les architectures list&eacute;es par <B>--list-known</B> &agrave; celles
correspondant au boutisme sp&eacute;cifi&eacute; (depuis dpkg&nbsp;1.17.14). Soit <B>little</B>,
soit <B>big</B>.
<DT id="18"><B>-f</B>, <B>--force</B><DD>
Les valeurs positionn&eacute;es par les variables d'environnement ayant le m&ecirc;me nom
que celles utilis&eacute;es par les scripts sont prises en compte (c'est-&agrave;-dire
utilis&eacute;es par <B>dpkg-architecture</B>), sauf si cette option est pr&eacute;sente. Cela
permet &agrave; un utilisateur de surcharger une valeur m&ecirc;me lorsque l'appel &agrave;
<B>dpkg-architecture</B> est inclus dans un autre script (par exemple
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)).
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>TERMINOLOGIE</H2>

<DL COMPACT>
<DT id="19">Machine de construction<DD>
Machine sur laquelle le paquet est construit.
<DT id="20">Machine h&ocirc;te<DD>
Machine pour laquelle le paquet est construit.
<DT id="21">Machine cible<DD>
La machine pour laquelle le compilateur construit. Cela est n&eacute;cessaire
uniquement lors de la construction d'une cha&icirc;ne d'outils de compilation
crois&eacute;e qui sera construite sur l'architecture de construction, pour &ecirc;tre
ex&eacute;cut&eacute;e sur l'architecture h&ocirc;te, afin de construire du code pour
l'architecture cible.
<DT id="22">Architecture Debian<DD>
Cha&icirc;ne de caract&egrave;res de l'architecture Debian qui sp&eacute;cifie l'emplacement
dans l'archive FTP. Par exemple&nbsp;: i386, sparc, hurd-i386.
<DT id="23">N-uplet d'architecture Debian<DD>
Un n-uplet d'architecture Debian est l'architecture pleinement qualifi&eacute;e
avec tous ses composants &eacute;nonc&eacute;s. C'est diff&eacute;rent des architectures Debian
en ce que le composant <I>processeur</I> n'int&egrave;gre pas l'<I>ABI</I>. Le n-uplet
actuel a la forme <I>ABI</I>-<I>libc</I>-<I>os</I>-<I>processeur</I>. Exemples&nbsp;:
base-gnu-linux-amd64, eabihf-musl-linux-arm.
<DT id="24">Architecture Debian joker<DD>
Une architecture Debian joker est une architecture sp&eacute;ciale qui correspond &agrave;
toutes les architectures r&eacute;elles qui en font partie. Il est en g&eacute;n&eacute;ral de la
forme d'un n-uplet d'architecture Debian avec quatre &eacute;l&eacute;ments ou moins dont
au moins l'un deux est <B>any</B>. Les &eacute;l&eacute;ments manquants du n-uplet sont
pr&eacute;fix&eacute;s implicitement par <B>any</B>, et donc les paires suivantes sont
&eacute;quivalentes.
<PRE>
    <B>any</B>-<B>any</B>-<B>any</B>-<B>any</B> = <B>any</B>
    <B>any</B>-<B>any</B>-<I>os</I>-<B>any</B> = <I>os</I>-<B>any</B>
    <B>any</B>-<I>libc</I>-<B>any</B>-<B>any</B> = <I>libc</I>-<B>any</B>-<B>any</B>
</PRE>

Exemples&nbsp;: linux-any, any-i386, hurd-any, eabi-any-any-arm, musl-any-any.
<DT id="25">Type de syst&egrave;me GNU<DD>
Cha&icirc;ne de caract&egrave;res d&eacute;finissant l'architecture et constitu&eacute;e de deux
parties s&eacute;par&eacute;es par un tiret&nbsp;: processeur et syst&egrave;me. Par exemple&nbsp;:
i586-linux-gnu, sparc-linux-gnu, i386-gnu, x86_64-netbsd.
<DT id="26">n-uplet multiarchitecture<DD>
Type en clair de syst&egrave;me GNU, utilis&eacute; pour les chemins du syst&egrave;me de
fichiers. Ce n-uplet ne change pas m&ecirc;me quand l'ISA de base est incr&eacute;ment&eacute;e,
de sorte que les chemins r&eacute;sultants sont stables dans la dur&eacute;e. La seule
diff&eacute;rence actuelle avec le type du syst&egrave;me GNU est que la partie processeur
pour les syst&egrave;mes bas&eacute;s sur l'i386 est toujours i386. Exemples&nbsp;:
i386-linux-gnu, x86_64-linux-gnu. Exemple de chemins&nbsp;:
/lib/powerpc64le-linux-gnu/, /usr/lib/i386-kfreebsd-gnu/.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>VARIABLES D'ENVIRONNEMENT</H2>

Les variables suivantes sont positionn&eacute;es par <B>dpkg-architecture</B> (voir la
section <B>TERMS</B> pour une description du sch&eacute;ma de nommage)&nbsp;:
<DL COMPACT>
<DT id="27"><B>DEB_BUILD_ARCH</B><DD>
Architecture Debian de la machine de construction.
<DT id="28"><B>DEB_BUILD_ARCH_ABI</B><DD>
Nom de l'ABI Debian de la machine de construction (depuis dpkg&nbsp;1.18.11).
<DT id="29"><B>DEB_BUILD_ARCH_LIBC</B><DD>
Nom de la libc Debian de la machine de construction (depuis dpkg&nbsp;1.18.11).
<DT id="30"><B>DEB_BUILD_ARCH_OS</B><DD>
Nom du syst&egrave;me Debian de la machine de construction (depuis dpkg&nbsp;1.13.2).
<DT id="31"><B>DEB_BUILD_ARCH_CPU</B><DD>
Nom de processeur Debian de la machine de construction (depuis dpkg&nbsp;1.13.2).
<DT id="32"><B>DEB_BUILD_ARCH_BITS</B><DD>
Taille de pointeur de la machine de construction (en bits, depuis
dpkg&nbsp;1.15.4).
<DT id="33"><B>DEB_BUILD_ARCH_ENDIAN</B><DD>
Boutisme de la machine de construction (petit ou gros, depuis dpkg&nbsp;1.15.4).
<DT id="34"><B>DEB_BUILD_GNU_CPU</B><DD>
Partie CPU de <B>DEB_BUILD_GNU_TYPE</B>.
<DT id="35"><B>DEB_BUILD_GNU_SYSTEM</B><DD>
Partie &laquo;&nbsp;syst&egrave;me&nbsp;&raquo; de <B>DEB_BUILD_GNU_TYPE</B>.
<DT id="36"><B>DEB_BUILD_GNU_TYPE</B><DD>
Type de syst&egrave;me GNU de la machine de construction.
<DT id="37"><B>DEB_BUILD_MULTIARCH</B><DD>
Le type en clair de syst&egrave;me GNU de la machine de construction, utilis&eacute; pour
les chemins du syst&egrave;me de fichiers (depuis dpkg&nbsp;1.16.0).
<DT id="38"><B>DEB_HOST_ARCH</B><DD>
Architecture Debian de la machine h&ocirc;te.
<DT id="39"><B>DEB_HOST_ARCH_ABI</B><DD>
Nom de l'ABI Debian de la machine h&ocirc;te (depuis dpkg&nbsp;1.18.11).
<DT id="40"><B>DEB_HOST_ARCH_LIBC</B><DD>
Nom de la libc Debian de la machine h&ocirc;te (depuis dpkg&nbsp;1.18.11).
<DT id="41"><B>DEB_HOST_ARCH_OS</B><DD>
Nom du syst&egrave;me Debian de la machine h&ocirc;te (depuis dpkg&nbsp;1.13.2).
<DT id="42"><B>DEB_HOST_ARCH_CPU</B><DD>
Nom du processeur Debian de la machine h&ocirc;te (depuis dpkg&nbsp;1.13.2).
<DT id="43"><B>DEB_HOST_ARCH_BITS</B><DD>
Taille de pointeur de la machine h&ocirc;te (en bits, depuis dpkg&nbsp;1.15.4).
<DT id="44"><B>DEB_HOST_ARCH_ENDIAN</B><DD>
Boutisme de la machine h&ocirc;te (petit ou gros, depuis dpkg&nbsp;1.15.4).
<DT id="45"><B>DEB_HOST_GNU_CPU</B><DD>
Partie &laquo;&nbsp;processeur&nbsp;&raquo; de <B>DEB_HOST_GNU_TYPE</B>.
<DT id="46"><B>DEB_HOST_GNU_SYSTEM</B><DD>
Partie &laquo;&nbsp;syst&egrave;me&nbsp;&raquo; de <B>DEB_HOST_GNU_TYPE</B>.
<DT id="47"><B>DEB_HOST_GNU_TYPE</B><DD>
Type de syst&egrave;me GNU de la machine h&ocirc;te.
<DT id="48"><B>DEB_HOST_MULTIARCH</B><DD>
Le type en clair de syst&egrave;me GNU de la machine h&ocirc;te, utilis&eacute; pour les chemins
du syst&egrave;me de fichiers (depuis dpkg&nbsp;1.16.0).
<DT id="49"><B>DEB_TARGET_ARCH</B><DD>
L'architecture Debian de la machine cible (depuis dpkg&nbsp;1.17.14).
<DT id="50"><B>DEB_TARGET_ARCH_ABI</B><DD>
Nom de l'ABI Debian de la machine cible (depuis dpkg&nbsp;1.18.11).
<DT id="51"><B>DEB_TARGET_ARCH_LIBC</B><DD>
Nom de la libc Debian de la machine cible (depuis dpkg&nbsp;1.18.11).
<DT id="52"><B>DEB_TARGET_ARCH_OS</B><DD>
Nom du syst&egrave;me Debian de la machine cible (depuis dpkg&nbsp;1.17.14).
<DT id="53"><B>DEB_TARGET_ARCH_CPU</B><DD>
Nom du processeur Debian de la machine cible (depuis dpkg&nbsp;1.17.14).
<DT id="54"><B>DEB_TARGET_ARCH_BITS</B><DD>
Taille de pointeur de la machine cible (en bits, depuis dpkg&nbsp;1.17.14).
<DT id="55"><B>DEB_TARGET_ARCH_ENDIAN</B><DD>
Boutisme de la machine cible (petit ou gros, depuis dpkg&nbsp;1.17.14).
<DT id="56"><B>DEB_TARGET_GNU_CPU</B><DD>
Partie &laquo;&nbsp;processeur&nbsp;&raquo; de <B>DEB_TARGET_GNU_TYPE</B> (depuis dpkg&nbsp;1.17.14).
<DT id="57"><B>DEB_TARGET_GNU_SYSTEM</B><DD>
Partie &laquo;&nbsp;syst&egrave;me&nbsp;&raquo; de <B>DEB_TARGET_GNU_TYPE</B> (depuis dpkg&nbsp;1.17.14).
<DT id="58"><B>DEB_TARGET_GNU_TYPE</B><DD>
Type du syst&egrave;me GNU de la machine cible (depuis dpkg&nbsp;1.17.14).
<DT id="59"><B>DEB_TARGET_MULTIARCH</B><DD>
Le type en clair du syst&egrave;me GNU de la machine cible, utilis&eacute; pour les
chemins du syst&egrave;me de fichiers (depuis dpkg&nbsp;1.17.14).
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>FICHIERS</H2>

<A NAME="lbAJ">&nbsp;</A>
<H3>Tables d'architectures</H3>

Tous ces fichiers sont n&eacute;cessaires afin que <B>dpkg-architecture</B> puisse
fonctionner. Leurs emplacements peuvent &ecirc;tre modifi&eacute;s lors du traitement &agrave;
l'aide de la variable d'environnement <B>DPKG_DATADIR</B>. Ces tables
contiennent en premi&egrave;re ligne un pseudo-champ de <B>Version</B> de format pour
indiquer leur format de sorte que les analyseurs peuvent v&eacute;rifier s'ils les
comprennent, tel que &laquo;&nbsp;#&nbsp;Version=1.0&nbsp;&raquo;.
<DL COMPACT>
<DT id="60"><I>/usr/share/dpkg/table-processeur</I><DD>
Table des noms de processeurs connus et liaison avec leur nom
GNU. Version&nbsp;1.0 de format (depuis dpkg&nbsp;1.13.2).
<DT id="61"><I>/usr/share/dpkg/table-syst&egrave;me-exploitation</I><DD>
Table des noms des syst&egrave;mes d'exploitation connus et liaison avec leurs noms
GNU. Version&nbsp;2.0 de format (depuis dpkg&nbsp;1.18.11).
<DT id="62"><I>/usr/share/dpkg/table-n-uplet</I><DD>
Correspondances entre les n-uplets de l'architecture Debian et les noms des
architectures Debian. Format version&nbsp;1.0 (depuis dpkg&nbsp;1.18.11).
<DT id="63"><I>/usr/share/dpkg/table-ABI</I><DD>
Table des substituts d'attributs d'ABI d'architecture Debian. Format
version&nbsp;2.0 (depuis dpkg&nbsp;1.18.11).
</DL>
<A NAME="lbAK">&nbsp;</A>
<H3>Gestion de l'empaquetage</H3>

<DL COMPACT>
<DT id="64"><I>/usr/share/dpkg/architecture.mk</I><DD>
Un fragment de fichier Makefile qui d&eacute;finit correctement et exporte toutes
les variables que <B>dpkg-architecture</B> peut fournir (depuis dpkg&nbsp;1.16.1).
</DL>
<A NAME="lbAL">&nbsp;</A>
<H2>EXEMPLES</H2>

<B>dpkg-buildpackage</B> accepte l'option <B>-a</B>, et la passe &agrave;
<B>dpkg-architecture</B>. Voici d'autres exemples&nbsp;:
<DL COMPACT>
<DT id="65"><DD>
CC=i386-gnu-gcc dpkg-architecture -c debian/rules build
<DT id="66"><DD>
eval `dpkg-architecture -u`
</DL>
<P>

V&eacute;rifie si l'architecture en cours (ou celle sp&eacute;cifi&eacute;e) est identique &agrave; une
architecture&nbsp;:
<DL COMPACT>
<DT id="67"><DD>
dpkg-architecture -elinux-alpha
<DT id="68"><DD>
dpkg-architecture -amips -elinux-mips
</DL>
<P>

V&eacute;rifie si l'architecture en cours (ou celle sp&eacute;cifi&eacute;e) est un syst&egrave;me
Linux&nbsp;:
<DL COMPACT>
<DT id="69"><DD>
dpkg-architecture -ilinux-any
<DT id="70"><DD>
dpkg-architecture -ai386 -ilinux-any
</DL>
<A NAME="lbAM">&nbsp;</A>
<H3>Utilisation dans debian/rules</H3>

Les variables d'environnement d&eacute;finies par <B>dpkg-architecture</B> sont
fournies &agrave; <I>debian/rules</I> comme variables pour make (consultez la
documentation de make). Cependant, vous ne devez pas compter l&agrave;-dessus
puisque cela emp&ecirc;che les appels manuels &agrave; ce script. &Agrave; la place, vous devez
toujours les initialiser en utilisant <B>dpkg-architecture</B> avec l'option
<B>-q</B>. Voici quelques exemples, qui indiquent aussi comment am&eacute;liorer la
gestion des compilations crois&eacute;es de votre paquet&nbsp;:
<P>

R&eacute;cup&eacute;ration du type de syst&egrave;me GNU et passage &agrave; ./configure&nbsp;:
<P>

<DL COMPACT><DT id="71"><DD>
<PRE>
DEB_BUILD_GNU_TYPE&nbsp;?= $(shell dpkg-architecture -qDEB_BUILD_GNU_TYPE)
DEB_HOST_GNU_TYPE&nbsp;?= $(shell dpkg-architecture -qDEB_HOST_GNU_TYPE)
[...]
ifeq ($(DEB_BUILD_GNU_TYPE), $(DEB_HOST_GNU_TYPE))
  confflags += --build=$(DEB_HOST_GNU_TYPE)
else
  confflags += --build=$(DEB_BUILD_GNU_TYPE) \
               --host=$(DEB_HOST_GNU_TYPE)
endif
[...]
./configure $(confflags)
</PRE>

</DL>

<P>

Effectuer une action pour une architecture sp&eacute;cifique&nbsp;:
<P>

<DL COMPACT><DT id="72"><DD>
<PRE>
DEB_HOST_ARCH&nbsp;?= $(shell dpkg-architecture -qDEB_HOST_ARCH)

ifeq ($(DEB_HOST_ARCH),alpha)
  [...]
endif
</PRE>

</DL>

<P>

Ou, si vous n'avez besoin que de v&eacute;rifier le type du processeur et du
syst&egrave;me, utilisez les variables <B>DEB_HOST_ARCH_CPU</B> ou <B>DEB_HOST_ARCH_OS</B>.
<P>

Veuillez noter qu'il est &eacute;galement possible d'utiliser un fragment externe
de fichier Makefile pour d&eacute;finir correctement toutes les variables que
<B>dpkg-architecture</B> peut fournir&nbsp;:
<P>

<DL COMPACT><DT id="73"><DD>
<PRE>
include /usr/share/dpkg/architecture.mk

ifeq ($(DEB_HOST_ARCH),alpha)
  [...]
endif
</PRE>

</DL>

<P>

Dans tous les cas, il ne faut jamais utiliser <B>dpkg --print-architecture</B>
pour r&eacute;cup&eacute;rer les informations relatives &agrave; l'architecture pendant la
construction d'un paquet.
<A NAME="lbAN">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="74"><B>DPKG_DATADIR</B><DD>
Si cette variable est d&eacute;finie, elle sera utilis&eacute;e comme r&eacute;pertoire de
donn&eacute;es de <B>dpkg</B> o&ugrave; sont plac&eacute;es les tables d'architecture (depuis
dpkg&nbsp;1.14.17). Par d&eacute;faut &laquo;/usr/share/dpkg&raquo;.
<DT id="75"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="76"><B>DPKG_NLS</B><DD>
Si cette variable est d&eacute;finie, elle sera utilis&eacute;e pour d&eacute;cider l'activation
de la prise en charge des langues (NLS -&nbsp;Native Language Support), connu
aussi comme la gestion de l'internationalisation (ou i18n) (depuis
dpkg&nbsp;1.19.0). Les valeurs permises sont&nbsp;: <B>0</B> et <B>1</B> (par d&eacute;faut).
</DL>
<A NAME="lbAO">&nbsp;</A>
<H2>NOTES</H2>

Tous les noms de commandes et d'options longs ne sont disponibles qu'&agrave;
partir de dpkg&nbsp;1.17.17.
<A NAME="lbAP">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1).
<A NAME="lbAQ">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="77"><A HREF="#lbAB">NOM</A><DD>
<DT id="78"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="79"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="80"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="81"><A HREF="#lbAF">OPTIONS</A><DD>
<DT id="82"><A HREF="#lbAG">TERMINOLOGIE</A><DD>
<DT id="83"><A HREF="#lbAH">VARIABLES D'ENVIRONNEMENT</A><DD>
<DT id="84"><A HREF="#lbAI">FICHIERS</A><DD>
<DL>
<DT id="85"><A HREF="#lbAJ">Tables d'architectures</A><DD>
<DT id="86"><A HREF="#lbAK">Gestion de l'empaquetage</A><DD>
</DL>
<DT id="87"><A HREF="#lbAL">EXEMPLES</A><DD>
<DL>
<DT id="88"><A HREF="#lbAM">Utilisation dans debian/rules</A><DD>
</DL>
<DT id="89"><A HREF="#lbAN">ENVIRONNEMENT</A><DD>
<DT id="90"><A HREF="#lbAO">NOTES</A><DD>
<DT id="91"><A HREF="#lbAP">VOIR AUSSI</A><DD>
<DT id="92"><A HREF="#lbAQ">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
