
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg</TITLE>
</HEAD><BODY>
<H1>dpkg</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg - Gestionnaire de paquet pour Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg</B> [<I>option</I>...] <I>action</I>
<A NAME="lbAD">&nbsp;</A>
<H2>AVERTISSEMENT</H2>

Ce manuel est destin&eacute; aux utilisateurs qui souhaitent aller au-del&agrave; de la
commande <B>dpkg --help</B> pour la compr&eacute;hension des options de la ligne de
commande et des &eacute;tats des paquets.
<P>
Les responsables de paquet qui veulent comprendre comment <B>dpkg</B> installe
leur paquet <I>ne doivent pas</I> l'utiliser. Les descriptions concernant
l'installation ou la d&eacute;sinstallation des paquets sont tr&egrave;s insuffisantes.
<A NAME="lbAE">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg</B> est un outil pour l'installation, la cr&eacute;ation, la suppression et la
gestion des paquets Debian. <B><A HREF="/cgi-bin/man/man2html?1+aptitude">aptitude</A></B>(1) est la principale interface &agrave;
<B>dpkg</B> et la plus agr&eacute;able pour l'utilisateur. <B>dpkg</B> lui-m&ecirc;me est
enti&egrave;rement contr&ocirc;l&eacute; par des param&egrave;tres sur la ligne de commande. Une
commande comporte exactement une action et z&eacute;ro ou plusieurs options. Le
param&egrave;tre &laquo;&nbsp;action&nbsp;&raquo; dit ce que <B>dpkg</B> doit faire et les options modifient
l'action d'une mani&egrave;re ou d'une autre.
<P>
<B>dpkg</B> peut &eacute;galement &ecirc;tre utilis&eacute; comme interface pour <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1) et
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1). La liste des actions g&eacute;r&eacute;es est indiqu&eacute;e dans la section
<B>ACTIONS</B>. Si cette section est pr&eacute;sente, <B>dpkg</B> n'ex&eacute;cute que <B>dpkg-deb</B>
ou <B>dpkg-query</B> avec les param&egrave;tres qui lui sont pass&eacute;s, mais aucune action
sp&eacute;cifique ne leur est communiqu&eacute;e. Pour utiliser cela, il est n&eacute;cessaire
d'appeler le programme directement.
<A NAME="lbAF">&nbsp;</A>
<H2>RENSEIGNEMENTS SUR LES PAQUETS</H2>

<B>dpkg</B> conserve des renseignements utiles sur les paquets
disponibles. Cette information est divis&eacute;e en trois classes&nbsp;: les &eacute;tats, les
&eacute;tats de la s&eacute;lection et les drapeaux. La modification de ces valeurs est
principalement d&eacute;volue &agrave; <B>dselect</B>.
<A NAME="lbAG">&nbsp;</A>
<H3>&Eacute;tats du paquet&nbsp;:</H3>

<DL COMPACT>
<DT id="1"><B>not-installed</B><DD>
Le paquet n'est pas install&eacute; sur le syst&egrave;me.
<DT id="2"><B>config-files</B><DD>
Seuls les fichiers de configuration du paquet existent sur le syst&egrave;me.
<DT id="3"><B>half-installed</B><DD>
L'installation du paquet a commenc&eacute; mais, pour une raison quelconque, ne
s'est pas termin&eacute;e.
<DT id="4"><B>unpacked</B><DD>
Le paquet est d&eacute;paquet&eacute; mais n'est pas configur&eacute;.
<DT id="5"><B>half-configured</B><DD>
Le paquet est d&eacute;paquet&eacute; et la configuration a commenc&eacute; mais, pour une
quelconque raison, ne s'est pas termin&eacute;e.
<DT id="6"><B>triggers-awaited</B><DD>
Le paquet attend l'ex&eacute;cution d'une action diff&eacute;r&eacute;e qui est &agrave; la charge d'un
autre paquet.
<DT id="7"><B>triggers-pending</B><DD>
Une action diff&eacute;r&eacute;e de ce paquet a &eacute;t&eacute; activ&eacute;e, il reste &agrave; l'ex&eacute;cuter.
<DT id="8"><B>installed</B><DD>
Le paquet est correctement d&eacute;paquet&eacute; et configur&eacute;.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H3>&Eacute;tats de s&eacute;lection des paquets</H3>

<DL COMPACT>
<DT id="9"><B>install</B><DD>
Le paquet est s&eacute;lectionn&eacute; pour &ecirc;tre install&eacute;.
<DT id="10"><B>hold</B><DD>
<B>dpkg</B> laisse de c&ocirc;t&eacute; un paquet marqu&eacute; <B>hold</B>, &agrave; moins qu'il ne soit lanc&eacute;
avec l'option de for&ccedil;age <B>--force-hold</B>.
<DT id="11"><B>deinstall</B><DD>
Le paquet est s&eacute;lectionn&eacute; pour &ecirc;tre d&eacute;sinstall&eacute; (c'est-&agrave;-dire qu'on veut
supprimer tous les fichiers &agrave; l'exception des fichiers de configuration).
<DT id="12"><B>purge</B><DD>
Le paquet est s&eacute;lectionn&eacute; pour &ecirc;tre purg&eacute; (c'est-&agrave;-dire qu'on veut tout
supprimer dans les r&eacute;pertoires du syst&egrave;me, m&ecirc;me les fichiers de
configuration).
<DT id="13"><B>unknown</B><DD>
La s&eacute;lection de paquets est inconnue. Un paquet qui est aussi dans un &eacute;tat
<B>not-installed</B> et avec un drapeau <B>ok</B> sera oubli&eacute; dans le prochain
enregistrement de la base de donn&eacute;es.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H3>Drapeaux du paquet&nbsp;:</H3>

<DL COMPACT>
<DT id="14"><B>ok</B><DD>
Un paquet marqu&eacute; <B>ok</B> est dans un &eacute;tat connu, mais pourrait n&eacute;cessiter un
traitement suppl&eacute;mentaire.
<DT id="15"><B>reinstreq</B><DD>
Un paquet marqu&eacute; <B>reinstreq</B> est d&eacute;fectueux et demande une
r&eacute;installation. <B>dpkg</B> ne peut supprimer ces paquets, &agrave; moins qu'il ne soit
lanc&eacute; avec l'option de for&ccedil;age <B>--force-remove-reinstreq</B>.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>ACTIONS</H2>

<DL COMPACT>
<DT id="16"><B>-i</B>, <B>--install</B> <I>fichier-paquet</I>...<DD>
Installe le paquet. Si l'option <B>--recursive</B> ou <B>-R</B> est utilis&eacute;e,
<I>fichier-paquet</I> doit alors &ecirc;tre un r&eacute;pertoire.
<P>
L'installation comporte les &eacute;tapes suivantes&nbsp;:
<BR>

<P>
<B>1.</B> Extraction des fichiers de contr&ocirc;le du nouveau paquet.
<BR>

<P>
<B>2.</B> Quand une ancienne version du m&ecirc;me paquet est d&eacute;j&agrave; install&eacute;e,
ex&eacute;cution du script <I>prerm</I> de l'ancien paquet.
<BR>

<P>
<B>3.</B> Lancement du script <I>preinst</I>, s'il est fourni par le paquet.
<BR>

<P>
<B>4.</B> D&eacute;paquetage des nouveaux fichiers et, en m&ecirc;me temps, sauvegarde des
anciens de mani&egrave;re &agrave; pouvoir les restaurer si quelque chose tourne mal.
<BR>

<P>
<B>5.</B> Quand une ancienne version du m&ecirc;me paquet est d&eacute;j&agrave; install&eacute;e,
ex&eacute;cution du script <I>postrm</I> de l'ancien paquet. Il faut remarquer que ce
script est ex&eacute;cut&eacute; apr&egrave;s le script <I>preinst</I> du nouveau paquet, parce que
les nouveaux fichiers sont &eacute;crits dans le m&ecirc;me temps que les anciens sont
supprim&eacute;s.
<BR>

<P>
<B>6.</B> Configuration du paquet. Voyez l'action <B>--configure</B> pour savoir
comment cela se passe.
<DT id="17"><B>--unpack </B><I>fichier-paquet</I>...<DD>
D&eacute;paqu&egrave;te le paquet mais ne configure rien. Si l'option <B>--recursive</B> ou
<B>-R</B> est utilis&eacute;e, <I>fichier-paquet</I> doit alors indiquer un r&eacute;pertoire.
<DT id="18"><B>--configure </B><I>paquet</I>...|<B>-a</B>|<B>--pending</B><DD>
Configuration d'un paquet d&eacute;paquet&eacute; mais non encore configur&eacute;. Si l'option
<B>-a</B> ou <B>--pending</B> est utilis&eacute;e au lieu de <I>paquet</I>, tous les paquets
d&eacute;paquet&eacute;s mais non configur&eacute;s sont configur&eacute;s.
<P>
Pour reconfigurer un paquet qui l'a d&eacute;j&agrave; &eacute;t&eacute;, vous devriez plut&ocirc;t utiliser
la commande <B><A HREF="/cgi-bin/man/man2html?8+dpkg-reconfigure">dpkg-reconfigure</A></B>(8).
<P>
La configuration comporte les &eacute;tapes suivantes&nbsp;:
<BR>

<P>
<B>1.</B> D&eacute;paquetage des fichiers de configuration, et dans le m&ecirc;me temps
sauvegarde des anciens fichiers de configuration, de mani&egrave;re &agrave; pouvoir les
restaurer si quelque chose se passe mal.
<BR>

<P>
<B>2.</B> Ex&eacute;cution du script <B>postinst</B>, s'il est fourni par le paquet.
<DT id="19"><B>--triggers-only</B> <I>paquet</I> ...|<B>-a</B> | <B>--pending</B><DD>
N'ex&eacute;cute que les actions diff&eacute;r&eacute;es (depuis dpkg&nbsp;1.14.17). Toutes les
actions diff&eacute;r&eacute;es en attente seront trait&eacute;es. Si des noms de paquets sont
fournis, les actions diff&eacute;r&eacute;es de ces paquets seront trait&eacute;es, une fois
chacune lorsque n&eacute;cessaire. L'utilisation de cette option peut laisser des
paquets dans les &eacute;tats incorrects de <B>triggers-awaited</B> et de
<B>triggers-pending</B>. Cela peut &ecirc;tre corrig&eacute; plus tard en ex&eacute;cutant&nbsp;: <B>dpkg
--configure --pending</B>.
<DT id="20"><B>-r</B>, <B>--remove</B> <I>paquet</I>...|<B>-a</B>|<B>--pending</B><DD>
Supprimer un paquet install&eacute;. Cela supprime tout &agrave; l'exception des fichiers
de configuration et les autres donn&eacute;es nettoy&eacute;es par le script <I>postrm</I>, ce
qui &eacute;vite d'avoir &agrave; reconfigurer le paquet s'il &eacute;tait r&eacute;install&eacute; par la
suite (ces fichiers sont les fichiers de configuration list&eacute;s dans le
fichier de contr&ocirc;le <I>DEBIAN/conffiles</I>). S'il n'y a pas de fichier de
contr&ocirc;le <I>DEBIAN/conffiles</I> ni script <I>DEBIAN/postrm</I>, cette commande est,
&eacute;quivalente &agrave; l'appel de <B>--purge</B>. Si <B>-a</B> ou <B>--pending</B> est indiqu&eacute; &agrave;
la place d'un nom de paquet, alors tous les paquets d&eacute;paquet&eacute;s mais marqu&eacute;s
pour suppression dans le fichier <I>/var/lib/dpkg/status</I> seront supprim&eacute;s.
<P>
La suppression d'un paquet comporte les &eacute;tapes suivantes&nbsp;:
<BR>

<P>
<B>1.</B> Lancement du script <I>prerm</I>
<BR>

<P>
<B>2.</B> Suppression des fichiers install&eacute;s
<BR>

<P>
<B>3.</B> Lancement du script <I>postrm</I>
<BR>

<P>
<DT id="21"><B>-P</B>, <B>--purge</B> <I>paquet</I>...|<B>-a</B>|<B>--pending</B><DD>
Purger un paquet install&eacute; ou d&eacute;j&agrave; supprim&eacute;. L'action supprime tout, y
compris les fichiers de configuration et tout le reste nettoy&eacute; de
<I>postrm</I>. Si <B>-a</B> ou <B>--pending</B> est indiqu&eacute; &agrave; la place d'un nom de
paquet, tous les paquets d&eacute;paquet&eacute;s ou supprim&eacute;s mais marqu&eacute;s dans le
fichier <I>/var/lib/dpkg/status</I> comme devant &ecirc;tre purg&eacute;s seront purg&eacute;s.
<P>
Note&nbsp;: certains fichiers de configuration peuvent &ecirc;tre inconnus de <B>dpkg</B>
car ils sont cr&eacute;&eacute;s et g&eacute;r&eacute;s s&eacute;par&eacute;ment par le biais de scripts de
configuration. En ce cas, <B>dpkg</B> ne les supprimera pas lui-m&ecirc;me et le
script <I>postrm</I> du paquet devra s'en charger durant l'op&eacute;ration de
purge. Cela ne s'applique bien entendu qu'aux fichiers situ&eacute;s dans les
r&eacute;pertoires syst&egrave;mes et non aux fichiers de configuration cr&eacute;&eacute;s dans les
r&eacute;pertoires &laquo;&nbsp;home&nbsp;&raquo; des utilisateurs.
<P>
La suppression d'un paquet comporte les &eacute;tapes suivantes&nbsp;:
<BR>

<P>
<B>1.</B> Supprime le paquet s'il n'est pas d&eacute;j&agrave; supprim&eacute;. Voir <B>--remove</B> pour
plus de d&eacute;tails sur la fa&ccedil;on dont cela est fait.
<BR>

<P>
<B>2.</B> Ex&eacute;cuter le script <I>postrm</I>.
<BR>

<DT id="22"><B>-V</B>, <B>--verify</B> <I>nom-du-paquet</I>...<DD>
V&eacute;rifie l'int&eacute;grit&eacute; du <I>nom-du-paquet</I> ou de tous les paquets, si omis, en
comparant l'information des fichiers install&eacute;s par un paquet avec
l'information des m&eacute;tadonn&eacute;es des fichiers stock&eacute;e dans la base de donn&eacute;es
de <B>dpkg</B> (depuis dpkg&nbsp;1.17.2). L'origine de l'information des m&eacute;tadonn&eacute;es
des fichiers dans la base de donn&eacute;es, ce sont les paquets binaires
eux-m&ecirc;mes. Ces m&eacute;tadonn&eacute;es sont collect&eacute;es au moment du d&eacute;paquetage des
paquets durant le processus d'installation.
<P>
Actuellement la seule v&eacute;rification fonctionnelle effectu&eacute;e est une
comparaison des sommes de contr&ocirc;le MD5 du contenu des fichier par rapport
aux valeurs stock&eacute;es dans la base de donn&eacute;es des fichiers. La v&eacute;rification
n'a lieu que si la base de donn&eacute;es contient les informations
n&eacute;cessaires. Pour v&eacute;rifier si des m&eacute;tadonn&eacute;es manquent dans la base de
donn&eacute;es, la commande <B>--audit</B> peut &ecirc;tre employ&eacute;e.
<P>
On peut choisir le format de sortie avec l'option <B>--verify-format</B>, par
d&eacute;faut c'est le format <B>rpm</B>, mais cela pourrait changer dans le futur, et
selon le format que les programmes analysant cette sortie de commande
pourraient explicitement attendre.
<DT id="23"><B>-C</B>, <B>--audit</B> <I>nom-du-paquet</I>...<DD>
Effectue une v&eacute;rification du bon &eacute;tat et de consistance de la base de
donn&eacute;es sur le <I>nom-du-paquet</I> ou sur tous les paquets si omis
(v&eacute;rification par paquet depuis dpkg&nbsp;1.17.10). Par exemple, recherche les
paquets qui n'ont &eacute;t&eacute; que partiellement install&eacute;s sur le syst&egrave;me ou qui ont
des donn&eacute;es de contr&ocirc;le ou des fichiers manquants, incorrects ou
obsol&egrave;tes. <B>dpkg</B> sugg&egrave;re une mani&egrave;re de les corriger.
<DT id="24"><B>--update-avail</B> [<I>fichier-Paquets</I>]<DD>

<B>--merge-avail</B> [<I>fichier-Paquets</I>]
Met &agrave; jour l'information de <B>dpkg</B> et de <B>dselect</B> sur les paquets
disponibles. L'action <B>--merge-avail</B> combine les informations anciennes
avec celles qui proviennent du fichier <I>fichier-Packages</I>. L'action
<B>--update-avail</B> remplace les informations anciennes par celles qui
proviennent du fichier <I>fichier-Packages</I>. Le fichier <I>fichier-Packages</I>
distribu&eacute; avec Debian est appel&eacute; simplement &laquo;&nbsp;<I>Packages</I>&nbsp;&raquo;. Si le param&egrave;tre
<I>fichier-Packages</I> est manquant ou est nomm&eacute; &laquo;&nbsp;<B>-</B>&nbsp;&raquo;, alors, il sera lu &agrave;
partir de l'entr&eacute;e standard (depuis dpkg&nbsp;1.17.7). <B>dpkg</B> garde son propre
enregistrement des paquets disponibles dans <I>/var/lib/dpkg/available</I>.
<P>
Une simple commande permettant de r&eacute;cup&eacute;rer et mettre &agrave; jour le fichier
<I>available</I> est <B>dselect update</B>. Veuillez noter que ce fichier est &agrave; peu
pr&egrave;s inutile si vous n'utilisez pas <B>dselect</B> mais une interface bas&eacute;e sur
APT. APT contient en effet son propre m&eacute;canisme pour suivre les paquets
disponibles.
<DT id="25"><B>-A</B>, <B>--record-avail</B> <I>fichier-paquet</I>...<DD>
Met &agrave; jour l'information de <B>dpkg</B> et de <B>dselect</B> sur les paquets
disponibles avec les informations qui proviennent de <I>fichier-paquet</I>. Si
l'option <B>--recursive</B> ou <B>-R</B> est utilis&eacute;e, <I>fichier-paquet</I> doit
indiquer un r&eacute;pertoire.
<DT id="26"><B>--forget-old-unavail</B><DD>
D&eacute;sormais <B>obsol&egrave;te</B> et sans effet car <B>dpkg</B> oublie automatiquement les
paquets d&eacute;sinstall&eacute;s qui ne sont pas disponibles depuis (dpkg&nbsp;1.15.4), mais
seulement ceux qui ne contiennent pas d'informations pour l'utilisateur
comme les s&eacute;lections de paquets.
<DT id="27"><B>--clear-avail</B><DD>
Efface les renseignements existants sur les paquets disponibles.
<DT id="28"><B>--get-selections</B> [<I>motif-de-nom-de-paquet</I>...]<DD>
Obtient la liste des s&eacute;lections de paquets et l'envoie sur la sortie
standard. Sans un motif, les paquets non install&eacute;s (c'est-&agrave;-dire ceux qui
ont &eacute;t&eacute; pr&eacute;c&eacute;demment purg&eacute;s) ne seront pas affich&eacute;s.
<DT id="29"><B>--set-selections</B><DD>
Modifie la liste des s&eacute;lections des paquets en lisant un fichier sur
l'entr&eacute;e standard. Le format de ce fichier doit &ecirc;tre de la forme &laquo;&nbsp;<I>paquet</I>
<I>&eacute;tat</I>&nbsp;&raquo;, o&ugrave; &eacute;tat vaut <B>install</B>, <B>hold</B>, <B>deinstall</B> ou <B>purge</B>. Les
lignes vides ou les lignes de commentaires d&eacute;butant par &laquo;&nbsp;<B>#</B>&nbsp;&raquo; sont
autoris&eacute;es.
<P>
Le fichier <I>available</I> doit &ecirc;tre &agrave; jour pour que cette commande soit utile,
autrement des paquets inconnus seront ignor&eacute;s avec un
avertissement. Veuillez consultez les commandes <B>--update-avail</B> et
<B>--merge-avail</B> pour plus d'informations.
<DT id="30"><B>--clear-selections</B><DD>
Met l'&eacute;tat de chaque paquet non essentiel &agrave; &laquo;&nbsp;deinstall&nbsp;&raquo; (depuis
dpkg&nbsp;1.13.18). Il faut utiliser cette option juste avant
<B>--set-selections</B>, pour d&eacute;sinstaller les paquets qui ne sont pas affich&eacute;s
par <B>--set-selections</B>.
<DT id="31"><B>--yet-to-unpack</B><DD>
Recherche les paquets qui ont &eacute;t&eacute; s&eacute;lectionn&eacute;s pour l'installation, mais
qui, pour une raison quelconque, ne sont pas encore install&eacute;s.
<DT id="32"><DD>
Note&nbsp;: cette commande utilise &agrave; la fois le fichier disponible et les
s&eacute;lections de paquets.
<DT id="33"><B>--predep-package</B><DD>
Affiche un fichier unique qui est la cible d'une ou plusieurs
pr&eacute;-d&eacute;pendances correspondantes et n'a lui-m&ecirc;me pas de pr&eacute;-d&eacute;pendances
insatisfaites.
<DT id="34"><DD>
Si un tel paquet est pr&eacute;sent, l'affiche comme entr&eacute;e du fichier Packages, et
il peut &ecirc;tre manipul&eacute; comme il se doit.
<DT id="35"><DD>
Note&nbsp;: cette commande utilise &agrave; la fois le fichier disponible et les
s&eacute;lections de paquets.
<DT id="36"><DD>
Renvoie <B>0</B> si un paquet est affich&eacute;, <B>1</B> quand il n'y a pas de paquet
ad&eacute;quat disponible et <B>2</B> en cas d'erreur.
<DT id="37"><B>--add-architecture </B><I>architecture</I><DD>
Ajoute <I>architecture</I> &agrave; la liste d'architectures pour lesquelles les
paquets peuvent &ecirc;tre install&eacute;s sans utiliser <B>--force-architecture</B> (depuis
dpkg&nbsp;1.16.2). L'architecture pour laquelle <B>dpkg</B> est compil&eacute; (c'est-&agrave;-dire
ce qu'affiche <B>--print-architecture</B>) est toujours incluse dans cette
liste.
<DT id="38"><B>--remove-architecture </B><I>architecture</I><DD>
Retire <I>architecture</I> de la liste d'architectures pour lesquelles les
paquets peuvent &ecirc;tre install&eacute;s sans utiliser <B>--force-architecture</B> (depuis
dpkg&nbsp;1.16.2). Si cette architecture est actuellement utilis&eacute;e dans la base
de donn&eacute;es, cette op&eacute;ration sera rejet&eacute;e, sauf si <B>--force-architecture</B>
est utilis&eacute;. L'architecture pour laquelle <B>dpkg</B> est compil&eacute; (c'est-&agrave;-dire
ce qu'affiche <B>--print-architecture</B>) ne peut jamais &ecirc;tre retir&eacute;e de cette
liste.
<DT id="39"><B>--print-architecture</B><DD>
Affiche l'architecture des paquets install&eacute;s (par exemple, &laquo;&nbsp;i386&nbsp;&raquo;).
<DT id="40"><B>--print-foreign-architectures</B><DD>
Affiche la liste, &agrave; raison d'une par ligne, des architectures
suppl&eacute;mentaires pour lesquelles <B>dpkg</B> est autoris&eacute; &agrave; installer des paquets
(depuis dpkg&nbsp;1.16.2).
<DT id="41"><B>--assert=</B><I>fonction</I><DD>
D&eacute;clare que <B>dpkg</B> prend en charge la fonction requise. Renvoie <B>0</B> si la
fonction est compl&egrave;tement prise en charge, <B>1</B> si la fonction est reconnue
mais que <B>dpkg</B> ne peut pas encore fournir sa prise en charge, et <B>2</B> si
la fonction est inconnue. La liste actuelle des fonctions d&eacute;clarables est&nbsp;:
<DL COMPACT><DT id="42"><DD>
<DL COMPACT>
<DT id="43"><B>support-predepends</B><DD>
G&egrave;re le champ <B>Pre-Depends</B> (depuis&nbsp;dpkg&nbsp;1.1.0).
<DT id="44"><B>working-epoch</B><DD>
G&egrave;re les &laquo;&nbsp;epochs&nbsp;&raquo; dans les cha&icirc;nes de version (depuis dpkg&nbsp;1.4.0.7).
<DT id="45"><B>longs-noms-de-fichier</B><DD>
G&egrave;re les longs noms de fichier dans les archives <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5) (depuis
dpkg&nbsp;1.4.1.17).
<DT id="46"><B>multi-conrep</B><DD>
G&egrave;re plusieurs <B>Conflicts</B> et <B>Replaces</B> (depuis dpkg&nbsp;1.4.1.19).
<DT id="47"><B>multi-arch</B><DD>
G&egrave;re les champs et les s&eacute;mantiques multi-architectures (depuis dpkg&nbsp;1.16.2).
<DT id="48"><B>versioned-provides</B><DD>
G&egrave;re les <B>Provides</B> versionn&eacute;s (depuis dpkg&nbsp;1.17.11).
</DL>
</DL>

<DT id="49"><B>--validate-</B><I>cha&icirc;ne-quelque-chose</I><DD>
Valide que la <I>cha&icirc;ne</I> <I>quelque-chose</I> a une syntaxe correcte (depuis
dpkg&nbsp;1.18.16). Renvoie <B>0</B> si la <I>cha&icirc;ne</I> est valable, <B>1</B> si la
<I>cha&icirc;ne</I> n'est pas valable mais pourrait &ecirc;tre accept&eacute; dans des contextes
tol&eacute;rants, et <B>2</B> si la cha&icirc;ne n'est pas valable. La liste actuelle des
<I>quelque-chose</I>s acceptables est&nbsp;:
<DL COMPACT><DT id="50"><DD>
<DL COMPACT>
<DT id="51"><B>pkgname</B><DD>
Valide le nom de paquet donn&eacute; (depuis dpkg&nbsp;1.18.16).
<DT id="52"><B>trigname</B><DD>
Valide le nom d'action diff&eacute;r&eacute;e donn&eacute; (depuis dpkg&nbsp;1.18.16).
<DT id="53"><B>archname</B><DD>
Valide le nom d'architecture donn&eacute; (depuis dpkg&nbsp;1.18.16).
<DT id="54"><B>version</B><DD>
Valide la version donn&eacute;e (depuis dpkg&nbsp;1.18.16).
</DL>
</DL>

<DT id="55"><B>--compare-versions </B><I>ver1 op ver2</I><DD>





Compare des num&eacute;ros de version, o&ugrave; <I>op</I> est un op&eacute;rateur binaire. <B>dpkg</B>
renvoie &laquo;&nbsp;true&nbsp;&raquo; (<B>0</B>) si la condition sp&eacute;cifi&eacute;e est v&eacute;rifi&eacute;e, et renvoie
&laquo;&nbsp;false&nbsp;&raquo; (<B>1</B>) dans le cas contraire. Il y a deux groupes d'op&eacute;rateurs&nbsp;;
ils diff&egrave;rent par leur fa&ccedil;on de traiter l'absence de <I>ver1</I> ou de
<I>ver2</I>. Pour les op&eacute;rateurs suivants, <B>lt le eq ne ge gt</B>, l'absence d'une
version est consid&eacute;r&eacute;e comme inf&eacute;rieure &agrave; toute version&nbsp;; pour les
op&eacute;rateurs <B>lt-nl le-nl ge-nl gt-nl</B>, l'absence d'une version est
consid&eacute;r&eacute;e comme sup&eacute;rieure &agrave; toute version. Les op&eacute;rateurs <B>&lt;
&lt;&lt; &lt;= = &gt;= &gt;&gt; &gt;</B> ne sont fournis que pour la
compatibilit&eacute; avec la syntaxe du fichier de contr&ocirc;le. Les op&eacute;rateurs
<B>&lt;</B> et <B>&gt;</B> sont obsol&egrave;tes et ne devraient <B>pas</B> &ecirc;tre utilis&eacute;s du
fait d'une s&eacute;mantique pas claire. Comme illustration, <B>0.1&lt; 0.1</B> est
&eacute;valu&eacute;e &agrave; vrai.
<DT id="56"><B>-?</B>, <B>--help</B><DD>
Affiche un court message d'aide.
<DT id="57"><B>--force-help</B><DD>
Donne des renseignements sur les options <B>--force-</B><I>quelque-chose</I>.
<DT id="58"><B>-Dh</B>, <B>--debug=help</B><DD>
Donne des renseignements sur les options de d&eacute;bogage.
<DT id="59"><B>--version</B><DD>
Affiche la version de <B>dpkg</B>.
<DT id="60"><B>dpkg-deb actions</B><DD>
Voyez <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1) pour des renseignements suppl&eacute;mentaires sur les actions
suivantes.
<P>
<PRE>
<B>-b</B>, <B>--build</B> <I>r&eacute;pertoire</I> [<I>archive</I>|<I>r&eacute;pertoire</I>]
    Construit un paquet deb.
<B>-c</B>, <B>--contents</B> <I>archive</I>
    Liste le contenu d'un paquet deb.
<B>-e</B>, <B>--control</B> <I>archive</I> [<I>r&eacute;pertoire</I>]
    Extrait les informations de contr&ocirc;le d'un paquet.
<B>-x</B>, <B>--extract</B> <I>archive r&eacute;pertoire</I>
    Extrait et affiche les fichiers contenus dans un paquet.
<B>-X</B>, <B>--vextract</B> <I>archive r&eacute;pertoire</I>
    Extrait et affiche les noms de fichiers contenus dans un
    paquet.
<B>-f</B>, <B>--field</B> <I>archive</I> [<I>champ de contr&ocirc;le</I>] ...
    Affiche le(s) champ(s) de contr&ocirc;le d'un paquet.
<B>--ctrl-tarfile</B> <I>archive</I>
    Produit le contenu du fichier tar de contr&ocirc;le d'un paquet Debian.
<B>--fsys-tarfile</B> <I>archive</I>
    Produit le contenu du fichier tar du syst&egrave;me de fichiers d'un
    paquet Debian.
<B>-I</B>, <B>--info</B> <I>archive</I> [<I>fichier de contr&ocirc;le</I>]
    Affiche des renseignements sur un paquet.
</PRE>

<P>
<DT id="61"><B>dpkg-query actions</B><DD>
Voyez <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1) pour davantage d'explications sur les actions
suivantes.
<P>
<PRE>

<B>-l</B>, <B>--list</B> <I>motif-du-nom-de-paquet</I> ...
    Affiche la liste des paquets qui correspondent au motif.
<B>-s</B>, <B>--status</B> <I>nom-du-paquet</I> ...
    Donne l'&eacute;tat du paquet indiqu&eacute;.
<B>-L</B>, <B>--listfiles</B> <I>nom-du-paquet</I> ...
    Affiche la liste des fichiers install&eacute;s qui appartiennent
    &agrave; <I>paquet</I>.
<B>-S</B>, <B>--search</B> <I>motif-du-fichier-&agrave;-rechercher</I> ...
    Recherche un fichier dans les paquets install&eacute;s.
<B>-p</B>, <B>--print-avail</B> <I>nom-du-paquet</I>
    Affiche les informations trouv&eacute;es dans <I>/var/lib/dpkg/available</I>
    &agrave; propos de <I>paquet</I>. Les utilisateurs des interfaces &agrave; APT
    devraient plut&ocirc;t utiliser <B>apt-cache show</B> <I>nom-du-paquet</I>.
</PRE>

</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>OPTIONS</H2>

On peut sp&eacute;cifier toutes les options &agrave; la fois sur la ligne de commande,
dans le fichier de configuration de <B>dpkg</B>, <I>/etc/dpkg/dpkg.cfg</I> ou
dans les fragments de fichiers du r&eacute;pertoire de configuration
<I>/etc/dpkg/dpkg.cfg.d/</I> (avec un nom qui respecte le motif
&laquo;&nbsp;[0-9a-zA-Z_-]*&nbsp;&raquo;). Chaque ligne de ce fichier est soit une option
(identique &agrave; une option en ligne de commande mais sans tirets initiaux),
soit un commentaire, commen&ccedil;ant par &laquo;&nbsp;<B>#</B>&nbsp;&raquo;.
<BR>

<DL COMPACT>
<DT id="62"><B>--abort-after=</B><I>nombre</I><DD>
Modifie le nombre d'erreurs au del&agrave; duquel <B>dpkg</B> s'arr&ecirc;te. Il est par
d&eacute;faut &eacute;gal &agrave; 50.
<DT id="63"><B>-B</B>, <B>--auto-deconfigure</B><DD>
Quand un paquet est supprim&eacute;, il peut arriver qu'un paquet install&eacute;
d&eacute;pendait du paquet supprim&eacute;. En sp&eacute;cifiant cette option, on obtient la
d&eacute;configuration automatique du paquet qui d&eacute;pendait du paquet supprim&eacute;.
<DT id="64"><B>-D</B><I>octal</I><B>, --debug=</B><I>octal</I><DD>
Demande de d&eacute;bogage. <I>octal</I> est form&eacute; en faisant un &laquo;&nbsp;ou&nbsp;&raquo; logique entre
des valeurs souhait&eacute;es appartenant &agrave; la liste ci-dessous (notez que ces
valeurs pourront changer dans les prochaines versions). <B>-Dh</B> ou
<B>--debug=help</B> affiche ces valeurs de d&eacute;bogage.
<P>
<BR>&nbsp;nombre&nbsp;&nbsp;description
<BR>&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;Informations&nbsp;de&nbsp;progression
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;en&nbsp;g&eacute;n&eacute;ral&nbsp;utiles
<BR>&nbsp;&nbsp;&nbsp;&nbsp;2&nbsp;&nbsp;&nbsp;Appel&nbsp;et&nbsp;&eacute;tat&nbsp;des&nbsp;scripts&nbsp;du&nbsp;responsable
<BR>&nbsp;&nbsp;&nbsp;10&nbsp;&nbsp;&nbsp;Affichage&nbsp;pour&nbsp;chaque&nbsp;fichier&nbsp;trait&eacute;
<BR>&nbsp;&nbsp;100&nbsp;&nbsp;&nbsp;De&nbsp;nombreux&nbsp;affichages&nbsp;pour&nbsp;chaque&nbsp;fichier
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;trait&eacute;
<BR>&nbsp;&nbsp;&nbsp;20&nbsp;&nbsp;&nbsp;Affichage&nbsp;pour&nbsp;chaque&nbsp;fichier&nbsp;de&nbsp;configuration
<BR>&nbsp;&nbsp;200&nbsp;&nbsp;&nbsp;De&nbsp;nombreux&nbsp;affichages&nbsp;pour&nbsp;chaque&nbsp;fichier
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;de&nbsp;configuration
<BR>&nbsp;&nbsp;&nbsp;40&nbsp;&nbsp;&nbsp;D&eacute;pendances&nbsp;et&nbsp;conflits
<BR>&nbsp;&nbsp;400&nbsp;&nbsp;&nbsp;De&nbsp;nombreuses&nbsp;sorties&nbsp;pour&nbsp;les&nbsp;d&eacute;pendances
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;et&nbsp;les&nbsp;conflits
10000   Sortie sur l'activation et le traitement des actions diff&eacute;r&eacute;es
20000   De nombreuses sorties sur les actions diff&eacute;r&eacute;es
40000   Quantit&eacute; stupide de sorties sur les actions diff&eacute;r&eacute;es
<BR>&nbsp;1000&nbsp;&nbsp;&nbsp;Beaucoup&nbsp;de&nbsp;radotage&nbsp;&agrave;&nbsp;propos,&nbsp;par&nbsp;exemple,&nbsp;du&nbsp;r&eacute;pertoire
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;dpkg/info
<BR>&nbsp;2000&nbsp;&nbsp;&nbsp;Quantit&eacute;&nbsp;stupide&nbsp;de&nbsp;radotage
<DT id="65"><B>--force-</B><I>quelque-chose</I><DD>

<B>--no-force-</B><I>quelque-chose</I>, <B>--refuse-</B><I>quelque-chose</I>
Forcer ou refuser (<B>no-force</B> et <B>refuse</B> signifient la m&ecirc;me chose) de
faire quelque chose. <I>quelque-chose</I> est une liste d'actions s&eacute;par&eacute;es par
des virgules, d&eacute;crites ci-apr&egrave;s. <B>--force-help</B> affiche un message qui les
d&eacute;crit. Les actions marqu&eacute;es d'un (*) sont forc&eacute;es par d&eacute;faut.
<P>
<I>Avertissement&nbsp;: ces options sont principalement destin&eacute;es aux experts. Un
usage auquel manque la pleine compr&eacute;hension de leurs effets peut casser le
syst&egrave;me entier.</I>
<P>
<B>all</B>&nbsp;: Met en &oelig;uvre (ou pas) toutes les options de for&ccedil;age.
<P>
<B>downgrade</B>(*)&nbsp;: Installe un paquet, m&ecirc;me si une version plus r&eacute;cente du
paquet est d&eacute;j&agrave; install&eacute;e.
<P>
<I>Avertissement&nbsp;: pour l'instant,</I> <B>dpkg</B> <I>ne recherche pas les
d&eacute;pendances lors d'un retour &agrave; une version inf&eacute;rieure d'un paquet&nbsp;; il ne
vous pr&eacute;viendra pas si la version choisie casse les d&eacute;pendances d'un autre
paquet. Cela peut avoir de s&eacute;rieuses cons&eacute;quences&nbsp;;&nbsp;et si l'on revient &agrave; des
versions ant&eacute;rieures des programmes essentiels du syst&egrave;me, cela peut rendre
votre syst&egrave;me inutilisable. N'utiliser qu'avec pr&eacute;caution.</I>
<P>
<B>configure-any</B>&nbsp;: configurer aussi les paquets d&eacute;paquet&eacute;s mais non
configur&eacute;s dont d&eacute;pend le paquet en question.
<P>
<B>hold</B>&nbsp;: traiter m&ecirc;me les paquets marqu&eacute;s &laquo;&nbsp;&agrave; garder&nbsp;&raquo; (&laquo;&nbsp;hold&nbsp;&raquo;).
<P>
<B>remove-reinstreq</B>&nbsp;: supprimer un paquet, m&ecirc;me d&eacute;fectueux et marqu&eacute; comme
demandant une r&eacute;installation. Il se peut, d&egrave;s lors, que des &eacute;l&eacute;ments du
paquet restent dans le syst&egrave;me et soient oubli&eacute;s par <B>dpkg</B>.
<P>
<B>remove-essential</B>&nbsp;: supprimer un paquet m&ecirc;me s'il est consid&eacute;r&eacute; comme
indispensable. Les paquets &laquo;&nbsp;Essential&nbsp;&raquo; comportent les commandes Unix les
plus fondamentales et les enlever peut casser le syst&egrave;me entier. Il faut
utiliser cette option avec prudence.
<P>
<B>depends</B>&nbsp;: changer tous les probl&egrave;mes de d&eacute;pendance en
avertissements. Cela affecte les champs <B>Pre-Depends</B> et <B>Depends</B>.
<P>
<B>depends-version</B>&nbsp;: ignorer les versions dans les questions de
d&eacute;pendance.Cela affecte les champs <B>Pre-Depends</B> et <B>Depends</B>.
<P>
<B>breaks</B>&nbsp;: forcer l'installation, m&ecirc;me si cela risque de casser un autre
paquet (depuis dpkg&nbsp;1.14.6). Cela affecte le champ <B>Breaks</B>.
<P>
<B>conflicts</B>&nbsp;: installer un paquet, m&ecirc;me s'il est en conflit avec un autre
paquet. C'est dangereux car habituellement cela produit le remplacement de
certains fichiers. Cela affecte le champ <B>Conflicts</B>.
<P>
<B>confmiss</B>&nbsp;: toujours installer le fichier de configuration manquant sans
rien demander. Cette op&eacute;ration est dangereuse, puisque les changements
apport&eacute;s au fichier ne seront pas pr&eacute;serv&eacute;s (suppression).
<P>
<B>confnew</B>&nbsp;: quand un fichier de configuration a &eacute;t&eacute; modifi&eacute; et que la
version dans le paquet a chang&eacute;, toujours installer la nouvelle version sans
rien demander, sauf si l'option <B>--force-confdef</B> est aussi pr&eacute;sente,
auquel cas l'action par d&eacute;faut est choisie.
<P>
<B>confold</B>&nbsp;: quand un fichier de configuration a &eacute;t&eacute; modifi&eacute; et que la
version du paquet a chang&eacute;, garder l'ancienne version sans rien demander,
sauf si l'option <B>--force-confdef</B> est aussi pr&eacute;sente, auquel cas l'action
par d&eacute;faut est choisie.
<P>
<B>confdef</B>&nbsp;: quand un fichier de configuration a &eacute;t&eacute; modifi&eacute; et que la
version du paquet a chang&eacute;, utilise toujours l'action par d&eacute;faut, de mani&egrave;re
non interactive. Quand il n'y a pas d'action par d&eacute;faut, la commande
s'arr&ecirc;te et interroge l'utilisateur, &agrave; moins que l'option <B>--force-confnew</B>
ou l'option <B>--force-confold</B> n'ait &eacute;t&eacute; donn&eacute;e, auquel cas elle se sert de
ces options pour d&eacute;terminer ce qu'il faut faire.
<P>
<B>confask</B>&nbsp;: si un fichier de configuration a &eacute;t&eacute; modifi&eacute;, propose de le
remplacer avec la version du paquet, m&ecirc;me si celle-ci n'a pas chang&eacute; (depuis
dpkg&nbsp;1.15.8). Si l'une des options <B>--force-confmiss</B>, <B>--force-confnew</B>,
<B>--force-confold</B>, ou <B>--force-confdef</B> est &eacute;galement mentionn&eacute;e, elle
d&eacute;terminera l'action finalement utilis&eacute;e.
<P>
<B>overwrite</B>&nbsp;: remplacer un fichier par un fichier d'un autre paquet.
<P>
<B>overwrite-dir</B>&nbsp;: remplacer un r&eacute;pertoire d'un paquet par le fichier d'un
autre paquet.
<P>
<B>overwrite-diverted</B>&nbsp;: remplacer un fichier d&eacute;tourn&eacute; avec une version non
d&eacute;tourn&eacute;e.
<P>
<B>statoverride-add</B>&nbsp;: remplacer une d&eacute;rogation d'&eacute;tat existante lors de son
ajout (depuis dpkg&nbsp;1.19.5)
<P>
<B>statoverride-remove</B>&nbsp;: ignorer l'absence de d&eacute;rogation d'&eacute;tat lors de sa
suppression (depuis dpkg&nbsp;1.19.5).
<P>
<B>security-mac</B>(*)&nbsp;: utiliser une s&eacute;curit&eacute; bas&eacute;e sur le contr&ocirc;le d'acc&egrave;s
obligatoire (Mandatory Access Controls -&nbsp;MAC) sp&eacute;cifique &agrave; la plateforme
lors de l'installation de fichiers dans le syst&egrave;mes de fichiers (depuis
dpkg&nbsp;1.19.5). Sur les syst&egrave;mes Linux, la mise en &oelig;uvre utilise SELinux.
<P>
<B>unsafe-io</B>&nbsp;: ne pas effectuer d'action d'entr&eacute;e/sortie non s&ucirc;re lors de la
d&eacute;compression (depuis dpkg&nbsp;1.15.8.6). Cela implique actuellement de ne pas
synchroniser le syst&egrave;me de fichiers avant le renommage de fichiers, ce qui
est une cause connue de d&eacute;gradation des performances sur certains syst&egrave;mes,
en g&eacute;n&eacute;ral ceux qui, peu fiables, ont besoin d'actions s&ucirc;res pour &eacute;viter de
terminer avec des fichiers de taille vide en cas d'interruption inopin&eacute;e.
<P>
<I>Note</I>&nbsp;: pour ext4, le principal concern&eacute;, il est sugg&eacute;r&eacute; de plut&ocirc;t
utiliser l'option de montage <B>nodelalloc</B>, qui corrigera &agrave; la fois la
d&eacute;gradation des performances et les probl&egrave;mes de s&eacute;curit&eacute; des donn&eacute;es. Elle
permet notamment d'&eacute;viter de terminer avec des fichiers vides lors des
arr&ecirc;ts brutaux pour tout logiciel qui ne synchronise pas le syst&egrave;me de
fichiers avant chaque renommage.
<P>
<I>Avertissement&nbsp;: l'utilisation de cette option peut am&eacute;liorer la
performance mais augmente le risque de perte de donn&eacute;es. Elle est donc &agrave;
utiliser avec pr&eacute;cautions.</I>
<P>
<B>script-chrootless</B>&nbsp;: ex&eacute;cuter les scripts du responsable sans cr&eacute;er de
<B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2) dans <B>instdir</B> m&ecirc;me si le paquet ne g&egrave;re pas ce mode
d'op&eacute;ration (depuis dpkg&nbsp;1.18.5).
<P>
<I>Avertissement&nbsp;: cela peut d&eacute;truire le syst&egrave;me h&ocirc;te, utilisez avec des
pr&eacute;cautions extr&ecirc;mes.</I>
<P>
<B>architecture</B>&nbsp;: traiter m&ecirc;me les paquets sans architecture ou avec une
architecture incorrecte.
<P>
<B>bad-version</B>&nbsp;: traiter m&ecirc;me les paquets dont la version est incorrecte
(depuis dpkg&nbsp;1.16.1).
<P>
<B>bad-path</B>&nbsp;: programmes importants non visibles par la variable <B>PATH</B>, ce
qui va poser des probl&egrave;mes.
<P>
<B>not-root</B>&nbsp;: tenter de (d&eacute;s)installer m&ecirc;me sans &ecirc;tre root.
<P>
<B>bad-verify</B>&nbsp;: installer un paquet m&ecirc;me si la v&eacute;rification de son
authenticit&eacute; a &eacute;chou&eacute;.
<P>
<DT id="66"><B>--ignore-depends</B>=<I>paquet</I>,...<DD>
Ne tient pas compte de la v&eacute;rification des d&eacute;pendances pour les paquets
sp&eacute;cifi&eacute;s (en fait, la v&eacute;rification est faite mais on ne donne rien d'autre
que des avertissements). Cela affecte les champs <B>Pre-Depends</B>, <B>Depends</B>
et <B>Breaks</B>.
<DT id="67"><B>--no-act</B>, <B>--dry-run</B>, <B>--simulate</B><DD>
Faire tout ce qui doit &ecirc;tre fait, mais n'&eacute;crire aucune modification. On
utilise cette option pour voir ce qui se passe sans modifier quoi que ce
soit.
<P>
Assurez-vous de donner l'option <B>--no-act</B> avant le param&egrave;tre action, sinon
des r&eacute;sultats f&acirc;cheux sont probables. Par exemple, la commande <B>dpkg
--purge foo --no-act</B> purge d'abord le paquet foo et essaie ensuite de
purger le paquet --no-act, m&ecirc;me si vous comptiez qu'elle ne ferait rien du
tout.
<DT id="68"><B>-R</B>, <B>--recursive</B><DD>
Traite r&eacute;cursivement tous les simples fichiers qui correspondent au motif
<B>*.deb</B> et qui se trouvent dans les r&eacute;pertoires et sous-r&eacute;pertoires
sp&eacute;cifi&eacute;s. On peut utiliser cette option avec les actions <B>-i</B>, <B>-A</B>,
<B>--install</B>, <B>--unpack</B> et <B>--record-avail</B>.
<DT id="69"><B>-G</B><DD>
Ne pas installer un paquet si une version plus r&eacute;cente de ce paquet est d&eacute;j&agrave;
install&eacute;e. C'est un alias pour <B>--refuse-downgrade</B>.
<DT id="70"><B>--admindir</B>=<I>r&eacute;pertoire</I><DD>
Fixe le r&eacute;pertoire d'administration &agrave; <I>r&eacute;pertoire</I>. Ce r&eacute;pertoire contient
de nombreux fichiers donnant des informations au sujet de l'&eacute;tat des paquets
install&eacute;s ou non,&nbsp;etc. (Le r&eacute;pertoire par d&eacute;faut est <I>/var/lib/dpkg</I>)
<DT id="71"><B>--instdir=</B><I>r&eacute;pertoire</I><DD>
Fixe le r&eacute;pertoire d'installation qui indique o&ugrave; les paquets vont &ecirc;tre
install&eacute;s. <B>instdir</B> est aussi le nom du r&eacute;pertoire indiqu&eacute; &agrave; <B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2)
avant que ne soient lanc&eacute;s les scripts d'installation, ce qui signifie que
ces scripts voient <B>instdir</B> comme r&eacute;pertoire racine. Le r&eacute;pertoire par
d&eacute;faut est &laquo;&nbsp;<I>/</I>&nbsp;&raquo;.
<DT id="72"><B>--root=</B><I>r&eacute;pertoire</I><DD>
Fixe le r&eacute;pertoire racine &agrave; <I>r&eacute;pertoire</I> ce qui fixe le r&eacute;pertoire
d'installation &agrave; &laquo;&nbsp;<I>r&eacute;pertoire</I>&nbsp;&raquo; et le r&eacute;pertoire d'administration &agrave;
&laquo;&nbsp;<I>r&eacute;pertoire</I><B>/var/lib/dpkg</B>&nbsp;&raquo;.
<DT id="73"><B>-O</B>, <B>--selected-only</B><DD>
Traiter seulement les paquets qui sont s&eacute;lectionn&eacute;s pour l'installation. La
s&eacute;lection est r&eacute;ellement faite par <B>dselect</B> ou par <B>dpkg</B> quand ils
manipulent les paquets. Par exemple, quand un paquet est supprim&eacute;, il est
marqu&eacute; comme ayant &eacute;t&eacute; s&eacute;lectionn&eacute; pour une d&eacute;sinstallation.
<DT id="74"><B>-E</B>, <B>--skip-same-version</B><DD>
Ne pas installer le paquet si la m&ecirc;me version du paquet est d&eacute;j&agrave; install&eacute;e.
<DT id="75"><B>--pre-invoke=</B><I>commande</I><DD>

<B>--post-invoke=</B><I>commande</I>
Programme l'ex&eacute;cution de <I>commande</I> &agrave; l'aide &laquo;&nbsp;sh -c&nbsp;&raquo; avant ou apr&egrave;s
l'ex&eacute;cution de <B>dpkg</B> pour les actions <I>unpack</I>, <I>configure</I>, <I>install</I>,
<I>triggers-only</I>, <I>remove</I>, <I>purge</I>, <I>add-architecture</I> et
<I>remove-architecture</I> (depuis dpkg&nbsp;1.15.4&nbsp;; les actions <I>add-architecture</I>
et <I>remove-architecture</I> depuis dpkg&nbsp;1.17.19). Cette option peut &ecirc;tre
utilis&eacute;e plusieurs fois. L'ordre dans lequel les options multiples sont
indiqu&eacute;es sera pr&eacute;serv&eacute; et celles indiqu&eacute;es dans le fichier de configuration
auront la priorit&eacute;. La variable d'environnement <B>DPKG_HOOK_ACTION</B> est
utilis&eacute;e pour indiquer aux scripts utilis&eacute;s quelle est l'action actuelle de
<B>dpkg</B>. Note&nbsp;:&nbsp;les interfaces de <B>dpkg</B> peuvent l'appeler plusieurs fois &agrave;
chaque invocation, ce qui peut provoquer l'ex&eacute;cution des &laquo;&nbsp;hooks&nbsp;&raquo; plus
souvent que pr&eacute;vu.
<DT id="76"><B>--path-exclude=</B><I>motif-global</I><DD>

<B>--path-include=</B><I>motif-global</I>
Utilise <I>motif-global</I> comme filtre de chemins, soit en excluant, soit en
r&eacute;-incluant des chemins pr&eacute;c&eacute;demment exclus, correspondant au motif indiqu&eacute;,
pendant l'installation (depuis dpkg&nbsp;1.15.8).
<P>
<I>Attention&nbsp;:&nbsp;d&eacute;pendre des chemins exclus peut enti&egrave;rement casser le
syst&egrave;me. Ce r&eacute;glage doit donc &ecirc;tre utilis&eacute; avec pr&eacute;cautions.</I>
<P>
Les motifs globaux utilisent les m&ecirc;mes caract&egrave;res joker que le
shell&nbsp;o&ugrave;&nbsp;&laquo;&nbsp;*&nbsp;&raquo; correspond &agrave; une s&eacute;quence quelconque de caract&egrave;res, y compris
une cha&icirc;ne vide ou le caract&egrave;re &laquo;&nbsp;/&nbsp;&raquo;. Ainsi, &laquo;&nbsp;<I>/usr/*/READ*</I>&nbsp;&raquo; comportera
&laquo;&nbsp;<I>/usr/share/doc/package/README</I>&nbsp;&raquo;. Comme toujours, le caract&egrave;re &laquo;&nbsp;?&nbsp;&raquo;
correspond &agrave; un caract&egrave;re quelconque (y compris &laquo;&nbsp;/&nbsp;&raquo;). Le caract&egrave;re &laquo;&nbsp;[&nbsp;&raquo;
marque le d&eacute;but d'une classe de caract&egrave;res, qui contient une liste de
caract&egrave;res, s&eacute;ries de caract&egrave;res ou compl&eacute;ments de s&eacute;ries. Veuillez
consulter <B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7) pour plus d'informations &agrave; propos des correspondances
globales. Note&nbsp;:&nbsp;l'impl&eacute;mentation actuelle pourrait r&eacute;-inclure plus de
r&eacute;pertoires et liens symboliques que n&eacute;cessaire, par souci de s&eacute;curit&eacute; et
pour &eacute;viter des &eacute;checs possibles de d&eacute;compression. Des modifications &agrave; venir
pourraient changer cela.
<P>
Cela peut servir &agrave; exclure tous les chemins sauf certains sp&eacute;cifiques. Un
cas classique d'utilisation est&nbsp;:
<P>
<PRE>
<B>--path-exclude=/usr/share/doc/*</B>
<B>--path-include=/usr/share/doc/*/copyright</B>
</PRE>

<P>
qui permet de supprimer tous les fichiers de documentation sauf les fichiers
de &laquo;&nbsp;copyright&nbsp;&raquo;.
<P>
Ces deux options peuvent &ecirc;tre utilis&eacute;es plusieurs fois et &eacute;ventuellement
&ecirc;tre altern&eacute;es entre elles. Les deux sont trait&eacute;es dans l'ordre indiqu&eacute;&nbsp;:&nbsp;la
derni&egrave;re r&egrave;gle correspondant &agrave; un fichier donn&eacute; est alors celle qui sera
utilis&eacute;e.
<P>
Les filtres sont appliqu&eacute;s lors du d&eacute;paquetage des paquets binaires et, en
tant que tel, ont seulement connaissance du type des objets qui sont en
cours de filtrage (par exemple un fichier ordinaire ou un r&eacute;pertoire) et
n'ont pas de visibilit&eacute; des objets &agrave; venir. Comme ces filtres ont des effets
secondaires (&agrave; la diff&eacute;rence des filtres de <B><A HREF="/cgi-bin/man/man2html?1+find">find</A></B>(1)), l'exclusion d'un
chemin pr&eacute;cis qui se trouve &ecirc;tre un objet r&eacute;pertoire, comme
<I>/usr/share/doc</I>, n'aura pas le r&eacute;sultat d&eacute;sir&eacute;, et seul ce chemin sera
exclu (et qui pourrait &ecirc;tre r&eacute;int&eacute;gr&eacute; automatiquement si le code en voit la
n&eacute;cessit&eacute;).Le d&eacute;paquetage de tous les fichiers suivants renferm&eacute;s par ce
r&eacute;pertoire &eacute;chouera.
<P>
Astuce&nbsp;: Assurez-vous que les &laquo;&nbsp;globs&nbsp;&raquo; ne sont pas d&eacute;velopp&eacute;s par le shell.
<DT id="77"><B>--verify-format</B><I> nom-de-format</I><DD>
D&eacute;finit le format de sortie de la commande <B>--verify</B> (depuis dpkg&nbsp;1.17.2).
<P>
Le seul format de sortie g&eacute;r&eacute; actuellement est <B>rpm</B>, qui consiste en une
ligne par chemin dont la v&eacute;rification a &eacute;chou&eacute;. Les lignes d&eacute;butent par
9&nbsp;caract&egrave;res pour signaler les r&eacute;sultats d'une v&eacute;rification sp&eacute;cifique, un
&laquo;&nbsp;<B>?</B>&nbsp;&raquo; implique que la v&eacute;rification ne peut &ecirc;tre r&eacute;alis&eacute;e (absence de
prise en charge, droit d'acc&egrave;s de fichier,&nbsp;etc), &laquo;&nbsp;<B>.</B>&nbsp;&raquo; implique que la
v&eacute;rification est pass&eacute;e et un caract&egrave;re alphanum&eacute;rique implique qu'une
v&eacute;rification sp&eacute;cifique a &eacute;chou&eacute;&nbsp;; l'&eacute;chec de v&eacute;rification md5sum est
identifi&eacute;e par un &laquo;&nbsp;<B>5</B>&nbsp;&raquo; en troisi&egrave;me caract&egrave;re. La ligne continue par une
espace et un caract&egrave;re d'attribut (comme &laquo;&nbsp;<B>c</B>&nbsp;&raquo; pour conffiles -&nbsp;fichiers
de configuration), une autre espace et le nom de chemin.
<DT id="78"><B>--status-fd </B><I>n</I><DD>
Envoie un &eacute;tat du paquet compr&eacute;hensible par la machine et met &agrave; jour cette
information dans le descripteur de fichier <I>n</I>. Cette option peut &ecirc;tre
sp&eacute;cifi&eacute;e plusieurs fois. L'information est g&eacute;n&eacute;ralement constitu&eacute;e d'un
enregistrement par ligne, dans l'une des formes suivantes&nbsp;:
<DL COMPACT><DT id="79"><DD>
<DL COMPACT>
<DT id="80"><B>status: </B><I>paquet</I><B>: </B><I>&eacute;tat</I><DD>
L'&eacute;tat du paquet a chang&eacute;&nbsp;; l'<I>&eacute;tat</I> est tel que dans le fichier d'&eacute;tat
(&nbsp;&laquo;status file&nbsp;&raquo;).
<DT id="81"><B>status: </B><I>paquet</I><B> : error : </B><I>message-d'erreur-complet</I><DD>
Une erreur s'est produite. Toutes les lignes suppl&eacute;mentaires &eacute;ventuelles
dans <I>message-d'erreur-complet</I> seront converties en espaces avant
affichage.
<DT id="82"><B>status: </B><I>fichier</I><B> : conffile-prompt : '</B><I>real-old</I><B>' '</B><I>real-new</I><B>' </B><I>useredited</I><B> </B><I>distedited</I><DD>
Une question pour un fichier de configuration va &ecirc;tre pos&eacute;e &agrave; l'utilisateur.
<DT id="83"><B>processing: </B><I>phase</I><B>: </B><I>paquet</I><DD>
Envoy&eacute; juste avant le d&eacute;but du traitement d'une phase. Les <I>phases</I> sont
<B>upgrade</B>, <B>install</B> (les deux sont envoy&eacute;s avant le d&eacute;paquetage),
<B>configure</B>, <B>trigproc</B>, <B>disappear</B>, <B>remove</B>, <B>purge</B>.
</DL>
</DL>

<DT id="84"><B>--status-logger</B>=<I>commande</I><DD>
Envoie un &eacute;tat du paquet compr&eacute;hensible par la machine et met &agrave; jour
l'information de progression sur l'entr&eacute;e standard du processeur de
commandes <I>command</I>, &agrave; ex&eacute;cuter avec &laquo;&nbsp;sh -c&nbsp;&raquo; (depuis dpkg&nbsp;1.16.0). Cette
option peut &ecirc;tre sp&eacute;cifi&eacute;e plusieurs fois. Le format d'affichage utilis&eacute; est
le m&ecirc;me que celui de <B>--status-fd.</B>
<DT id="85"><B>--log=</B><I>fichier</I><DD>
Enregistre les mises &agrave; jour et actions des changements d'&eacute;tat dans
<I>fichier</I> plut&ocirc;t que dans le <I>/var/log/dpkg.log</I> par d&eacute;faut. Si l'option
est pass&eacute;e plusieurs fois, le dernier nom de fichier est utilis&eacute;. Les
messages du journal ont cette forme&nbsp;:
<DL COMPACT><DT id="86"><DD>
<DL COMPACT>
<DT id="87">AAAA-MM-JJ HH:MM:SS <B>startup</B> <I>type</I> <I>commande</I><DD>
Pour chaque invocation de dpkg o&ugrave; <I>type</I> est <B>archives</B> (avec une
<I>commande</I> <B>unpack</B> ou <B>install</B>) ou <B>packages</B> (avec une <I>commande</I>
<B>configure</B>, <B>triggers-only</B>, <B>remove</B> ou <B>purge</B>).
<DT id="88">AAAA-MM-JJ HH:MM:SS <B>status</B> <I>&eacute;tat</I> <I>paquet</I> <I>version-install&eacute;e</I><DD>
Pour les mises &agrave; jour des changements d'&eacute;tat.
<DT id="89">AAAA-MM-JJ HH:MM:SS <B>action</B> <I>paquet</I> <I>version-install&eacute;e</I> <I>version-disponible</I><DD>
Pour les actions o&ugrave; <I>action</I> est <B>install</B>, <B>upgrade</B>, <B>configure</B>,
<B>trigproc</B>, <B>disappear</B>, <B>remove</B> ou <B>purge</B>.
<DT id="90">AAAA-MM-JJ HH:MM:SS <B>conffile</B> <I>fichier</I> <I>d&eacute;cision</I><DD>
Pour les changements du fichier de configuration o&ugrave; <I>d&eacute;cision</I> est
<B>install</B> ou <B>keep</B>.
</DL>
</DL>

<DT id="91"><B>--no-pager</B><DD>
D&eacute;sactive l'utilisation d'un afficheur pour montrer les informations (depuis
dpkg&nbsp;1.19.2).
<DT id="92"><B>--no-debsig</B><DD>
Ne pas tenter de v&eacute;rifier la signature des paquets.
<DT id="93"><B>--no-triggers</B><DD>
Durant ce traitement, ne pas lancer d'actions diff&eacute;r&eacute;es (depuis
dpkg&nbsp;1.14.17), mais les activations seront toujours enregistr&eacute;es. S'il est
utilis&eacute; avec <B>--configure</B> <I>paquet</I> ou <B>--triggers-only</B> <I>paquet</I> alors
le postinst du paquet sera toujours ex&eacute;cut&eacute; m&ecirc;me si seule l'ex&eacute;cution d'une
action diff&eacute;r&eacute;e est n&eacute;cessaire. L'utilisation de cette option peut laisser
des paquets dans les mauvais &eacute;tats <B>triggers-awaited</B> et
<B>triggers-pending</B>. Cela peut &ecirc;tre corrig&eacute; plus tard en ex&eacute;cutant <B>dpkg
--configure --pending</B>.
<DT id="94"><B>--triggers</B><DD>
Annule un pr&eacute;c&eacute;dent <B>--no-triggers</B> (depuis dpkg&nbsp;1.14.17).
</DL>
<A NAME="lbAL">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="95"><B>0</B><DD>
L'action demand&eacute;e s'est correctement d&eacute;roul&eacute;e. Ou bien une commande de
v&eacute;rification ou de d&eacute;claration renvoie &laquo;&nbsp;true&nbsp;&raquo;.
<DT id="96"><B>1</B><DD>
Une commande de v&eacute;rification ou de d&eacute;claration renvoie &laquo;&nbsp;false&nbsp;&raquo;.
<DT id="97"><B>2</B><DD>
Erreur fatale ou irr&eacute;cup&eacute;rable due &agrave; l'utilisation d'une ligne de commande
non valable, ou interactions avec le syst&egrave;me, telles que des acc&egrave;s &agrave; la base
de donn&eacute;es, des allocations de m&eacute;moire,&nbsp;etc.
</DL>
<A NAME="lbAM">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<A NAME="lbAN">&nbsp;</A>
<H3>Environnement externe</H3>

<DL COMPACT>
<DT id="98"><B>PATH</B><DD>
Cette variable devrait &ecirc;tre d&eacute;finie dans l'environnement et pointer vers les
chemins du syst&egrave;me o&ugrave; plusieurs programmes requis devraient se trouver. Si
la variable n'est pas d&eacute;finie ou si les programmes ne sont pas trouv&eacute;s,
<B>dpkg</B> s'arr&ecirc;te.
<DT id="99"><B>HOME</B><DD>
Si cette option est utilis&eacute;e, <B>dpkg</B> utilisera le r&eacute;pertoire indiqu&eacute; pour
lire le fichier de configuration propre &agrave; l'utilisateur.
<DT id="100"><B>TMPDIR</B><DD>
Si cette option est utilis&eacute;e, <B>dpkg</B> utilisera le r&eacute;pertoire indiqu&eacute; pour
cr&eacute;er les fichiers et r&eacute;pertoires temporaires.
<DT id="101"><B>SHELL</B><DD>
Le programme ex&eacute;cut&eacute; par <B>dpkg</B> quand il lance un nouvel interpr&eacute;teur de
commandes interactif ou lance une commande avec le shell.
<DT id="102"><B>PAGER</B><DD>

<B>DPKG_PAGER</B>
Le programme ex&eacute;cut&eacute; par <B>dpkg</B> quand il utilise un afficheur, par exemple
lorsqu'il affiche des diff&eacute;rences de fichiers de configuration. Si <B>SHELL</B>
n'est pas d&eacute;fini, <B>sh</B> sera utilis&eacute; &agrave; la place. Le <B>DPKG_PAGER</B> se
substitue &agrave; la variable d'environnement <B>PAGER</B> (depuis dpkg&nbsp;1.19.2).
<DT id="103"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="104"><B>DPKG_FORCE</B><DD>
D&eacute;finit les drapeaux de for&ccedil;age (depuis dpkg&nbsp;1.19.5). Quand cette variable
est pr&eacute;sente, aucune des options internes de for&ccedil;age par d&eacute;faut ne sera
appliqu&eacute;e. Si la variable est pr&eacute;sente mais vide, tous les drapeaux de
for&ccedil;age seront d&eacute;sactiv&eacute;s.
<DT id="105"><B>DPKG_FRONTEND_LOCKED</B><DD>
D&eacute;finie par une interface de gestion de paquets pour notifier &agrave; dpkg qu'il
ne devrait pas obtenir le verrou d'interface (dpkg&nbsp;1.19.1).
</DL>
<A NAME="lbAO">&nbsp;</A>
<H3>Environnement interne</H3>

<DL COMPACT>
<DT id="106"><B>LESS</B><DD>
D&eacute;finie par <B>dpkg</B> &agrave; &laquo;&nbsp;<B>-FRSXMQ</B>&nbsp;&raquo;, si ce n'est pas d&eacute;j&agrave; configur&eacute;, lors
du lancement d'un afficheur (depuis dpkg&nbsp;1.19.2). Pour modifier le
comportement par d&eacute;faut, cette variable peut &ecirc;tre configur&eacute;e &agrave; une autre
valeur y compris une cha&icirc;ne vide&nbsp;; alternativement, les variables <B>PAGER</B>
ou <B>DPKG_PAGER</B> peuvent &ecirc;tre r&eacute;gl&eacute;es pour d&eacute;sactiver des options
particuli&egrave;res avec &laquo;<B>-+</B>&raquo;, par exemple <B>DPKG_PAGER=&quot;less -+F&quot;</B>.
<DT id="107"><B>DPKG_ROOT</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du script du responsable pour
indiquer quelle installation activer (depuis dpkg&nbsp;1.18.5). La valeur est
destin&eacute;e &agrave; &ecirc;tre ajout&eacute;e avant n'importe quel chemin sur lequel les scripts
du responsable agissent. Pendant une op&eacute;ration normale, cette variable est
vide. Lors de l'installation de paquets dans un <B>instdir</B> diff&eacute;rent,
<B>dpkg</B> invoque normalement les scripts du responsable avec <B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2) et
laisse cette variable vide, mais si <B>--force-script-chrootless</B> est
indiqu&eacute;, alors, l'appel de <B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2) est ignor&eacute; et <B>instdir</B> n'est pas
vide.
<DT id="108"><B>DPKG_ADMINDIR</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du script du responsable, pour
indiquer le r&eacute;pertoire d'administration &agrave; utiliser (depuis
dpkg&nbsp;1.16.0). Cette variable est toujours fix&eacute;e &agrave; la valeur actuelle de
<B>--admindir</B>.
<DT id="109"><B>DPKG_FORCE</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du sous-processus pour tous les
noms d'options de for&ccedil;age actuellement activ&eacute;es s&eacute;par&eacute;s par des virgules
(depuis&nbsp;dpkg&nbsp;1.19.5).
<DT id="110"><B>DPKG_SHELL_REASON</B><DD>
Cette variable est d&eacute;finie pour le shell lanc&eacute; par <B>dpkg</B> lorsqu'il lui est
demand&eacute; d'analyser la situation lors du traitement des fichiers de
configuration (depuis dpkg&nbsp;1.15.6). La valeur actuellement valable est&nbsp;:
<B>conffile-prompt</B>.
<DT id="111"><B>DPKG_CONFFILE_OLD</B><DD>
Cette variable est d&eacute;finie pour le shell lanc&eacute; par <B>dpkg</B> lorsqu'il lui est
demand&eacute; d'analyser la situation lors du traitement des fichiers de
configuration (depuis dpkg&nbsp;1.15.6). Elle contient le nom de l'ancien fichier
de configuration.
<DT id="112"><B>DPKG_CONFFILE_NEW</B><DD>
Cette variable est d&eacute;finie pour le shell lanc&eacute; par <B>dpkg</B> lorsqu'il lui est
demand&eacute; d'analyser la situation lors du traitement des fichiers de
configuration (depuis dpkg&nbsp;1.15.6). Elle contient le nom du nouveau fichier
de configuration.
<DT id="113"><B>DPKG_HOOK_ACTION</B><DD>
Cette variable est d&eacute;finie par <B>dpkg</B> pour le shell lanc&eacute; lors de
l'ex&eacute;cution d'une action de point d'entr&eacute;e (depuis dpkg&nbsp;1.15.4). Elle
contient l'action actuelle de <B>dpkg</B>.
<DT id="114"><B>DPKG_RUNNING_VERSION</B><DD>
Cette variable est d&eacute;finie par <B>dpkg</B> dans l'environnement du script du
responsable. Elle contient la version de l'instance de <B>dpkg</B> en cours
d'ex&eacute;cution (depuis dpkg&nbsp;1.14.17).
<DT id="115"><B>DPKG_MAINTSCRIPT_PACKAGE</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du script du responsable, cette
variable contient le nom du paquet (sans qualification d'architecture) en
cours de traitement (depuis dpkg&nbsp;1.14.17).
<DT id="116"><B>DPKG_MAINTSCRIPT_PACKAGE_REFCOUNT</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du script du responsable, cette
variable contient le compte de r&eacute;f&eacute;rence du paquet, c'est-&agrave;-dire le nombre
d'instances de paquet avec un &eacute;tat plus &eacute;lev&eacute; que <B>not-installed</B> (depuis
dpkg&nbsp;1.17.2).
<DT id="117"><B>DPKG_MAINTSCRIPT_ARCH</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du script du responsable, cette
variable contient l'architecture pour laquelle le paquet a &eacute;t&eacute; construit
(depuis dpkg&nbsp;1.15.4).
<DT id="118"><B>DPKG_MAINTSCRIPT_NAME</B><DD>
D&eacute;finie par <B>dpkg</B> dans l'environnement du script du responsable, cette
variable contient le nom du script en cours d'ex&eacute;cution, <B>preinst</B>,
<B>postinst</B>, <B>prerm</B> ou <B>postrm</B> (depuis dpkg&nbsp;1.15.7).
<DT id="119"><B>DPKG_MAINTSCRIPT_DEBUG</B><DD>
Cette variable est d&eacute;finie par <B>dpkg</B> dans l'environnement du script du
responsable &agrave; une valeur (&laquo;&nbsp;<B>0</B>&nbsp;&raquo; ou &laquo;&nbsp;<B>1</B>&nbsp;&raquo; notant si le d&eacute;bogage a &eacute;t&eacute;
demand&eacute; (avec l'option <B>--debug</B>) pour les scripts du responsable (depuis
dpkg&nbsp;1.18.4).
</DL>
<A NAME="lbAP">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="120"><I>/etc/dpkg/dpkg.cfg.d/[0-9a-zA-Z_-]*</I><DD>
Fragments de fichiers de configuration (depuis dpkg&nbsp;1.15.4).
<DT id="121"><I>/etc/dpkg/dpkg.cfg</I><DD>
Fichier de configuration contenant les options par d&eacute;faut.
<DT id="122"><I>/var/log/dpkg.log</I><DD>
Fichier journal standard. Voyez <I>/etc/dpkg/dpkg.cfg</I> et l'option
<B>--log</B>.
</DL>
<P>

Les autres fichiers r&eacute;pertori&eacute;s ici sont dans leur r&eacute;pertoire par d&eacute;faut,
voyez l'option <B>--admindir</B> pour savoir comment changer l'emplacement de
ces fichiers.
<DL COMPACT>
<DT id="123"><I>/var/lib/dpkg/available</I><DD>
Liste des paquets disponibles.
<DT id="124"><I>/var/lib/dpkg/status</I><DD>
&Eacute;tats des paquets disponibles. Ce fichier contient des informations qui
permettent de savoir si un paquet est marqu&eacute; comme devant &ecirc;tre supprim&eacute; ou
pas, devant &ecirc;tre install&eacute; ou pas,&nbsp;etc. Voyez la section <B>RENSEIGNEMENTS SUR
LES PAQUETS</B> pour des informations suppl&eacute;mentaires.
<P>
Le fichier d'&eacute;tat est sauvegard&eacute; quotidiennement dans <I>/var/backups</I>. Cela
peut &ecirc;tre utile en cas de perte ou de corruption due &agrave; des probl&egrave;mes de
syst&egrave;me de fichiers.
</DL>
<P>

Le format et le contenu d'un paquet binaire sont d&eacute;crits dans <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5).
<A NAME="lbAQ">&nbsp;</A>
<H2>BOGUES</H2>

L'option <B>--no-act</B> ne donne pas assez d'informations utiles.
<A NAME="lbAR">&nbsp;</A>
<H2>EXEMPLES</H2>

Affichage des paquets install&eacute;s li&eacute;s &agrave; l'&eacute;diteur <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1) (noter que
<B>dpkg-query</B> ne charge plus le fichier <I>available</I> par d&eacute;faut, sauf si
l'option <B>dpkg-query</B> <B>--load-avail</B> est utilis&eacute;e)&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;-l&nbsp;'*vi*'</B>
<BR>

<P>
Pour voir les entr&eacute;es de <I>/var/lib/dpkg/available</I> concernant deux paquets&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--print-avail&nbsp;elvis&nbsp;vim&nbsp;|&nbsp;less</B>
<BR>

<P>
Pour rechercher vous-m&ecirc;me dans la liste des paquets&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>less&nbsp;/var/lib/dpkg/available</B>
<BR>

<P>
Pour supprimer le paquet install&eacute; elvis&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;-r&nbsp;elvis</B>
<BR>

<P>
Pour installer un paquet, vous devez d'abord le trouver dans une archive ou
sur un CD. Le fichier <I>available</I> montre que le paquet vim se trouve dans
la section &laquo;&nbsp;<B>editors</B>&nbsp;&raquo;&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>cd&nbsp;/media/cdrom/pool/main/v/vim</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;-i&nbsp;vim_4.5-3.deb</B>
<BR>

<P>
Pour faire une copie locale des &eacute;tats de s&eacute;lection des paquets&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--get-selections&nbsp;&gt;mes-s&eacute;lections</B>
<BR>

<P>
Vous pourriez transf&eacute;rer ce fichier sur un autre ordinateur, et apr&egrave;s avoir
mis &agrave; jour le fichier <I>available</I> avec l'interface de gestion de paquets de
votre choix (voir <A HREF="https://wiki.debian.org/Teams/Dpkg/FAQ">https://wiki.debian.org/Teams/Dpkg/FAQ</A> pour plus de
d&eacute;tails), par exemple&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>apt-cache&nbsp;dumpavail&nbsp;|&nbsp;dpkg&nbsp;--merge-avail</B>
<BR>

ou avec dpkg&nbsp;1.17.6 et les versions ant&eacute;rieures&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>avail=`mktemp`</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>apt-cache&nbsp;dumpavail&nbsp;&gt;&quot;$avail&quot;</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--merge-avail&nbsp;&quot;$avail&quot;</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>rm&nbsp;&quot;$avail&quot;</B>
<BR>

vous pouvez l'installer de cette mani&egrave;re&nbsp;:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--clear-selections</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--set-selections&nbsp;&lt;mes-s&eacute;lections</B>
<BR>

<P>
On remarquera que cela n'installe ou ne supprime rien du tout&nbsp;; cela ne fait
qu'enregistrer l'&eacute;tat souhait&eacute; des paquets. Vous aurez besoin d'autres
applications pour r&eacute;cup&eacute;rer et installer r&eacute;ellement les paquets requis. Par
exemple, ex&eacute;cuter <B>apt-get dselect-upgrade</B>.
<P>
Habituellement, vous trouverez que <B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1) fournit une fa&ccedil;on plus
ais&eacute;e de modifier les &eacute;tats de s&eacute;lection des paquets.
<BR>

<A NAME="lbAS">&nbsp;</A>
<H2>FONCTIONNALIT&Eacute;S SUPPL&Eacute;MENTAIRES</H2>

D'autres possibilit&eacute;s sont offertes en installant les paquets suivants&nbsp;:
<B>apt</B>, <B>aptitude</B> et <B>debsums</B>.
<A NAME="lbAT">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?1+aptitude">aptitude</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+apt">apt</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+dpkg.cfg">dpkg.cfg</A></B>(5) et <B><A HREF="/cgi-bin/man/man2html?8+dpkg-reconfigure">dpkg-reconfigure</A></B>(8).
<A NAME="lbAU">&nbsp;</A>
<H2>AUTEURS</H2>

Consultez <I>/usr/share/doc/dpkg/THANKS</I> pour la liste de ceux qui ont contribu&eacute; &agrave;
<B>dpkg</B>.
<A NAME="lbAV">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="125"><A HREF="#lbAB">NOM</A><DD>
<DT id="126"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="127"><A HREF="#lbAD">AVERTISSEMENT</A><DD>
<DT id="128"><A HREF="#lbAE">DESCRIPTION</A><DD>
<DT id="129"><A HREF="#lbAF">RENSEIGNEMENTS SUR LES PAQUETS</A><DD>
<DL>
<DT id="130"><A HREF="#lbAG">&Eacute;tats du paquet&nbsp;:</A><DD>
<DT id="131"><A HREF="#lbAH">&Eacute;tats de s&eacute;lection des paquets</A><DD>
<DT id="132"><A HREF="#lbAI">Drapeaux du paquet&nbsp;:</A><DD>
</DL>
<DT id="133"><A HREF="#lbAJ">ACTIONS</A><DD>
<DT id="134"><A HREF="#lbAK">OPTIONS</A><DD>
<DT id="135"><A HREF="#lbAL">CODE DE SORTIE</A><DD>
<DT id="136"><A HREF="#lbAM">ENVIRONNEMENT</A><DD>
<DL>
<DT id="137"><A HREF="#lbAN">Environnement externe</A><DD>
<DT id="138"><A HREF="#lbAO">Environnement interne</A><DD>
</DL>
<DT id="139"><A HREF="#lbAP">FICHIERS</A><DD>
<DT id="140"><A HREF="#lbAQ">BOGUES</A><DD>
<DT id="141"><A HREF="#lbAR">EXEMPLES</A><DD>
<DT id="142"><A HREF="#lbAS">FONCTIONNALIT&Eacute;S SUPPL&Eacute;MENTAIRES</A><DD>
<DT id="143"><A HREF="#lbAT">VOIR AUSSI</A><DD>
<DT id="144"><A HREF="#lbAU">AUTEURS</A><DD>
<DT id="145"><A HREF="#lbAV">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
