
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-gencontrol</TITLE>
</HEAD><BODY>
<H1>dpkg-gencontrol</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-gencontrol - Cr&eacute;er des fichiers de contr&ocirc;le Debian.
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-gencontrol</B> [<I>option</I>...]
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-gencontrol</B> lit les informations contenues dans une arborescence
Debian d&eacute;paquet&eacute;e et cr&eacute;e le fichier &laquo;&nbsp;control&nbsp;&raquo; d'un paquet binaire (par
d&eacute;faut, c'est le fichier debian/tmp/DEBIAN/control)&nbsp;; durant cette action il
y a simplification des champs de relations.
<P>
<B>Pre-Depends</B>, <B>Depends</B>, <B>Recommends</B> et <B>Suggests</B> sont simplifi&eacute;s
dans cet ordre pour supprimer les d&eacute;pendances qui sont connues pour &ecirc;tre
v&eacute;rifi&eacute;es par la plus forte d&eacute;pendance d&eacute;j&agrave; trait&eacute;e. Sont aussi supprim&eacute;es
toutes les auto-d&eacute;pendances (dans les faits, cela supprime les d&eacute;pendances
qui sont d&eacute;j&agrave; valid&eacute;es par la version du paquet d&eacute;j&agrave; install&eacute;). Logiquement,
il conserve les correspondances entre plusieurs d&eacute;pendances dans le m&ecirc;me
paquet. L'ordre des d&eacute;pendances est conserv&eacute; du mieux possible&nbsp;: si une
d&eacute;pendance doit &ecirc;tre supprim&eacute;e &agrave; cause d'une autre d&eacute;pendance qui appara&icirc;t
plus loin dans le champ, la d&eacute;pendance rempla&ccedil;ante prendra la place de celle
&eacute;limin&eacute;e.
<P>
Les autres champs (<B>Enhances</B>, <B>Conflicts</B>, <B>Breaks</B>, <B>Replaces</B> et
<B>Provides</B>) sont &eacute;galement simplifi&eacute;s individuellement par l'analyse des
diff&eacute;rentes d&eacute;pendances lorsque un paquet est indiqu&eacute; plusieurs fois dans le
champ.
<P>
<B>dpkg-gencontrol</B> ajoute aussi une entr&eacute;e pour un paquet binaire dans
<B>debian/files</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="1"><B>-v</B><I>version</I><DD>
Fixe le num&eacute;ro de version du paquet binaire qui sera cr&eacute;&eacute;.
<DT id="2"><B>-V</B><I>nom</I><B>=</B><I>valeur</I><DD>
Fixe la valeur d'une variable de substitution. Consultez <B><A HREF="/cgi-bin/man/man2html?5+deb-substvars">deb-substvars</A></B>(5)
pour une discussion sur la valeur de substitution.
<DT id="3"><B>-T</B><I>fichier-substvars</I><DD>
Lecture des variables de substitution depuis <I>fichier-substvars</I>&nbsp;; la
valeur par d&eacute;faut est <B>debian/substvars</B>. Cette option peut &ecirc;tre utilis&eacute;e
plusieurs fois pour lire les variables de substitution depuis plusieurs
fichiers (depuis dpkg&nbsp;1.15.6).
<DT id="4"><B>-D</B><I>champ</I><B>=</B><I>valeur</I><DD>
Remplace ou ajoute en sortie un champ dans le fichier de contr&ocirc;le.
<DT id="5"><B>-U</B><I>champ</I><DD>
Supprime en sortie un champ dans le fichier de contr&ocirc;le.
<DT id="6"><B>-c</B><I>fichier-de-contr&ocirc;le</I><DD>
Indique le principal fichier de contr&ocirc;le des sources o&ugrave; trouver des
renseignements. Par d&eacute;faut, c'est le fichier <B>debian/control</B>.
<DT id="7"><B>-l</B><I>fichier-des-changements</I><DD>
Indique le fichier des changements o&ugrave; trouver des renseignements. Par
d&eacute;faut, c'est le fichier <B>debian/changelog</B>.
<DT id="8"><B>-f</B><I>fichier/liste-des-fichiers</I><DD>
Lit ou &eacute;crit la liste des fichiers qui doivent &ecirc;tre envoy&eacute;s vers l'archive
dans ce fichier plut&ocirc;t que dans le fichier <B>debian/files</B>.
<DT id="9"><B>-F</B><I>format-du-fichier-des-changements</I><DD>
Indique le format du fichier des changements. Voir <B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1)
pour plus d'informations &agrave; propos des formats g&eacute;r&eacute;s.
<DT id="10"><B>-p</B><I>paquet</I><DD>
Cette option produit les informations concernant le paquet binaire
<I>paquet</I>.Si le fichier de contr&ocirc;le des sources liste un seul paquet
binaire, on peut omettre cette option&nbsp;; sinon il est indispensable
d'indiquer le paquet pour lequel on veut produire les informations.
<DT id="11"><B>-n</B><I>nom-de-fichier</I><DD>
Le nom du paquet est <I>nom-de-fichier</I> au lieu de l'habituel&nbsp;:
paquet_version_arch.deb.
<DT id="12"><B>-is</B>, <B>-ip</B>, <B>-isp</B><DD>
Ces options, conserv&eacute;es pour compatibilit&eacute; avec les anciennes versions des
scripts de construction de dpkg, sont maintenant d&eacute;conseill&eacute;es. Elles
servaient &agrave; dire &agrave; <B>dpkg-gencontrol</B> d'inclure les champs &laquo;&nbsp;Section&nbsp;&raquo; et
&laquo;&nbsp;Priority&nbsp;&raquo; dans le fichier &laquo;&nbsp;control&nbsp;&raquo;. C'est maintenant le comportement
par d&eacute;faut. Si vous voulez l'ancien comportement, vous pouvez utiliser
l'option <B>-U</B> pour supprimer ces champs du fichier &laquo;&nbsp;control&nbsp;&raquo;.
<DT id="13"><B>-P</B><I>r&eacute;pertoire-construction-paquet</I><DD>
Cette option indique &agrave; <B>dpkg-source</B> que le r&eacute;pertoire de construction du
paquet est <I>r&eacute;pertoire-construction-paquet</I> au lieu de <B>debian/tmp</B>. Cette
valeur sert &agrave; trouver la valeur par d&eacute;faut de la variable de substitution
<B>Installed-Size</B> et celle du champ correspondant dans le fichier de
contr&ocirc;le (on utilise la commande <B>du</B>)&nbsp;; elle donne aussi l'emplacement par
d&eacute;faut pour le fichier de sortie.
<DT id="14"><B>-O</B>[<I>nom-de-fichier</I>]<DD>
Affiche le fichier &laquo;&nbsp;control&nbsp;&raquo; sur la sortie standard (ou <I>nom-de-fichier</I>,
depuis dpkg&nbsp;1.17.2), au lieu de <B>debian/tmp/DEBIAN/control</B> (ou
<I>r&eacute;pertoire-construction-paquet</I><B>/DEBIAN/control</B> si l'option <B>-P</B> a &eacute;t&eacute;
utilis&eacute;e).
<DT id="15"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="16"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="17"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="18"><B>DPKG_NLS</B><DD>
Si cette variable est d&eacute;finie, elle sera utilis&eacute;e pour d&eacute;cider l'activation
de la prise en charge des langues (NLS -&nbsp;Native Language Support), connu
aussi comme la gestion de l'internationalisation (ou i18n) (depuis
dpkg&nbsp;1.19.0). Les valeurs permises sont&nbsp;: <B>0</B> et <B>1</B> (par d&eacute;faut).
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="19"><B>debian/control</B><DD>
Le principal fichier d'information sur les sources&nbsp;; il donne des
renseignements qui ne d&eacute;pendent pas d'une version concernant le paquet
source et les paquets binaires qui peuvent &ecirc;tre cr&eacute;&eacute;s.
<DT id="20"><B>debian/files</B><DD>
La liste des fichiers cr&eacute;&eacute;s qui font partie de ceux qui seront envoy&eacute;s sur
le serveur. <B>dpkg-gencontrol</B> ajoute les noms pr&eacute;sum&eacute;s des fichiers des
paquets binaires &agrave; partir des fichiers &laquo;&nbsp;control&nbsp;&raquo; qu'il cr&eacute;e.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?5+deb-substvars">deb-substvars</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-changelog">deb-changelog</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5).
<A NAME="lbAI">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="21"><A HREF="#lbAB">NOM</A><DD>
<DT id="22"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="23"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="24"><A HREF="#lbAE">OPTIONS</A><DD>
<DT id="25"><A HREF="#lbAF">ENVIRONNEMENT</A><DD>
<DT id="26"><A HREF="#lbAG">FICHIERS</A><DD>
<DT id="27"><A HREF="#lbAH">VOIR AUSSI</A><DD>
<DT id="28"><A HREF="#lbAI">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
