
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-parsechangelog</TITLE>
</HEAD><BODY>
<H1>dpkg-parsechangelog</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-parsechangelog - Analyse un fichier changelog Debian.
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-parsechangelog</B> [<I>option</I>...]
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-parsechangelog</B> lit et fait l'analyse du fichier &laquo;&nbsp;changelog&nbsp;&raquo; d'une
arborescence source d&eacute;paquet&eacute;e et affiche les informations qu'il contient
sur la sortie standard et sous une forme lisible par la machine.
<A NAME="lbAE">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="1"><B>-l</B>, <B>--file</B> <I>fichier-des-changements</I><DD>
Indique le fichier des changements o&ugrave; trouver des renseignements. Un &laquo;&nbsp;-&nbsp;&raquo;
peut &ecirc;tre utilis&eacute; pour sp&eacute;cifier une lecture &agrave; partir de l'entr&eacute;e
standard. Par d&eacute;faut, c'est le fichier <B>debian/changelog</B>.
<DT id="2"><B>-F</B> <I>format-du-fichier-des-changements</I><DD>
Indique le format du fichier changelog. Par d&eacute;faut, c'est une ligne
sp&eacute;ciale, pr&egrave;s de la fin du fichier, qui l'indique&nbsp;; sinon, on utilise le
format classique <B>debian</B>. Voir aussi <B>FORMATS DES FICHIERS DE
CHANGEMENTS</B>.
<DT id="3"><B>-L</B> <I>rep_lib</I><DD>
Option obsol&egrave;te sans effet (depuis dpkg&nbsp;1.18.8). Fixer les variables
d'environnement de Perl <B>PERL5LIB</B> ou <B>PERLLIB</B> a un effet similaire lors
de la recherche des modules d'analyse de Perl.
<DT id="4"><B>-S</B>, <B>--show-field</B> <I>champ</I><DD>
Indique le nom du champ &agrave; afficher (depuis dpkg&nbsp;1.17.0). Le nom du champ
n'est pas affich&eacute;, mais seulement sa valeur.
<DT id="5"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="6"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H3>Options de filtrage</H3>

Les options suivantes peuvent &ecirc;tre utilis&eacute;es pour influencer la sortie de
l'analyseur du journal des modifications (&laquo;&nbsp;changelog&nbsp;&raquo;), par exemple la
gamme d'entr&eacute;es ou le format de sortie.
<DL COMPACT>
<DT id="7"><B>--format</B><I> format-de-sortie</I><DD>
R&egrave;gle le format de sortie. Actuellement les valeurs g&eacute;r&eacute;es sont <I>dpkg</I> et
<B>rfc822</B>. <I>dpkg</I> est le format classique de sortie (avant que cette option
n'existe) et l'option par d&eacute;faut. Il se compose d'un paragraphe dans le
format du fichier de contr&ocirc;le Debian (voir <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5)). Si plus d'une
entr&eacute;e est demand&eacute;e, alors la plupart des champs sont tir&eacute;s de la premi&egrave;re
entr&eacute;e (habituellement la plus r&eacute;cente), sauf si c'est indiqu&eacute; autrement.
<DL COMPACT><DT id="8"><DD>
<DL COMPACT>
<DT id="9"><B>Source:</B><I> nom-du-paquet</I><DD>
<DT id="10"><B>Version:</B><I> version</I><DD>
<DT id="11"><B>Distribution:</B><I> distribution-cible</I><DD>
<DT id="12"><B>Urgency:</B><I> priorit&eacute;</I><DD>
La priorit&eacute; la plus &eacute;lev&eacute;e de toutes les entr&eacute;es incluses est utilis&eacute;e,
suivie par les commentaires concat&eacute;n&eacute;s et s&eacute;par&eacute;s par des espaces pour
toutes les versions demand&eacute;es.
<DT id="13"><B>Maintainer:</B><I> auteur</I><DD>
<DT id="14"><B>Date:</B><I> date</I><DD>
La date de l'entr&eacute;e sous forme d'une cha&icirc;ne, telle qu'elle appara&icirc;t dans le
changelog. Avec un format <B><A HREF="/cgi-bin/man/man2html?3+strptime">strptime</A></B>(3) &laquo;&nbsp;<B>%a, %d %b %Y %T %z</B>&nbsp;&raquo; mais o&ugrave;
le nom du jour de la semaine pourrait ne pas vraiment correspondre au jour
r&eacute;el obtenu &agrave; partir du reste de la cha&icirc;ne de date. Si une repr&eacute;sentation
plus pr&eacute;cise du jour est n&eacute;cessaire, utilisez le champ <B>Timestamp</B>, mais il
faut prendre en compte qu'il pourrait ne pas &ecirc;tre possible de la faire
correspondre &agrave; la valeur exacte de ce champ.
<DT id="15"><B>Timestamp:</B> <I>horodatage</I><DD>
La date de l'entr&eacute;e comme horodatage en secondes depuis &laquo;&nbsp;l'epoch&nbsp;&raquo; (depuis
dpkg&nbsp;1.18.8).
<DT id="16"><B>Closes:</B><I> num&eacute;ro-bogue</I><DD>
Les champs &laquo;&nbsp;Closes&nbsp;&raquo; de toutes les entr&eacute;es incluses sont fusionn&eacute;s.
<DT id="17"><B>Changes:</B><I> entr&eacute;es-du-fichier-des-changements</I><DD>
Les textes de toutes les entr&eacute;es de changelog sont concat&eacute;n&eacute;s. Pour faire de
ce champ un champ de contr&ocirc;le Debian valable, les lignes multiples qui sont
vides sont remplac&eacute;es par un point <B>&laquo;&nbsp;.&nbsp;&raquo;</B> et toutes les lignes sont
indent&eacute;es par une seule espace. Le contenu exact d&eacute;pend du format du
changelog.
</DL>
</DL>

<DT id="18"><DD>
Les champs <B>Version</B>, <B>Distribution</B>, <B>Urgency</B>, <B>Maintainer</B> et
<B>Changes</B> sont obligatoires.
<DT id="19"><DD>
Il est possible d'avoir d'autres champs qui sont d&eacute;finis par l'utilisateur.
<DT id="20"><DD>
Le format <B>rfc822</B> utilise les m&ecirc;mes champs mais le r&eacute;sultat est un
paragraphe distinct pour chaque entr&eacute;e du changelog afin que toutes les
m&eacute;tadonn&eacute;es de chaque entr&eacute;e soit pr&eacute;serv&eacute;es.
<DT id="21"><B>--reverse</B><DD>
Inclut toutes les modifications en ordre inverse (depuis
dpkg&nbsp;1.19.1). Note&nbsp;: pour le format de <B>dpkg</B>, la premi&egrave;re entr&eacute;e sera
l'entr&eacute;e la plus ancienne.
<DT id="22"><B>--all</B><DD>
Inclut toutes les modifications. Note&nbsp;:&nbsp;d'autres options deviennent sans
effet lorsque celle-ci est utilis&eacute;e.
<DT id="23"><B>-s</B>, <B>--since</B> <I>version</I><DD>

<B>-v</B> <I>version</I>
Inclut tous les changements qui ont suivi la <I>version</I>.
<DT id="24"><B>-u</B>, <B>--until</B> <I>version</I><DD>
Inclut tous les changements qui ont eu lieu avant la <I>version</I>.
<DT id="25"><B>-f</B>, <B>--from</B> <I>version</I><DD>
Inclut tous les changements depuis la <I>version</I> (incluse).
<DT id="26"><B>-t</B>, <B>--to</B> <I>version</I><DD>
Inclut tous les changements apport&eacute;s jusqu'&agrave; la <I>version</I> comprise.
<DT id="27"><B>-c</B>, <B>--count</B> <I>nombre</I><DD>

<B>-n</B> <I>nombre</I>
Inclut ce <I>nombre</I> d'entr&eacute;es depuis le d&eacute;but (ou la fin si le <I>nombre</I> est
inf&eacute;rieur &agrave;&nbsp;0).
<DT id="28"><B>-o</B>, <B>--offset</B> <I>nombre</I><DD>
Modifie le point de d&eacute;part pour <B>--count</B>, &agrave; compter du d&eacute;but (ou la fin si
le <I>nombre</I> est inf&eacute;rieur &agrave;&nbsp;0).
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>FORMATS DE JOURNAUX DE MODIFICATIONS</H2>

Il est possible d'utiliser un format diff&eacute;rent de celui utilis&eacute;
habituellement, en fournissant un analyseur pour le format alternatif.
<P>
Afin que <B>dpkg-parsechangelog</B> utilise le nouvel analyseur, il doit exister
une ligne, parmi les 40&nbsp;derni&egrave;res du fichier, qui corresponde &agrave; l'expression
r&eacute;guli&egrave;re Perl "<B>\schangelog-format:\s+([0-9a-z]+)\W</B>&nbsp;(la partie entre
parenth&egrave;ses doit &ecirc;tre le nom du format). Exemple&nbsp;:
<P>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;@@@&nbsp;changelog-format:&nbsp;<I>autreformat</I>&nbsp;@@@
<P>
Les noms de formats de journaux de modifications sont des cha&icirc;nes non vides
de caract&egrave;res alphanum&eacute;riques en minuscules (&laquo;&nbsp;a-z0-9&nbsp;&raquo;).
<P>
Si une telle ligne existe, <B>dpkg-parsechangelog</B> recherchera l'analyseur
sous le nom du module Perl <B>Dpkg::Changelog::</B><I>autreformat</I>&nbsp;; s'il n'est
pas pr&eacute;sent, c'est une condition d'erreur. Le nom de l'analyseur dans le
module Perl sera automatiquement mis en capitale. Le format de journaux des
modifications par d&eacute;faut est <B>debian</B> et un analyseur pour ce format est
fourni par d&eacute;faut.
<P>
L'analyseur doit &ecirc;tre d&eacute;riv&eacute;e de la classe Dpkg::Changelog et impl&eacute;menter
l'interface document&eacute;e requise.
<P>
Si le format du journal des modifications analys&eacute; laisse toujours ou presque
une ligne blanche entre chaque changement, ces lignes blanches devraient
&ecirc;tre retir&eacute;es, afin de rendre l'affichage de sortie plus compact.
<P>
Si le journal des modifications ne contient pas d'informations de date ou de
nom de paquet, cette information doit &ecirc;tre omise de l'affichage. L'analyseur
ne doit pas essayer de les calculer ou de les retrouver depuis d'autres
sources.
<P>
Si le journal des modifications n'utilise pas le format attendu, l'analyseur
produira une erreur, plut&ocirc;t que d'essayer de s'en tirer comme il peut et
produire une sortie incorrecte.
<P>
Un analyseur de journal de modifications ne doit pas du tout interagir avec
l'utilisateur.
<A NAME="lbAH">&nbsp;</A>
<H2>NOTES</H2>

Toutes les <B>options d'analyse</B> sauf <B>-v</B> sont g&eacute;r&eacute;es par <B>dpkg</B> seulement
depuis la version&nbsp;1.14.16.
<P>

Analyse des options courtes avec des valeurs non-group&eacute;es, disponible
seulement &agrave; partir de dpkg 1.18.0.
<A NAME="lbAI">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="29"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
<DT id="30"><B>DPKG_NLS</B><DD>
Si cette variable est d&eacute;finie, elle sera utilis&eacute;e pour d&eacute;cider l'activation
de la prise en charge des langues (NLS -&nbsp;Native Language Support), connu
aussi comme la gestion de l'internationalisation (ou i18n) (depuis
dpkg&nbsp;1.19.0). Les valeurs permises sont&nbsp;: <B>0</B> et <B>1</B> (par d&eacute;faut).
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="31"><B>debian/changelog</B><DD>
Le journal des modifications&nbsp;; on s'en sert pour conna&icirc;tre les informations
qui d&eacute;pendent d'une version du paquet source, par exemple l'urgence ou la
distribution d'une installation sur le serveur, les modifications faites
depuis telle &eacute;dition et le num&eacute;ro de la version source lui-m&ecirc;me.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-changelog">deb-changelog</A></B>(5).
<A NAME="lbAL">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="32"><A HREF="#lbAB">NOM</A><DD>
<DT id="33"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="34"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="35"><A HREF="#lbAE">OPTIONS</A><DD>
<DL>
<DT id="36"><A HREF="#lbAF">Options de filtrage</A><DD>
</DL>
<DT id="37"><A HREF="#lbAG">FORMATS DE JOURNAUX DE MODIFICATIONS</A><DD>
<DT id="38"><A HREF="#lbAH">NOTES</A><DD>
<DT id="39"><A HREF="#lbAI">ENVIRONNEMENT</A><DD>
<DT id="40"><A HREF="#lbAJ">FICHIERS</A><DD>
<DT id="41"><A HREF="#lbAK">VOIR AUSSI</A><DD>
<DT id="42"><A HREF="#lbAL">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
