
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-query</TITLE>
</HEAD><BODY>
<H1>dpkg-query</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dpkg-query - Un outil pour interroger la base de donn&eacute;es de dpkg
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>dpkg-query</B> [<I>option</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>dpkg-query</B> est un outil pour afficher des informations sur les paquets
connus par la base de donn&eacute;es de <B>dpkg</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="1"><B>-l</B>, <B>--list</B> [<I>motif-de-nom-de-paquet</I>...]<DD>
Affiche les paquets correspondant &agrave; un ou plusieurs motifs, quelque soit
leur statut, ce qui comprend tout paquet r&eacute;el ou virtuel r&eacute;f&eacute;renc&eacute; dans tout
champ de relation de d&eacute;pendance (tel que <B>Breaks</B>, <B>Enhances</B>,&nbsp;etc.). Si
aucun <I>motif-de-nom-de-paquet</I> n'est indiqu&eacute;, affiche tous les paquets de
<I>/var/lib/dpkg/status</I>, sauf ceux qui ne sont pas install&eacute;s (c'est-&agrave;-dire ceux
qui ont &eacute;t&eacute; pr&eacute;c&eacute;demment purg&eacute;s). Les m&eacute;tacaract&egrave;res ordinaires de
l'interpr&eacute;teur de commandes sont autoris&eacute;s dans
<I>motif-de-nom-de-paquet</I>. Il faudra sans doute mettre
<I>motif-de-nom-de-paquet</I> entre apostrophes pour &eacute;viter l'expansion des noms
de fichier par l'interpr&eacute;teur de commandes. Par exemple, tous les paquets
dont le nom commence par &laquo;&nbsp;libc6&nbsp;&raquo; seront affich&eacute;s par la commande&nbsp;:
<P>
<PRE>
<B>dpkg-query -l 'libc6*'</B>
</PRE>

<P>
Les trois premi&egrave;res colonnes affich&eacute;es montrent dans l'ordre&nbsp;: l'action
souhait&eacute;e, l'&eacute;tat du paquet et les erreurs.
<P>
Action souhait&eacute;e&nbsp;:
<PRE>
  u = Inconnu (Unknown)
  i = Installer (Install)
  h = Garder (Hold)
  r = Supprimer (Remove)
  p = Purger (Purge)
</PRE>

<P>
&Eacute;tat du paquet&nbsp;:
<PRE>
  n = Non install&eacute; (Not-installed)
  c = Fichiers de configuration (Config-files)
  H = Semi-install&eacute; (Half-installed)
  U = D&eacute;compress&eacute; (Unpacked)
  F = Semi-configur&eacute; (Half-configured)
  W = Attente de d&eacute;clenchements (Triggers-awaiting)
  t = D&eacute;clenchements en attente (Triggers-pending)
  i = Install&eacute; (Installed)
</PRE>

<P>
Drapeaux d'erreur&nbsp;:
<PRE>
  &lt;empty&gt; = (aucun)
  R = R&eacute;installation requise (Reinst-required)
</PRE>

<P>
Un &eacute;tat en majuscules ou une lettre d'erreur indiquent que le paquet peut
provoquer des probl&egrave;mes graves. Veuillez consulter <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1) &agrave; propos des
&eacute;tats et drapeaux ci-dessus.
<P>
On ne peut pas configurer le format de sortie de cette option. Il s'adapte
automatiquement &agrave; la largeur du terminal. Ce format est destin&eacute; aux humains
et la machine le lit mal. Voyez <B>-W</B> (<B>--show</B>) et <B>--showformat</B> pour
une possible configuration de ce format.
<DT id="2"><B>-W</B>, <B>--show</B> [<I>motif-de-nom-de-paquet</I>...]<DD>
Tout comme l'option <B>--list</B>, cette option affiche la liste des paquets qui
correspondent au motif donn&eacute;. La sortie peut cependant &ecirc;tre format&eacute;e en
utilisant l'option <B>--showformat</B>. Le format de sortie par d&eacute;faut est le
suivant&nbsp;: une ligne pour chaque paquet, avec le nom (&eacute;ventuellement compl&eacute;t&eacute;
par l'identifiant d'architecture pour les paquets <B>Multi-Arch</B> <B>same</B>) et
la version install&eacute;e, s&eacute;par&eacute;s par une tabulation.
<DT id="3"><B>-s</B>, <B>--status</B> [<I>nom-du-paquet</I> ...]<DD>
Donne l'&eacute;tat du paquet indiqu&eacute;. C'est simplement l'affichage de l'entr&eacute;e de
la base de donn&eacute;es concernant les &eacute;tats des paquets install&eacute;s. Si aucun
<I>nom-de-paquet</I> n'est indiqu&eacute;, toutes les entr&eacute;es de paquet dans la base de
donn&eacute;es d'&eacute;tat seront affich&eacute;es (depuis dpkg&nbsp;1.19.1). Lorsque des entr&eacute;es de
<I>nom-de-paquet</I> multiples sont indiqu&eacute;es, les entr&eacute;es d'&eacute;tat demand&eacute;es sont
s&eacute;par&eacute;es par une ligne vide et sont dans l'ordre utilis&eacute; pour la liste de
param&egrave;tres.
<DT id="4"><B>-L</B>, <B>--listfiles</B> <I>nom-du-paquet</I>...<DD>
Affiche la liste des fichiers du <I>nom-du-paquet</I> install&eacute;s sur le
syst&egrave;me. Lorsque plusieurs <I>nom-du-paquet</I> sont indiqu&eacute;s, les diff&eacute;rentes
listes de fichiers sont s&eacute;par&eacute;es par une ligne vide et elles sont fournies
dans l'ordre de la liste de param&egrave;tres. Il faut remarquer cependant que les
fichiers cr&eacute;&eacute;s par les scripts d'installation propres aux paquets ne sont
pas affich&eacute;s.
<DT id="5"><B>--control-list</B> <I>nom-du-paquet</I><DD>
Affiche les fichiers de contr&ocirc;le install&eacute;s sur le syst&egrave;me &agrave; partir de
<I>nom-du-paquet</I> (depuis dpkg&nbsp;1.16.5). Ceux-ci peuvent &ecirc;tre utilis&eacute;s en
param&egrave;tres d'entr&eacute;e de <B>--control-show</B>.
<DT id="6"><B>--control-show</B> <I>nom-du-paquet</I> <I>fichier-de-contr&ocirc;le</I><DD>
Affiche sur la sortie standard le <I>fichier-de-contr&ocirc;le</I> install&eacute; sur le
syst&egrave;me pour <I>nom-du-paquet</I> (depuis dpkg&nbsp;1.16.5).
<DT id="7"><B>-c</B>, <B>--control-path</B> <I>nom-du-paquet</I> [<I>fichier-contr&ocirc;le</I>]<DD>
Affiche les chemins pour les fichiers de contr&ocirc;le install&eacute;s sur votre
syst&egrave;me pour <I>nom-du-paquet</I> (depuis dpkg&nbsp;1.15.4). Si <I>fichier-contr&ocirc;le</I>
est indiqu&eacute;, seul le chemin pour ce fichier de contr&ocirc;le sera affich&eacute;, s'il
est pr&eacute;sent.
<P>
<B>Attention</B>&nbsp;: cette commande est obsol&egrave;te parce qu'elle donne un acc&egrave;s
direct &agrave; la base de donn&eacute;es interne de dpkg, et il est conseill&eacute; d'utiliser
<B>--control-list</B> et <B>--control-show</B> &agrave; la place dans tous les cas o&ugrave; ces
commandes peuvent donner le m&ecirc;me r&eacute;sultat. N&eacute;anmoins,aussi longtemps qu'il y
a un cas au moins o&ugrave; cette commande est n&eacute;cessaire (c'est-&agrave;-dire quand il
faut supprimer le script d'un responsable endommageant postrm), et tant
qu'il n'y aura pas de bonne solution pour cela, cette commande ne sera pas
supprim&eacute;e.
<DT id="8"><B>-S</B>, <B>--search</B> <I>motif-de-nom-&agrave;-rechercher</I>...<DD>
Recherche les paquets propri&eacute;taires de fichiers dont le nom correspond au
motif indiqu&eacute;. On peut utiliser tous les m&eacute;tacaract&egrave;res de l'interpr&eacute;teur de
commandes dans le motif, o&ugrave; l'ast&eacute;risque (<B>*</B> et le point d'interrogation
(<B>?</B>) correspondront &agrave; une barre oblique et la barre oblique inverse sert
de caract&egrave;re d'&eacute;chappement.
<P>
Si le premier caract&egrave;re du <I>motif-de-nom-&agrave;-rechercher</I> est aucun des
caract&egrave;res &laquo;&nbsp;<B>*[?/</B>&nbsp;&raquo;, il sera alors consid&eacute;r&eacute; comme une sous-cha&icirc;ne de
correspondance et sera implicitement entour&eacute; de &laquo;&nbsp;<B>*</B>&nbsp;&raquo; (comme
<B>*</B><I>motif-de-nom-&agrave;-rechercher</I><B>*</B>). Si la cha&icirc;ne suivante contient un des
caract&egrave;res &laquo;&nbsp;<B>*[?\</B>&nbsp;&raquo;, il sera g&eacute;r&eacute; comme un motif global, sinon tout
&laquo;&nbsp;<B>/</B>&nbsp;&raquo; ou &laquo;&nbsp;<B>/.</B>&nbsp;&raquo; terminal sera supprim&eacute; et une recherche litt&eacute;rale de
chemin sera ex&eacute;cut&eacute;e.
<P>
Cette commande ne donne pas les fichiers suppl&eacute;mentaires cr&eacute;&eacute;s par les
scripts du responsable de paquet, ni les alternatives.
<DT id="9"><B>-p</B>, <B>--print-avail</B> [<I>nom-du-paquet</I>...]<DD>
Affiche les d&eacute;tails relatifs aux paquets, tels que pr&eacute;sents dans
<I>/var/lib/dpkg/available</I>. Si aucun <I>nom-de-paquet</I> n'est indiqu&eacute;, toutes les
entr&eacute;es de paquet dans la base de donn&eacute;es d'&eacute;tat seront affich&eacute;es (depuis
dpkg&nbsp;1.19.1). Lorsque des entr&eacute;es de <I>nom-de-paquet</I> multiples sont
indiqu&eacute;es, les entr&eacute;es <I>available</I> demand&eacute;es sont s&eacute;par&eacute;es par une ligne
vide et sont dans l'ordre utilis&eacute; pour la liste de param&egrave;tres.
<P>
Les utilisateurs des outils bas&eacute;s sur APT devraient plut&ocirc;t utiliser la
commande <B>apt-cache show</B> <I>nom-du-paquet</I> car le fichier <I>available</I>
n'est tenu &agrave; jour que lorsque <B>dselect</B> est utilis&eacute;.
<DT id="10"><B>-?</B>, <B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="11"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="12"><B>--admindir</B>=<I>r&eacute;pertoire</I><DD>
Change l'endroit o&ugrave; se trouve la base de donn&eacute;es de <B>dpkg</B>. Par d&eacute;faut,
c'est <I>/var/lib/dpkg</I>.
<DT id="13"><B>--load-avail</B><DD>
Charge &eacute;galement le fichier <I>available</I> &agrave; l'utilisation des commandes
<B>--show</B> et <B>--list</B>, ce qui d&eacute;sormais revient &agrave; n'interroger que le
fichier d'&eacute;tat (depuis dpkg&nbsp;1.16.2).
<DT id="14"><B>--no-pager</B><DD>
D&eacute;sactive l'utilisation d'un afficheur pour montrer les informations (depuis
dpkg&nbsp;1.19.2).
<DT id="15"><B>-f</B>, <B>--showformat=</B><I>format</I><DD>
Cette option sert &agrave; sp&eacute;cifier le format de sortie de l'option <B>--show</B>
(option courte depuis dpkg&nbsp;1.13.1). Ce format est une cha&icirc;ne qui sera
utilis&eacute;e pour chaque paquet list&eacute;.
<P>
Dans la cha&icirc;ne, &laquo;&nbsp;<B>\</B>&nbsp;&raquo; pr&eacute;fixe des caract&egrave;res de contr&ocirc;le&nbsp;:
<P>
<PRE>
    <B>\n</B>  nouvelle ligne
    <B>\r</B>  retour chariot
    <B>\t</B>  tabulation
</PRE>

<P>
"<B>\</B>" avant n'importe quel caract&egrave;re supprime la signification sp&eacute;cial du
caract&egrave;re qui suit. C'est utile pour les caract&egrave;res &laquo;&nbsp;<B>\</B>&nbsp;&raquo; et &laquo;&nbsp;<B>$</B>&nbsp;&raquo;.
<P>
L'information relative &agrave; un paquet peut &ecirc;tre indiqu&eacute;e en ins&eacute;rant des appels
de variables sp&eacute;cifiant des champs du paquet avec la syntaxe suivante&nbsp;:
&laquo;&nbsp;<B>${</B><I>champ</I>[<B>;</B><I>largeur</I>]<B>}</B>&nbsp;&raquo;. Les champs sont align&eacute;s &agrave; droite, &agrave;
moins que la largeur ne soit n&eacute;gative, auquel cas ils sont align&eacute;s &agrave;
gauche. Les champs suivants sont reconnus, mais pas n&eacute;cessairement
disponibles dans le fichier d'&eacute;tat (seuls les champs internes ou les champs
conserv&eacute;s avec le paquet binaire le sont)&nbsp;:
<P>
<PRE>
    <B>Architecture</B>
    <B>Bugs</B>
    <B>Conffiles</B> (interne)
    <B>Config-Version</B> (interne)
    <B>Conflicts</B>
    <B>Breaks</B>
    <B>Depends</B>
    <B>Description</B>
    <B>Enhances</B>
    <B>Essential</B>
    <B>Filename</B> (interne, li&eacute; au programme frontal)
    <B>Homepage</B>
    <B>Installed-Size</B>
    <B>MD5sum</B> (interne, li&eacute; au programme frontal)
    <B>MSDOS-Filename</B> (interne, li&eacute; au programme frontal)
    <B>Maintainer</B>
    <B>Origin</B>
    <B>Package</B>
    <B>Pre-Depends</B>
    <B>Priority</B>
    <B>Provides</B>
    <B>Recommends</B>
    <B>Replaces</B>
    <B>Revision</B> (obsol&egrave;te)
    <B>Section</B>
    <B>Size</B> (interne, li&eacute; au programme frontal)
    <B>Source</B>
    <B>Status</B> (interne)
    <B>Suggests</B>
    <B>Tag</B> (en g&eacute;n&eacute;ral pas dans le .deb mais dans les fichiers
            Packages des d&eacute;p&ocirc;ts)
    <B>Triggers-Awaited</B> (interne)
    <B>Triggers-Pending</B> (interne)
    <B>Version</B>
</PRE>

<P>
Les champs suivants sont virtuels, cr&eacute;&eacute;s par <B>dpkg-query</B> &agrave; partir des
valeurs d'autres champs (veuillez noter qu'ils utilisent des noms qui ne
sont pas valables comme noms de champs dans le fichiers de contr&ocirc;le)&nbsp;:
<DL COMPACT><DT id="16"><DD>
<DL COMPACT>
<DT id="17"><B>binary:Package</B><DD>
Contient le nom du paquet binaire avec &eacute;ventuellement le type d'architecture
tel que &laquo;&nbsp;libc6:amd64&nbsp;&raquo; (depuis dpkg&nbsp;1.16.2). Le type d'architecture sera
pr&eacute;sent pour rendre le nom de paquet non ambigu, par exemple si le champ
<B>Multi-Arch</B> du paquet a la valeur <B>same</B> ou si le paquet appartient &agrave; une
architecture diff&eacute;rente.
<DT id="18"><B>binary:Synopsis</B><DD>
Il contient la description courte du paquet (depuis dpkg&nbsp;1.19.1).
<DT id="19"><B>binary:Summary</B><DD>
C'est un alias de <B>binary:Synopsis</B> (depuis dpkg&nbsp;1.16.2).
<DT id="20"><B>db:Status-Abbrev</B><DD>
Il contient l'&eacute;tat du paquet dans sa forme abr&eacute;g&eacute;e en trois caract&egrave;res,
comme &laquo;&nbsp;ii&nbsp;&nbsp;&raquo; ou &laquo;&nbsp;iHR&nbsp;&raquo; (depuis dpkg&nbsp;1.16.2). Voir la description de la
commande <B>--list</B> pour plus de d&eacute;tails.
<DT id="21"><B>db:Status-Want</B><DD>
Il contient l'&eacute;tat d&eacute;sir&eacute; du paquet, extrait du champ Status (depuis
dpkg&nbsp;1.17.11).
<DT id="22"><B>db:Status-Status</B><DD>
Il contient l'expression d'&eacute;tat du paquet, extrait du champ Status (depuis
dpkg&nbsp;1.17.11).
<DT id="23"><B>db:Status-Eflag</B><DD>
Il contient le drapeau d'erreur d'&eacute;tat du paquet, extrait du champ Status
(depuis dpkg&nbsp;1.17.11).
<DT id="24"><B>db-fsys:Files</B><DD>
Il contient la liste des entr&eacute;es de paquets du syst&egrave;me de fichiers, s&eacute;par&eacute;es
par des sauts de lignes (depuis dpkg&nbsp;1.19.3).
<DT id="25"><B>db-fsys:Last-Modified</B><DD>
Il contient l'horodatage en seconde de la derni&egrave;re date &agrave; laquelle les
entr&eacute;es de paquets du syst&egrave;me de fichiers ont &eacute;t&eacute; modifi&eacute;es (depuis
dpkg&nbsp;1.19.3).
<DT id="26"><B>source:Package</B><DD>
Il contient le nom du paquet source de ce paquet binaire (depuis
dpkg&nbsp;1.16.2).
<DT id="27"><B>source:Version</B><DD>
Il contient la version du paquet source de ce paquet binaire (depuis
dpkg&nbsp;1.16.2).
<DT id="28"><B>source:Upstream-Version</B><DD>
Il contient la version du paquet source amont de ce paquet binaire (depuis
dpkg&nbsp;1.18.16).
</DL>
</DL>

<DT id="29"><DD>
Le format par d&eacute;faut est le suivant&nbsp;:
&laquo;&nbsp;<B>${binary:Package}\t${Version}\n</B>&nbsp;&raquo;. Tous les autres champs du fichier
d'&eacute;tat, par exemple des champs d&eacute;finis par l'utilisateur, peuvent &ecirc;tre
demand&eacute;s. Ils seront affich&eacute;s mais sans aucune mise en forme et aucune
conversion ou v&eacute;rification n'est faite. Pour obtenir le nom du responsable
de <B>dpkg</B> et la version install&eacute;e, ex&eacute;cutez par exemple&nbsp;:
<P>
<PRE>
  <B>dpkg-query -W -f='${binary:Package} ${Version}\t${Maintainer}\n' dpkg</B>
</PRE>

</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="30"><B>0</B><DD>
La requ&ecirc;te demand&eacute;e s'est correctement d&eacute;roul&eacute;e.
<DT id="31"><B>1</B><DD>
La requ&ecirc;te demand&eacute;e a &eacute;chou&eacute; soit totalement, soit partiellement, du fait
qu'aucun fichier ni paquet n'a &eacute;t&eacute; trouv&eacute; (sauf pour <B>--control-path</B>,
<B>--control-list</B> et <B>--control-show</B> o&ugrave; de telles erreurs sont fatales).
<DT id="32"><B>2</B><DD>
Erreur fatale ou irr&eacute;cup&eacute;rable due &agrave; l'utilisation d'une ligne de commande
non valable, ou interactions avec le syst&egrave;me, telles que des acc&egrave;s &agrave; la base
de donn&eacute;es, des allocations de m&eacute;moire,&nbsp;etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<A NAME="lbAI">&nbsp;</A>
<H3>Environnement externe</H3>

<DL COMPACT>
<DT id="33"><B>SHELL</B><DD>
D&eacute;finit le programme &agrave; ex&eacute;cuter lors du lancement d'une commande avec un
shell (depuis dpkg&nbsp;1.19.2).
<DT id="34"><B>PAGER</B><DD>

<B>DPKG_PAGER</B>
D&eacute;finit la commande d'afficheur &agrave; utiliser (depuis dpkg&nbsp;1.19.1) qui sera
ex&eacute;cut&eacute;e avec &laquo;&nbsp;<B>$SHELL -c</B>&nbsp;&raquo;. Si <B>SHELL</B> n'est pas d&eacute;fini, &laquo;&nbsp;<B>sh</B>&nbsp;&raquo; sera
utilis&eacute; &agrave; la place. <B>DPKG_PAGER</B> remplace la variable d'environnement
<B>PAGER</B> (depuis dpkg&nbsp;1.19.2).
<DT id="35"><B>DPKG_ADMINDIR</B><DD>
Si cette variable est positionn&eacute;e et que l'option <B>--admindir</B> n'est pas
pr&eacute;cis&eacute;e, ce r&eacute;pertoire sera utilis&eacute; comme r&eacute;pertoire de donn&eacute;es pour
<B>dpkg</B>.
<DT id="36"><B>DPKG_COLORS</B><DD>
D&eacute;finit le mode de couleur (depuis dpkg&nbsp;1.18.5). Les valeurs actuellement
accept&eacute;es sont <B>auto</B> (par d&eacute;faut), <B>always</B> et <B>never</B>.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H3>Environnement interne</H3>

<DL COMPACT>
<DT id="37"><B>LESS</B><DD>
D&eacute;finie &agrave; &laquo;&nbsp;<B>-FRSXMQ</B>&nbsp;&raquo; par <B>dpkg-query</B>, si elle n'est pas d&eacute;j&agrave; fix&eacute;e,
lors du lancement d'un afficheur (depuis dpkg&nbsp;1.19.2). Pour modifier le
comportement par d&eacute;faut, cette variable peut &ecirc;tre r&eacute;gl&eacute;e &agrave; une autre valeur
y compris une cha&icirc;ne vide, ou les variables <B>PAGER</B> ou <B>DPKG_PAGER</B>
peuvent &ecirc;tre fix&eacute;es pour d&eacute;sactiver des options sp&eacute;cifiques avec &laquo;&nbsp;<B>-+</B>&nbsp;&raquo;,
par exemple <B>DPKG_PAGER=&quot;less -+F&quot;</B>.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<P>
<A NAME="lbAL">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="38"><A HREF="#lbAB">NOM</A><DD>
<DT id="39"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="40"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="41"><A HREF="#lbAE">COMMANDES</A><DD>
<DT id="42"><A HREF="#lbAF">OPTIONS</A><DD>
<DT id="43"><A HREF="#lbAG">CODE DE SORTIE</A><DD>
<DT id="44"><A HREF="#lbAH">ENVIRONNEMENT</A><DD>
<DL>
<DT id="45"><A HREF="#lbAI">Environnement externe</A><DD>
<DT id="46"><A HREF="#lbAJ">Environnement interne</A><DD>
</DL>
<DT id="47"><A HREF="#lbAK">VOIR AUSSI</A><DD>
<DT id="48"><A HREF="#lbAL">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:01 GMT, March 31, 2021
</BODY>
</HTML>
