
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of update-alternatives</TITLE>
</HEAD><BODY>
<H1>update-alternatives</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

update-alternatives - Maintenance des liens symboliques d&eacute;terminant les noms
par d&eacute;faut de certaines commandes
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<B>update-alternatives</B> [<I>option</I>...] <I>commande</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

<B>update-alternatives</B> cr&eacute;e, enl&egrave;ve, conserve et affiche des informations
concernant les liens symboliques qui forment le syst&egrave;me Debian des
&laquo;&nbsp;alternatives&nbsp;&raquo;.
<P>

Il est possible d'installer, sur un m&ecirc;me syst&egrave;me et en m&ecirc;me temps, des
programmes qui remplissent des fonctions identiques ou semblables. Par
exemple, beaucoup de syst&egrave;mes installent plusieurs &eacute;diteurs de texte en m&ecirc;me
temps. Cela permet &agrave; chaque utilisateur d'un syst&egrave;me de choisir, s'il le
d&eacute;sire, un &eacute;diteur de texte diff&eacute;rent&nbsp;; mais cela rend les choses difficiles
pour le programme qui doit choisir un bon &eacute;diteur de texte quand
l'utilisateur n'a pas fait de choix pr&eacute;cis.
<P>

Le syst&egrave;me Debian des &laquo;&nbsp;alternatives&nbsp;&raquo; essaie de r&eacute;soudre ce probl&egrave;me. Tous
les fichiers qui proposent des fonctions interchangeables se servent d'un
nom g&eacute;n&eacute;rique qui se trouve dans l'arborescence. Le syst&egrave;me des
&laquo;&nbsp;alternatives&nbsp;&raquo; et l'administrateur syst&egrave;me font conna&icirc;tre ensemble le
fichier qui est r&eacute;ellement vis&eacute; par ce nom g&eacute;n&eacute;rique. Par exemple, si les
&eacute;diteurs de texte <B><A HREF="/cgi-bin/man/man2html?1+ed">ed</A></B>(1) et <B><A HREF="/cgi-bin/man/man2html?1+nvi">nvi</A></B>(1) sont tous les deux install&eacute;s, le
syst&egrave;me des &laquo;&nbsp;alternatives&nbsp;&raquo; fait que le nom g&eacute;n&eacute;rique <I>/usr/bin/editor</I>
renvoie par d&eacute;faut &agrave; <I>/usr/bin/nvi</I>. L'administrateur syst&egrave;me peut
remplacer cette assignation par <I>/usr/bin/ed</I> et le syst&egrave;me des
&laquo;&nbsp;alternatives&nbsp;&raquo; ne la changera pas tant qu'on ne lui aura pas demand&eacute;
explicitement de le faire.
<P>

Le nom g&eacute;n&eacute;rique n'est pas un lien symbolique direct vers l'alternative
choisie. C'est en fait un lien symbolique vers un nom situ&eacute; dans le
<I>r&eacute;pertoire</I> <I>des &laquo;&nbsp;alternatives&nbsp;&raquo;</I>, lequel nom est &agrave; son tour un lien
symbolique vers le fichier r&eacute;ellement vis&eacute;. Les modifications faites par
l'administrateur syst&egrave;me sont ainsi confin&eacute;es dans le r&eacute;pertoire
<I>/etc</I>&nbsp;; le FHS (lisez-le) donne de Bonnes Raisons de faire ainsi.
<P>

Chaque fois qu'un paquet, proposant un fichier pour une fonction d&eacute;termin&eacute;e,
est install&eacute;, modifi&eacute; ou d&eacute;sinstall&eacute;, <B>update-alternatives</B> est appel&eacute; pour
mettre &agrave; jour les informations concernant ce fichier dans le syst&egrave;me des
&laquo;&nbsp;alternatives&nbsp;&raquo;. En g&eacute;n&eacute;ral, <B>update-alternatives</B> est appel&eacute; dans les
scripts <B>postinst</B> (configure) et <B>prerm</B> (remove and deconfigure) des
paquets Debian.
<P>

Il est souvent utile de synchroniser certaines alternatives, de mani&egrave;re &agrave;
pouvoir les manipuler globalement&nbsp;; par exemple, quand plusieurs versions de
<B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1) sont install&eacute;es, la page de manuel qui est vis&eacute;e par
<I>/usr/share/man/man1/vi.1</I> devrait correspondre &agrave;
<I>/usr/bin/vi</I>. <B>update-alternatives</B> g&egrave;re ce probl&egrave;me avec les liens
<I>principaux (&laquo;&nbsp;master&nbsp;&raquo;)</I> et les liens <I>secondaires (&laquo;&nbsp;slave&nbsp;&raquo;)</I>. Quand le
lien principal est chang&eacute;, tous les liens secondaires associ&eacute;s sont
chang&eacute;s. Un lien principal et ses liens secondaires associ&eacute;s composent un
<I>groupe</I> de <I>liens</I>.
<P>

&Agrave; tout moment, un groupe de liens est dans l'un des deux modes suivants&nbsp;:
automatique ou manuel. Quand un groupe est dans le mode automatique et que
des paquets sont install&eacute;s ou d&eacute;sinstall&eacute;s, le syst&egrave;me des &laquo;&nbsp;alternatives&nbsp;&raquo;
d&eacute;cide automatiquement s'il doit mettre &agrave; jour les liens et comment le
faire. Dans le mode manuel, le syst&egrave;me des &laquo;&nbsp;alternatives&nbsp;&raquo; ne change pas
les liens et laisse l'administrateur syst&egrave;me prendre toutes les d&eacute;cisions
(sauf si quelque chose est cass&eacute;).
<P>

Un groupe de liens est en mode automatique quand il est cr&eacute;&eacute; sur un syst&egrave;me
pour la premi&egrave;re fois. Quand l'administrateur syst&egrave;me modifie le param&eacute;trage
automatique du syst&egrave;me, <B>update-alternatives</B> le remarquera la prochaine
fois qu'il sera lanc&eacute; pour ce groupe aux liens modifi&eacute;s et il fera passer ce
groupe en mode manuel.
<P>

&Agrave; chaque alternative est associ&eacute;e une <I>priorit&eacute;</I>. Quand un groupe de liens
est en mode automatique, l'alternative vis&eacute;e par les &eacute;l&eacute;ments du groupe est
celle qui poss&egrave;de la priorit&eacute; la plus &eacute;lev&eacute;e.
<P>

Quand l'option <B>--config</B> est utilis&eacute;e, <B>update-alternatives</B> affiche
toutes les possibilit&eacute;s du groupe pour lequel <I>nom</I> est le lien
principal. Le choix actuel est not&eacute; par un &laquo;&nbsp;*&nbsp;&raquo;. Il sera alors demand&eacute; quel
choix doit &ecirc;tre fait pour ce groupe. Suivant le choix effectu&eacute;, le groupe de
liens peut ne plus &ecirc;tre en mode <I>auto</I>. Il vous faudra utiliser l'option
<B>--auto</B> pour revenir au mode automatique (ou r&eacute;utiliser <B>--config</B> et
choisir l'entr&eacute;e marqu&eacute;e comme automatique).
<P>

Si vous voulez configurer de mani&egrave;re non interactive, vous pouvez utiliser
l'option <B>--set</B> (voir ci-dessous).
<P>

Les diff&eacute;rents paquets qui fournissent un m&ecirc;me fichier doivent le faire en
<B>collaborant</B>. En d'autres termes, l'utilisation de <B>update-alternatives</B>
est <B>obligatoire</B> pour tous les paquets qui sont dans ce cas et il n'est
pas possible de remplacer un fichier d'un paquet qui n'utilise pas le
m&eacute;canisme offert par <B>update-alternatives</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>TERMINOLOGIE</H2>

Comme les op&eacute;rations de <B>update-alternatives</B> sont tr&egrave;s compliqu&eacute;es, voici
quelques termes qui faciliteront l'explication.
<DL COMPACT>
<DT id="1">nom g&eacute;n&eacute;rique (ou lien alternatif)<DD>
C'est un nom, par exemple <I>/usr/bin/editor</I>, qui renvoie, &agrave; travers le
syst&egrave;me des &laquo;&nbsp;alternatives&nbsp;&raquo;, &agrave; l'un des fichiers qui remplissent des
fonctions similaires.
<DT id="2">nom alternatif<DD>
Nom d'un lien symbolique dans le r&eacute;pertoire des alternatives.
<DT id="3">alternative (ou chemin alternatif)<DD>
C'est le nom d'un fichier particulier dans l'arborescence&nbsp;; il peut &ecirc;tre
accessible avec un nom g&eacute;n&eacute;rique gr&acirc;ce au syst&egrave;me d'alternatives.
<DT id="4">r&eacute;pertoire des alternatives <DD>
C'est le r&eacute;pertoire qui contient les liens symboliques&nbsp;; il s'agit par
d&eacute;faut de <I>/etc/alternatives</I>.
<DT id="5">r&eacute;pertoire administratif<DD>
C'est le r&eacute;pertoire qui contient des renseignements sur l'&eacute;tat de
<B>update-alternatives.</B> Il s'agit par d&eacute;faut de <I>/var/lib/dpkg/alternatives</I>.
<DT id="6">groupe de liens<DD>
C'est un ensemble de liens symboliques corr&eacute;l&eacute;s, de mani&egrave;re qu'on puisse les
mettre &agrave; jour en une seule fois.
<DT id="7">lien principal<DD>
Dans un groupe de liens, c'est le lien alternatif qui d&eacute;termine comment sont
configur&eacute;s les autres liens du groupe.
<DT id="8">lien secondaire (&laquo;&nbsp;slave&nbsp;&raquo;)<DD>
Dans un groupe de liens, c'est un lien alternatif contr&ocirc;l&eacute; par la
configuration du lien principal.
<DT id="9">mode automatique<DD>
Quand un groupe de liens est en mode automatique, le syst&egrave;me des
&laquo;&nbsp;alternatives&nbsp;&raquo; assure que les liens dans le groupe pointent vers
l'alternative poss&eacute;dant la priorit&eacute; la plus &eacute;lev&eacute;e dans ce groupe.
<DT id="10">mode manuel <DD>
Quand un groupe de liens est en mode manuel, le syst&egrave;me des &laquo;&nbsp;alternatives&nbsp;&raquo;
ne modifie pas le param&eacute;trage de l'administrateur syst&egrave;me.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>COMMANDES</H2>

<DL COMPACT>
<DT id="11"><B>--install</B> <I>lien nom chemin priorit&eacute;</I> [<B>--slave</B> <I>lien nom chemin</I>]...<DD>
Ajoute un groupe d'alternatives au syst&egrave;me. <I>lien</I> est le nom g&eacute;n&eacute;rique du
lien principal, <I>nom</I> est le nom de son lien symbolique, et <I>chemin</I> est
l'alternative pr&eacute;sent&eacute;e pour le lien principal. Les param&egrave;tres qui suivent
<B>--slave</B> sont le nom g&eacute;n&eacute;rique, le lien symbolique dans le r&eacute;pertoire des
alternatives et l'alternative pour un lien secondaire. On peut indiquer z&eacute;ro
ou plusieurs options <B>--slave</B>, chacune suivie par trois
param&egrave;tres. L'alternative principale doit exister, sinon la commande
&eacute;chouera. Cependant, si une alternative secondaire n'existe pas, le lien
secondaire ne sera simplement pas install&eacute; (mais un avertissement sera
affich&eacute;). Si un fichier existe &agrave; l'emplacement o&ugrave; l'alternative doit &ecirc;tre
install&eacute;e, il est conserv&eacute; sauf si <B>--force</B> est utilis&eacute;.
<DT id="12"><DD>
Quand le lien principal sp&eacute;cifi&eacute; existe d&eacute;j&agrave; dans les enregistrements du
syst&egrave;me des &laquo;&nbsp;alternatives&nbsp;&raquo;, les renseignements fournis sont ajout&eacute;s dans
un nouvel ensemble d'alternatives pour le groupe. Sinon, un nouveau groupe
contenant ces informations est ajout&eacute; et mis en mode automatique. Quand un
groupe est en mode automatique, et que la priorit&eacute; des alternatives
nouvellement ajout&eacute;es est sup&eacute;rieure &agrave; celle de toutes les alternatives
install&eacute;es dans ce groupe, les liens symboliques sont mis &agrave; jour et pointent
vers les alternatives nouvellement ajout&eacute;es.
<DT id="13"><B>--set</B> <I>nom chemin</I><DD>
Ajoute le programme <I>chemin</I> comme alternative pour <I>nom</I>. C'est
&eacute;quivalent &agrave; <B>--config</B> mais ce n'est pas interactif et on peut donc &eacute;crire
un script.
<DT id="14"><B>--remove</B> <I>nom chemin</I><DD>
Enl&egrave;ve une alternative et tous les liens secondaires associ&eacute;s. <I>nom</I> est un
nom dans le r&eacute;pertoire des &laquo;&nbsp;alternatives&nbsp;&raquo;, et <I>chemin</I> est un nom de
fichier auquel <I>nom</I> peut &ecirc;tre li&eacute;. Quand <I>nom</I> est en effet li&eacute; &agrave;
<I>chemin</I>, <I>nom</I> est mis &agrave; jour et pointe vers une autre alternative
ad&eacute;quate ou bien est enlev&eacute; s'il n'y en a pas d'autre. De m&ecirc;me, les liens
secondaires associ&eacute;s sont mis &agrave; jour ou enlev&eacute;s. Quand le lien ne pointe pas
d&eacute;j&agrave; sur <I>chemin</I>, aucun lien n'est modifi&eacute;&nbsp;; seules les informations sur
l'alternative sont supprim&eacute;es.
<DT id="15"><B>--remove-all</B> <I>nom</I><DD>
Supprime toutes les alternatives et tous les liens secondaires
associ&eacute;s. <I>nom</I> est un nom dans le r&eacute;pertoire des alternatives.
<DT id="16"><B>--all</B><DD>
Utilise <B>--config</B> sur toutes les alternatives. Cette option peut &ecirc;tre
combin&eacute;e avec <B>--skip-auto</B> pour revoir et configurer toutes les
alternatives qui ne sont pas en mode automatique. Les alternatives erron&eacute;es
sont aussi affich&eacute;es. Ainsi, une m&eacute;thode simple pour corriger les
alternatives cass&eacute;es est d'utiliser <B>yes '' | update-alternatives --force
--all</B>.
<DT id="17"><B>--auto</B> <I>nom</I><DD>
Passe le groupe de liens suivant l'alternative de <I>nom</I> en mode
automatique. En m&ecirc;me temps, le lien symbolique principal et ses liens
secondaires sont mis &agrave; jour et pointent vers les alternatives avec les
priorit&eacute;s les plus &eacute;lev&eacute;es.
<DT id="18"><B>--display</B> <I>nom</I><DD>
Affiche des renseignements sur le groupe de liens. L'information affich&eacute;e
comprend le mode du groupe (auto ou manuel), les liens principal et
secondaires, vers quelle alternative le lien principal pointe actuellement,
quelles autres alternatives sont disponibles (et les liens secondaires
associ&eacute;s), et l'alternative actuellement install&eacute;e qui poss&egrave;de la priorit&eacute;
la plus &eacute;lev&eacute;e.
<DT id="19"><B>--get-selections</B><DD>
Affiche tous les noms principaux d'alternatives (ceux qui contr&ocirc;lent un
groupe de liens) ainsi que leur &eacute;tat (depuis la version&nbsp;1.15.0). Chaque
ligne comporte jusqu'&agrave; trois champs (s&eacute;par&eacute;s par une ou plusieurs
espaces). Le premier est le nom de l'alternative, le second est son &eacute;tat
(<B>auto</B> ou <B>manual</B>) et le dernier montre le choix actuel pour
l'alternative (il s'agit d'un nom de fichier et donc peut contenir des
espaces).
<DT id="20"><B>--set-selections</B><DD>
Lit la configuration des alternatives sur l'entr&eacute;e standard, dans le format
utilis&eacute; par <B>--get-selections</B> et les configure en cons&eacute;quence (depuis la
version&nbsp;1.15.0).
<DT id="21"><B>--query</B> <I>nom</I><DD>
Affiche des informations sur le groupe de liens de mani&egrave;re analogue &agrave;
<B>--display</B>, mais sous une forme qui peut &ecirc;tre analys&eacute;e automatiquement
(depuis la version&nbsp;1.15.0, voir la section <B>FORMAT DE REQU&Ecirc;TE</B> ci-dessous).
<DT id="22"><B>--list</B> <I>nom</I><DD>
Affiche toutes les cibles du groupe de liens.
<DT id="23"><B>--config</B> <I>nom</I><DD>
Affiche les alternatives disponibles pour un groupe de liens et permet de
choisir interactivement laquelle doit &ecirc;tre utilis&eacute;e. Le groupe de liens est
mis &agrave; jour.
<DT id="24"><B>--help</B><DD>
Affiche un message d'aide puis quitte.
<DT id="25"><B>--version</B><DD>
Affiche le num&eacute;ro de version puis quitte.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>OPTIONS</H2>

<DL COMPACT>
<DT id="26"><B>--altdir</B><I> r&eacute;pertoire</I><DD>
Donne le r&eacute;pertoire des alternatives, quand il est diff&eacute;rent de celui par
d&eacute;faut.
<DT id="27"><B>--admindir</B><I> r&eacute;pertoire</I><DD>
Donne le r&eacute;pertoire administratif, quand il est diff&eacute;rent de celui par
d&eacute;faut.
<DT id="28"><B>--log</B><I> fichier</I><DD>
Indique le fichier journal (depuis la version&nbsp;1.15.0), pour utiliser un
fichier diff&eacute;rent du fichier par d&eacute;faut (/var/log/alternatives.log).
<DT id="29"><B>--force</B><DD>
Autorise le remplacement ou la suppression de tout fichier install&eacute; &agrave; la
place d'un lien d'alternative qui doit &ecirc;tre cr&eacute;&eacute; ou supprim&eacute;.
<DT id="30"><B>--skip-auto</B><DD>
Passe l'invite de configuration pour les alternatives qui sont correctement
configur&eacute;es en mode automatique. Cette option n'est pertinente qu'avec
<B>--config</B> ou <B>--all</B>.
<DT id="31"><B>--quiet</B><DD>
Ne cr&eacute;e pas de commentaire &agrave; moins qu'une erreur ne survienne.
<DT id="32"><B>--verbose</B><DD>
Produit plus de commentaires sur ce qui est fait.
<DT id="33"><B>--debug</B><DD>
Produit plus de commentaires, utiles pour le d&eacute;bogage, sur ce qui est fait
(depuis la version&nbsp;1.19.3).
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>CODE DE SORTIE</H2>

<DL COMPACT>
<DT id="34"><B>0</B><DD>
L'action demand&eacute;e s'est correctement d&eacute;roul&eacute;e.
<DT id="35"><B>2</B><DD>
Des probl&egrave;mes sont survenus lors de l'analyse de la ligne de commande ou
bien pendant l'ex&eacute;cution de l'action.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>ENVIRONNEMENT</H2>

<DL COMPACT>
<DT id="36"><B>DPKG_ADMINDIR</B><DD>
Si cette variable est positionn&eacute;e et que l'option <B>--admindir</B> n'est pas
pr&eacute;cis&eacute;e, ce r&eacute;pertoire sera utilis&eacute; comme r&eacute;pertoire de base pour
l'administration.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="37"><I>/etc/alternatives/</I><DD>
Le r&eacute;pertoire des &laquo;&nbsp;alternatives&nbsp;&raquo; par d&eacute;faut. Peut &ecirc;tre remplac&eacute; avec
l'option <B>--altdir</B>.
<DT id="38"><I>/var/lib/dpkg/alternatives/</I><DD>
Le r&eacute;pertoire administratif par d&eacute;faut. Peut &ecirc;tre remplac&eacute; avec l'option
<B>--admindir</B>
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>FORMAT DE REQU&Ecirc;TE</H2>

Le format de <B>--query</B> est un format &agrave; plat de type RFC822. Il est
constitu&eacute; de <I>n</I>&nbsp;+&nbsp;1 blocs o&ugrave; <I>n</I> est le nombre d'alternatives disponibles
dans le groupe de liens interrog&eacute;. Le premier bloc contient les champs
suivants&nbsp;:
<DL COMPACT>
<DT id="39"><B>Name:</B><I> nom</I><DD>
Nom de l'alternative dans le r&eacute;pertoire des alternatives.
<DT id="40"><B>Link:</B><I> lien</I><DD>
Nom g&eacute;n&eacute;rique de l'alternative.
<DT id="41"><B>Slaves:</B> <I> liste-des-liens-secondaires</I><DD>
Lorsque cet en-t&ecirc;te est pr&eacute;sent, les lignes <B>suivantes</B> contiennent tous
les liens secondaires associ&eacute;s au lien principal de cette alternative, &agrave;
raison d'un lien secondaire par ligne. Chaque ligne comporte une espace, le
nom de l'alternative secondaire, une espace et le chemin vers le lien
secondaire.
<DT id="42"><B>Status:</B><I> &eacute;tat</I><DD>
&Eacute;tat de l'alternative (<B>auto</B> ou <B>manual</B>).
<DT id="43"><B>Best:</B><I> meilleur-choix</I><DD>
Chemin de la meilleure alternative pour ce groupe de liens. N'est pas
pr&eacute;sent si aucune alternative n'est disponible.
<DT id="44"><B>Value:</B> <I> alternative-actuellement-choisie</I><DD>
Chemin de l'alternative actuellement choisie. Peut aussi prendre la valeur
sp&eacute;ciale <B>none</B>, utilis&eacute;e si le lien n'existe pas.
</DL>
<P>

Les autres blocs d&eacute;crivent les alternatives disponibles dans le groupe de
liens interrog&eacute;.
<DL COMPACT>
<DT id="45"><B>Alternative:</B> <I> chemin-de-cette-alternative</I><DD>
Chemin vers l'alternative de ce bloc
<DT id="46"><B>Priority:</B> <I> valeur-de-la-priorit&eacute;</I><DD>
Valeur de la priorit&eacute; de cette alternative.
<DT id="47"><B>Slaves:</B> <I> liste-des-liens-secondaires</I><DD>
Lorsque ce champ est pr&eacute;sent, les lignes <B>suivantes</B> contiennent toutes les
alternatives secondaires associ&eacute;es au lien principal de cette alternative, &agrave;
raison d'une alternative secondaire par ligne. Chaque ligne comporte une
espace, le nom de l'alternative secondaire, une espace et le chemin vers
l'alternative secondaire.
</DL>
<A NAME="lbAL">&nbsp;</A>
<H3>Exemple</H3>

<PRE>
$ update-alternatives --query editor
Name: editor
Link: /usr/bin/editor
Slaves:
 editor.1.gz /usr/share/man/man1/editor.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/editor.1.gz
 editor.it.1.gz /usr/share/man/it/man1/editor.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/editor.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/editor.1.gz
Status: auto
Best: /usr/bin/vim.basic
Value: /usr/bin/vim.basic

Alternative: /bin/ed
Priority: -100
Slaves:
 editor.1.gz /usr/share/man/man1/ed.1.gz

Alternative: /usr/bin/vim.basic
Priority: 50
Slaves:
 editor.1.gz /usr/share/man/man1/vim.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/vim.1.gz
 editor.it.1.gz /usr/share/man/it/man1/vim.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/vim.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/vim.1.gz
</PRE>

<A NAME="lbAM">&nbsp;</A>
<H2>DIAGNOSTICS</H2>

Avec l'option <B>--verbose</B>, <B>update-alternatives</B> affiche de tr&egrave;s
nombreuses informations sur la sortie standard. Quand un probl&egrave;me survient,
<B>update-alternatives</B> envoie des messages d'erreur sur la sortie d'erreur
standard et retourne un &eacute;tat de sortie &eacute;gal &agrave; <B>2</B>. Ces diagnostics
devraient &ecirc;tre simples &agrave; comprendre&nbsp;; si ce n'est pas le cas, veuillez
envoyer un rapport de bogue.
<A NAME="lbAN">&nbsp;</A>
<H2>EXEMPLES</H2>

Plusieurs paquets fournissent un &eacute;diteur de texte compatible avec <B>vi</B>, par
exemple <B>nvi</B> et <B>vim</B>. Celui qui sera utilis&eacute; est d&eacute;termin&eacute; par le groupe
de liens <B>vi</B>, qui comprend des liens pour le programme lui-m&ecirc;me et sa page
de manuel.
<P>

Pour afficher les paquets disponibles qui fournissent <B>vi</B> et son
param&eacute;trage actuel, on peut utiliser l'action <B>--display</B>&nbsp;:
<P>

<DL COMPACT><DT id="48"><DD>
<B>update-alternatives --display vi</B>
</DL>

<P>

Pour choisir une impl&eacute;mentation particuli&egrave;re de <B>vi</B>, on peut utiliser
cette commande en tant que superutilisateur et choisir un nombre dans la
liste&nbsp;:
<P>

<DL COMPACT><DT id="49"><DD>
<B>update-alternatives --config vi</B>
</DL>

<P>

Pour retrouver l'impl&eacute;mentation par d&eacute;faut de <B>vi</B>, on peut utiliser cette
commande en tant que superutilisateur&nbsp;:
<P>

<DL COMPACT><DT id="50"><DD>
<B>update-alternatives --auto vi</B>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?1+ln">ln</A></B>(1), FHS, le standard pour l'organisation du syst&egrave;me de fichiers.
<A NAME="lbAP">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="51"><A HREF="#lbAB">NOM</A><DD>
<DT id="52"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="53"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="54"><A HREF="#lbAE">TERMINOLOGIE</A><DD>
<DT id="55"><A HREF="#lbAF">COMMANDES</A><DD>
<DT id="56"><A HREF="#lbAG">OPTIONS</A><DD>
<DT id="57"><A HREF="#lbAH">CODE DE SORTIE</A><DD>
<DT id="58"><A HREF="#lbAI">ENVIRONNEMENT</A><DD>
<DT id="59"><A HREF="#lbAJ">FICHIERS</A><DD>
<DT id="60"><A HREF="#lbAK">FORMAT DE REQU&Ecirc;TE</A><DD>
<DL>
<DT id="61"><A HREF="#lbAL">Exemple</A><DD>
</DL>
<DT id="62"><A HREF="#lbAM">DIAGNOSTICS</A><DD>
<DT id="63"><A HREF="#lbAN">EXEMPLES</A><DD>
<DT id="64"><A HREF="#lbAO">VOIR AUSSI</A><DD>
<DT id="65"><A HREF="#lbAP">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
