
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-HTTP</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-HTTP</H1>
Section: APT (1)<BR>Updated: 11&nbsp;Mai&nbsp;2018<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-transport-https - APT-Transportmethode zum Herunterladen mittels HTTP-Sicherheitsprotokoll (HTTPS)
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

Diese APT-Transportmethode erm&ouml;glicht die Verwendung von Depots, auf die mittels des HTTP-Sicherheitsprotokolls (HTTPS), auch unter HTTP &uuml;ber TLS bekannt, zugegriffen werden kann. Es ist standardm&auml;&szlig;ig seit APT 1.5 verf&uuml;gbar und war zuvor im Paket
apttransport-https
verf&uuml;gbar. Beachten Sie, dass eine Transportmethode niemals direkt durch einen Benutzer aufgerufen wird, jedoch von APT-Werkzeugen basierend auf der Konfiguration des Benutzers.
<P>

HTTP selbst ist ein unverschl&uuml;sseltes Transportprotokoll (vergleichen Sie
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)), das, wie es das angeh&auml;ngte S angibt, in eine verschl&uuml;sselte Ebene, bekannt als Transport Layer Security (TLS), eingepackt wird, um eine Ende-zu-Ende-Verschl&uuml;sselung bereitzustellen. Ein Angreifer mit ausreichenden F&auml;higkeiten kann die Kommunikationspartner immer noch beobachten und eine tiefere Analyse der verschl&uuml;sselten Kommunikation k&ouml;nnte immer noch wichtige Einzelheiten offenbaren. Einen &Uuml;berblick &uuml;ber alternative Transportmethoden finden Sie in der
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAD">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Das HTTPS-Protokoll basiert auf dem HTTP-Protokoll, daher sind alle von
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
unterst&uuml;tzten Optionen auch mittels
Acquire::https
verf&uuml;gbar und haben dieselben Voreinstellungen, wie die, die f&uuml;r
Acquire::http
angegeben wurden. Diese Handbuchseite wird nur die Optionen beschreiben, die
<I>einzig f&uuml;r HTTPS</I>
gelten.
<A NAME="lbAE">&nbsp;</A>
<H3>Serveranmeldedaten</H3>

<P>

Standardm&auml;&szlig;ig werden alle Zertifikate, denen das System vertraut (siehe das Paket
ca-certificates), f&uuml;r die Pr&uuml;fung des Serverzertifikats benutzt. Eine alternative Zertifizierungstelle (CA) kann mit der Option
Acquire::https::CAInfo
und der zugeh&ouml;rigen rechnerspezifischen Option
Acquire::https::CAInfo::<I>Rechner</I>
konfiguriert werden. Die Option CAInfo gibt eine Datei an, die aus CA-Zertifikaten (im PEM-Format) besteht, die zur Erstellung der Kette aneinandergereiht wurde, die APT zur Pr&uuml;fung des Pfads bis zur Wurzel (dem selbstsignierten Zertifikat) benutzen soll. Falls der ferne Server w&auml;hrend des Austauschs die ganze Kette bereitstellt, muss die Datei nur das Wurzelzertifikat enthalten. Andernfalls wird die ganze Kette ben&ouml;tigt. Falls Sie mehrere Zertifizierungstellen unterst&uuml;tzen m&uuml;ssen, besteht die einzige M&ouml;glichkeit darin, alles aneinander zu h&auml;ngen.
<P>

Eine benutzerdefinierte Zertifikatwiderrufsliste (CRL) kann mit den Optionen
Acquire::https::CRLFile
beziehungsweise
Acquire::https::CRLFile::<I>Rechner</I>
konfiguriert werden. Wie bei der vorherigen Option muss eine Datei im PEM-Format angegeben werden.
<A NAME="lbAF">&nbsp;</A>
<H3>Sicherheit deaktivieren</H3>

<P>

Wenn bei der Authentifizierung des Servers die Pr&uuml;fung des Zertifikats aus irgendeinem Grund fehlschl&auml;gt (abgelaufen, zur&uuml;ckgezogen, Mann in der Mitte, usw.) scheitert der Verbindungsaufbau. Dies ist offenkundig das, was Sie auf jeden Fall wollen und der Vorgabewert (&raquo;true&laquo;) der Option
Acquire::https::Verify-Peer
und was ihre rechnerspezifische Variante bereitstellt. Falls Sie
<I>genau</I>
wissen, was Sie tun, erm&ouml;glicht Ihnen das Setzen dieser Variable auf &raquo;false&laquo;, die Pr&uuml;fung des Partnerzertifikats zu &uuml;berspringen und den Austausch erfolgreich durchzuf&uuml;hren. Nochmals - diese Option dient nur der Fehlersuche und zu Testzwecken, da sie alle durch die Verwendung von HTTPS bereitgestellte Sicherheit entfernt.
<P>

Ebenso kann die Option
Acquire::https::Verify-Host
und ihre rechnerspezifischen Variante zum Deaktivieren einer Sicherheitsfunktionalit&auml;t verwendet werden: Das vom Server bereitgestellte Zertifikat enth&auml;lt die Identit&auml;t des Servers, der dem DNS-Namen entsprechen sollte, der zum Zugriff darauf benutzt wird. Standardm&auml;&szlig;ig wird, wie von RFC 2818 verlangt, der Name des Spiegelservers mit der im Zertifikat gefundenen Identit&auml;t gepr&uuml;ft. Dieses Standardverhalten ist sicher und sollte nicht ge&auml;ndert werden, falls Sie jedoch wissen, dass der Server, den Sie verwenden, einen DNS-Namen hat, der nicht der Identit&auml;t in seinem Zertifikat entspricht, k&ouml;nnen Sie die Option auf &raquo;false&laquo; setzen, wodurch das Vergleichen verhindert wird.
<A NAME="lbAG">&nbsp;</A>
<H3>Client-Authentifizierung</H3>

<P>

Abseits der unterst&uuml;tzten passwortbasierten Authentifizierung (siehe
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)) unterst&uuml;tzt HTTPS auch die Authentifizierung auf Basis von Client-Zertifikaten mittels
Acquire::https::SSLCert
und
Acquire::https::SSLKey. Sie sollten jeweils auf den Dateinamen des X.509-Client-Zertifikats und des zugeh&ouml;rigen (unverschl&uuml;sselten) privaten Schl&uuml;ssels gesetzt werden, beide im PEM-Format. In der Praxis wird die Verwendung der rechnerspezifischen Varianten der beiden Optionen w&auml;rmstens empfohlen.
<A NAME="lbAH">&nbsp;</A>
<H2>BEISPIELE</H2>

<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
Acquire::https {
        Proxy::example.org &quot;DIRECT&quot;;
        Proxy &quot;socks5h://apt:<A HREF="mailto:pass@127.0.0.1">pass@127.0.0.1</A>:9050&quot;;
        Proxy-Auto-Detect &quot;/usr/local/bin/apt-https-proxy-auto-detect&quot;;
        No-Cache &quot;true&quot;;
        Max-Age &quot;3600&quot;;
        No-Store &quot;true&quot;;
        Timeout &quot;10&quot;;
        Dl-Limit &quot;42&quot;;
        Pipeline-Depth &quot;0&quot;;
        AllowRedirect &quot;false&quot;;
        User-Agent &quot;Mein APT-HTTPS&quot;;
        SendAccept &quot;false&quot;;

        CAInfo &quot;/Pfad/zu/ca/certs.pem&quot;;
        CRLFile &quot;/Pfad/zu/all/crl.pem&quot;;
        Verify-Peer &quot;true&quot;;
        Verify-Host::broken.example.org &quot;false&quot;;
        SSLCert::example.org &quot;/Pfad/zu/client/cert.pem&quot;;
        SSLKey::example.org &quot;/Pfad/zu/client/key.pem&quot;
};
</PRE>

</DL>




<A NAME="lbAI">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAJ">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAK">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="2"><DD>
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="3"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="4"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NAME</A><DD>
<DT id="6"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="7"><A HREF="#lbAD">OPTIONEN</A><DD>
<DL>
<DT id="8"><A HREF="#lbAE">Serveranmeldedaten</A><DD>
<DT id="9"><A HREF="#lbAF">Sicherheit deaktivieren</A><DD>
<DT id="10"><A HREF="#lbAG">Client-Authentifizierung</A><DD>
</DL>
<DT id="11"><A HREF="#lbAH">BEISPIELE</A><DD>
<DT id="12"><A HREF="#lbAI">SIEHE AUCH</A><DD>
<DT id="13"><A HREF="#lbAJ">FEHLER</A><DD>
<DT id="14"><A HREF="#lbAK">&Uuml;BERSETZUNG</A><DD>
<DT id="15"><A HREF="#lbAL">AUTOR</A><DD>
<DT id="16"><A HREF="#lbAM">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:55 GMT, March 31, 2021
</BODY>
</HTML>
