
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-MIRR</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-MIRR</H1>
Section: APT (1)<BR>Updated: 09&nbsp;Dezember&nbsp;2017<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-transport-mirror - APT-Transportmethode f&uuml;r st&auml;rker automatisierte Spiegelserverauswahl
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

Diese APT-Transportmethode implementiert kein Protokoll, um auf lokale oder ferne Depots selbst zuzugreifen, beschafft jedoch eine Spiegelserverliste und leitet alle Anfragen an den/die Spiegel, der/die aus der Liste herausgegriffen <A HREF="/cgi-bin/man/man2html?n+wurde">wurde</A>(n). Der Zugriff erfolgt &uuml;ber andere Transportprotokolle wie
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1). Die Grundfunktionalit&auml;t ist seit APT 0.7.24 verf&uuml;gbar, war jedoch bis APT 1.6 nicht dokumentiert. APT 1.6 enth&auml;lt eine komplette Neuentwicklung der Transportmethode und der unterst&uuml;tzten Funktionalit&auml;ten. Beachten Sie, dass eine Transportmethode niemals durch einen Benutzer direkt aufgerufen wird, jedoch von APT-Werkzeugen basierend auf der Konfiguration des Benutzers.
<P>

Falls das Beschaffen einer Datei mittels eines Spiegelservers fehlschl&auml;gt, stellt die Methode sicher, dass automatisch ein anderer m&ouml;glicher Spiegelserver der Liste ausprobiert wird, entweder bis die Datei geholt wurde oder bis kein Spiegelserver auf der Liste mehr &uuml;brig ist. Damit werden transparent Serverausfallzeiten und &auml;hnliche Probleme gehandhabt.
<P>

Die Konsequenzen f&uuml;r die Sicherheit aufgrund der Transportmethode basieren auf Sicherheitserw&auml;gungen, die mit der Transportmethode verbunden sind, die zum Holen der Spiegelserverliste verwendet wird, und welche Transportmethoden beim Zugriff auf den/die ausgew&auml;hlten Spiegelserver durch die Transportmethode beteiligt sind.
<A NAME="lbAD">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Diese Transportmethode hat derzeit keine Konfigurationsoptionen. Die Auswahl des Spiegelservers basiert ganz auf den angebotenene Spiegelservern auf der Spiegelserverliste und den Dateien, die APT holen m&ouml;chte.
<A NAME="lbAE">&nbsp;</A>
<H3>Spiegelserverlistenformat</H3>

<P>

Eine Spiegelserverliste enth&auml;lt mindestens eine Zeile. Jede Zeile gibt einen URI f&uuml;r einen Spiegelserver an. Leere Zeilen und die, die mit einem Rautezeichen (#) beginnen, werden ignoriert. Ein URI beginnt immer mit einem URI-Schema, das angibt, welche Transportmethode f&uuml;r diesen Spiegelserver benutzt wird. Falls der URI beispielsweise mit
http:
anf&auml;ngt, ist die zust&auml;ndige Transportmethode
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1), was spezielle Anforderungen an das Format des verbleibenden Teils des URI stellen kann.
<P>

Metadaten &uuml;ber einen Spiegelserver k&ouml;nnen in derselben Zeile angegeben werden, vom URI durch einen Tabulator getrennt. Mehrere Elemente der Metadaten k&ouml;nnen ihrerseits durch Leerzeichen oder Tabulatoren getrennt werden. (Dies ist eine fortschrittliche Funktionalit&auml;t, die erst seit APT 1.6 verf&uuml;gbar ist. &Auml;ltere APT-Versionen scheitern bei der Auswertung von Spiegelserverlisten, die diese Funktionalit&auml;t verwenden.)
<P>

Seit APT 1.6 wird auch die Verwendung komprimierter Spiegelserverlisten unterst&uuml;tzt. Beachten Sie, dass der Dateiname der Spiegelserverliste den verwendeten Komprimierungsalgorithmus angeben muss; es wird keine automatische Bestimmung anhand des Dateiinhalts durchgef&uuml;hrt.
<A NAME="lbAF">&nbsp;</A>
<H3>Spiegelserverauswahl anhand von Metadaten</H3>

<P>

Wie im Format angegeben, k&ouml;nnen an einen Spiegelserver zus&auml;tzliche Metadaten angeh&auml;ngt werden, um zu verhindern, dass ein Spiegelserver ausgew&auml;hlt wird, um eine Datei zu beschaffen, die diesen Metadaten nicht entspricht. Auf diese Weise kann die Spiegelserverliste z.B. Teilspiegelserver enthalten, die nur bestimmte Architekturen bereitstellen, und APT wird f&uuml;r Dateien, die eine nicht aufgef&uuml;hrte Architektur ben&ouml;tigen, automatisch einen anderen Spiegelserver ausw&auml;hlen. Unterst&uuml;tzt werden Beschr&auml;nkungen f&uuml;r die Architektur (arch), den Codenamen der Ver&ouml;ffentlichung (codename), Bestandteil des Depots, in dem sich die Datei befindet (component), die zur Datei passende Sprache (lang), Suite-Name der Ver&ouml;ffentlichung (suite) und Typ der Datei (type).
<A NAME="lbAG">&nbsp;</A>
<H3>Reihenfolge der Ersatzspiegel</H3>

<P>

Falls f&uuml;r einen Spiegel keine Priorit&auml;t &uuml;ber den Metadatenschl&uuml;ssel
priority
angegeben wurde, ist die Reihenfolge, in der die Spiegelserver ausgew&auml;hlt werden, zuf&auml;llig. Falls eine bestimmte Zusammenstellung von Spiegelservern zuerst vor anderen Zusammenstellungen ausprobiert werden soll, kann die Priorit&auml;t explizit gesetzt werden. Die Spiegelserver mit der niedrigsten Nummer werden zuerst ausprobiert. Spiegelserver, die keine explizit gesetzte Priorit&auml;t haben, werden standardm&auml;&szlig;ig auf die h&ouml;chstm&ouml;gliche Nummer gesetzt und daher zuletzt ausprobiert. Die Auswahl zwischen Spiegelservern mit derselben Priorit&auml;t erfolgt wiederum zuf&auml;llig.
<A NAME="lbAH">&nbsp;</A>
<H3>Erlaubte Transportmethoden in einer Spiegelserverliste</H3>

<P>

Die Verf&uuml;gbarkeit und Auswahl von Transportmethoden in einer Spiegelserverliste wird durch die Zugriffsart von APT auf die Spiegelserverliste beschr&auml;nkt. Falls eine lokale Transportmethode wie
file
oder
copy
benutzt wird, kann die Spiegelserverliste auch lokale Ressourcen enthalten, w&auml;hrend eine Spiegelserverliste, auf die per
http
zugegriffen wird, dies nicht kann. Eine Spiegelserverliste kann nicht zus&auml;tzlich eine weitere Spiegelserverliste oder andere verpackte Transportmethoden (wie
apt-transport-tor) enthalten. Sie finden in der Dokumentation dieser Transportmethoden, wie sie mit der Spiegelservermethode benutzt werden.
<P>

Beachten Sie, dass APT-Versionen vor 1.6 keine andere Transportmethode als
http
unterst&uuml;tzten.
<A NAME="lbAI">&nbsp;</A>
<H2>BEISPIELE</H2>

<A NAME="lbAJ">&nbsp;</A>
<H3>Einfaches Beispiel</H3>

<P>

Eine einfache Beispielspiegelserverliste, die von allen APT-Versionen mit einer Spiegelservermethode (&gt;= 0.7.24) unterst&uuml;tzt wird, in der der Client einen von drei Spiegelservern aussuchen kann:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<A HREF="http://ftp.de.debian.org/debian/">http://ftp.de.debian.org/debian/</A>
<A HREF="http://ftp.us.debian.org/debian/">http://ftp.us.debian.org/debian/</A>
<A HREF="http://deb.debian.org/debian/">http://deb.debian.org/debian/</A>
</PRE>

</DL>




<P>

Angenommen, eine Datei mit diesem Inhalt w&auml;re als
/etc/apt/mirrorlist.txt
auf Ihrem Rechner gespeichert. Sie kann (seit APT 1.6) wie folgt in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
benutzt werden:
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
deb mirror+file:/etc/apt/mirrorlist.txt buster main
</PRE>

</DL>




<P>

Alle Versionen der Spiegelservermethode unterst&uuml;tzen eine Spiegelserverliste, auf die mittels HTTP zugegriffen werden kann. Wird davon ausgegangen, dass sie unter
<A HREF="http://apt.example.org/mirror.lst">http://apt.example.org/mirror.lst</A>
verf&uuml;gbar ist, kann obiger Sources.list-Eintrag kann stattdessen auch wie folgt geschrieben werden:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
deb <A HREF="mirror://apt.example.org/mirror.lst">mirror://apt.example.org/mirror.lst</A> buster main
</PRE>

</DL>




<P>

Beachten Sie, das seit APT 1.6 die Verwendung von
mirror+http
der Einheitlichkeit wegen
mirror
vorgezogen werden sollte. Die Funktionalit&auml;t ist dieselbe.
<A NAME="lbAK">&nbsp;</A>
<H3>Beispiel mit verbesserter Spiegelserverauswahl anhand von Metadaten</H3>

<P>

Wie in der Formatdefinition erkl&auml;rt, unterst&uuml;tzen dies APT-Versionen vor 1.6 nicht und das Auswerten der Spiegelserverliste wird scheitern. Die Beispielspiegelserverliste ist absichtlich komplex, um einige Aspekte der Auswahl zu zeigen. Die folgende Einstellung wird angenommen: Der erste Spiegelserver ist ein lokaler Spiegelserver, auf den mit der File-Methode zugegriffen wird, aber m&ouml;glicherweise unvollst&auml;ndig. Der zweite Spiegelserver hat eine gute Verbindung, ist aber ein Teilspiegelserver in sofern, dass er nur Dateien der Architekturen
amd64
und
all
enth&auml;lt. Die verbleibenden Spiegelserver sind Durchschnittsserver, die nur kontaktiert werden sollen, wenn die vorherigen nicht funktionieren.
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
file:/srv/local/debian/mirror/  priority:1 type:index
<A HREF="http://partial.example.org/mirror/">http://partial.example.org/mirror/</A>      priority:2 arch:amd64 arch:all type:deb
<A HREF="http://ftp.us.debian.org/debian/">http://ftp.us.debian.org/debian/</A>        type:deb
<A HREF="http://ftp.de.debian.org/debian/">http://ftp.de.debian.org/debian/</A>        type:deb
<A HREF="https://deb.debian.org/debian/">https://deb.debian.org/debian/</A>
</PRE>

</DL>




<P>

In dieser Einstellung mit dieser Spiegelserverliste wird der erste Spiegelserver benutzt, um alle Indexdateien herunterzuladen, unter der Annahme, dass auf die Spiegelserverliste selbst &uuml;ber eine lokale Transportmethode wie
file
zugegriffen wird. Falls dies nicht so ist, auf den Spiegelserver aus einem anderen Grund nicht zugegriffen werden kann oder er die angeforderte Datei nicht enth&auml;lt, wird ein anderer Spiegelserver benutzt, um die Datei zu beschaffen, was vom Typ der Datei abh&auml;ngt: Eine Indexdatei wird durch den letzten Spiegelserver auf der Liste bereitgestellt, w&auml;hrend ein Paket der Architektur
amd64
durch den zweiten und z.B. der Architektur
i386
durch einen der letzten drei.
<A NAME="lbAL">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAM">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="5"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="6"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="7"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="8"><A HREF="#lbAB">NAME</A><DD>
<DT id="9"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="10"><A HREF="#lbAD">OPTIONEN</A><DD>
<DL>
<DT id="11"><A HREF="#lbAE">Spiegelserverlistenformat</A><DD>
<DT id="12"><A HREF="#lbAF">Spiegelserverauswahl anhand von Metadaten</A><DD>
<DT id="13"><A HREF="#lbAG">Reihenfolge der Ersatzspiegel</A><DD>
<DT id="14"><A HREF="#lbAH">Erlaubte Transportmethoden in einer Spiegelserverliste</A><DD>
</DL>
<DT id="15"><A HREF="#lbAI">BEISPIELE</A><DD>
<DL>
<DT id="16"><A HREF="#lbAJ">Einfaches Beispiel</A><DD>
<DT id="17"><A HREF="#lbAK">Beispiel mit verbesserter Spiegelserverauswahl anhand von Metadaten</A><DD>
</DL>
<DT id="18"><A HREF="#lbAL">FEHLER</A><DD>
<DT id="19"><A HREF="#lbAM">&Uuml;BERSETZUNG</A><DD>
<DT id="20"><A HREF="#lbAN">AUTOR</A><DD>
<DT id="21"><A HREF="#lbAO">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:55 GMT, March 31, 2021
</BODY>
</HTML>
