
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-HTTP</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-HTTP</H1>
Section: APT (1)<BR>Updated: 04&nbsp;April&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-transport-http - APT-Transportmethode zum Herunterladen &uuml;ber das Hypertext Transfer Protocol (HTTP)
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

Diese APT-Transportmethode erlaubt die Verwendung von Depots, auf die &uuml;ber das Hypertext Transfer Protocol (HTTP) zugegriffen wird. Es ist standardm&auml;&szlig;ig verf&uuml;gbar und wahrscheinlich das meistverwendete aller Transporte. Beachten Sie, dass eine Transportmethode niemals direkt durch einen Benutzer aufgerufen wird, sondern von APT-Werkzeugen basierend auf der Konfiguration des Benutzers.
<P>

HTTP ist ein unverschl&uuml;sseltes Transportprotokoll. Das bedeutet, dass die ganze Kommunikation mit einem fernen Server (oder Proxy) durch einen Angreifer mit ausreichenden F&auml;higkeiten beobachtet werden kann, der landl&auml;ufig als &raquo;Mann in der Mitte&laquo; (MITM) bezeichnet wird. Ein derartiger Angreifer kann die Kommunikation jedoch
<I>nicht</I>
&auml;ndern, um die Sicherheit Ihres System zu kompromittieren, da APTs Datensicherheitsmodell unabh&auml;ngig von der gew&auml;hlten Transportmethode ist. Einzelheiten werden in
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
erkl&auml;rt. Einen &Uuml;berblick &uuml;ber verf&uuml;gbare Transportmethoden gibt es in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAD">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Verschiedene Optionen k&ouml;nnen in einer
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)-Datei gesetzt werden, um sein Verhalten zu &auml;ndern. Dies reicht von einer Proxy-Konfiguration bis hin zu einer Behelfsl&ouml;sung f&uuml;r spezielle Serverbeschr&auml;nkungen.
<A NAME="lbAE">&nbsp;</A>
<H3>Proxy-Konfiguration</H3>

<P>

Die Umgebungsvariable
<B>http_proxy</B>
wird zur systemweiten Konfiguration unterst&uuml;tzt. APT-spezifische Proxys k&ouml;nnen mittels der Option
Acquire::http::Proxy
konfiguriert werden. Proxys, die nur f&uuml;r bestimmte Rechner benutzt werden, k&ouml;nnen &uuml;ber
Acquire::http::Proxy::<I>Rechner</I>
angegeben werden. Eine granularere Steuerung kann &uuml;ber die nachfolgend genauer beschriebene Proxy-Autoerkennung erreicht werden. Alle diese Optionen verwenden das URI-Format
<I>Schema</I>://[[<I>Benutzer</I>][:<I>Passwort</I>]@]<I>Rechner</I>[:<I>Port</I>]/. Unters&uuml;tzte URI-Schemen sind
socks5h
(SOCKS5 mit ferner DNS-Aufl&ouml;sung),
http
und
https. Authentifizierungseinzelheiten k&ouml;nnen &uuml;ber
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
bereitgestellt werden, statt sie direkt in den URI einzuf&uuml;gen.
<P>

Die unterschiedlichen APT-Konfigurationsoptionen unterst&uuml;tzen den Sonderwert
DIRECT, der bedeutet, dass kein Proxy benutzt werden soll. Au&szlig;erdem wird die Umgebungsvariable
<B>no_proxy</B>
f&uuml;r denselben Zweck unterst&uuml;tzt.
<P>

Desweiteren werden drei Einstellungen zur Steuerung des Zwischenspeichers mit HTTP/1.1-konformen Proxy-Zwischenspeichern bereitgestellt:
Acquire::http::No-Cache
teilt dem Proxy mit, dass er unter keinen Umst&auml;nden seine zwischengespeicherten Antworten benutzen soll,
Acquire::http::Max-Age
setzt das maximal erlaubte Alter einer Indexdatei im Zwischenspeicher des Proxys (in Sekunden).
Acquire::http::No-Store
gibt an, dass der Proxy die angefragten Archivdateien nicht in seinem Zwischenspeicher ablegen soll. Das kann verwandt werden, um zu verhindern, dass der Proxy seinen Zwischenspeicher mit (gro&szlig;en) .deb-Dateien verunreinigt.
<A NAME="lbAF">&nbsp;</A>
<H3>Automatische Proxy-Konfiguration</H3>

<P>

Acquire::http::Proxy-Auto-Detect
kann benutzt werden, um einen externen Befehl zum Auffinden des HTTP-Proxys anzugeben, der benutzt werden soll. Der erste und einzige Parameter ist ein URI, der den Rechner bezeichnet, der kontaktiert werden soll, um eine rechnerspezifische Konfiguration zu erm&ouml;glichen. APT erwartet dass der Befehl als Ausgabe auf der Standardausgabe den Proxy als einzelne Zeile im vorher angegebenen URI-Format oder das Wort
DIRECT
ausgibt, falls kein Proxy benutzt werden soll. Fehlt die Ausgabe, zeigt dies an, dass die allgemeinen Proxy-Einstellungen benutzt werden sollen.
<P>

Beachten Sie, dass die automatische Erkennung nicht f&uuml;r einen Rechner benutzt wird, falls bereits eine rechnerspezifische Proxy-Konfiguration per
Acquire::http::Proxy::<I>Rechner</I>
gesetzt wurde.
<P>

Beispielimplementierungen finden Sie in den Paketen
<B><A HREF="/cgi-bin/man/man2html?1+squid-deb-proxy-client">squid-deb-proxy-client</A></B>(1)
und
<B><A HREF="/cgi-bin/man/man2html?1+auto-apt-proxy">auto-apt-proxy</A></B>(1).
<P>

Diese Option hat Vorrang vor dem veralteten Optionsnamen
Acquire::http::ProxyAutoDetect.
<A NAME="lbAG">&nbsp;</A>
<H3>Verbindungskonfiguration</H3>

<P>

Die Option
Acquire::http::Timeout
stellt den Zeitnehmer, der von der Methode benutzt wird. Dieser Wert wird auf die Verbindungs- sowie die Datenzeit&uuml;berschreitungen angewendet.
<P>

Die benutzte Bandbreite kann durch
Acquire::http::Dl-Limit
eingeschr&auml;nkt werden, was Ganzzahlwerte in Kilobyte pro Sekunde akzeptiert. Der Vorgabewert ist 0, was die Beschr&auml;nkung ausschaltet und versucht, s&auml;mtliche verf&uuml;gbare Bandbreite zu benutzen. Beachten Sie, dass diese Optionen implizit das Herunterladen von mehreren Servern zur gleichen Zeit deaktiviert.
<P>

Die Einstellung
Acquire::http::Pipeline-Depth
kann verwandt werden, um HTTP-Pipelining zu aktivieren (RFC 2616 Abschnitt 8.1.2.2), was z.B. bei Verbindungen mit hoher Latenz vorteilhaft sein kann. Sie gibt an, wie viele Anfragen in eine Leitung gesandt werden. APT versucht, zur Laufzeit Webserver und Proxys aufzusp&uuml;ren, die sich falsch verhalten und eine Behelfsl&ouml;sung zu finden. Falls Sie jedoch wissen, dass sich Ihrer nicht konform zur HTTP/1.1-Spezifikation verh&auml;lt, kann das Weiterleiten durch Setzen des Wertes auf 0 deaktiviert werden. Standardm&auml;&szlig;ig ist es mit dem Wert 10 aktiviert.
<P>

Acquire::http::AllowRedirect
steuert, ob APT Umleitungen folgen wird, was standardm&auml;&szlig;ig aktiviert ist.
<P>

Acquire::http::User-Agent
kann benutzt werden, um einen anderen User-Agent f&uuml;r die HTTP-Download-Methode zu setzten, da einige Proxys den Clients nur dann Zugriff gew&auml;hren, wenn der Client einen bekannten Kennzeichner verwendet.
<P>

Acquire::http::SendAccept
ist standardm&auml;&szlig;ig aktiviert und sendet f&uuml;r Abfragen ohne Dateinamenserweiterungen ein
Accept: text/*-Kopfzeilenfeld an den Server, um zu verhindern, dass der Server versucht, Inhalt auszuhandeln.
<A NAME="lbAH">&nbsp;</A>
<H2>BEISPIELE</H2>

<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
Acquire::http {
        Proxy::example.org &quot;DIRECT&quot;;
        Proxy &quot;socks5h://apt:<A HREF="mailto:pass@127.0.0.1">pass@127.0.0.1</A>:9050&quot;;
        Proxy-Auto-Detect &quot;/usr/local/bin/apt-http-proxy-auto-detect&quot;;
        No-Cache &quot;true&quot;;
        Max-Age &quot;3600&quot;;
        No-Store &quot;true&quot;;
        Timeout &quot;10&quot;;
        Dl-Limit &quot;42&quot;;
        Pipeline-Depth &quot;0&quot;;
        AllowRedirect &quot;false&quot;;
        User-Agent &quot;My APT-HTTP&quot;;
        SendAccept &quot;false&quot;;
};
</PRE>

</DL>




<A NAME="lbAI">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAJ">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAK">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="2"><DD>
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="3"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="4"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NAME</A><DD>
<DT id="6"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="7"><A HREF="#lbAD">OPTIONEN</A><DD>
<DL>
<DT id="8"><A HREF="#lbAE">Proxy-Konfiguration</A><DD>
<DT id="9"><A HREF="#lbAF">Automatische Proxy-Konfiguration</A><DD>
<DT id="10"><A HREF="#lbAG">Verbindungskonfiguration</A><DD>
</DL>
<DT id="11"><A HREF="#lbAH">BEISPIELE</A><DD>
<DT id="12"><A HREF="#lbAI">SIEHE AUCH</A><DD>
<DT id="13"><A HREF="#lbAJ">FEHLER</A><DD>
<DT id="14"><A HREF="#lbAK">&Uuml;BERSETZUNG</A><DD>
<DT id="15"><A HREF="#lbAL">AUTOR</A><DD>
<DT id="16"><A HREF="#lbAM">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:55 GMT, March 31, 2021
</BODY>
</HTML>
