
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-FTPARCHIVE</TITLE>
</HEAD><BODY>
<H1>APT-FTPARCHIVE</H1>
Section: APT (1)<BR>Updated: 10&nbsp;Mai&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt-ftparchive - Hilfsprogramm zum Generieren von Indexdateien
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<DL COMPACT>
<DT id="1">
<B>apt-ftparchive</B> [<B>-dsq</B>] [<B>--md5</B>] [<B>--delink</B>] [<B>--readonly</B>] [<B>--contents</B>] [<B>--arch&nbsp;</B><B></B><I>architecture</I>] [<B>-o=</B><B></B><I>Konfigurationszeichenkette</I>] [<B>-c=</B><B></B><I>Konfigurationsdatei</I>] {packages&nbsp;<I>Pfad</I>...&nbsp;[<I>Au&szlig;er-Kraft-Setzdatei</I>&nbsp;[<I>Pfadpr&auml;fix</I>]]  | sources&nbsp;<I>Pfad</I>...&nbsp;[<I>Au&szlig;er-Kraft-Setzdatei</I>&nbsp;[<I>Pfadpr&auml;fix</I>]]  | contents&nbsp;<I>Pfad</I>  | release&nbsp;<I>Pfad</I>  | generate&nbsp;<I>Konfigurationsdatei</I>&nbsp;<I>Abschnitt</I>...  | clean&nbsp;<I>Konfigurationsdatei</I>  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

<B>apt-ftparchive</B>
<DD>ist das Befehlszeilenwerkzeug, das Indexdateien generiert, die APT zum Zugriff auf eine Distributionsquelle benutzt. Die Indexdateien sollten auf der Ursprungs-Site auf Basis des Inhalts dieser Site generiert werden.
<P>

<B>apt-ftparchive</B>
ist eine Obermenge des
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1)-Programms, das dessen ganze Funktionalit&auml;t &uuml;ber den
packages-Befehl enth&auml;lt. Es enth&auml;lt auch einen Generator f&uuml;r Contents-Dateien,
contents
und ein Mittel, um den Generierungsprozess f&uuml;r ein komplettes Archiv zu &raquo;skripten&laquo;.
<P>

Intern kann
<B>apt-ftparchive</B>
von Programmdatenbanken Gebrauch machen, um die Inhalte einer .deb-Datei zwischenzuspeichern und es verl&auml;sst sich nicht auf irgendwelche externen Programme, abgesehen von
<B><A HREF="/cgi-bin/man/man2html?1+gzip">gzip</A></B>(1). Wenn eine vollst&auml;ndige Generierung erfolgt, werden automatisch Datei&auml;nderungspr&uuml;fungen durchgef&uuml;hrt und die gew&uuml;nschten komprimierten Ausgabedateien erzeugt.
<P>

Sofern nicht die
<B>-h</B>-, oder
<B>--help</B>-Option angegeben ist, muss einer der nachfolgend aufgef&uuml;hrten Befehle vorkommen.
<P>

<B>packages</B>
<DL COMPACT><DT id="2"><DD>
Der &raquo;packages&laquo;-Befehl generiert eine Paketdatei aus einem Verzeichnisbaum. Er nimmt ein vorgegebenes Verzeichnis und durchsucht es rekursiv nach .deb-Dateien, wobei es f&uuml;r jede einen Paketdatensatz auf Stdout ausgibt. Dieser Befehl entspricht etwa
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1).
<P>
Die Option
<B>--db</B>
kann benutzt werden, um eine Datenbank zum Zwischenspeichern von Programmen anzugeben.
</DL>

<P>

<B>sources</B>
<DL COMPACT><DT id="3"><DD>
Der
sources-Befehl generiert eine Quellenindexdatei aus einem Verzeichnisbaum. Er nimmt ein vorgegebenes Verzeichnis und durchsucht es rekursiv nach .dsc-Dateien, wobei es f&uuml;r jede einen Quelldatensatz auf Stdout ausgibt. Dieser Befehl entspricht etwa
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scansources">dpkg-scansources</A></B>(1).
<P>
Wenn eine au&szlig;er Kraft setzende Datei angegeben ist, wird nach einer Quelldatei zum &Uuml;berschreiben mit einer .src-Dateiendung gesucht. Die Option &raquo;--source-override&laquo; kann benutzt werden, um die Quelldatei zum &Uuml;berschreiben, die benutzt wird, zu &auml;ndern.
</DL>

<P>

<B>contents</B>
<DL COMPACT><DT id="4"><DD>
Der
contents-Befehl generiert eine Inhaltsdatei aus einem Verzeichnisbaum. Er nimmt ein vorgegebenes Verzeichnis und durchsucht es rekursiv nach .deb-Dateien und liest die Dateiliste von jeder Datei. Dann sortiert er die Liste der passenden Pakete und schreibt sie nach Stdout. Verzeichnisse werden nicht in die Ausgabe geschrieben. Falls mehrere Pakete die gleiche Datei besitzen, dann befindet sich jedes Paket durch Komma getrennt in der Ausgabe.
<P>
Die Option
<B>--db</B>
kann benutzt werden, um eine Datenbank zum Zwischenspeichern von Programmen anzugeben.
</DL>

<P>

<B>release</B>
<DL COMPACT><DT id="5"><DD>
Der Befehl
release
erzeugt eine Release-Datei aus einem Verzeichnisbaum. Standardm&auml;&szlig;ig durchsucht er rekursiv das angegebene Verzeichnis nach nicht komprimierten und komprimierten
Packages-,
Sources-,
Contents-,
Components- und
icons-Dateien, ebenso wie standardm&auml;&szlig;ig
Release-,
Index
und
md5sum.txt-Dateien (APT::FTPArchive::Release::Default-Patterns). Zus&auml;tzliche Muster f&uuml;r Dateinamen k&ouml;nnen hinzugef&uuml;gt werden, indem sie in
APT::FTPArchive::Release::Patterns
aufgef&uuml;hrt werden. Dann schreibt er eine
Release-Datei auf die Standardausgabe, die (standardm&auml;&szlig;ig) f&uuml;r jede Datei eine MD5-, SHA1-, SHA256- und SHA512-Pr&uuml;fsumme enth&auml;lt.
<P>
Werte f&uuml;r zus&auml;tzliche Metadatenfelder in der Release-Datei werden den entsprechenden Variablen unter
APT::FTPArchive::Release
entnommen, z.B.
APT::FTPArchive::Release::Origin. Die unterst&uuml;tzten Felder sind:
Origin,
Label,
Suite,
Version,
Codename,
Date,
NotAutomatic,
ButAutomaticUpgrades,
Acquire-By-Hash,
Valid-Until,
Signed-By,
Architectures,
Components,
Description.
</DL>

<P>

<B>generate</B>
<DL COMPACT><DT id="6"><DD>
Der
generate-Befehl wurde entworfen, um von einem Cron-Skript ausf&uuml;hrbar zu sein und bildet Indexe, die der angegebenen Konfigurationsdatei entsprechen. Die Konfigurationssprache stellt eine flexible M&ouml;glichkeit bereit, um anzugeben, welche Indexdateien von welchen Verzeichnissen gebildet wurden, ebenso wie sie eine einfache M&ouml;glichkeit zur Verwaltung der erforderlichen Einstellungen bereitstellt.
</DL>

<P>

<B>clean</B>
<DL COMPACT><DT id="7"><DD>
Der
clean-Befehl r&auml;umt die Datenbanken auf, die von der angegebenen Konfigurationsdatei benutzt wurden, indem es nicht l&auml;nger n&ouml;tige Datens&auml;tze entfernt.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>DIE GENERATE-KONFIGURATION</H2>

<P>

Der
generate-Befehl benutzt eine Konfigurationsdatei, um die Archive zu beschreiben, die generiert werden sollen. Es folgt dem typischen ISC-Konfigurationsformat, wie es in ISC-Werkzeugen wie Bind 8 oder DHCP gesehen werden kann.
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
enth&auml;lt eine Beschreibung der Syntax. Beachten Sie, dass die generate-Konfiguration abschnittsweise ausgewertet wird,
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
aber baumartig ausgewertet wird. Dies hat nur Auswirkungen, wie die Markierung &raquo;scope&laquo; behandelt wird.
<P>

Die generate-Konfiguration hat vier getrennte Abschnitte, jeder ist unterhalb beschrieben
<A NAME="lbAF">&nbsp;</A>
<H3>Dir-Abschnitt</H3>

<P>

Der
Dir-Abschnitt definiert die Vorgabeverzeichnisse, die zum Orten der ben&ouml;tigten Dateien w&auml;hrend des Generierungsprozesses gebraucht werden. Diese Verzeichnisse werden bestimmte relative Pfade, die in sp&auml;teren Abschnitten definiert werden, vorangestellt, um einen vollst&auml;ndigen absoluten Pfad zu bilden.
<P>

<B>ArchiveDir</B>
<DL COMPACT><DT id="8"><DD>
gibt die Wurzel des FTP-Archivs an. In einer Debian-Standardkonfiguration ist das das Verzeichnis, das die
ls-LR- und dist-Knoten enth&auml;lt.
</DL>

<P>

<B>OverrideDir</B>
<DL COMPACT><DT id="9"><DD>
gibt den Ort der Dateien zum &Uuml;berschreibenan.
</DL>

<P>

<B>CacheDir</B>
<DL COMPACT><DT id="10"><DD>
gibt den Ort der Zwischenspeicherdateien an.
</DL>

<P>

<B>FileListDir</B>
<DL COMPACT><DT id="11"><DD>
gibt den Ort der Dateilistendateien an, wenn die
FileList
unterhalb benutzt wird.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H3>Default-Abschnitt</H3>

<P>

Der
Default-Abschnitt gibt Vorgabewerte an und Einstellungen, die den Betrieb des Generators steuern. Andere Abschnitte k&ouml;nnen diese Vorgaben mit einer Einstellung pro Abschnitt au&szlig;er Kraft setzen.
<P>

<B>Packages::Compress</B>
<DL COMPACT><DT id="12"><DD>
setzt das Standardkompressionsschema, das f&uuml;r die Paketindexdateien benutzt wird. Es ist eine Zeichenkette, die eine durch Leerzeichen getrennte Liste mit mindestens einem der im Konfigurationsbereich
<B>APT::Compressor</B>
eingerichteten Kompressionsprogramme enth&auml;lt. Die Voreinstellung f&uuml;r alle Kompressionsschemas ist &raquo;. gzip&laquo;.
</DL>

<P>

<B>Packages::Extensions</B>
<DL COMPACT><DT id="13"><DD>
setzt die Vorgabeliste von Dateierweiterungen, die Paketdateien sind. Vorgabe ist &raquo;.deb&laquo;.
</DL>

<P>

<B>Sources::Compress</B>
<DL COMPACT><DT id="14"><DD>
Dies ist
Packages::Compress
&auml;hnlich, au&szlig;er dass es die Kompression der Quelldateien steuert.
</DL>

<P>

<B>Sources::Extensions</B>
<DL COMPACT><DT id="15"><DD>
setzt die Vorgabeliste von Dateierweiterungen, die Quelldateien sind. Vorgabe ist &raquo;.dsc&laquo;.
</DL>

<P>

<B>Contents::Compress</B>
<DL COMPACT><DT id="16"><DD>
Dies ist
Packages::Compress
&auml;hnlich, au&szlig;er dass es die Kompression der Contents-Dteien steuert.
</DL>

<P>

<B>Translation::Compress</B>
<DL COMPACT><DT id="17"><DD>
Dies ist
Packages::Compress
&auml;hnlich, au&szlig;er dass es die Kompression der Translation-en-Hauptdatei steuert.
</DL>

<P>

<B>DeLinkLimit</B>
<DL COMPACT><DT id="18"><DD>
gibt die Anzahl von Kilobyte an, deren Verweis pro Durchlauf entfernt (und durch Hardlinks ersetzt) werden sollen. Dies wird in Verbindung mit der abschnittsweisen Einstellung
External-Links
benutzt.
</DL>

<P>

<B>FileMode</B>
<DL COMPACT><DT id="19"><DD>
gibt den Modus f&uuml;r alle erstellten Indexdateien an. Vorgabe ist 0644. Alle Indexdateien erhalten diese Rechte ohne Beachtung von umask.
</DL>

<P>

<B>LongDescription</B>
<DL COMPACT><DT id="20"><DD>
gesetzt, falls lange Beschreibungen in die
Package-Datei eingeschlossen oder in eine
Translation-en-Hauptdatei unterteilt werden sollen
</DL>

<A NAME="lbAH">&nbsp;</A>
<H3>TreeDefault-Abschnitt</H3>

<P>

setzt Vorgaben speziell f&uuml;r
Tree-Abschnitte. All diese Variablen sind Platzhaltervariablen und haben die Zeichenketten $(DIST), $(SECTION) und $(ARCH) durch ihre jeweiligen Werte ersetzt.
<P>

<B>MaxContentsChange</B>
<DL COMPACT><DT id="21"><DD>
setzt die Anzahl der Kilobyte an Inhaltdateien, die jeden Tag generiert werden. Die Inhaltdateien werden reihum ersetzt, so dass sie &uuml;ber mehrere Tage alle neu gebildet werden.
</DL>

<P>

<B>ContentsAge</B>
<DL COMPACT><DT id="22"><DD>
steuert die Anzahl der Tage, die eine Inhaltsdatei erlaubt ist ohne &Auml;nderung gepr&uuml;ft zu werden. Wenn die Grenze &uuml;berschritten ist, wird die mtime der Inhaltsdatei aktualisiert. Dieser Fall kann auftreten, wenn die Package-Datei in einer Art ge&auml;ndert wurde, die nicht in einer neuen Inhaltsdatei resultierte [au&szlig;er Kraft setzendes Bearbeiten zum Beispiel]. Ein Aufhalten ist erlaubt, in der Hoffnung dass neue .debs installiert werden, die sowieso eine neue Datei ben&ouml;tigen. Die Vorgabe ist 10, die Einheiten sind Tage.
</DL>

<P>

<B>Directory</B>
<DL COMPACT><DT id="23"><DD>
setzt den Beginn des .deb-Verzeichnisbaums. Vorgabe ist
$(DIST)/$(SECTION)/binary-$(ARCH)/
</DL>

<P>

<B>SrcDirectory</B>
<DL COMPACT><DT id="24"><DD>
setzt den Beginn des Quellpaketverzeichnisbaums. Vorgabe ist
$(DIST)/$(SECTION)/source/
</DL>

<P>

<B>Packages</B>
<DL COMPACT><DT id="25"><DD>
setzt die Ausgabe-Packages-Datei. Vorgabe ist
$(DIST)/$(SECTION)/binary-$(ARCH)/Packages
</DL>

<P>

<B>Sources</B>
<DL COMPACT><DT id="26"><DD>
setzt die Ausgabe-Sources-Datei. Vorgabe ist
$(DIST)/$(SECTION)/source/Sources
</DL>

<P>

<B>Translation</B>
<DL COMPACT><DT id="27"><DD>
setzt die Ausgabe der Translation-en-Hauptdatei mit den langen Beschreibungen falls sie nicht in der Packages-Datei enthalten sein sollen. Vorgabe ist
$(DIST)/$(SECTION)/i18n/Translation-en.
</DL>

<P>

<B>InternalPrefix</B>
<DL COMPACT><DT id="28"><DD>
setzt das Pfad-Pr&auml;fix, das bewirkt, dass ein symbolischer Verweis wie ein interner anstatt wie ein externer Verweis behandelt wird. Vorgabe ist
$(DIST)/$(SECTION)/
</DL>

<P>

<B>Contents</B>
<DL COMPACT><DT id="29"><DD>
setzt die Ausgabe-Contents-Datei. Vorgabe ist
$(DIST)/$(SECTION)/Contents-$(ARCH). Wenn diese Einstellung bewirkt, dass mehrere Packages-Dateien auf einer einzelnen Inhaltsdatei abgebildet werden (so wie es Vorgabe ist), dann wird
<B>apt-ftparchive</B>
diese Dateien automatisch integrieren.
</DL>

<P>

<B>Contents::Header</B>
<DL COMPACT><DT id="30"><DD>
setzt die Kopfdatendatei, um sie der Inhaltsausgabe voranzustellen.
</DL>

<P>

<B>BinCacheDB</B>
<DL COMPACT><DT id="31"><DD>
setzt die Programmzwischenspeicherdatenbank zur Benutzung in diesem Abschnitt. Mehrere Abschnitte k&ouml;nnen sich die gleiche Datenbank teilen.
</DL>

<P>

<B>FileList</B>
<DL COMPACT><DT id="32"><DD>
gibt an, dass
<B>apt-ftparchive</B>
die Liste der Dateien aus der vorgegebenen Datei liest, anstatt den Verzeichnisbaum zu durchlaufen. Relativen Dateinamen wird das Archivverzeichnis vorangestellt.
</DL>

<P>

<B>SourceFileList</B>
<DL COMPACT><DT id="33"><DD>
gibt an, dass
<B>apt-ftparchive</B>
die Liste der Dateien aus der vorgegebenen Datei liest, anstatt den Verzeichnisbaum zu durchlaufen. Relativen Dateinamen wird das Archivverzeichnis vorangestellt. Dies wird benutzt, wenn Quellindizes verarbeitet werden.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H3>Tree-Abschnitt</H3>

<P>

Der
Tree-Abschnitt definiert einen Standard-Debian-Dateibaum, der aus einem Basisverzeichnis, dann mehreren Abschnitten in diesem Basisverzeichnis und am Ende, mehreren Architekturen in jedem Abschnitt besteht. Die genaue benutzte Pfadeinstellung ist durch die
Directory-Ersetzungsvariable definiert.
<P>

Der
Tree-Abschnitt akzeptiert eine scope-Markierung, die die
$(DIST)-Variable setzt und die Wurzel des Baumes definiert (dem Pfad wird
ArchiveDir
vorangestellt). Typischerweise ist dies eine Einstellung wie
dists/buster.
<P>

Alle im
TreeDefault-Abschnitt definierten Einstellungen k&ouml;nnen in einem
Tree-Abschnitt, sowie drei neue Variablen benutzt werden.
<P>

Wenn ein
Tree-Abschnitt bearbeitet wird, f&uuml;hrt
<B>apt-ftparchive</B>
eine Aktion aus, die folgender &auml;hnelt:
<P>
<DL COMPACT><DT id="34"><DD>



<PRE>
for i in Abschnitte do
   for j in Architekturen do
      Generiere for DIST=Geltungsbereich SECTION=i ARCH=j
     
</PRE>

</DL>




<P>
<P>

<B>Sections</B>
<DL COMPACT><DT id="35"><DD>
Dies ist eine durch Leerzeichen getrennte Liste der Abschnitte, die unter der Distribution erscheint, typischerweise etwas wie
main contrib non-free
</DL>

<P>

<B>Architectures</B>
<DL COMPACT><DT id="36"><DD>
Dies ist eine durch Kommas getrennte Liste aller Architekturen, die unter dem Suchabschnitt erscheinen. Die besondere Architektur &raquo;source&laquo; wird benutzt, um anzuzeigen, dass dieser Verzeichnisbaum &uuml;ber ein Quellarchiv verf&uuml;gt. Die Architektur &raquo;all&laquo; signalisiert, dass architekturspezifische Dateien wie
Packages
keine Informationen &uuml;ber Pakete der Architektur
all
enthalten sollten, da sie in einer dedizierten Datei verf&uuml;gbar sein werden.
</DL>

<P>

<B>LongDescription</B>
<DL COMPACT><DT id="37"><DD>
gesetzt, falls lange Beschreibungen in die
Package-Datei eingeschlossen oder in eine
Translation-en-Hauptdatei unterteilt werden sollen
</DL>

<P>

<B>BinOverride</B>
<DL COMPACT><DT id="38"><DD>
setzt die Bin&auml;rdatei zum &Uuml;berschreiben. Die Datei zum &Uuml;berschreiben enth&auml;lt Abschnitt, Priorit&auml;t und Adressinformationen des Betreuers.
</DL>

<P>

<B>SrcOverride</B>
<DL COMPACT><DT id="39"><DD>
setzt die Quelldatei zum &Uuml;berschreiben. Die Quelldatei zum &Uuml;berschreiben enth&auml;lt Abschnittsinformationen.
</DL>

<P>

<B>ExtraOverride</B>
<DL COMPACT><DT id="40"><DD>
setzt die zus&auml;tzliche Bin&auml;rdatei zum &Uuml;berschreiben.
</DL>

<P>

<B>SrcExtraOverride</B>
<DL COMPACT><DT id="41"><DD>
setzt die zus&auml;tzliche Quelldatei zum &Uuml;berschreiben.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H3>BinDirectory-Abschnitt</H3>

<P>

Der
bindirectory-Abschnitt definiert einen Bin&auml;rverzeichnisbaum ohne spezielle Struktur. Die scope-Markierung gibt den Ort des Bin&auml;rverzeichnisses an und die Einstellungen sind denen des
Tree-Abschnitts ohne Platzhaltervariablen oder
AbschnittArchitektur
&auml;hnlich.
<P>

<B>Packages</B>
<DL COMPACT><DT id="42"><DD>
setzt die Packages-Dateiausgabe.
</DL>

<P>

<B>Sources</B>
<DL COMPACT><DT id="43"><DD>
setzt die Sources-Dateiausgabe. Entweder
Packages
oder
Sources
ist erforderlich.
</DL>

<P>

<B>Contents</B>
<DL COMPACT><DT id="44"><DD>
setzt die Contents-Dateiausgabe (optional)
</DL>

<P>

<B>BinOverride</B>
<DL COMPACT><DT id="45"><DD>
setzt die Bin&auml;rdatei zum &Uuml;berschreiben.
</DL>

<P>

<B>SrcOverride</B>
<DL COMPACT><DT id="46"><DD>
setzt die Quelldatei zum &Uuml;berschreiben.
</DL>

<P>

<B>ExtraOverride</B>
<DL COMPACT><DT id="47"><DD>
setzt die zus&auml;tzliche Bin&auml;rdatei zum &Uuml;berschreiben.
</DL>

<P>

<B>SrcExtraOverride</B>
<DL COMPACT><DT id="48"><DD>
setzt die zus&auml;tzliche Quelldatei zum &Uuml;berschreiben.
</DL>

<P>

<B>BinCacheDB</B>
<DL COMPACT><DT id="49"><DD>
setzt die Zwischenspeicherdatenbank.
</DL>

<P>

<B>PathPrefix</B>
<DL COMPACT><DT id="50"><DD>
h&auml;ngt einen Pfad an alle Ausgabepfade an.
</DL>

<P>

<B>FileList</B>, <B>SourceFileList</B>
<DL COMPACT><DT id="51"><DD>
gibt die Dateilistendatei an.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>DIE PROGRAMMDATEI ZUM &Uuml;BERSCHREIBEN</H2>

<P>

Die Bin&auml;rdatei zum &Uuml;berschreiben ist vollst&auml;ndig zu
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1)
kompatibel. Sie enth&auml;lt vier durch Leerzeichen getrennte Felder. Das erste Feld ist der Paketname, das zweite ist die Priorit&auml;t, zu der das Paket erzwungen wird, das dritte ist der Abschnitt, zu der das Paket erzwungen wird und das letzte Feld ist das Betreuerumsetzungsfeld.
<P>

Die allgemeine Form des Betreuerfelds ist:
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
alt [// oldn]* =&gt; neu
</PRE>

</DL>




<P>
oder einfach
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
neu
</PRE>

</DL>




<P>
. Die erste Form erlaubt es, eine durch Doppelschr&auml;gstrich getrennte Liste alter E-Mail-Adressen anzugegeben. Wenn eine davon gefunden wird, wird die neue f&uuml;r das Betreuerfeld ersetzt. Die zweite Form ersetzt das Betreuerfeld bedingungslos.
<A NAME="lbAL">&nbsp;</A>
<H2>DIE QUELLDATEI ZUM &Uuml;BERSCHREIBEN</H2>

<P>

Die Quelldatei zum &Uuml;berschreiben ist vollst&auml;ndig kompatibel zu
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scansources">dpkg-scansources</A></B>(1). Sie enth&auml;lt zwei durch Leerzeichen getrennte Felder. Das erste Feld ist der Quellpaketname, das zweite ist der Abschnitt, dem er zugeordnet ist.
<A NAME="lbAM">&nbsp;</A>
<H2>DIE ZUS&Auml;TZLICHE DATEI ZUM &Uuml;BERSCHREIBEN</H2>

<P>

Die zus&auml;tzliche Datei zum &Uuml;berschreiben erlaubt jeder beliebigen Markierung zur Ausgabe hinzugef&uuml;gt oder darin ersetzt zu werden. Sie hat drei Spalten. Die erste ist das Paket, die zweite ist die Markierung und der Rest der Zeile ist der neue Wert.
<A NAME="lbAN">&nbsp;</A>
<H2>OPTIONEN</H2>

<P>

Alle Befehlszeilenoptionen k&ouml;nnen durch die Konfigurationsdatei gesetzt werden, die Beschreibung gibt die zu setzende Option an. F&uuml;r boolesche Optionen k&ouml;nnen Sie die Konfigurationsdatei au&szlig;er Kraft setzen, indem Sie etwas der Art
<B>-f-</B>,
<B>--no-f</B>,
<B>-f=no</B>
oder etliche weitere Varianten benutzen.
<P>

<B>--md5</B>, <B>--sha1</B>, <B>--sha256</B>, <B>--sha512</B>
<DL COMPACT><DT id="54"><DD>
erzeugt die vorgegebene Pr&uuml;fsumme. Diese Optionen sind standardm&auml;&szlig;ig aktiviert. Wenn sie deaktiviert sind, werden die erzeugten Indexdateien nach M&ouml;glichkeit keine Pr&uuml;fsummenfelder erhalten. Konfigurationselemente:
APT::FTPArchive::<I>Pr&uuml;fsumme</I>
und
APT::FTPArchive::<I>Index</I>::<I>Pr&uuml;fsumme</I>, wobei
<I>Index</I>
Packages,
Sources
oder
Release
sein kann und
<I>Pr&uuml;fsumme</I>
MD5,
SHA1,
SHA256
oder
SHA512
sein kann.
</DL>

<P>

<B>-d</B>, <B>--db</B>
<DL COMPACT><DT id="55"><DD>
benutzt eine Bin&auml;rzwischenspeicherdatenbank. Dies hat keine Auswirkung auf den &raquo;generate&laquo;-Befehl. Konfigurationselement:
APT::FTPArchive::DB.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="56"><DD>
still; erzeugt eine Ausgabe, die f&uuml;r Protokollierung geeignet ist und Fortschrittsanzeiger wegl&auml;sst. Mehr &raquo;q&laquo;s unterdr&uuml;cken mehr Ausgaben, bis zu einem Maximum von 2. Sie k&ouml;nnen au&szlig;erdem
<B>-q=#</B>
benutzen, um die Stillestufe zu setzen, was die Konfigurationsdatei au&szlig;er Kraft setzt. Konfigurationselement:
quiet.
</DL>

<P>

<B>--delink</B>
<DL COMPACT><DT id="57"><DD>
entfernt Verweise. Wenn die
External-Links-Einstellung benutzt wird, schaltet diese Option tats&auml;chlich das Entfernen von Verweisen zu Dateien ein. Standardm&auml;&szlig;ig ist es an und kann mit
<B>--no-delink</B>
ausgeschaltet werden. Konfigurationselement:
APT::FTPArchive::DeLinkAct.
</DL>

<P>

<B>--contents</B>
<DL COMPACT><DT id="58"><DD>
f&uuml;hrt Inhaltsgenerierung durch. Wenn diese Option gesetzt ist und Paketindizes mit einer Zwischenspeicherdatenbank generiert werden, dann wird die Dateiliste auch extrahiert und f&uuml;r sp&auml;tere Benutzung in der Datenbank gespeichert. Wenn der &raquo;generate&laquo;-Befehl benutzt wird, erlaubt diese Option au&szlig;erdem die Erzeugung beliebiger Contents-Dateien. Die Vorgabe ist an. Konfigurationselement:
APT::FTPArchive::Contents.
</DL>

<P>

<B>-s</B>, <B>--source-override</B>
<DL COMPACT><DT id="59"><DD>
w&auml;hlt die Quelldatei zum au&szlig;er Kraft setzen, die mit dem
sources-Befehl benutzt wird. Konfigurationselement:
APT::FTPArchive::SourceOverride.
</DL>

<P>

<B>--readonly</B>
<DL COMPACT><DT id="60"><DD>
macht die Zwischenspeicherdatenbank nur lesbar. Konfigurationselement:
APT::FTPArchive::ReadOnlyDB.
</DL>

<P>

<B>-a</B>, <B>--arch</B>
<DL COMPACT><DT id="61"><DD>
akzeptiert in den Befehlen
packages
und
contents
nur Paketdateien, die auf
*_arch.deb
oder
*_all.deb
passen, anstatt aller Paketdateien im angegebenen Pfad. Konfigurationselement:
APT::FTPArchive::Architecture.
</DL>

<P>

<B>APT::FTPArchive::AlwaysStat</B>
<DL COMPACT><DT id="62"><DD>
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1)
speichert so viele Metadaten wie m&ouml;glich in einer Zwischenspeicherdatenbank. Falls Pakete neu kompiliert und/oder neu mit der gleichen Version ver&ouml;ffentlicht werden, f&uuml;hrt dies zu Problemen, da die nun veralteten zwischengespeicherten Metadaten, wie Gr&ouml;&szlig;e und Pr&uuml;fsumme, benutzt werden. Mit dieser eingeschalteten Option wird dies nicht weiter vorkommen, da gepr&uuml;ft wird, ob die Datei ge&auml;ndert wurde. Beachten Sie, dass diese Option standardm&auml;&szlig;ig auf &raquo;false&laquo; gesetzt ist, da es nicht empfohlen wird, mehrere Versionen/Builds eines Pakets mit der gleichen Versionsnummer hochzuladen, so dass theoretisch niemand dieses Probleme haben sollte und all diese zus&auml;tzlichen Pr&uuml;fungen daher nutzlos sind.
</DL>

<P>

<B>APT::FTPArchive::LongDescription</B>
<DL COMPACT><DT id="63"><DD>
Diese Konfigurationsoption ist standardm&auml;&szlig;ig &raquo;true&laquo; und sollte nur auf &raquo;false&laquo; gesetzt werden, wenn das mit
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1)
generierte Archiv au&szlig;erdem
Translation-Dateien bereitstellt. Beachten Sie, dass die Hauptdatei
Translation-en
nur durch den Befehl &raquo;generate&laquo; erstellt werden kann.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="64"><DD>
eine kurze Aufrufzusammenfassung zeigen
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="65"><DD>
die Version des Programms anzeigen
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="66"><DD>
Konfigurationsdatei; hiermit wird die zu verwendende Konfigurationssdatei angegeben. Das Programm wird die Vorgabe-Konfigurationsdatei und dann diese Konfigurationsdatei lesen. Falls Konfigurationseinstellungen vor der Vorgabe-Konfiguration ausgewertet werden m&uuml;ssen, geben Sie eine Datei in der Umgebungsvariable
<B>APT_CONFIG</B>
an. Lesen Sie
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5), um Syntax-Informationen zu erhalten.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="67"><DD>
eine Konfigurationsoption setzen; hiermit wird eine beliebige Konfigurationsoption gesetzt. Die Syntax lautet
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
und
<B>--option</B>
kann mehrfach benutzt werden, um verschiedene Optionen zu setzen.
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>BEISPIELE</H2>

<P>

Um eine gepackte Paketdatei f&uuml;r ein Verzeichnis zu erstellen, das Bin&auml;rpakete (.deb) enth&auml;lt:
<P>
<DL COMPACT><DT id="68"><DD>



<PRE>
<B>apt-ftparchive</B> packages <I>Verzeichnis</I> | <B>gzip</B> &gt; Packages.gz
</PRE>

</DL>




<A NAME="lbAP">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>DIAGNOSE</H2>

<P>

<B>apt-ftparchive</B>
gibt bei normalen Aktionen 0 zur&uuml;ck, dezimal 100 bei Fehlern.
<A NAME="lbAR">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAS">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAT">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="69"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="70"><DD>
</DL>

<A NAME="lbAU">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="71"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="72"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="73"><A HREF="#lbAB">NAME</A><DD>
<DT id="74"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="75"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="76"><A HREF="#lbAE">DIE GENERATE-KONFIGURATION</A><DD>
<DL>
<DT id="77"><A HREF="#lbAF">Dir-Abschnitt</A><DD>
<DT id="78"><A HREF="#lbAG">Default-Abschnitt</A><DD>
<DT id="79"><A HREF="#lbAH">TreeDefault-Abschnitt</A><DD>
<DT id="80"><A HREF="#lbAI">Tree-Abschnitt</A><DD>
<DT id="81"><A HREF="#lbAJ">BinDirectory-Abschnitt</A><DD>
</DL>
<DT id="82"><A HREF="#lbAK">DIE PROGRAMMDATEI ZUM &Uuml;BERSCHREIBEN</A><DD>
<DT id="83"><A HREF="#lbAL">DIE QUELLDATEI ZUM &Uuml;BERSCHREIBEN</A><DD>
<DT id="84"><A HREF="#lbAM">DIE ZUS&Auml;TZLICHE DATEI ZUM &Uuml;BERSCHREIBEN</A><DD>
<DT id="85"><A HREF="#lbAN">OPTIONEN</A><DD>
<DT id="86"><A HREF="#lbAO">BEISPIELE</A><DD>
<DT id="87"><A HREF="#lbAP">SIEHE AUCH</A><DD>
<DT id="88"><A HREF="#lbAQ">DIAGNOSE</A><DD>
<DT id="89"><A HREF="#lbAR">FEHLER</A><DD>
<DT id="90"><A HREF="#lbAS">&Uuml;BERSETZUNG</A><DD>
<DT id="91"><A HREF="#lbAT">AUTOREN</A><DD>
<DT id="92"><A HREF="#lbAU">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:55 GMT, March 31, 2021
</BODY>
</HTML>
