
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg</TITLE>
</HEAD><BODY>
<H1>dpkg</H1>
Section: dpkg-Programmsammlung (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

dpkg - Paketverwalter f&uuml;r Debian
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<B>dpkg</B> [<I>Option</I> …] <I>Aktionen</I>
<A NAME="lbAD">&nbsp;</A>
<H2>WARNUNG</H2>

Dieses Handbuch ist f&uuml;r Benutzer gedacht, die die Befehlszeilenoptionen und
Paketzust&auml;nde von <B>dpkg</B> detaillierter verstehen wollen, als durch <B>dpkg
--help</B> beschrieben ist.
<P>
Es sollte <I>nicht</I> von Paketbetreuern verwendet werden, die verstehen
wollen, wie <B>dpkg</B> ihr Paket installieren wird. Die Beschreibung von den
T&auml;tigkeiten von <B>dpkg</B> beim Installieren und Entfernen von Paketen ist
besonders unzul&auml;nglich.
<A NAME="lbAE">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<B>dpkg</B> ist ein Werkzeug, um Debian-Pakete zu installieren, zu bauen und zu
verwalten. Die prim&auml;re und benutzerfreundlichere Oberfl&auml;che f&uuml;r <B>dpkg</B> ist
<B><A HREF="/cgi-bin/man/man2html?1+aptitude">aptitude</A></B>(1). <B>dpkg</B> selbst wird komplett &uuml;ber Befehlszeilenoptionen
gesteuert, die aus genau einer Aktion und Null oder mehreren Optionen
bestehen. Der Aktionsparameter teilt <B>dpkg</B> mit, was zu tun ist, und die
Optionen steuern die Aktionen in irgendeiner Weise.
<P>
<B>dpkg</B> kann auch als Oberfl&auml;che f&uuml;r <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1) und <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1)
verwendet werden. Die Liste der unterst&uuml;tzen Aktionen kann im Abschnitt
<B>AKTIONEN</B> gefunden werden. Falls so eine Aktion angetroffen wird, f&uuml;hrt
<B>dpkg</B> einfach <B>dpkg-deb</B> oder <B>dpkg-query</B> mit den &uuml;bergebenen
Parametern aus, allerdings werden derzeit keine spezifischen Optionen an
diese &uuml;bergeben. Um solche Optionen zu verwenden, m&uuml;ssen die Backends direkt
aufgerufen werden.
<A NAME="lbAF">&nbsp;</A>
<H2>INFORMATIONEN &Uuml;BER PAKETE</H2>

<B>dpkg</B> verwaltet einige n&uuml;tzliche Informationen &uuml;ber verf&uuml;gbare Pakete. Die
Informationen sind in drei Klassen unterteilt: <B>Status</B>, <B>Auswahlstatus</B>
und <B>Schalter</B>. Diese Werte sind haupts&auml;chlich zur &Auml;nderung durch
<B>dselect</B> gedacht.
<A NAME="lbAG">&nbsp;</A>
<H3>Paketstatus</H3>

<DL COMPACT>
<DT id="1"><B>not-installed</B> (nicht-installiert)<DD>
Das Paket ist nicht auf Ihrem System installiert.
<DT id="2"><B>config-files</B> (Config-Dateien)<DD>
Nur die Konfigurationsdateien des Pakets existieren auf dem System.
<DT id="3"><B>half-installed</B> (halb-installiert)<DD>
Die Installation des Paketes wurde begonnen, aber aus irgendeinem Grund
nicht abgeschlossen.
<DT id="4"><B>unpacked</B> (entpackt)<DD>
Das Paket ist entpackt, aber nicht konfiguriert.
<DT id="5"><B>half-configured</B> (halb-konfiguriert)<DD>
Das Paket ist entpackt und die Konfiguration wurde begonnen, aber aus
irgendeinem Grund nicht abgeschlossen.
<DT id="6"><B>triggers-awaited</B> (triggers-awaited)<DD>
Das Paket erwartet Trigger-Verarbeitung durch ein anderes Paket.
<DT id="7"><B>triggers-pending</B> (triggers-pending)<DD>
Das Paket wurde getriggert.
<DT id="8"><B>installed</B> (installiert)<DD>
Das Paket ist korrekt entpackt und konfiguriert.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H3>Paketauswahlstatus</H3>

<DL COMPACT>
<DT id="9"><B>installiere</B><DD>
Das Paket ist zur Installation ausgew&auml;hlt.
<DT id="10"><B>halten</B><DD>
Ein Paket, das mit <B>halten</B> markiert ist, wird von <B>dpkg</B> nicht behandelt,
es sei denn Sie erzwingen dies mit der Option <B>--force-hold</B>.
<DT id="11"><B>deinstalliere</B><DD>
Das Paket ist zur Deinstallation ausgew&auml;hlt (d.h. wir wollen alle Dateien
au&szlig;er den Konfigurationsdateien entfernen).
<DT id="12"><B>vollst&auml;ndig l&ouml;schen</B><DD>
Das Paket ist zum vollst&auml;ndigen L&ouml;schen (&raquo;purge&laquo;) ausgew&auml;hlt (d.h. wir
wollen alle Dateien aus den Systemverzeichnissen inklusive der
Konfigurationsdateien entfernen).
<DT id="13"><B>unknown</B><DD>
Die Paketauswahl ist unbekannt. Ein Paket, das auch im Zustand
<B>not-installed</B> und ohne Schalter <B>ok</B> ist, wird beim n&auml;chsten Abspeichern
der Datenbank vergessen.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H3>Paketschalter</H3>

<DL COMPACT>
<DT id="14"><B>ok</B><DD>
Ein mit <B>ok</B> markiertes Paket ist in einem bekannten Zustand, kann aber
weitere Verarbeitung ben&ouml;tigen.
<DT id="15"><B>Neuinst.</B><DD>
Ein mit <B>Neuinst.</B> markiertes Paket ist defekt und muss erneut installiert
werden. Diese Pakete k&ouml;nnen nicht entfernt werden, es sei denn, Sie
erzwingen dies mit der Option <B>--force-remove-reinstreq</B>.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>AKTIONEN</H2>

<DL COMPACT>
<DT id="16"><B>-i</B>, <B>--install</B> <I>Paketdatei</I> …<DD>
Installiere das Paket. Falls die <B>--recursive</B> oder <B>-R</B>-Option angegeben
ist, muss sich <I>Paketdatei</I> stattdessen auf ein Verzeichnis beziehen.
<P>
Die Installation besteht aus folgenden Schritten:
<BR>

<P>
<B>1.</B> Extrahiere die control-Dateien aus dem neuen Paket.
<BR>

<P>
<B>2.</B> Falls eine andere Version des gleichen Pakets vor der der neuen
Installation installiert war, dann f&uuml;hre das <I>prerm</I>-Skript des alten
Paketes aus.
<BR>

<P>
<B>3.</B> F&uuml;hre das <I>preinst</I>-Skript aus, falls dies vom Paket bereitgestellt
wird.
<BR>

<P>
<B>4.</B> Entpacke die neuen Dateien und sichere gleichzeitig die alten Dateien,
so dass diese, falls etwas schief geht, wiederhergestellt werden k&ouml;nnen.
<BR>

<P>
<B>5.</B> Falls eine andere Version des gleichen Pakets vor der der neuen
Installation installiert war, dann f&uuml;hre das <I>postrm</I>-Skript des alten
Paketes aus. Beachten Sie, dass dieses Skript nach dem <I>preinst</I>-Skript des
neuen Pakets ausgef&uuml;hrt wird, da neue Dateien zeitgleich zu der Entfernung
alter Dateien geschrieben werden.
<BR>

<P>
<B>6.</B> Konfiguriere das Paket. Lesen Sie <B>--configure</B> f&uuml;r detaillierte
Informationen wie dies geschieht.
<DT id="17"><B>--unpack </B><I>Paketdatei</I> …<DD>
Entpacke das Paket, aber konfiguriere es nicht. Falls die <B>--recursive</B>
oder <B>-R</B>-Option angegeben ist, muss sich <I>Paketdatei</I> stattdessen auf ein
Verzeichnis beziehen.
<DT id="18"><B>--configure </B><I>Paket</I> …|<B>-a</B>|<B>--pending</B><DD>
Konfiguriert ein entpacktes aber noch nicht konfiguriertes Paket. Falls
<B>-a</B> oder <B>--pending</B> anstelle von <I>Paket</I> angegeben ist, werden alle
entpackten aber nicht konfigurierten Pakete konfiguriert.
<P>
Um ein Paket zu rekonfigurieren, dass bereits konfiguriert wurde, verwenden
Sie stattdessen den Befehl <B><A HREF="/cgi-bin/man/man2html?8+dpkg-reconfigure">dpkg-reconfigure</A></B>(8).
<P>
Die Konfiguration besteht aus folgenden Schritten:
<BR>

<P>
<B>1.</B> Entpacke die Conffiles und sichere gleichzeitig die alten Conffiles,
so dass diese, falls etwas schief geht, wiederhergestellt werden k&ouml;nnen.
<BR>

<P>
<B>2.</B> F&uuml;hre das <I>postinst</I>-Skript aus, falls dies vom Paket bereitgestellt
wird.
<DT id="19"><B>--triggers-only</B> <I>Paket</I> …|<B>-a</B>|<B>--pending</B><DD>
Verarbeite nur Trigger (seit Dpkg 1.14.17). Alle ausstehenden Trigger werden
verarbeitet. Falls Paketnamen &uuml;bergeben werden, werden nur die Trigger
dieser Pakete verarbeitet, jedes genau einmal wo notwendig. Die Verwendung
dieser Option kann Pakete in die unzul&auml;ssigen Stati <B>triggers-awaited</B> und
<B>triggers-pending</B> bringen. Durch die Ausf&uuml;hrung von &raquo;<B>dpkg --configure
--pending</B>&laquo; kann dies sp&auml;ter behoben werden.
<DT id="20"><B>-r</B>, <B>--remove</B> <I>Paket</I>…|<B>-a</B>|<B>--pending</B><DD>
Entfernt ein installiertes Paket. Dies entfernt alles au&szlig;er Conffiles und
anderen Daten, die vom Skript <I>postrm</I> bereinigt werden, da damit eine
erneute Konfiguration des Paketes vermieden wird, falls es sp&auml;ter nochmals
installiert wird. Conffiles sind Konfigurationsdateien, die in der
Steuerdatei <I>DEBIAN/conffiles</I> aufgef&uuml;hrt sind. Falls es keine Steuerdatei
<I>DEBIAN/conffiles</I> oder kein Skript <I>DEBIAN/postrm</I> gibt, ist dieser
Befehl &auml;quivalent zum Aufruf von <B>--purge</B>. Falls statt des Paketnamens
<B>-a</B> oder <B>--pending</B> angegeben wird, werden alle Pakete, die entpackt,
aber in der Datei <I>/var/lib/dpkg/status</I> zur Entfernung vorgemerkt sind,
entfernt.
<P>
Entfernung eines Paketes besteht aus den folgenden Schritten:
<BR>

<P>
<B>1.</B> F&uuml;hre das <I>prerm</I>-Skript aus
<BR>

<P>
<B>2.</B> Entferne die installierten Dateien
<BR>

<P>
<B>3.</B> F&uuml;hre das <I>postrm</I>-Skript aus
<BR>

<P>
<DT id="21"><B>-P</B>, <B>--purge</B> <I>Paket</I>…|<B>-a</B>|<B>--pending</B><DD>
L&ouml;scht ein installiertes oder bereits entferntes Paket vollst&auml;ndig. Damit
wird alles entfernt, auch Conffiles und alles, was im Skript <I>postrm</I>
bereinigt wird. Falls statt des Paketnamens <B>-a</B> oder <B>--pending</B>
angegeben wird, werden alle Pakete, die entpackt oder entfernt, aber in der
Datei <I>/var/lib/dpkg/status</I> zum vollst&auml;ndigen L&ouml;schen vorgemerkt sind,
vollst&auml;ndig gel&ouml;scht.
<P>
Hinweis: Einige Konfigurationsdateien k&ouml;nnen <B>dpkg</B> nicht bekannt sein, da
sie separat durch die Konfigurationsskripte angelegt und verwaltet
werden. In diesem Fall wird <B>dpkg</B> sie nicht selbst entfernen sondern das
Skript <I>postrm</I> (das von <B>dpkg</B> aufgerufen wird) des Pakets muss sich
w&auml;hrend des vollst&auml;ndigen L&ouml;schens um das Entfernen k&uuml;mmern. Nat&uuml;rlich
betrifft dies nur Dateien in den Systemverzeichnissen, nicht
Konfigurationsdateien, die in die Home-Verzeichnisse der individuellen
Benutzer geschrieben werden.
<P>
Entg&uuml;ltiges L&ouml;schen eines Paketes besteht aus den folgenden Schritten:
<BR>

<P>
<B>1.</B> Entfernen des Pakets, falls es noch nicht entfernt ist. Lesen Sie
<B>--remove</B> f&uuml;r detaillierte Informationen, wie dies erfolgt.
<BR>

<P>
<B>2.</B> F&uuml;hre das <I>postrm</I>-Skript aus
<BR>

<DT id="22"><B>-V</B>, <B>--verify</B> [<I>Paketname</I> …]<DD>
&Uuml;berpr&uuml;ft die Integrit&auml;t von <I>Paketname</I> oder allen Paketen, falls nicht
angegeben, indem Informationen aus den durch ein Paket installierten Dateien
mit den in der <B>dpkg</B>-Datenbank gespeicherten Dateimetadateninformationen
verglichen werden (seit Dpkg 1.17.2). Die Quelle der
Dateimetadateninformationen in der Datenbank ist das Bin&auml;rpaket
selbst. Diese Metadaten werden zum Zeitpunkt des Entpackens w&auml;hrend des
Installationsprozesses gesammelt.
<P>
Derzeit ist die einzige funktionale Pr&uuml;fung eine Md5sum-&Uuml;berpr&uuml;fung der
Dateiinhalte mit den gespeicherten Wert in der Datei-Datenbank. Er wird nur
gepr&uuml;ft, falls die Datenbank die Md5sum der Datei enth&auml;lt. Um auf fehlende
Metadaten in der Datenbank zu pr&uuml;fen, kann der Befehl <B>--audit</B> verwandt
werden.
<P>
Das Ausgabeformat kann mit der Option <B>--verify-format</B> ausgew&auml;hlt
werden. Standardm&auml;&szlig;ig wird das Format <B>rpm</B> verwandt. Das kann sich in der
Zukunft aber &auml;ndern und daher sollten Programme, die die Ausgabe dieses
Befehls auswerten, explizit das Format angeben, das sie erwarten.
<DT id="23"><B>-C</B>, <B>--audit</B> [<I>Paketname</I> …]<DD>
F&uuml;hrt Plausibilit&auml;ts- und Konsistenzpr&uuml;fungen der Datenbank f&uuml;r <I>Paketname</I>
oder alle Pakete, falls das Argument fehlt, durch (pro-Paket-Pr&uuml;fungen seit
Dpkg 1.17.10). Sucht beispielsweise nach Paketen die auf Ihrem System nur
teilweise installiert wurden oder fehlende, falsch oder veraltete
Steuerdaten oder -Dateien haben. <B>dpkg</B> wird einen Vorschlag machen, was
mit Ihnen zur Korrektur gemacht werden sollte.
<DT id="24"><B>--update-avail</B> [<I>Packages-Datei</I>]<DD>

<B>--merge-avail</B> [<I>Packages-Datei</I>]
Aktualisiere <B>dpkg</B>s und <B>dselect</B>s Verst&auml;ndnis dar&uuml;ber, welche Pakete
verf&uuml;gbar sind. Mit der Aktion <B>--merge-avail</B> wird alte Information mit
der Information aus der <I>Packages-Datei</I> zusammengef&uuml;hrt. Mit der Aktion
<B>--update-avail</B> wird die alte Information durch die Information aus der
<I>Packages-Datei</I> ersetzt. Die mit Debian vertriebene <I>Packages-Datei</I>
hei&szlig;t einfach Bq<I>Packages</I>". Falls das Argument <I>Packages-file</I> fehlt oder
Bq<B>-</B>" benannt ist, wird es aus der Standardeingabe lesen (seit Dpkg
1.17.7). <B>dpkg</B> h&auml;lt seine Aufzeichnungen &uuml;ber die verf&uuml;gbaren Pakete in
<I>/var/lib/dpkg/available</I>.
<P>
Ein einfacher Befehl, um die Datei <I>available</I> in einem Rutsch zu holen und
zu aktualisieren ist <B>dselect update</B>. Beachten Sie, dass diese Datei
nahezu nutzlos ist, falls Sie nicht <B>dselect</B> sondern eine APT-basierte
Oberfl&auml;che verwenden: APT verf&uuml;gt &uuml;ber sein eigenes System, die verf&uuml;gbaren
Pakete zu &uuml;berwachen.
<DT id="25"><B>-A</B>, <B>--record-avail</B> <I>Paketdatei</I> …<DD>
Aktualisiere mit den Informationen aus dem Paket <I>Paketdatei</I> <B>dpkg</B>s und
<B>dselect</B>s Verst&auml;ndnis dar&uuml;ber, welche Pakete verf&uuml;gbar sind. Falls die
<B>--recursive</B> oder <B>-R</B>-Option angegeben ist, muss sich <I>Paketdatei</I>
stattdessen auf ein Verzeichnis beziehen.
<DT id="26"><B>--forget-old-unavail</B><DD>
Jetzt <B>veraltet</B> und ohne Funktion, da <B>dpkg</B> automatisch nicht
installierte nicht verf&uuml;gbare Pakete vergisst (seit Dpkg 1.15.4). Allerdings
nur solche, die keine Benutzerinformationen enthalten, wie Paketauswahlen.
<DT id="27"><B>--clear-avail</B><DD>
L&ouml;sche die existierenden Informationen dar&uuml;ber, welche Pakete verf&uuml;gbar
sind.
<DT id="28"><B>--get-selections</B> [<I>Paket-Name-Muster</I> …]<DD>
Hole Liste von Paketauswahlen und schreibe sie auf die Standardausgabe. Ohne
Muster werden nicht-installierte Pakete (d.h. solche, die vorher
&raquo;vollst&auml;ndig gel&ouml;scht&laquo; wurden) nicht angezeigt.
<DT id="29"><B>--set-selections</B><DD>
Setze die Paketauswahl durch Einlesen einer Datei von der
Standardeingabe. Diese Datei sollte im Format Bq<I>Paket</I> <I>Zustand</I>" sein,
wobei Zustand einer aus <B>install</B>, <B>hold</B>, <B>deinstall</B> oder <B>purge</B>
ist. Leerzeilen und Kommentarzeilen (beginnend mit bq<B>#</B>') sind auch
erlaubt.
<P>
Die Datei <I>available</I> muss f&uuml;r diesen Befehl aktuell sein, damit dies
Nutzen hat, andernfalls werden unbekannte Pakete mit einer Warnung
ignoriert. Siehe die Befehle <B>--update-avail</B> und <B>--merge-avail</B> f&uuml;r
weitere Informationen.
<DT id="30"><B>--clear-selections</B><DD>
Setze den erbetenen Zustand von jedem nicht-essenziellen Paket auf
&raquo;Deinstallation&laquo; (seit Dpkg 1.13.18). Dies ist dazu gedacht, direkt vor
<B>--set-selections</B> verwendet zu werden, um jedes Paket, das nicht in der
Liste von <B>--set-selections</B> vorkommt, zu deinstallieren.
<DT id="31"><B>--yet-to-unpack</B><DD>
Sucht nach Paketen, die zur Installation ausgew&auml;hlt wurden, die aber aus
irgendeinem Grund noch nicht installiert wurden.
<DT id="32"><DD>
Beachten Sie: Dieser Befehl verwendet sowohl die Datei available als auch
die Paketauswahlen.
<DT id="33"><B>--predep-package</B><DD>
Gibt ein einzelnes Paket aus, das das Ziel einer oder mehrere relevanter
Vorabh&auml;ngigkeiten ist und selbst keine unerf&uuml;llten Vorabh&auml;ngigkeiten hat.
<DT id="34"><DD>
Falls ein solches Paket vorhanden ist, wird es als Dateieintrag f&uuml;r
&raquo;Packages&laquo; ausgegeben, der passend weiterverarbeitet werden kann.
<DT id="35"><DD>
Beachten Sie: Dieser Befehl verwendet sowohl die Datei available als auch
die Paketauswahlen.
<DT id="36"><DD>
Liefert 0 zur&uuml;ck, wenn ein Paket ausgegeben wird und 1, wenn kein passendes
Paket verf&uuml;gbar ist und 2 im Fehlerfall.
<DT id="37"><B>--add-architecture </B><I>Architektur</I><DD>
F&uuml;gt <I>Architektur</I> zu der Liste von Architekturen hinzu, f&uuml;r die Pakete
ohne die Verwendung von <B>--force-architecture</B> installiert werden k&ouml;nnen
(seit Dpkg 1.16.2). Die Architektur, f&uuml;r die <B>dpkg</B> gebaut wurde (d.h. der
Ausgabe von <B>--print-architecture</B>), ist immer Teil der Liste.
<DT id="38"><B>--remove-architecture </B><I>Architektur</I><DD>
Entfernt <I>Architektur</I> von der Liste von Architekturen, f&uuml;r die Pakete ohne
die Verwendung von <B>--force-architecture</B> installiert werden k&ouml;nnen (seit
Dpkg 1.16.2). Falls die Architektur derzeit in der Datenbank benutzt wird,
dann wird die Durchf&uuml;hrung verweigert, falls nicht <B>--force-architecture</B>
verwandt wird. Die Architektur, f&uuml;r die <B>dpkg</B> gebaut wurde (d.h. der
Ausgabe von <B>--print-architecture</B>), kann niemals von der Liste entfernt
werden.
<DT id="39"><B>--print-architecture</B><DD>
Gebe die Architektur der Pakete aus, die <B>dpkg</B> installiert (beispielsweise
Bqi386").
<DT id="40"><B>--print-foreign-architectures</B><DD>
Gibt eine durch Zeilenumbr&uuml;che getrennte Liste von zus&auml;tzlichen
Architekturen aus, f&uuml;r die <B>dpkg</B> konfiguriert ist, Paketinstallationen f&uuml;r
zu erlauben (seit Dpkg 1.16.2).
<DT id="41"><B>--assert-</B><I>Funktionalit&auml;t</I><DD>
Best&auml;tigt, dass <B>dpkg</B> die erbetene Funktionalit&auml;t unterst&uuml;tzt. Liefert 0,
falls die Funktionalit&auml;t voll unterst&uuml;tzt wird, 1, falls die Funktionalit&auml;t
bekannt ist aber noch keine Unterst&uuml;tzung daf&uuml;r geliefert werden kann und 2,
falls die Funktionalit&auml;t unbekannt ist. Die aktuelle Liste von best&auml;tigbaren
Funktionalit&auml;ten ist wie folgt:
<DL COMPACT><DT id="42"><DD>
<DL COMPACT>
<DT id="43"><B>support-predepends</B><DD>
Unterst&uuml;tzt das Feld <B>Pre-Depends</B> (seit Dpkg 1.1.0).
<DT id="44"><B>working-epoch</B><DD>
Unterst&uuml;tzt Epochen in Versionszeichenketten (seit Dpkg 1.4.0.7).
<DT id="45"><B>long-filenames</B><DD>
Unterst&uuml;tzt in <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5)-Archiven lange Dateinamen (seit Dpkg 1.4.1.17).
<DT id="46"><B>multi-conrep</B><DD>
Unterst&uuml;tzt mehrere <B>Conflicts</B> und <B>Replaces</B> (seit Dpkg 1.4.1.19).
<DT id="47"><B>multi-arch</B><DD>
Unterst&uuml;tzt Multi-Arch-Felder und deren Semantik (seit Dpkg 1.16.2).
<DT id="48"><B>versioned-provides</B><DD>
Unterst&uuml;tzt versionierte <B>Provides</B> (seit Dpkg 1.17.11).
</DL>
</DL>

<DT id="49"><B>--validate-</B><I>Sachenzeichenkette</I><DD>
Best&auml;tigt, dass die <I>Sachenzeichenkette</I> eine korrekte Syntax hat (seit
Dpkg 1.18.16). Liefert 0 zur&uuml;ck, falls die <I>Zeichenkette</I> g&uuml;ltig ist, 1
falls die <I>Zeichenkette</I> ung&uuml;ltig ist, aber in lockeren Umgebungen
akzeptiert werden k&ouml;nnte und 2, falls die <I>Zeichenkette</I> ung&uuml;ltig ist. Die
aktuelle Liste der &uuml;berpr&uuml;fbaren <I>Sachen</I> ist:
<DL COMPACT><DT id="50"><DD>
<DL COMPACT>
<DT id="51"><B>pkgname</B><DD>
&Uuml;berpr&uuml;ft den &uuml;bergebenen Paketnamen (seit Dpkg 1.18.16).
<DT id="52"><B>trigname</B><DD>
&Uuml;berpr&uuml;ft den &uuml;bergebenen Triggernamen (seit Dpkg 1.18.16).
<DT id="53"><B>archname</B><DD>
&Uuml;berpr&uuml;ft den &uuml;bergebenen Architekturnamen (seit Dpkg 1.18.16).
<DT id="54"><B>version</B><DD>
&Uuml;berpr&uuml;ft die &uuml;bergebene Version (seit Dpkg 1.18.16).
</DL>
</DL>

<DT id="55"><B>--compare-versions </B><I>Ver1 Op Ver2</I><DD>





Vergleiche Versionsnummern, wobei <I>Op</I> ein bin&auml;rer Operator ist. <B>dpkg</B>
liefert wahr (<B>0</B>), falls die angegebene Bedingung erf&uuml;llt ist und falsch
(<B>1</B>) andernfalls. Es gibt zwei Gruppen von Operatoren, die sich in der
Behandlung von leeren <I>Ver1</I> oder <I>Ver2</I> unterscheiden. Die folgenden
behandeln leere Versionen als j&uuml;nger als jede andere Version: <B>lt le eq ne
ge gt</B>. Die folgenden behandeln eine leere Version als &auml;lter als jede
Version: <B>lt-nl le-nl ge-nl gt-nl</B>. Die folgenden sind nur aus
Kompatibilit&auml;t mit der Steuerdateisyntax bereitgestellt: <B>&lt; &lt;&lt;
&lt;= = &gt;= &gt;&gt; &gt;</B>. Die Operatoren <B>&lt;</B> und <B>&gt;</B> sind
obsolet und sollten <B>nicht</B> verwandt werden, da ihre Semantik verwirrend
ist. Beispielsweise ergibt <B>0.1 &lt; 0.1</B> wahr.
<DT id="56"><B>-?</B>, <B>--help</B><DD>
Zeige eine kurze Hilfenachricht an.
<DT id="57"><B>--force-help</B><DD>
Gebe Hilfe &uuml;ber die <B>--force-</B><I>Sache</I>-Optionen aus.
<DT id="58"><B>-Dh</B>, <B>--debug=help</B><DD>
Gibt Hilfe &uuml;ber Fehlersuchoptionen aus.
<DT id="59"><B>--version</B><DD>
Zeige <B>dpkg</B> Versionsinformationen an.
<DT id="60"><B>dpkg-deb-Aktionen</B><DD>
Lesen Sie <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1) f&uuml;r weitere Informationen &uuml;ber die folgenden
Aktionen.
<P>
<PRE>
<B>-b</B>, <B>--build</B> <I>Verzeichnis</I> [<I>Archiv</I>|<I>Verzeichnis</I>]
    Baue ein deb-Paket.
<B>-c</B>, <B>--contents</B> <I>Archiv</I>
    Liste den Inhalt eines deb-Paketes auf.
<B>-e</B>, <B>--control</B> <I>Archiv</I> [<I>Verzeichnis</I>]
    Extrahiere Steuerinformationen von einem Paket.
<B>-x</B>, <B>--extract</B> <I>Archiv Verzeichnis</I>
    Extrahiere die vom Paket enthaltenen Dateien.
<B>-f</B>, <B>--field</B> <I>Archiv</I> [<I>Steuerfeld</I>] …
    Zeige das/die Steuerfeld(er) eines Paketes an.
<B>--ctrl-tarfile</B> <I>Archive</I>
    Gebe die von einem Debian-Paket enthaltene Steuer-Tar-Datei aus.
<B>--fsys-tarfile</B> <I>Archiv</I>
    Gebe die von einem Debian-Paket enthaltene Dateisystem-Tar-Datei aus.
<B>-I</B>, <B>--info</B> <I>Archiv</I> [<I>Steuerdatei</I> …]
    Zeige Informationen &uuml;ber ein Paket.
</PRE>

<P>
<DT id="61"><B>dpkg-query-Aktionen</B><DD>
Lesen Sie <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1) f&uuml;r weitere Informationen &uuml;ber die folgenden
Aktionen.
<P>
<PRE>

<B>-l</B>, <B>--list</B> <I>Paketnamen-Muster</I> …
    Liste auf das &uuml;bergebene Suchmuster passende Pakete auf.
<B>-s</B>, <B>--status</B> <I>Paketname</I> …
    Berichte den Status des spezifizierten Pakets.
<B>-L</B>, <B>--listfiles</B> <I>Paketname</I> …
    Liste die aus <B>Paketname</B> auf Ihrem System installierten Dateien auf.
<B>-S</B>, <B>--search</B> <I>Dateinamen-Suchmuster</I> …
    Suche nach einem Dateinamen in installierten Paketen.
<B>-p</B>, <B>--print-avail</B> <I>Paketname</I>
    Zeige Details &uuml;ber <I>Paketname</I>, wie in <I>/var/lib/dpkg/available</I>
    gefunden. Benutzer von APT-basierten Oberfl&auml;chen sollten stattdessen
    <B>apt-cache show</B> <I>Paketname</I> verwenden.
</PRE>

</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>OPTIONEN</H2>

Alle Optionen k&ouml;nnen auf der Befehlszeile, in der
<B>dpkg</B>-Konfigurationsdatei <I>/etc/dpkg/dpkg.cfg</I> oder Fragementdateien
(mit Namen, die auf das Shell-Muster '[0-9a-zA-Z_-]*' passen) in den Dateien
im Konfigurationsverzeichnis <I>/etc/dpkg/dpkg.cfg.d/</I> angegeben
werden. Jede Zeile in der Konfigurationsdatei ist entweder eine Option
(exakt die gleiche wie die Befehlszeilenoption nur ohne f&uuml;hrende
Bindestriche) oder ein Kommentar (falls sie mit bq<B>#</B>' beginnt).
<BR>

<DL COMPACT>
<DT id="62"><B>--abort-after=</B><I>Zahl</I><DD>
&Auml;ndere nach wie vielen Fehlern <B>dpkg</B> abbrechen wird. Der Standardwert ist
50.
<DT id="63"><B>-B</B>, <B>--auto-deconfigure</B><DD>
Wenn ein Paket entfernt wird besteht die M&ouml;glichkeit, dass ein anderes
installiertes Paket von dem entfernten Paket abh&auml;ngt. Die Angabe dieser
Option f&uuml;hrt zur automatischen Dekonfiguration des Paketes, das von dem
entfernten Paket abh&auml;ngt.
<DT id="64"><B>-D</B><I>Oktal</I><B>, --debug=</B><I>Oktal</I><DD>
Schalte Fehlersuche ein. <I>Oktal</I> wird durch bitweise Oder-Verkn&uuml;pfung der
gew&uuml;nschten Werte von der nachfolgenden Liste gebildet (beachten Sie, dass
sich diese Werte in zuk&uuml;nftigen Ver&ouml;ffentlichungen ver&auml;ndern k&ouml;nnen). <B>-Dh</B>
oder <B>--debug=help</B> zeigen diese Fehlersuchwerte an.
<P>
<BR>&nbsp;&nbsp;Nummer&nbsp;&nbsp;Beschreibung
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;Allgemein&nbsp;hilfreiche&nbsp;Fortschrittsinformationen
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2&nbsp;&nbsp;&nbsp;Aufruf&nbsp;und&nbsp;Status&nbsp;der&nbsp;Betreuerskripte
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10&nbsp;&nbsp;&nbsp;Ausgabe&nbsp;f&uuml;r&nbsp;jede&nbsp;verarbeitete&nbsp;Datei
<BR>&nbsp;&nbsp;&nbsp;&nbsp;100&nbsp;&nbsp;&nbsp;Umfangreiche&nbsp;Ausgabe&nbsp;f&uuml;r&nbsp;jede&nbsp;verarbeitete&nbsp;Datei
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;20&nbsp;&nbsp;&nbsp;Ausgabe&nbsp;f&uuml;r&nbsp;jede&nbsp;Konfigurationsdatei
<BR>&nbsp;&nbsp;&nbsp;&nbsp;200&nbsp;&nbsp;&nbsp;Umfangreiche&nbsp;Ausgabe&nbsp;f&uuml;r&nbsp;jede&nbsp;Konfigurationsdatei
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;40&nbsp;&nbsp;&nbsp;Abh&auml;ngigkeiten&nbsp;und&nbsp;Konflikte
<BR>&nbsp;&nbsp;&nbsp;&nbsp;400&nbsp;&nbsp;&nbsp;Umfangreiche&nbsp;Abh&auml;ngigkeiten/Konflikte-Ausgabe
<BR>&nbsp;&nbsp;10000&nbsp;&nbsp;&nbsp;Trigger-Aktivierung&nbsp;und&nbsp;-Verarbeitung
<BR>&nbsp;&nbsp;20000&nbsp;&nbsp;&nbsp;Umfangreiche&nbsp;Ausgabe&nbsp;bez&uuml;glich&nbsp;Trigger
<BR>&nbsp;&nbsp;40000&nbsp;&nbsp;&nbsp;Alberne&nbsp;Menge&nbsp;an&nbsp;Ausgabe&nbsp;bez&uuml;glich&nbsp;Trigger
<BR>&nbsp;&nbsp;&nbsp;1000&nbsp;&nbsp;&nbsp;Umfangreiches&nbsp;Gelaber&nbsp;beispielsweise&nbsp;&uuml;ber&nbsp;das&nbsp;dpkg/info-Verzeichnis
<BR>&nbsp;&nbsp;&nbsp;2000&nbsp;&nbsp;&nbsp;Verr&uuml;ckte&nbsp;Mengen&nbsp;an&nbsp;Gelaber
<DT id="65"><B>--force-</B><I>Sachen</I><DD>

<B>--no-force-</B><I>Sachen</I>, <B>--refuse-</B><I>Sachen</I>
Erzwinge oder verweigere (<B>no-force</B> und <B>refuse</B> bedeuten das gleiche)
bestimmte Sachen. <I>Sachen</I> ist eine Komma-separierte Liste von Dingen, die
im folgenden beschrieben sind. <B>--force-help</B> zeigt eine Nachricht an, die
diese beschreibt. Mit (*) markierte Dinge werden standardm&auml;&szlig;ig erzwungen.
<P>
<I>Warnung. Diese Optionen sind haupts&auml;chlich f&uuml;r den Einsatz durch Experten
gedacht. Der Einsatz ohne komplettes Verst&auml;ndnis der Effekte kann Ihr
gesamtes System zerst&ouml;ren.</I>
<P>
<B>all</B>: Schaltet alle &raquo;force&laquo;-Optionen ein (oder aus).
<P>
<B>downgrade</B>(*): Installiere ein Paket, selbst wenn eine neuere Version
davon bereits installiert ist.
<P>
<I>Warnung: Derzeit f&uuml;hrt </I><B>dpkg</B><I> keine Abh&auml;ngigkeits&uuml;berpr&uuml;fung bei der
Installation &auml;lterer Versionen (als bereits installiert) durch
(sog. Downgrade) und wird Sie daher nicht warnen, falls dadurch die
Abh&auml;ngigkeit eines anderen Pakets nicht mehr erf&uuml;llt ist. Dies kann
ernsthafte Seiteneffekte haben, ein Downgrade einer essenziellen
Systemkomponente kann Ihr gesamtes System unbrauchbar machen. Verwenden Sie
diese Option mit Vorsicht.</I>
<P>
<B>configure-any</B>: Konfiguriere auch jedes entpackte, aber unkonfigurierte
Paket von dem das aktuelle Paket abh&auml;ngt.
<P>
<B>hold</B>: Verarbeite auch Pakete, die mit Bqhalten" markiert sind.
<P>
<B>remove-reinstreq</B>: Entferne ein Paket, selbst falls es defekt ist und zur
Neuinstallation markiert ist. Dies kann beispielsweise dazu f&uuml;hren, dass
Teile des Pakets auf dem System bleiben und von <B>dpkg</B> vergessen werden.
<P>
<B>remove-essential</B>: Entferne, selbst falls das Paket als essenziell
betrachtet wird. Essenzielle Pakete enthalten haupts&auml;chlich sehr
grundlegende Unix-Befehle. Diese zu entfernen kann dazu f&uuml;hren, dass das
gesamte System nicht mehr arbeitet - verwenden Sie diese Option daher mit
Vorsicht.
<P>
<B>depends</B>: Verwandle alle Abh&auml;ngigkeitsprobleme in Warnungen. Dies betrifft
die Felder <B>Pre-Depends</B> und <B>Depends</B>.
<P>
<B>depends-version</B>: Ignoriere Versionen bei der Pr&uuml;fung von
Abh&auml;ngigkeiten. Dies betrifft die Felder <B>Pre-Depends</B> und <B>Depends</B>.
<P>
<B>breaks</B>: Installiere, selbst falls dies ein anderes Paket besch&auml;digt (seit
Dpkg 1.14.6). Dies betrifft das Feld <B>Breaks</B>.
<P>
<B>conflicts</B>: Installiere, selbst wenn es mit einem anderen Paket in
Konflikt steht. Dies ist gef&auml;hrlich, da dies gew&ouml;hnlich dazu f&uuml;hrt, dass
einige Dateien &uuml;berschrieben werden. Dies betrifft das Feld <B>Conflicts</B>.
<P>
<B>confmiss</B>: Installiere das fehlende Conffile immer ohne R&uuml;ckfrage. Dies
ist gef&auml;hrlich, da es bedeutet, dass eine &Auml;nderung (die Entfernung) an der
Datei nicht erhalten wird.
<P>
<B>confnew</B>: Falls eine Conffile modifiziert wurde und sich die Version im
Paket ge&auml;ndert hat, installiere immer die neue Version ohne R&uuml;ckfrage, es
sei denn, <B>--force-confdef</B> ist ebenfalls angegeben, in welchem Falle die
Standardaktion bevorzugt wird.
<P>
<B>confold</B>: Falls eine Conffile modifiziert wurde und sich die Version im
Paket ge&auml;ndert hat, behalte immer die alte Version ohne R&uuml;ckfrage, es sei
denn, <B>--force-confdef</B> ist ebenfalls angegeben, in welchem Falle die
Standardaktion bevorzugt wird.
<P>
<B>confdef</B>: Falls eine Conffile ver&auml;ndert wurde und sich die Version im
Paket ge&auml;ndert hat, w&auml;hle immer die Standardaktion ohne R&uuml;ckfrage. Falls es
keine Standardaktion gibt, halte an, um den Benutzer zu fragen, es sei denn,
<B>--force-confnew</B> oder <B>--force-confold</B> sind ebenfalls angegeben, in
welchem Falle dies verwendet wird, um die letztendliche Aktion zu bestimmen.
<P>
<B>confask</B>: Falls eine Conffile ver&auml;ndert wurde, biete immer an, sie durch
die Version aus dem Paket zu ersetzen, selbst falls sich die Version in dem
Paket nicht ge&auml;ndert hat (seit Dpkg 1.15.8). Falls auch einer von
<B>--force-confnew</B>, <B>--force-confold</B> oder <B>--force-confdef</B> angegeben
wird, wird sie dazu verwandt, die letztendliche Aktion zu ermitteln.
<P>
<B>overwrite</B>: &Uuml;berschreibe die Datei aus einem Paket mit einer Datei aus
einem anderen Paket.
<P>
<B>overwrite-dir</B>: &Uuml;berschreibe das Verzeichnis aus einem Paket mit einer
Datei aus einem anderen Paket.
<P>
<B>overwrite-diverted</B>: &Uuml;berschreibe eine umgeleitete (&raquo;diverted&laquo;) Datei mit
einer nicht umgeleiteten.
<P>
<B>statoverride-add</B>: &Uuml;berschreibt eine existierende Status-Hinwegsetzung
beim Hinzuf&uuml;gen (seit Dpkg 1.19.5).
<P>
<B>statoverride-remove</B>: Ignoriert eine fehlende Status-Hinwegsetzung beim
Entfernen (seit Dpkg 1.19.5).
<P>
<B>security-mac</B>(*): Verwendet plattformspezifische &raquo;Mandatory Access Control
(MAC)&laquo;-basierende Sicherheit bei der Installation von Dateien in das
Dateisystem (seit Dpkg 1.19.5). Auf Linux-Systemen verwendet die
Implementierung SELinux.
<P>
<B>unsafe-io</B>: Beim Entpacken keine sicheren E/A-Operationen durchf&uuml;hren
(seit Dpkg 1.15.8.6). Derzeit impliziert dies, dass vor Dateiumbenennungen
kein Systemsync durchgef&uuml;hrt wird. Dieser Sync f&uuml;hrt bei einigen
Dateisystemen zu erheblichen Leistungseinbu&szlig;en, ungl&uuml;cklicherweise bei
solchen, die &uuml;berhaupt sichere E/A aufgrund ihres unzuverl&auml;ssigen Verhaltens
ben&ouml;tigen, auf denen bei abrupten Systemabst&uuml;rzen Dateien der L&auml;nge Null
entstehen k&ouml;nnen.
<P>
<I>Hinweis:</I> F&uuml;r den Hauptmisst&auml;ter Ext4 sollten Sie stattdessen die
Einh&auml;ngeoption <B>nodelalloc</B> verwenden, die sowohl die Leistungseinbu&szlig;e
verhindert als auch Datensicherheitsprobleme vermeidet. Letzteres bedeutet,
dass bei abrupten Systemabst&uuml;rzen bei jeder Software, die keine Syncs vor
atomaren Umbenennungen durchf&uuml;hrt, keine Dateien der L&auml;nge Null generiert
werden.
<P>
<I>Warnung: Die Verwendung dieser Option kann die Leistung erh&ouml;hen,
allerdings k&ouml;nnen dabei Daten verloren gehen. Verwenden Sie die Option
vorsichtig.</I>
<P>
<B>script-chrootless</B>: Skripte ausf&uuml;hren, ohne per <B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2) in das
<B>instdir</B> zu wechseln, selbst falls das Paket diese Vorgehensweise nicht
unterst&uuml;tzt (seit Dpkg 1.18.5).
<P>
<I>Warnung: Dies kann Ihr Wirtsystem besch&auml;digen, passen Sie sehr gut auf!</I>
<P>
<B>architecture</B>: Verarbeite sogar Pakete mit der falschen oder keiner
Architektur.
<P>
<B>bad-version</B>: Verarbeite sogar Pakete mit falschen Versionen (seit Dpkg
1.16.1).
<P>
<B>bad-path</B>: Im <B>PATH</B> fehlen wichtige Programme, daher sind Probleme
wahrscheinlich.
<P>
<B>not-root</B>: Versuche Sachen zu (de)installieren, selbst falls nicht root.
<P>
<B>bad-verify</B>: Installiere ein Paket selbst wenn die Authentizit&auml;tspr&uuml;fung
fehlschl&auml;gt.
<P>
<DT id="66"><B>--ignore-depends</B>=<I>Paket</I>, …<DD>
Ignoriere Abh&auml;ngigkeits&uuml;berpr&uuml;fungen f&uuml;r bestimmte Pakete (tats&auml;chlich wird
die &Uuml;berpr&uuml;fung durchgef&uuml;hrt, aber nur Warnungen &uuml;ber Konflikte werden
angezeigt, sonst nichts). Dies betrifft die Felder <B>Pre-Depends</B>,
<B>Depends</B> und <B>Breaks</B>.
<DT id="67"><B>--no-act</B>, <B>--dry-run</B>, <B>--simulate</B><DD>
Erledige alles, was gemacht werden soll, aber schreibe keine
&Auml;nderungen. Dies wird verwendet um zu sehen, was mit der spezifizierten
&Auml;nderung passieren w&uuml;rde ohne tats&auml;chlich etwas zu modifizieren.
<P>
Stellen Sie sicher, dass <B>--no-act</B> vor dem Aktions-Parameter steht, oder
Sie k&ouml;nnten mit unerw&uuml;nschten Ergebnissen enden. (Beispielsweise wird <B>dpkg
--purge foo --no-act</B> zuerst das Paket foo bereinigen und dann versuchen,
das Paket --no-act zu bereinigen, obwohl Sie wahrscheinlich davon ausgingen,
dass tats&auml;chlich gar nichts passieren sollte)
<DT id="68"><B>-R</B>, <B>--recursive</B><DD>
Behandle rekursiv alle regul&auml;ren Dateien, die auf das Muster <B>*.deb</B> passen
und im angegeben Verzeichnis sowie allen Unterverzeichnis liegen. Dies kann
mit den Aktionen <B>-i</B>, <B>-A</B>, <B>--install</B>, <B>--unpack</B> und
<B>--record-avail</B> verwendet werden.
<DT id="69"><B>-G</B><DD>
Installiere ein Paket nicht, falls bereits eine neuere Version des gleichen
Paketes installiert ist. Dies ist ein Alias f&uuml;r <B>--refuse-downgrade</B>.
<DT id="70"><B>--admindir=</B><I>Verz</I><DD>
Setzt das Standardadministrationsverzeichnis auf <I>Verzeichnis</I>. Diess
Verzeichnis enth&auml;lt viele Dateien, die Informationen &uuml;ber den Status von
installierten und deinstallierten Paketen usw. enthalten. Standardm&auml;&szlig;ig
Bq<I>/var/lib/dpkg</I>".
<DT id="71"><B>--instdir=</B><I>Verz</I><DD>
Setzt das voreingestellte Installationsverzeichnis. Dieses Verzeichnis gibt
an, wo Pakete installiert werden. <B>instdir</B> ist auch das Verzeichnis, das
an <B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2) vor dem Aufruf der Installationsskripte des Paketes
&uuml;bergeben wird, was bedeutet, dass die Skripte <B>instdir</B> als ein
Wurzelverzeichnis sehen. Standardm&auml;&szlig;ig Bq<I>/</I>".
<DT id="72"><B>-root=</B><I>Verz</I><DD>
Setzt das Wurzelverzeichnis auf <I>Verzeichnis</I>, wodurch das
Installationsverzeichnis auf Bq<I>Verz</I>" und das administrative Verzeichnis
auf Bq<I>Verz</I><B>/var/lib/dpkg</B>" gesetzt wird.
<DT id="73"><B>-O</B>, <B>--selected-only</B><DD>
Bearbeite nur die Pakete, die zur Installation ausgew&auml;hlt sind. Die
eigentliche Markierung erfolgt mit <B>dselect</B> oder durch <B>dpkg</B>, wenn es
Pakete bearbeitet. Beispielsweise wird ein Paket bei der Entfernung als &raquo;zur
Deinstallation ausgew&auml;hlt&laquo; markiert.
<DT id="74"><B>-E</B>, <B>--skip-same-version</B><DD>
Installiere das Paket nicht, falls die gleiche Version des Pakets bereits
installiert ist.
<DT id="75"><B>--pre-invoke=</B><I>Befehl</I><DD>

<B>--post-invoke=</B><I>Befehl</I>
Setzt einen Aufruf-Hook <I>Befehl</I>, der via &raquo;sh -c&laquo; vor oder nach dem
<B>dpkg</B>-Aufruf der <B>dpkg</B>-Aktionen <I>unpack</I>, <I>configure</I>, <I>install</I>,
<I>triggers-only</I>, <I>remove</I>, <I>purge</I>, <I>add-architecture</I> und
<I>remove-architecture</I> ausgef&uuml;hrt wird (seit Dpkg 1.15.4; Aktionen
<I>add-architecture</I> und <I>remove-architecture</I> seit Dpkg 1.17.19). Diese
Option kann mehrfach angegeben werden. Die Reihenfolge der Optionen wird
erhalten, wobei Eintr&auml;ge aus den Konfigurationsdateien Vorrang
einnehmen. Die Umgebungsvariable <B>DPKG_HOOK_ACTION</B> wird f&uuml;r die Hooks auf
die aktuelle <B>dpkg</B>-Aktion gesetzt. Hinweis: Oberfl&auml;chen k&ouml;nnten <B>dpkg</B>
mehrere Male pro Ausf&uuml;hrung aufrufen, wodurch die Hooks &ouml;fter als erwartet
ausgef&uuml;hrt werden k&ouml;nnten.
<DT id="76"><B>--path-exclude=</B><I>Glob-Muster</I><DD>

<B>--path-include=</B><I>Glob-Muster</I>
Setzt <I>Glob-Muster</I> als Pfadfilter, entweder durch Ausschluss oder durch
Wiedereinschluss vorher ausgeschlossener Pfade, die w&auml;hrend der Installation
auf bestimmte Muster passen (seit Dpkg 1.15.8).
<P>
<I>Warnung: Beachten Sie, dass abh&auml;ngig von den ausgeschlossenen Pfaden Sie
Ihr System komplett besch&auml;digen k&ouml;nnten. Verwenden Sie dies daher
vorsichtig.</I>
<P>
Das Glob-Muster kann die gleichen Platzhalter wie in der Shell verwenden,
wobei bq*' auf eine beliebige Folge von Zeichen, auch dem Leerzeichen und
bq/', passt. Beispielsweise passt Bq<I>/usr/*/READ*</I>" auf
Bq<I>/usr/share/doc/package/README</I>". Wie gew&ouml;hnlich passt bq?' auf ein
einzelnes Zeichen (wieder auch auf bq/'). Und bq[' beginnt eine Zeichenklasse,
die eine Liste von Zeichen, Bereiche und Komplemente enthalten kann. Lesen
Sie <B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7) f&uuml;r detaillierte Informationen &uuml;ber das Globben. Hinweis:
Aktuelle Implementierungen k&ouml;nnten mehr Verzeichnisse und symbolische Links
als ben&ouml;tigt wieder einschlie&szlig;en. Um auf der sicheren Seite zu sein und in
der Zukunft m&ouml;gliche Entpackfehler zu vermeiden, k&ouml;nnte dies durch
zuk&uuml;nftige Arbeiten behoben werden.
<P>
Dies kann dazu verwandt werden, alle Pfade au&szlig;er bestimmten zu entferen, ein
typischer Fall lautet:
<P>
<PRE>
<B>--path-exclude=/usr/share/doc/*</B>
<B>--path-include=/usr/share/doc/*/copyright</B>
</PRE>

<P>
Hiermit werden alle Dokumentationsdateien (au&szlig;er den Copyright-Dateien)
entfernt.
<P>
Diese zwei Optionen k&ouml;nnen mehrfach angegeben und miteinander verschachtelt
werden. Beide werden in der angegebenen Reihenfolge ausgewertet, wobei die
letzte Regel, die auf eine Datei passt, die Entscheidung f&auml;llt.
<P>
Die Filter werden beim Entpacken des Bin&auml;rpakets angewandt und haben daher
nur Wissen &uuml;ber den Typ des derzeit gefilterten Objekts (d.h. eine normale
Datei oder ein Verzeichnis) und sehen daher nicht, welche Objekte als
n&auml;chstes kommen. Da diese Filter Seiteneffekte haben (im Gegensatz zu
<B><A HREF="/cgi-bin/man/man2html?1+find">find</A></B>(1)-Filtern) wird das Ausschlie&szlig;en eines genauen Pfadnamens, der ein
Verzeichnisobjekt wie <I>/usr/share/doc</I> ist, nicht den gew&uuml;nschten Effekt
haben und nur der Pfadname wird ausgeschlossen (der automatisch wieder
eingeschlossen werden k&ouml;nnte, falls der Code eine Notwendigkeit hierf&uuml;r
sieht). Alle folgenden Dateien innerhalb des Verzeichnisses werden beim
Entpacken fehlschlagen.
<P>
Tipp: Stellen Sie sicher, dass die Metazeichen nicht durch Ihre Shell
expandiert werden.
<DT id="77"><B>--verify-format=</B><I>Formatname</I><DD>
Setzt das Ausgabeformat f&uuml;r den Befehl <B>--verify</B> (seit Dpkg 1.17.2).
<P>
Derzeit wird nur das Ausgabeformat <B>rpm</B> unterst&uuml;tzt. Es besteht aus einer
Zeile f&uuml;r jeden Pfad, der bei der Pr&uuml;fung fehlschlug. Die Zeilen starten mit
9 Zeichen, um die Ergebnisse jeder angegebenen Pr&uuml;fung zu berichten. Ein
bq<B>?</B>' impliziert, dass die Pr&uuml;fung nicht durchgef&uuml;hrt werden konnte (keine
Unterst&uuml;tzung daf&uuml;r, Dateirechte usw.). bq<B>.</B>' impliziert, dass die Pr&uuml;fung
erfolgreich durchgef&uuml;hrt wurde und ein alphanumerisches Zeichen impliziert,
dass eine angegebene Pr&uuml;fung fehlschlug. Der Md5sum-&Uuml;berpr&uuml;fungsfehlschlag
(die Dateiinhalte haben sich ge&auml;ndert) wird durch ein bq<B>5</B>' als drittes
Zeichen angezeigt. Der Zeile folgt ein Leerzeichen und ein Attributszeichen
(derzeit bq<B>c</B>' f&uuml;r Conffiles), ein weiteres Leerzeichen und der Pfadnmae.
<DT id="78"><B>--status-fd </B><I>n</I><DD>
Schicke maschinenlesbare Paketstatus- und Fortschrittsinformationen an den
Dateideskriptor <I>n</I>. Diese Option kann mehrfach angegeben werden. Die
Information besteht typischerweise aus einem Datensatz pro Zeile in
folgendem Format:
<DL COMPACT><DT id="79"><DD>
<DL COMPACT>
<DT id="80"><B>status: </B><I>Paket</I><B>: </B><I>Status</I><DD>
Paketstatus ge&auml;ndert; <I>Status</I> entsprechend der Statusdatei.
<DT id="81"><B>status: </B><I>Paket</I><B> : error : </B><I>ausf&uuml;hrliche-Fehlermeldung</I><DD>
Ein Fehler ist aufgetreten. Alle m&ouml;glichen Zeilenumbr&uuml;che in
<I>ausf&uuml;hrliche-Fehlermeldung</I> werden vor der Ausgabe in Leerzeichen
gewandelt.
<DT id="82"><B>status: </B><I>Datei</I><B> : conffile-prompt : &raquo;</B><I>echt-alt</I><B>&laquo; &raquo;</B><I>echt-neu</I><B>&laquo; </B><I>benutzer-edit</I><B> </B><I>dist-edit</I><DD>
Dem Benutzer wird eine Conffile-Frage gestellt.
<DT id="83"><B>processing: </B><I>Stufe</I><B>: </B><I>Paket</I><DD>
Versandt genau bevor eine Verarbeitungsstufe beginnt. <I>Stufe</I> ist eine der
folgenden: <B>upgrade</B>, <B>install</B> (beide werden vor dem Entpacken versandt),
<B>configure</B>, <B>trigproc</B>, <B>disappear</B>, <B>remove</B>, <B>purge</B>.
</DL>
</DL>

<DT id="84"><B>--status-logger</B>=<I>Befehl</I><DD>
Schicke maschinenlesbare Paketstatus- und Fortschrittsinformationen an die
Standardeingabe des <I>Befehl</I>s der Shell, was dann mittels &raquo;sh -c&laquo;
ausgef&uuml;hrt wird (seit Dpkg 1.16.0). Diese Option kann mehrfach angegeben
werden. Das verwandte Ausgabeformat ist identisch zu dem in <B>--status-fd</B>.
<DT id="85"><B>--log=</B><I>Dateiname</I><DD>
Protokolliere Status&auml;nderungen und -aktionen in <I>Dateiname</I> statt zu dem
standardm&auml;&szlig;igen <I>/var/log/dpkg.log</I>. Falls diese Option mehrfach angegeben
ist, wird der letzte Dateiname verwandt. Protokollnachrichten haben die
Form:
<DL COMPACT><DT id="86"><DD>
<DL COMPACT>
<DT id="87">YYYY-MM-DD HH:MM:SS <B>startup</B> <I>Typ</I> <I>Befehl</I><DD>
F&uuml;r jeden Dpkg-Aufruf, wobei <I>Typ</I> entweder <B>archives</B> (mit einem
<I>Befehl</I> <B>unpack</B> oder <B>install</B>) oder <B>packages</B> (mit einem <I>Befehl</I>
<B>configure</B>, <B>triggers-only</B>, <B>remove</B> oder <B>purge</B>) ist.
<DT id="88">YYYY-MM-DD HH:MM:SS <B>status</B> <I>Zustand</I> <I>Pkt</I> <I>installierte_Version</I><DD>
F&uuml;r Statusaktualisierungen.
<DT id="89">YYYY-MM-DD HH:MM:SS <I>Aktion</I> <I>Pkt</I> <I>installierte_Version</I> <I>verf&uuml;gbar_Version</I><DD>
F&uuml;r Aktionen, wobei <I>Aktion</I> einer aus <B>install</B>, <B>upgrade</B>,
<B>configure</B>, <B>trigproc</B>, <B>disappear</B>, <B>remove</B> oder <B>purge</B> ist.
<DT id="90">YYYY-MM-DD HH:MM:SS <B>conffile</B> <I>Dateiname</I> <I>Entscheidung</I><DD>
F&uuml;r Conffile-&Auml;nderungen, wobei <I>Entscheidung</I> entweder <B>install</B> oder
<B>keep</B> ist.
</DL>
</DL>

<DT id="91"><B>--no-pager</B><DD>
Deaktiviert die Verwendung jeglichen Pagers bei der Anzeige von
Informationen (seit Dpkg 1.19.2).
<DT id="92"><B>--no-debsig</B><DD>
Versuche nicht, Paketsignaturen zu &uuml;berpr&uuml;fen.
<DT id="93"><B>--no-triggers</B><DD>
F&uuml;hre keine Trigger in diesem Durchlauf aus (seit Dpkg
1.14.17). Aktivierungen werden aber dennoch aufgezeichnet. Falls dies mit
<B>--configure</B> <I>Paket</I> oder <B>--triggers-only</B> <I>Paket</I> verwandt wird, wird
das Postinst des benannten Pakets dennoch ausgef&uuml;hrt, selbst falls nur ein
Trigger-Lauf notwendig ist. Die Verwendung dieser Option kann Pakete in die
unzul&auml;ssigen Stati <B>triggers-awaited</B> und <B>triggers-pending</B>
bringen. Durch die Ausf&uuml;hrung von &raquo;<B>dpkg --configure --pending</B>&laquo; kann dies
sp&auml;ter behoben werden.
<DT id="94"><B>--triggers</B><DD>
Annulliert ein vorheriges <B>--no-triggers</B> (seit Dpkg 1.14.17).
</DL>
<A NAME="lbAL">&nbsp;</A>
<H2>R&Uuml;CKGABEWERT</H2>

<DL COMPACT>
<DT id="95"><B>0</B><DD>
Die angeforderte Aktion wurde erfolgreich ausgef&uuml;hrt. Oder ein Pr&uuml;fausdruck
oder eine Zusicherung (Assertion) lieferte Wahr zur&uuml;ck.
<DT id="96"><B>1</B><DD>
Ein Pr&uuml;fausdruck oder eine Zusicherung lieferte Falsch zur&uuml;ck.
<DT id="97"><B>2</B><DD>
Fataler oder nicht behebbarer Fehler aufgrund ung&uuml;ltiger
Befehlszeilenverwendung oder Interaktionen mit dem System, wie Zugriffe auf
die Datenbank, Speicherzuweisungen usw.
</DL>
<A NAME="lbAM">&nbsp;</A>
<H2>UMGEBUNG</H2>

<A NAME="lbAN">&nbsp;</A>
<H3>Externe Umgebung</H3>

<DL COMPACT>
<DT id="98"><B>PATH</B><DD>
Es wird erwartet, dass diese Variable in der Umgebung gesetzt ist und auf
die Systempfade zeigt, in denen eine Reihe von ben&ouml;tigten Programmen
gefunden werden k&ouml;nnen. Falls sie nicht gesetzt ist oder die Programme nicht
gefunden werden k&ouml;nnen, wird <B>dpkg</B> die Bearbeitung abbrechen.
<DT id="99"><B>HOME</B><DD>
Falls gesetzt, wird <B>dpkg</B> es als das Verzeichnis verwenden, aus dem die
benutzerspezifische Konfigurationsdatei gelesen wird.
<DT id="100"><B>TMPDIR</B><DD>
Falls gesetzt, wird <B>dpkg</B> es als das Verzeichnis verwenden, in dem
tempor&auml;re Dateien und Verzeichnisse erstellt werden.
<DT id="101"><B>SHELL</B><DD>
Das Programm, das <B>dpkg</B> ausf&uuml;hren wird, wenn es eine neue interaktive
Shell startet oder einen Befehl &uuml;ber eine Shell ausf&uuml;hrt.
<DT id="102"><B>PAGER</B><DD>

<B>DPKG_PAGER</B>
Das Programm, das <B>dpkg</B> ausf&uuml;hren wird, wenn es einen Pager ausf&uuml;hrt,
beispielsweise zur Anzeige von Conffile-Dateiunterschieden. Falls <B>SHELL</B>
nicht gesetzt ist, wird stattdessen Bq<B>sh</B>" verwandt. <B>DPKG_PAGER</B> setzt
die Umgebungsvariable <B>PAGER</B> au&szlig;er Kraft (seit Dpkg 1.19.2).
<DT id="103"><B>DPKG_COLORS</B><DD>
Setzt den Farbmodus (seit Dpkg 1.18.5). Die derzeit unterst&uuml;tzten Werte
sind: <B>auto</B> (Vorgabe), <B>always</B> und <B>never</B>.
<DT id="104"><B>DPKG_FORCE</B><DD>
Setzt die Erzwingungsschalter (seit Dpkg 1.19.5). Wenn diese Variable
vorhanden ist, werden keine eingebauten Vorgaben f&uuml;r Erzwingungen
angewandt. Falls diese Variable vorhanden aber leer ist, werden alle
Erzwingungsschalter deaktiviert.
<DT id="105"><B>DPKG_FRONTEND_LOCKED</B><DD>
Wird von einer Paketverwalterprogrammoberfl&auml;che gesetzt, um Dpkg zu
informieren, dass es nicht die Sperre der Oberfl&auml;che erlangen soll (seit
Dpkg 1.19.1).
</DL>
<A NAME="lbAO">&nbsp;</A>
<H3>Interne Umgebung</H3>

<DL COMPACT>
<DT id="106"><B>LESS</B><DD>
Von <B>dpkg</B> auf &raquo;<B>-FRSXMQ</B>&laquo; definiert, falls es nicht bereits gesetzt ist
oder wenn ein Pager gestartet wird (seit Dpkg 1.19.2). Um das
Vorgabeverhalten zu ver&auml;ndern, kann diese Variable auf einen anderen Wert
einschlie&szlig;lich der leeren Zeichenkette voreingestellt werden oder die
Variablen <B>PAGER</B> oder <B>DPKG_PAGER</B> k&ouml;nnen gesetzt werden, um bestimmte
Optionen mit Bq<B>-+</B>" zu deaktivieren, beispielsweise <B>DPKG_PAGER=&quot;less
-+F&quot;</B>.
<DT id="107"><B>DPKG_ROOT</B><DD>
Durch <B>dpkg</B> in der Betreuerskriptumgebung definiert, um anzuzeigen, auf
welche Installation gehandelt werden soll (seit Dpkg 1.18.5). Der Wert soll
jedem Pfad, auf den Betreuerskripte handeln, vorangestellt werden. W&auml;hrend
des Normalbetriebs ist diese Variable leer. Bei der Installation von Paketen
in ein anderes <B>instdir</B> wird <B>dpkg</B> normalerweise Betreuerskripte mittels
<B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2) aufrufen und diese Variable leer lassen. Falls aber
<B>--force-script-chrootless</B> angegeben ist, wird dieser <B><A HREF="/cgi-bin/man/man2html?2+chroot">chroot</A></B>(2)-Aufruf
&uuml;bersprungen und <B>instdir</B> ist nicht leer.
<DT id="108"><B>DPKG_ADMINDIR</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung gesetzt, um das zu
verwendende administrative Verzeichnis von <B>dpkg</B> anzuzeigen (seit Dpkg
1.16.0). Diese Variable wird immer auf den aktuellen Wert von <B>--admindir</B>
gesetzt.
<DT id="109"><B>DPKG_FORCE</B><DD>
Wird von <B>dpkg</B> f&uuml;r alle Unterprozessumgebungen auf alle aktuell
aktivierten Erzwingungsoptionennamen (getrennt durch Kommata) gesetzt (seit
Dpkg 1.19.5).
<DT id="110"><B>DPKG_SHELL_REASON</B><DD>
Wird von <B>dpkg</B> auf der Shell, die von der Conffile-Eingabeaufforderung
gestartet wird, um die Situation zu analysieren, gesetzt (seit Dpkg
1.15.6). Derzeit g&uuml;ltiger Wert: <B>conffile-prompt</B>.
<DT id="111"><B>DPKG_CONFFILE_OLD</B><DD>
Wird von <B>dpkg</B> auf der Shell, die von der Conffile-Eingabeaufforderung
gestartet wird, um die Situation zu analysieren, gesetzt (seit Dpkg
1.15.6). Enth&auml;lt den Pfad zu der alten Conffile.
<DT id="112"><B>DPKG_CONFFILE_NEW</B><DD>
Wird von <B>dpkg</B> auf der Shell, die von der Conffile-Eingabeaufforderung
gestartet wird, um die Situation zu analysieren, gesetzt (seit Dpkg
1.15.6). Enth&auml;lt den Pfad zu der neuen Conffile.
<DT id="113"><B>DPKG_HOOK_ACTION</B><DD>
Wird von <B>dpkg</B> auf der Shell, die beim Ausf&uuml;hren von Hook-Aktionen
gestartet wird, gesetzt (seit Dpkg 1.15.4). Enth&auml;lt die aktuelle
<B>dpkg</B>-Aktion.
<DT id="114"><B>DPKG_RUNNING_VERSION</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung auf die Version der
aktuell laufenden Instanz von <B>dpkg</B> gesetzt (seit Dpkg 1.14.17).
<DT id="115"><B>DPKG_MAINTSCRIPT_PACKAGE</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung auf den in Arbeit
befindlichen (nicht architekturspezifizierte) Paketnamen gesetzt (seit Dpkg
1.14.17).
<DT id="116"><B>DPKG_MAINTSCRIPT_PACKAGE_REFCOUNT</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung auf die Paketreferenzzahl
gesetzt, d.h. die Anzahl der Paketinstanzen mit einem Status gr&ouml;&szlig;er als
<B>not-installed</B> (seit Dpkg 1.17.2).
<DT id="117"><B>DPKG_MAINTSCRIPT_ARCH</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung auf die Architektur
gesetzt, f&uuml;r die das Paket gebaut wurde (seit Dpkg 1.15.4).
<DT id="118"><B>DPKG_MAINTSCRIPT_NAME</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung auf den Namen des
laufenden Skripts, eines von <B>preinst</B>, <B>postinst</B>, <B>prerm</B> oder
<B>postrm</B> (seit Dpkg 1.15.7).
<DT id="119"><B>DPKG_MAINTSCRIPT_DEBUG</B><DD>
Wird von <B>dpkg</B> f&uuml;r die Betreuer-Skript-Umgebung auf einen Wert (bq<B>0</B>'
oder bq<B>1</B>') gesetzt, der angibt, ob die Fehlersuche (mit der Option
<B>--debug</B>) f&uuml;r die Betreuerskripte angefordert wurde (seit Dpkg 1.18.4).
</DL>
<A NAME="lbAP">&nbsp;</A>
<H2>DATEIEN</H2>

<DL COMPACT>
<DT id="120"><I>/etc/dpkg/dpkg.cfg.d/[0-9a-zA-Z_-]*</I><DD>
Konfigurationsfragmentdateien (seit Dpkg 1.15.4).
<DT id="121"><I>/etc/dpkg/dpkg.cfg</I><DD>
Konfigurationsdatei mit Standardeinstellungen der Optionen.
<DT id="122"><I>/var/log/dpkg.log</I><DD>
Standard-Protokolldatei (lesen Sie <I>/etc/dpkg/dpkg.cfg</I> und die Option
<B>--log</B>).
</DL>
<P>

Die anderen unten aufgef&uuml;hrten Dateien sind in ihrem Standardverzeichnis,
lesen Sie den Text zur Option <B>--admindir</B> um zu sehen, wie sie den Ort
dieser Dateien &auml;ndern k&ouml;nnen.
<DL COMPACT>
<DT id="123"><I>/var/lib/dpkg/available</I><DD>
Liste der verf&uuml;gbaren Pakete.
<DT id="124"><I>/var/lib/dpkg/status</I><DD>
Statusse der verf&uuml;gbaren Pakete. Diese Datei enth&auml;lt Informationen dar&uuml;ber,
ob ein Paket zur Entfernung markiert ist oder nicht, ob es installiert ist
oder nicht usw. Lesen Sie den Abschnitt <B>INFORMATIONEN &Uuml;BER PAKETE</B> f&uuml;r
weitere Informationen.
<P>
Die Statusdatei wird t&auml;glich nach <I>/var/backups</I> gesichert. Dies kann
hilfreich sein, falls sie aufgrund von Problemen mit dem Dateisystem
verloren gegangen oder besch&auml;digt worden ist.
</DL>
<P>

Das Format und die Inhalte eines Bin&auml;rpakets sind in <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5) beschrieben.
<A NAME="lbAQ">&nbsp;</A>
<H2>FEHLER</H2>

<B>--no-act</B> gibt gew&ouml;hnlich weniger Informationen als hilfreich sein
k&ouml;nnten.
<A NAME="lbAR">&nbsp;</A>
<H2>BEISPIELE</H2>

Um die installierten Pakete mit Bezug zum Editor <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1) aufzulisten
(beachten Sie, dass <B>dpkg-query</B> nicht mehr standardm&auml;&szlig;ig die Datei
<I>available</I> l&auml;dt und stattdessen daf&uuml;r die Option <B>dpkg-query</B>
<B>--load-avail</B> verwandt werden sollte):
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;-l&nbsp;'*vi*'</B>
<BR>

<P>
Um die Eintr&auml;ge von zwei Paketen in <I>/var/lib/dpkg/available</I> zu sehen:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--print-avail&nbsp;elvis&nbsp;vim&nbsp;|&nbsp;less</B>
<BR>

<P>
Wenn Sie die Liste der Pakete selbst durchsuchen wollen:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>less&nbsp;/var/lib/dpkg/available</B>
<BR>

<P>
Um ein installiertes Elvis-Paket zu entfernen:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;-r&nbsp;elvis</B>
<BR>

<P>
Um ein Paket zu installieren, m&uuml;ssen Sie es erst in einem Archiv oder auf
einer CD-ROM finden. Die Datei <I>available</I> zeigt, dass das vim-Paket in der
Sektion <B>editors</B> ist:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>cd&nbsp;/media/cdrom/pool/main/v/vim</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;-i&nbsp;vim_4.5-3.deb</B>
<BR>

<P>
Um eine lokale Kopie der Paketauswahl-Zust&auml;nde zu erstellen:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--get-selections&nbsp;&gt;meine_auswahl</B>
<BR>

<P>
Sie k&ouml;nnten diese Datei auf einen anderen Rechner &uuml;bertragen und dann die
Datei <I>available</I> dort mit dem Paketverwalter Ihrer Wahl (siehe
<A HREF="https://wiki.debian.org/Teams/Dpkg/FAQ">https://wiki.debian.org/Teams/Dpkg/FAQ</A> f&uuml;r weitere Details) aktualisieren,
zum Beispiel:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>apt-cache&nbsp;dumpavail&nbsp;|&nbsp;dpkg&nbsp;--merge-avail</B>
<BR>

Oder mit Dpkg 1.17.6 oder &auml;lter:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>avail=`mktemp`</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>apt-cache&nbsp;dumpavail&nbsp;&gt;&quot;$avail&quot;</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--merge-avail&nbsp;&quot;$avail&quot;</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>rm&nbsp;&quot;$avail&quot;</B>
<BR>

Sie k&ouml;nnen sie dann wie folgt installieren:
<BR>

<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--clear-selections</B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>dpkg&nbsp;--set-selections&nbsp;&lt;meine_auswahl</B>
<BR>

<P>
Beachten Sie, dass dies nichts wirklich installiert oder entfernt, sondern
lediglich den Auswahlzustand der angeforderten Pakete setzt. Sie werden eine
andere Anwendung ben&ouml;tigen, um die angeforderten Pakete tats&auml;chlich
herunterzuladen und zu installieren. F&uuml;hren Sie beispielsweise <B>apt-get
dselect-upgrade</B> aus.
<P>
Gew&ouml;hnlich werden Sie feststellen, dass <B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1) eine bequemere Art
ist, den Paketauswahlzustand zu &auml;ndern.
<BR>

<A NAME="lbAS">&nbsp;</A>
<H2>ZUS&Auml;TZLICHE FUNKTIONALIT&Auml;T</H2>

Zus&auml;tzliche Funktionalit&auml;t kann durch die Installation jedes der folgenden
Pakete erhalten werden: <B>apt</B>, <B>aptitude</B> und <B>debsums</B>.
<A NAME="lbAT">&nbsp;</A>
<H2>SIEHE AUCH</H2>


<B><A HREF="/cgi-bin/man/man2html?1+aptitude">aptitude</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+apt">apt</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+dpkg.cfg">dpkg.cfg</A></B>(5) und <B><A HREF="/cgi-bin/man/man2html?8+dpkg-reconfigure">dpkg-reconfigure</A></B>(8).
<A NAME="lbAU">&nbsp;</A>
<H2>AUTOREN</H2>

Lesen Sie <I>/usr/share/doc/dpkg/THANKS</I> f&uuml;r die Liste der Leute, die zu <B>dpkg</B>
beigetragen haben.
<A NAME="lbAV">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="125"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="126"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="127"><A HREF="#lbAD">WARNUNG</A><DD>
<DT id="128"><A HREF="#lbAE">BESCHREIBUNG</A><DD>
<DT id="129"><A HREF="#lbAF">INFORMATIONEN &Uuml;BER PAKETE</A><DD>
<DL>
<DT id="130"><A HREF="#lbAG">Paketstatus</A><DD>
<DT id="131"><A HREF="#lbAH">Paketauswahlstatus</A><DD>
<DT id="132"><A HREF="#lbAI">Paketschalter</A><DD>
</DL>
<DT id="133"><A HREF="#lbAJ">AKTIONEN</A><DD>
<DT id="134"><A HREF="#lbAK">OPTIONEN</A><DD>
<DT id="135"><A HREF="#lbAL">R&Uuml;CKGABEWERT</A><DD>
<DT id="136"><A HREF="#lbAM">UMGEBUNG</A><DD>
<DL>
<DT id="137"><A HREF="#lbAN">Externe Umgebung</A><DD>
<DT id="138"><A HREF="#lbAO">Interne Umgebung</A><DD>
</DL>
<DT id="139"><A HREF="#lbAP">DATEIEN</A><DD>
<DT id="140"><A HREF="#lbAQ">FEHLER</A><DD>
<DT id="141"><A HREF="#lbAR">BEISPIELE</A><DD>
<DT id="142"><A HREF="#lbAS">ZUS&Auml;TZLICHE FUNKTIONALIT&Auml;T</A><DD>
<DT id="143"><A HREF="#lbAT">SIEHE AUCH</A><DD>
<DT id="144"><A HREF="#lbAU">AUTOREN</A><DD>
<DT id="145"><A HREF="#lbAV">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:56 GMT, March 31, 2021
</BODY>
</HTML>
