
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-query</TITLE>
</HEAD><BODY>
<H1>dpkg-query</H1>
Section: dpkg-Programmsammlung (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

dpkg-query - ein Werkzeug, um die dpkg-Datenbank abzufragen
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<B>dpkg-query</B> [<I>Option</I> …] <I>Befehl</I>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<B>dpkg-query</B> ist ein Werkzeug, um Informationen &uuml;ber Pakete zu zeigen, die
in der <B>dpkg</B>-Datenbank aufgef&uuml;hrt sind.
<A NAME="lbAE">&nbsp;</A>
<H2>BEFEHLE</H2>

<DL COMPACT>
<DT id="1"><B>-l</B>, <B>--list</B> [<I>Paketname-Muster</I> …]<DD>
Liste alle bekannten Pakete auf, deren Namen auf ein oder mehrere bestimmte
Muster passen, unabh&auml;ngig ihres Status, dazu geh&ouml;ren alle echten und
virtuellen Pakete, die in irgendeinem Abh&auml;ngigkeitsbeziehungsfeld (wie
<B>Breaks</B>, <B>Enhances</B> usw.) referenziert sind. Falls kein
<I>Paketname-Muster</I> angegeben ist, liste alle Pakete in <I>/var/lib/dpkg/status</I>
auf. Dabei werden alle Pakete ausgeschlossen, die als &raquo;nicht-installiert&laquo;
markiert sind (d.h. fr&uuml;her endg&uuml;ltig entfernt wurden). Normale
Shell-Jokerzeichen sind im <I>Paketname-Muster</I> erlaubt. Beachten Sie, dass
Sie wahrscheinlich <I>Paketname-Muster</I> durch Anf&uuml;hrungszeichen sch&uuml;tzen
m&uuml;ssen, um die Shell an der Dateinamen-Expansion zu hindern. Folgender
Befehl listet beispielsweise alle Paketnamen, die mit &raquo;libc6&laquo; beginnen, auf:
<P>
<PRE>
  <B>dpkg-query -l 'libc6*'</B>
</PRE>

<P>
Die ersten drei Spalten der Ausgabe zeigen die gew&uuml;nschte Aktion, den
Paketstatus und Fehler, in dieser Reihenfolge.
<P>
Gew&uuml;nschte Aktion:
<PRE>
  u = Unbekannt
  i = Installieren
  h = Halten
  r = Entfernen
  p = Vollst&auml;ndig L&ouml;schen
</PRE>

<P>
Paketstatus:
<PRE>
  n = Nicht installiert
  c = Config-Datei
  H = Halb installiert
  U = Entpackt
  F = Fehlgeschl. Konfiguration
  W = Trigger erWartet
  t = Trigger anh&auml;ngig
  i = Installiert
</PRE>

<P>
Fehler-Schalter:
<PRE>
  &lt;leer&gt; = (kein)
  R = Neuinstallation notwendig
</PRE>

<P>
Ein Gro&szlig;buchstabe als Status oder Fehler zeigt an, dass das Paket
wahrscheinlich schwere Fehler verursachen wird. Bitte lesen Sie <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
&uuml;ber die oben genannten Zust&auml;nde und Schalter.
<P>
Das Ausgabeformat dieser Option kann nicht konfiguriert werden, variiert
aber automatisch mit der Terminalbreite. Die Ausgabe ist f&uuml;r menschliche
Leser gedacht und nicht leicht maschinenlesbar. Lesen Sie &uuml;ber die Optionen
<B>-W</B> (<B>--show</B>) und <B>--showformat</B>, um das Ausgabeformat zu
konfigurieren.
<DT id="2"><B>-W</B>, <B>--show</B> [<I>Paketname-Muster</I> …]<DD>
Genau wie die <B>--list</B>-Option wird dies alle Pakete, die auf das angegebene
Muster passen, auff&uuml;hren. Allerdings kann die Ausgabe mit der
<B>--showformat</B>-Option angepasst werden. Im Standardausgabeformat wird eine
Zeile pro passendem Paket ausgegeben, wobei in jeder Zeile Name (erweitert
mit der Architektur-Spezifizierung f&uuml;r <B>Multi-Arch</B>-<B>same</B>-Pakete) und
installierte Version des Pakets getrennt durch einen Tabulator enthalten
sind.
<DT id="3"><B>-s</B>, <B>--status</B> [<I>Paketname</I> …]<DD>
Berichte Zustand des angegebenen Paketes. Dies zeigt nur den Eintrag in der
Datenbank der Zust&auml;nde der installierten Pakete. Falls kein <I>Paketname</I>
festgelegt ist, werden alle Paketeintr&auml;ge in der Statusdatenbank angezeigt
(seit dpkg 1.19.1). Wenn mehrere <I>Paketname</I>-Eintr&auml;ge aufgef&uuml;hrt sind,
werden die angeforderten Statuseintr&auml;ge durch Leerzeilen getrennt, wobei die
Reihenfolge identisch zu der in der Argumentenliste ist.
<DT id="4"><B>-L</B>, <B>--listfiles</B> <I>Paketname</I> …<DD>
Auff&uuml;hren von Dateien, die durch <I>Paketname</I> installiert wurden. Wenn
mehrere <I>Paketname</I> aufgef&uuml;hrt sind, werden die angeforderten Dateilisten
durch Leerzeilen getrennt, wobei die Reihenfolge identisch zu der in der
Argumentenliste ist. Beachten Sie aber, dass Dateien, die durch
Paket-spezifische Installationsskripte angelegt wurden, nicht aufgef&uuml;hrt
werden.
<DT id="5"><B>--control-list</B> <I>Paketname</I><DD>
Auff&uuml;hren von Steuerdateien, die auf Ihrem System von <I>Paketname</I>
installiert wurden (seit Dpkg 1.16.5). Diese k&ouml;nnen als Eingabeargumente f&uuml;r
<B>--control-show</B> verwandt werden.
<DT id="6"><B>--control-show</B> <I>Paketname</I> <I>Steuerdatei</I><DD>
Die <I>Steuerdatei</I>, die auf Ihrem System von <I>Paketname</I> installiert wurde,
auf der Standardausgabe ausgeben (seit Dpkg 1.16.5).
<DT id="7"><B>-c</B>, <B>--control-path</B> <I>Paketname</I> [<I>Steuerdatei</I>]<DD>
Listet die Pfade f&uuml;r Steuerdateien auf, die von <I>Paketname</I> auf Ihrem
System installiert wurden (seit Dpkg 1.15.4). Falls <I>Steuerdatei</I> angegeben
wurde, liste nur den Pfad f&uuml;r diese Steuerdatei auf, falls sie existiert.
<P>
<B>Warnung</B>: Dieser Befehl ist veraltet, da er direkten Zugriff auf die
interne Dpkg-Datenbank gibt. Bitte wechseln Sie stattdessen zu
<B>--control-list</B> und <B>--control-show</B> f&uuml;r alle F&auml;lle, in denen diese
Befehle die gleichen Ergebnisse geben. Solange es noch mindestens einen Fall
gibt, in dem dieser Befehl ben&ouml;tigt wird (d.h. wenn ein besch&auml;digendes
Postrm-Betreuerskript entfernt werden muss), und solange es keine gute
L&ouml;sung daf&uuml;r gibt wird dieser Befehl nicht entfernt.
<DT id="8"><B>-S</B>, <B>--search</B> <I>Dateiname-Suchmuster</I> …<DD>
Suche nach Paketen, denen Paketen, die auf ein bestimmtes Muster passen,
geh&ouml;ren. Die normalen Jokerzeichen (&raquo;wildcards&laquo;) der Shell k&ouml;nnen in diesem
Muster verwandt werden, wobei der Stern (<B>*</B>) und das Fragezeichen (<B>?</B>)
auf einen Schr&auml;gstrich passen und der inverse Schr&auml;gstrich (<B>\</B>) als
Maskierzeichen verwandt wird.
<P>
Falls das erste Zeichen im <I>Dateiname-Suchmuster</I> keines aus bq<B>*[?/</B>' ist,
dann wird es als Teilzeichenkette-Suche betrachtet und implizit durch bq<B>*</B>'
eingeschlossen (wie in <B>*</B><I>Dateiname-Suchmuster</I><B>*</B>). Falls die
nachfolgende Zeichenkette etwas aus bq<B>*[?\</B>' enth&auml;lt, dann wird dies wie
ein Glob-Muster behandelt, andernfalls werden alle abschlie&szlig;enden bq<B>/</B>'
oder bq<B>/.</B>' entfernt und ein &raquo;literal path lookup&laquo; durchgef&uuml;hrt.
<P>
Dieser Befehl wird weder die zus&auml;tzlichen Dateien, die durch
Betreuer-Skripte angelegt wurden, noch Alternativen auff&uuml;hren.
<DT id="9"><B>-p</B>, <B>--print-avail</B> [<I>Paketname</I> …]<DD>
Zeige Details &uuml;ber Pakete an, wie diese in <I>/var/lib/dpkg/available</I>
vorliegen. Falls kein <I>Paketname</I> festgelegt ist, werden alle in der
Datenbank <I>available</I> verf&uuml;gbaren Paketeintr&auml;ge angezeigt (seit Dpkg
1.19.1). Wenn mehrere <I>Paketname</I> aufgef&uuml;hrt sind, werden die angeforderten
<I>available</I>-Eintr&auml;ge durch Leerzeilen getrennt, wobei die Reihenfolge
identisch zu der in der Argumentenliste ist.
<P>
Benutzer APT-basierter Oberfl&auml;chen sollten <B>apt-cache show</B> <I>Paketname</I>
verwenden, da die Datei <I>available</I> nur bei der Benutzung von <B>dselect</B>
aktuell bleibt.
<DT id="10"><B>-?</B>, <B>--help</B><DD>
Zeige den Bedienungshinweis und beende.
<DT id="11"><B>--version</B><DD>
Gebe die Version aus und beende sich.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONEN</H2>

<DL COMPACT>
<DT id="12"><B>--admindir=</B><I>Verz</I><DD>
&Auml;ndert den Ablageort der <B>dpkg</B>-Datenbank. Der Standardort ist
<I>/var/lib/dpkg</I>.
<DT id="13"><B>--load-avail</B><DD>
Auch die &raquo;available&laquo;-Datei laden, wenn die Befehle <B>--show</B> und <B>--list</B>
verwandt werden, die jetzt standardmn&auml;&szlig;ig nur die Statusdatei laden (seit
Dpkg 1.16.2).
<DT id="14"><B>--no-pager</B><DD>
Deaktiviert die Verwendung jeglichen Pagers bei der Anzeige von
Informationen (seit Dpkg 1.19.2).
<DT id="15"><B>-f</B>, <B>--showformat=</B><I>Format</I><DD>
Diese Option wird dazu verwendet, das Format der Ausgabe anzugeben, das
<B>--show</B> verwenden wird (kurze Option seit Dpkg 1.13.1). Das Format ist
eine Zeichenkette, die f&uuml;r jedes aufgef&uuml;hrte Paket ausgegeben wird.
<P>
In der Formatzeichenkette leitet Bq<B>\</B>" Escape-Sequenzen ein:
<P>
<PRE>
    <B>\n</B>  Zeilenumbruch
    <B>\r</B>  Wagenr&uuml;cklauf
    <B>\t</B>  Tabulator
</PRE>

<P>
Bq<B>\</B>" vor einem anderen Zeichen unterdr&uuml;ckt jede spezielle Bedeutung des
folgenden Zeichens. Dies ist f&uuml;r Bq<B>\</B>" und Bq<B>$</B>" n&uuml;tzlich.
<P>
Paketinformationen k&ouml;nnen einbezogen werden, indem Variablenreferenzen auf
Paketfelder eingef&uuml;gt werden. Hierbei wird folgende Syntax verwendet:
Bq<B>${</B><I>Feld</I>[<B>;</B><I>Breite</I>]<B>}</B>". Felder werden rechtsb&uuml;ndig ausgegeben,
falls die Breite nicht negativ ist und somit linksb&uuml;ndige Ausgabe
erfolgt. Die folgenden <I>Feld</I>er werden verstanden, sind aber nicht
notwendigerweise in der Status-Datei verf&uuml;gbar (nur interne Felder oder
Felder, die im Bin&auml;rpaket abgespeichert sind, landen dort):
<P>
<PRE>
    <B>Architecture</B>
    <B>Bugs</B>
    <B>Conffiles</B> (intern)
    <B>Config-Version</B> (intern)
    <B>Conflicts</B>
    <B>Breaks</B>
    <B>Depends</B>
    <B>Description</B>
    <B>Enhances</B>
    <B>Essential</B>
    <B>Filename</B> (intern, Oberfl&auml;chen-bezogen)
    <B>Homepage</B>
    <B>Installed-Size</B>
    <B>MD5sum</B> (intern, Oberfl&auml;chen-bezogen)
    <B>MSDOS-Filename</B> (intern, Oberfl&auml;chen-bezogen)
    <B>Maintainer</B>
    <B>Origin</B>
    <B>Package</B>
    <B>Pre-Depends</B>
    <B>Priority</B>
    <B>Provides</B>
    <B>Recommends</B>
    <B>Replaces</B>
    <B>Revision</B> (veraltet)
    <B>Section</B>
    <B>Size</B> (intern, Oberfl&auml;chen-bezogen)
    <B>Source</B>
    <B>Status</B> (intern)
    <B>Suggests</B>
    <B>Tag</B> (normalerweise nicht im .deb sondern in Packages-Dateien des Depots)
    <B>Triggers-Awaited</B> (intern)
    <B>Triggers-Pending</B> (intern)
    <B>Version</B>
    <B>show:Summary</B> (virtuell)
    <B>show:Status-Abbrev</B> (virtuell)
</PRE>

<P>
Die folgenden Felder sind virtuell, sie werden von <B>dpkg-query</B> aus Werten
aus anderen Feldern erstellt (beachten Sie, dass diese keine g&uuml;ltigen Namen
f&uuml;r Felder in Steuerdateien benutzen):
<DL COMPACT><DT id="16"><DD>
<DL COMPACT>
<DT id="17"><B>binary:Package</B><DD>
Es enth&auml;lt den Bin&auml;rpaketnamen mit einer m&ouml;glichen
Architektur-Spezifizierung wie Bqlibc6:amd64" (seit Dpkg 1.16.2). Eine
Architektur-Spezifizierung dient dazu, einen eindeutigen Paketnamen zu
erzeugen, falls beispielsweise das Paket ein Feld <B>Multi-Arch</B> mit dem Wert
<B>same</B> hat oder das Paket f&uuml;r eine fremde Architektur ist.
<DT id="18"><B>binary:Synopsis</B><DD>
Es enth&auml;lt die Kurzbeschreibung des Pakets (seit Dpkg 1.19.1).
<DT id="19"><B>binary:Summary</B><DD>
Dies ist ein Alias f&uuml;r <B>binary:Synopsis</B> (seit Dpkg 1.16.2).
<DT id="20"><B>db:Status-Abbrev</B><DD>
Es enth&auml;lt den abgek&uuml;rzten Paketstatus (als drei Zeichen) wie Bqii " oder
BqiHR" (seit Dpkg 1.16.2). Lesen Sie die Beschreibung von <B>--list</B> f&uuml;r
weitere Details.
<DT id="21"><B>db:Status-Want</B><DD>
Es enth&auml;lt den gew&uuml;nschten Status des Pakets, Teil des Statusfeldes (seit
Dpkg 1.17.11).
<DT id="22"><B>db:Status-Status</B><DD>
Es enth&auml;lt das Paketstatuswort, Teil des Statusfeldes (seit Dpkg 1.17.11).
<DT id="23"><B>db:Status-Eflag</B><DD>
Es enth&auml;lt den Paketstatusfehlerschalter, Teil des Statusfeldes (seit Dpkg
1.17.11).
<DT id="24"><B>db-fsys:Files</B><DD>
Es enth&auml;lt die Liste der Paketdateisystemeintr&auml;ge, getrennt durch
Zeilenumbr&uuml;che (seit Dpkg 1.19.3).
<DT id="25"><B>db-fsys:Last-Modified</B><DD>
Es enth&auml;lt den Zeitstempel in Sekunden des letzten Zeitpunkts, zu dem der
Paketdateisystemeintrag ge&auml;ndert wurde (seit Dpkg 1.19.3).
<DT id="26"><B>source:Package</B><DD>
Es enth&auml;lt den Quellpaketnamen f&uuml;r dieses Bin&auml;rpaket (seit Dpkg 1.16.2).
<DT id="27"><B>source:Version</B><DD>
Es enth&auml;lt die Quellpaketversion f&uuml;r dieses Bin&auml;rpaket (seit Dpkg 1.16.2).
<DT id="28"><B>source:Upstream-Version</B><DD>
Es enth&auml;lt die Quellpaketversion der Originalautoren f&uuml;r dieses Bin&auml;rpaket
(seit Dpkg 1.18.16).
</DL>
</DL>

<DT id="29"><DD>
Die Standard-Formatzeichenkette ist
Bq<B>${binary:Package}\t${Version}\n</B>". Tats&auml;chlich k&ouml;nnen auch alle anderen
Felder, die in der Statusdatei gefunden werden k&ouml;nnen
(d.h. benutzerdefinierte Felder), abgefragt werden. Sie werden so
dargestellt, wie sie gefunden werden, es erfolgt keine Umwandlung oder
Fehler&uuml;berpr&uuml;fung. Um den Namen des <B>dpkg</B>-Betreuers und die installierte
Version zu erhalten, k&ouml;nnten Sie folgendes ausf&uuml;hren:
<P>
<PRE>
  <B>dpkg-query -W -f='${binary:Package} ${Version}\t${Maintainer}\n' dpkg</B>
</PRE>

</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>R&Uuml;CKGABEWERT</H2>

<DL COMPACT>
<DT id="30"><B>0</B><DD>
Die angeforderte Abfrage wurde erfolgreich ausgef&uuml;hrt.
<DT id="31"><B>1</B><DD>
Die angeforderte Abfrage schlug entweder ganz oder teilweise fehl, da keine
Datei oder kein Paket gefunden wurde (au&szlig;er f&uuml;r <B>--control-path</B>,
<B>--control-list</B> und <B>--control-show</B>, bei denen solche Fehler fatal
sind).
<DT id="32"><B>2</B><DD>
Fataler oder nicht behebbarer Fehler aufgrund ung&uuml;ltiger
Befehlszeilenverwendung oder Interaktionen mit dem System, wie Zugriffe auf
die Datenbank, Speicherzuweisungen usw.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>UMGEBUNG</H2>

<A NAME="lbAI">&nbsp;</A>
<H3>Externe Umgebung</H3>

<DL COMPACT>
<DT id="33"><B>SHELL</B><DD>
Setzt das auszuf&uuml;hrende Programm, wenn ein Befehl &uuml;ber eine Shell ausgef&uuml;hrt
wird (seit Dpkg 1.19.2).
<DT id="34"><B>PAGER</B><DD>

<B>DPKG_PAGER</B>
Setzt den zu verwendenen Pager-Befehl (seit Dpkg 1.19.1), der mit Bq<B>$SHELL
-c</B>" ausgef&uuml;hrt wird. Falls <B>SHELL</B> nicht gesetzt ist, wird stattdessen
Bq<B>sh</B>" verwandt. <B>DPKG_PAGER</B> setzt die Umgebungsvariable <B>PAGER</B> au&szlig;er
Kraft (seit Dpkg 1.19.2).
<DT id="35"><B>DPKG_ADMINDIR</B><DD>
Falls gesetzt und die Option <B>--admindir</B> nicht verwandt wurde, wird dies
als Datenverzeichnis von <B>dpkg</B> verwandt.
<DT id="36"><B>DPKG_COLORS</B><DD>
Setzt den Farbmodus (seit Dpkg 1.18.5). Die derzeit unterst&uuml;tzten Werte
sind: <B>auto</B> (Vorgabe), <B>always</B> und <B>never</B>.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H3>Interne Umgebung</H3>

<DL COMPACT>
<DT id="37"><B>LESS</B><DD>
Von <B>dpkg-query</B> auf &raquo;<B>-FRSXMQ</B>&laquo; definiert, falls es nicht bereits gesetzt
ist oder wenn ein Pager gestartet wird (seit Dpkg 1.19.2). Um das
Vorgabeverhalten zu ver&auml;ndern, kann diese Variable auf einen anderen Wert
einschlie&szlig;lich der leeren Zeichenkette voreingestellt werden oder die
Variablen <B>PAGER</B> oder <B>DPKG_PAGER</B> k&ouml;nnen gesetzt werden, um bestimmte
Optionen mit Bq<B>-+</B>" zu deaktivieren, beispielsweise <B>DPKG_PAGER=&quot;less
-+F&quot;</B>.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<P>
<A NAME="lbAL">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="38"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="39"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="40"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="41"><A HREF="#lbAE">BEFEHLE</A><DD>
<DT id="42"><A HREF="#lbAF">OPTIONEN</A><DD>
<DT id="43"><A HREF="#lbAG">R&Uuml;CKGABEWERT</A><DD>
<DT id="44"><A HREF="#lbAH">UMGEBUNG</A><DD>
<DL>
<DT id="45"><A HREF="#lbAI">Externe Umgebung</A><DD>
<DT id="46"><A HREF="#lbAJ">Interne Umgebung</A><DD>
</DL>
<DT id="47"><A HREF="#lbAK">SIEHE AUCH</A><DD>
<DT id="48"><A HREF="#lbAL">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:56 GMT, March 31, 2021
</BODY>
</HTML>
