
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-deb</TITLE>
</HEAD><BODY>
<H1>dpkg-deb</H1>
Section: dpkg-Programmsammlung (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

dpkg-deb - Debian-Paketarchiv (.deb) Manipulationswerkzeug
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<B>dpkg-deb</B> [<I>Option</I> …] <I>Befehl</I>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<B>dpkg-deb</B> packt und entpackt Debian-Archive und stellt Informationen &uuml;ber
sie breit.
<P>

Verwenden Sie <B>dpkg</B>, um Pakete auf Ihrem System hinzuzuf&uuml;gen oder zu
entfernen
<P>

Sie k&ouml;nnen <B>dpkg-deb</B> durch Aufruf von <B>dpkg</B> mit beliebigen Optionen, die
Sie an <B>dpkg-deb</B> &uuml;bergeben wollen, aufrufen. <B>dpkg</B> erkennt, dass Sie
<B>dpkg-deb</B> wollten und wird es f&uuml;r Sie ausf&uuml;hren.
<P>

Bei den meisten Befehlen, die ein Archiv als Eingabeargument erwarten, kann
der Archivname von der Standardeingabe gelesen werden, wenn er als einzelnes
Minuszeichen (Bq<B>-</B>") angegeben ist. Falls dies nicht unterst&uuml;tzt wird, ist
dies in der jeweiligen Beschreibung des Befehls dokumentiert.
<A NAME="lbAE">&nbsp;</A>
<H2>BEFEHLE</H2>

<DL COMPACT>
<DT id="1"><B>-b</B>, <B>--build</B> <I>Programmverzeichnis</I> [<I>Archiv</I>|<I>Verzeichnis</I>]<DD>
Legt ein Debian-Archiv aus dem Dateisystembaum, das in
<I>Programmverzeichnis</I> gespeichert ist, an. <I>Programmverzeichnis</I> muss ein
<B>DEBIAN</B>-Unterverzeichnis aufweisen, das die Dateien mit Steuerinformation
wie die control-Datei selbst enth&auml;lt. Dieses Verzeichnis wird <I>nicht</I> in
dem Dateisystemarchiv des Bin&auml;rpakets auftauchen, sondern die Dateien selbst
werden in den Steuer-Informationsbereich des Bin&auml;rpakets gepackt.
<P>
Falls Sie nicht <B>--nocheck</B> angeben, wird <B>dpkg-deb</B> <B>DEBIAN/control</B>
lesen und es auswerten. Es pr&uuml;ft die Datei auf Syntax-Fehler und andere
Probleme und zeigt den Namen des zu bauenden Bin&auml;rpakets an. <B>dpkg-deb</B>
wird auch die Rechte der Betreuer-Skripte und anderer Dateien im
<B>DEBIAN</B>-Steuer-Informationsverzeichnis pr&uuml;fen.
<P>
Falls kein <I>Archiv</I> angegeben ist, wird <B>dpkg-deb</B> das Paket in die Datei
<I>Programmverzeichnis</I><B>.deb</B> schreiben.
<P>
Falls das anzulegende Archiv bereits existiert, wird es &uuml;berschrieben.
<P>
Falls das zweite Argument ein Verzeichnis ist, wird <B>dpkg-deb</B> in die Datei
<I>Verzeichnis</I><B>/</B><I>Paket</I><B>_</B><I>Version</I><B>_</B><I>Arch</I><B>.deb.</B> schreiben. Wenn
ein Zielverzeichnis statt einer Datei angegeben ist, darf die Option
<B>--nocheck</B> nicht verwendet werden (da <B>dpkg-deb</B> die Paketsteuerdatei
lesen und auswerten muss, um den zu verwendenen Dateinamen zu bestimmen).
<DT id="2"><B>-I</B>, <B>--info</B> <I>Archiv</I> [<I>Steuer-Dateiname</I> …]<DD>
Stellt Informationen &uuml;ber ein Bin&auml;rpaketarchiv bereit.
<P>
Falls keine <I>Steuer-Dateiname</I>n angegeben sind, wird es eine
Zusammenfassung des Inhalts des Pakets sowie dessen control-Datei ausgeben.
<P>
Falls <I>Steuer-Dateiname</I>n angegeben sind, wird <B>dpkg-deb</B> diese in der
angegebenen Reihenfolge ausgeben; falls einige der Komponenten nicht
vorhanden sind, wird es eine Fehlernachricht nach Stderr &uuml;ber jede ausgeben
und sich mit dem Status 2 beenden.
<DT id="3"><B>-W</B>, <B>--show</B> <I>Archiv</I><DD>
Stellt Informationen &uuml;ber Bin&auml;rpaketarchive im Format dar, das mit dem
Argument <B>--showformat</B> angegeben wurde. Das Standardformat zeigt den
Paketnamen und die Paketversion in einer Zeile, getrennt durch einen
Tabulator.
<DT id="4"><B>-f</B>, <B>--field</B> <I>Archiv</I> [<I>Steuer-Feldname</I> …]<DD>
Extrahiert die Informationen der control-Datei aus einem Bin&auml;rpaketarchiv.
<P>
Falls keine <I>Steuer-Feldname</I>n angegeben sind, gibt es die gesamte
control-Datei aus.
<P>
Falls welche angegeben sind, gibt <B>dpkg-deb</B> ihren Inhalt in der
Reihenfolge aus, in der sie in der control-Datei angegeben sind. Falls mehr
als ein <I>Steuer-Feldname</I> angegeben ist, stellt <B>dpkg-deb</B> jedem Inhalt
seinen Feldnamen (und einen Doppelpunkt mit Leerzeichen) voran.
<P>
Falls angeforderte Felder nicht gefunden werden wird kein Fehler gemeldet.
<DT id="5"><B>-c</B>, <B>--contents</B> <I>Archiv</I><DD>
Listet den Inhalt des Dateisystem-Archivanteils des Paketarchivs auf. Die
Ausgabe erfolgt derzeit in dem Format, das von <B>tar</B> in der ausf&uuml;hrlichen
Auflistung erstellt wird.
<DT id="6"><B>-x</B>, <B>--extract</B> <I>Archiv-Verzeichnis</I><DD>
Extrahiert den Dateisystembaum aus einem Paketarchiv in das angegebene
Verzeichnis.
<P>
Beachten Sie, dass das Extrahieren eines Pakets in das Wurzelverzeichnis
<I>nicht</I> zu einer korrekten Installation f&uuml;hrt! Verwenden Sie <B>dpkg</B> zur
Paketinstallation.
<P>
<I>Verzeichnis</I> (aber nicht die &uuml;bergeordneten) wird falls notwendig
angelegt. Seine Rechte werden angepasst, um mit dem Inhalt des Pakets
&uuml;bereinzustimmen.
<DT id="7"><B>-X</B>, <B>--vextract</B> <I>Archiv-Verzeichnis</I><DD>
Ist wie <B>--extract</B> (<B>-x</B>) mit <B>--verbose</B> (<B>-v</B>), das beim Arbeiten
eine Liste von entpackten Dateien ausgibt.
<DT id="8"><B>-R</B>, <B>--raw-extract</B> <I>Archiv-Verzeichnis</I><DD>
Extrahiert den Dateisystembaum aus einem Paketarchiv in ein angegebenes
Verzeichnis und die Steuerinformationensdateien in das
<B>DEBIAN</B>-Unterverzeichnis des angegebenen Verzeichnisses (seit Dpkg
1.16.1).
<P>
Das Zielverzeichnis (aber nicht &uuml;bergeordnete) wird, falls notwendig,
angelegt.
<P>
Das Eingebearchiv wird (derzeit) nicht sequenziell verarbeitet, daher wird
das Einlesen von der Standardeingabe (Bq<B>-</B>") <B>nicht</B> unterst&uuml;tzt.
<DT id="9"><B>--ctrl-tarfile</B> <I>Archiv</I><DD>
Extrahiert die Steuerdaten aus einem Bin&auml;rpaket und schickt sie zur
Standardausgabe im <B>tar</B>-Format (seit Dpkg 1.17.14. Dies kann zusammen mit
<B><A HREF="/cgi-bin/man/man2html?1+tar">tar</A></B>(1) verwendet werden, um eine bestimmte control-Datei aus einem
Paketarchiv zu extrahieren. Das Eingabearchiv wird immer sequenziell
verarbeitet.
<DT id="10"><B>--fsys-tarfile</B> <I>Archiv</I><DD>
Extrahiert die Dateisystembaum-Daten aus einem Bin&auml;rpaket und schickt sie
zur Standardausgabe im <B>tar</B>-Format. Dies kann zusammen mit <B><A HREF="/cgi-bin/man/man2html?1+tar">tar</A></B>(1)
verwendet werden, um eine bestimmte Datei aus einem Paketarchiv zu
extrahieren. Das Eingabearchiv wird immer sequenziell verarbeitet.
<DT id="11"><B>-e</B>, <B>--control</B> <I>Archiv</I> [<I>Verzeichnis</I>]<DD>
Extrahiert die Steuer-Informationsdateien aus einem Paketarchiv in das
angegebene Verzeichnis.
<P>
Falls kein Verzeichnis angegeben ist, wird das Unterverzeichnis <B>DEBIAN</B> im
aktuellen Verzeichnis verwendet.
<P>
Das Zielverzeichnis (aber nicht &uuml;bergeordnete) wird, falls notwendig,
angelegt.
<DT id="12"><B>-?</B>, <B>--help</B><DD>
Zeige den Bedienungshinweis und beende.
<DT id="13"><B>--version</B><DD>
Gebe die Version aus und beende sich.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPTIONEN</H2>

<DL COMPACT>
<DT id="14"><B>--showformat=</B><I>Format</I><DD>
Diese Option wird dazu verwendet, das Format der Ausgabe anzugeben, das
<B>--show</B> verwenden wird. Das Format ist eine Zeichenkette, die f&uuml;r jedes
aufgef&uuml;hrte Paket ausgegeben wird.
<P>
Die Zeichenkette darf jedes Statusfeld in der Form Bq${<I>Feldname</I>}"
referenzieren, eine Liste der m&ouml;glichen Felder kann leicht mittels <B>-I</B> f&uuml;r
das gleiche Paket ermittelt werden. Eine komplette Erl&auml;uterung der
Formatieroptionen (darunter die Escape-Sequenzen und Feld-Tabulatoren) kann
in der Erkl&auml;rung der Option <B>--showformat</B> von <B><A HREF="/cgi-bin/man/man2html?1+dpkg-query">dpkg-query</A></B>(1) gefunden
werden.
<P>
Die Voreinstellung f&uuml;r dieses Feld ist Bq${Package}\t${Version}\n".
<DT id="15"><B>-z</B><I>Komprimierstufe</I><DD>
Gibt die Komprimierstufe an, die im Komprimier-Backendprogramm beim Bau
eines Pakets verwendet werden soll. Standardm&auml;&szlig;ig ist dies 9 f&uuml;r Gzip, 6 f&uuml;r
Xz. Die akzeptierten Werte innerhalb von 0-9 sind: 0 wird auf den
Komprimierer &raquo;none&laquo; f&uuml;r Gzip einstellen. Vor Dpkg 1.16.2 war die Stufe 0
&auml;quivalent zu dem Komprimierer &raquo;none&laquo; f&uuml;r alle Komprimierer.
<DT id="16"><B>-S</B><I>Komprimierstrategie</I><DD>
Gibt die zu verwendende Komprimierstrategie an, die f&uuml;r den
Komprimierer-Backend beim Bau eines Pakets verwandt werden soll (seit Dpkg
1.16.2). Erlaubte Werte sind <B>none</B> (seit Dpkg 1.16.4), <B>filtered</B>,
<B>huffman</B>, <B>rle</B> und <B>fixed</B> f&uuml;r Gzip (seit Dpkg 1.17.0) und <B>extreme</B>
f&uuml;r Xz.
<DT id="17"><B>-Z</B><I>Komprimierart</I><DD>
Gibt die Art der Komprimierung beim Bau eines Pakets an. Erlaubte Werte sind
<B>gzip</B>, <B>xz</B> (seit Dpkg 1.15.6) und <B>none</B> (voreingestellt ist <B>xz</B>).
<DT id="18"><B>--[no-]uniform-compression</B><DD>
Gibt an, dass die gleichen Komprimierungsparameter f&uuml;r alle Archivteile
(d.h. <B>control.tar</B> und <B>data.tar</B>; seit Dpkg 1.17.6) verwandt werden
sollen. Andernfalls wird nur der Teil <B>data.tar</B> diese Parameter
verwenden. Die einzigen unterst&uuml;tzten Kompressionstypen, die &uuml;bergreifend
benutzt werden d&uuml;rfen, sind <B>none</B>, <B>gzip</B> und <B>xz</B>. Die Option
<B>--no-uniform-compression</B> deaktiviert die &uuml;bergreifende Komprimierung
(seit Dpkg 1.19.0). &Uuml;bergreifende Komprimierung ist die Vorgabe (seit Dpkg
1.19.0).
<DT id="19"><B>--root-owner-group</B><DD>
Setzt f&uuml;r jeden Eintrag in den Dateisystembaumdaten den Eigent&uuml;mer und die
Gruppe auf Kennung 0 (seit Dpkg 1.19.0).
<P>
<B>Hinweis</B>: Diese Option kann f&uuml;r rootloses Bauen (siehe
<I>rootless-builds.txt</I>) n&uuml;tzlich sein, sollte aber <B>nicht</B> verwandt werden,
wenn Eintr&auml;ge eine von root verschiedenen Eigent&uuml;mer oder Gruppe haben. Die
Unterst&uuml;tzung hierf&uuml;r wird sp&auml;ter in der Form eines Meta-Manifests
hinzugef&uuml;gt.
<DT id="20"><B>--deb-format=</B><I>Format</I><DD>
Setzt das beim Bau verwandte Archivformat (seit Dpkg 1.17.0). Erlaubte Werte
sind <B>2.0</B> f&uuml;r das neue Format und <B>0.939000</B> f&uuml;r das alte Format (Vorgabe
ist <B>2.0</B>).
<P>
Das alte Format wird nicht so leicht von nicht-Debian-Werkzeugen eingelesen
und ist jetzt veraltet; der einzige Zweck ist zum Bau von Paketen, die von
Dpkg-Versionen kleiner 0.93.76 (September 1995) eingelesen werden
sollen. Diese Dpkg-Version wurde nur als i386 a.out-Programm ver&ouml;ffentlicht.
<DT id="21"><B>--nocheck</B><DD>
Unterdr&uuml;ckt die normalen &Uuml;berpr&uuml;fungen von <B>dpkg-deb --build</B> &uuml;ber die
vorgeschlagenen Inhalte eines Archivs. Damit k&ouml;nnen Sie jedes Archiv bauen,
das Sie m&ouml;chten, egal wie defekt es ist.
<DT id="22"><B>-v</B>, <B>--verbose</B><DD>
Aktiviert ausf&uuml;hrliche Ausgabe (seit Dpkg 1.16.1). Dies betrifft derzeit nur
<B>--extract</B>, wodurch dieses sich wie <B>--vextract</B> verh&auml;lt.
<DT id="23"><B>-D</B>, <B>--debug</B><DD>
Aktiviert Fehlersuchausgaben (&raquo;debugging&laquo;). Dies ist nicht sehr interessant.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>R&Uuml;CKGABEWERT</H2>

<DL COMPACT>
<DT id="24"><B>0</B><DD>
Die angeforderte Aktion wurde erfolgreich ausgef&uuml;hrt.
<DT id="25"><B>2</B><DD>
Fataler oder nicht behebbarer Fehler aufgrund ung&uuml;ltiger
Befehlszeilenverwendung oder Interaktionen mit dem System, wie Zugriffe auf
die Datenbank, Speicherzuweisungen usw.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>UMGEBUNG</H2>

<DL COMPACT>
<DT id="26"><B>DPKG_COLORS</B><DD>
Setzt den Farbmodus (seit Dpkg 1.18.5). Die derzeit unterst&uuml;tzten Werte
sind: <B>auto</B> (Vorgabe), <B>always</B> und <B>never</B>.
<DT id="27"><B>TMPDIR</B><DD>
Falls gesetzt, wird <B>dpkg-deb</B> es als das Verzeichnis verwenden, in dem
tempor&auml;re Dateien und Verzeichnisse erstellt werden.
<DT id="28"><B>SOURCE_DATE_EPOCH</B><DD>
Falls gesetzt, wird es als Zeitstempel (als Sekunden seit der Epoche) in dem
<B><A HREF="/cgi-bin/man/man2html?5+ar">ar</A></B>(5)-Container von <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5) und zum Festlegen der Mtime in den
Dateieintr&auml;gen von <B><A HREF="/cgi-bin/man/man2html?5+tar">tar</A></B>(5) verwandt.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>BEMERKUNGEN</H2>

Versuchen Sie nicht, nur mit <B>dpkg-deb</B> Software zu installieren! Sie
m&uuml;ssen <B>dpkg</B> selber verwenden, um sicherzustellen, dass alle Dateien an
den richtigen Ort platziert werden, die Paketskripte ausgef&uuml;hrt werden und
sein Status und Inhalt aufgezeichnet wird.
<A NAME="lbAJ">&nbsp;</A>
<H2>FEHLER</H2>

<B>dpkg-deb -I</B> <I>Paket1</I><B>.deb</B> <I>Paket2</I><B>.deb</B> macht das Falsche.
<P>
<B>.deb</B>-Dateien werden nicht authentifiziert; in der Tat gibt es noch nicht
mal eine klare Pr&uuml;fsumme. (Abstraktere Werkzeuge wie APT unterst&uuml;tzten die
Authentifizierung von <B>.deb</B>-Paketen, die von einem vorgegebenen Depot
geholt wurden und die meisten Pakete stellen heutzutage eine
md5sum-Steuerdatei bereit, die mittels debian/rules erstellt
wurde. Allerdings wird dies von den Werkzeugen auf niedrigerer Ebene nicht
direkt unterst&uuml;tzt.)
<A NAME="lbAK">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1).
<A NAME="lbAL">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="29"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="30"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="31"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="32"><A HREF="#lbAE">BEFEHLE</A><DD>
<DT id="33"><A HREF="#lbAF">OPTIONEN</A><DD>
<DT id="34"><A HREF="#lbAG">R&Uuml;CKGABEWERT</A><DD>
<DT id="35"><A HREF="#lbAH">UMGEBUNG</A><DD>
<DT id="36"><A HREF="#lbAI">BEMERKUNGEN</A><DD>
<DT id="37"><A HREF="#lbAJ">FEHLER</A><DD>
<DT id="38"><A HREF="#lbAK">SIEHE AUCH</A><DD>
<DT id="39"><A HREF="#lbAL">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:56 GMT, March 31, 2021
</BODY>
</HTML>
