
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of update-alternatives</TITLE>
</HEAD><BODY>
<H1>update-alternatives</H1>
Section: dpkg-Programmsammlung (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

update-alternatives - Verwaltung symbolischer Links zur Bestimmung von
Standardwerten f&uuml;r Befehle
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<B>update-alternatives</B> [<I>Option</I> …] <I>Befehl</I>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<B>update-alternatives</B> erzeugt, entfernt, verwaltet und zeigt die
Informationen &uuml;ber die symbolischen Links, die das &raquo;Debian
Alternativ-System&laquo; bilden, an.
<P>

Es ist m&ouml;glich, mehrere Programme, die die gleiche oder &auml;hnliche
Funktionalit&auml;t bereitstellen, gleichzeitig auf einem System zu
installieren. Beispielsweise sind auf vielen Systemen mehrere Texteditoren
gleichzeitig installiert. Dies gibt den Benutzern eines Systems die
M&ouml;glichkeit, falls gew&uuml;nscht, jeweils einen anderen Editor zu verwenden,
allerdings wird es damit f&uuml;r ein Programm schwierig, eine gute Wahl f&uuml;r
einen Editor zum Starten zu treffen, falls der Benutzer keine spezielle Wahl
getroffen hat.
<P>

Debians Alternativ-System hat das Ziel, dieses Problem zu l&ouml;sen. Ein
generischer Name im Dateisystem wird von allen Dateien, die austauschbare
Funktionalit&auml;t bereitstellen, verwendet. Das Alternativ-System bestimmt
zusammen mit dem Systemadministrator welche Datei tats&auml;chlich durch diesen
generischen Namen referenziert wird. Falls beispielsweise sowohl der
Texteditor <B><A HREF="/cgi-bin/man/man2html?1+ed">ed</A></B>(1) als auch <B><A HREF="/cgi-bin/man/man2html?1+nvi">nvi</A></B>(1) im System installiert sind, wird das
Alternativ-System daf&uuml;r sorgen, dass der generische Name <I>/usr/bin/editor</I>
standardm&auml;&szlig;ig auf <I>/usr/bin/nvi</I> zeigt. Der Systemadministrator kann dies
&Auml;ndern und daf&uuml;r sorgen, dass er stattdessen auf <I>/usr/bin/ed</I> zeigt, und
das Alternativ-System wird diese Einstellung nicht ver&auml;ndern, bis es
explizit dazu aufgefordert wird.
<P>

Der generische Name ist nicht ein direkter symbolischer Link auf die
ausgew&auml;hlte Alternative. Stattdessen ist es ein symbolischer Link auf einen
Namen im <I>Alternativ-Verzeichnis</I>, welches wiederum ein symbolischer Link
auf die tats&auml;chlich referenzierte Datei ist. Dies ist so realisiert, damit
die &Auml;nderungen des Systemadministrators auf das <I>/etc</I> Verzeichnis
beschr&auml;nkt bleiben: der FHS (siehe dort) erkl&auml;rt warum dies eine Gute Idee
ist.
<P>

F&uuml;r jedes Paket, das eine Datei mit einer bestimmten Funktionalit&auml;t
bereitstellt, wird bei der Installation, der &Auml;nderung oder der Entfernung
<B>update-alternatives</B> aufgerufen, um die Informationen &uuml;ber diese Datei im
Alternativ-System zu aktualisieren. <B>update-alternatives</B> wird gew&ouml;hnlich
vom Skript <B>postinst</B> (configure) oder <B>prerm</B> (remove und deconfigure)
eines Debian-Paketes aufgerufen.
<P>

Es ist oft sinnvoll, dass eine Reihe von Alternativen synchronisiert werden,
so dass sie als Gruppe ge&auml;ndert werden; wenn beispielsweise mehrere
Versionen des <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1) Editors installiert sind, sollte die Handbuchseite,
die durch <I>/usr/share/man/man1/vi.1</I> referenziert wird, zu dem ausf&uuml;hrbaren
Programm, dass durch <I>/usr/bin/vi</I> referenziert wird,
geh&ouml;ren. <B>update-alternatives</B> erledigt dies mit Hilfe von <I>Master-</I> und
<I>Slave-Links</I>; wird der Master-Link ge&auml;ndert, wird auch jeder zugeh&ouml;rige
Slave-Link ge&auml;ndert. Ein Master-Link und seine zugeh&ouml;rigen Slave-Links
bilden zusammen eine <I>Link-Gruppe</I>.
<P>

Eine Linkgruppe ist zu jeder Zeit in einem der beiden Modi: automatisch oder
manuell. Ist eine Gruppe im automatischen Modus, dann wird das
Alternativ-System bei der Paketinstallation und -entfernung automatisch
entscheiden, ob und wie die Links aktualisiert werden. Im manuellen Modus
wird das Alternativ-System die Wahl des Administrators beibehalten und
&Auml;nderungen der Links vermeiden (au&szlig;er irgendetwas ist defekt).
<P>

Beim erstmaligen Einf&uuml;hren in das System befindet sich eine Linkgruppe im
automatischen Modus. F&uuml;hrt der Systemadministrator &Auml;nderungen an den
automatischen Einstellungen des Systems durch, wird dies beim n&auml;chsten
Aufruf von <B>update-alternatives</B> auf die Linkgruppe bemerkt und die Gruppe
wird automatisch in den manuellen Modus umgeschaltet.
<P>

Jede Alternative hat eine ihr zugeordnete <I>Priorit&auml;t</I>. Befindet sich eine
Linkgruppe im automatischen Modus, zeigen die Mitglieder einer Gruppe auf
die Alternative mit der h&ouml;chsten Priorit&auml;t.
<P>

Wird die <B>--config</B>-Option verwendet, dann zeigt <B>update-alternatives</B>
alle Auswahlm&ouml;glichkeiten f&uuml;r die Link-Gruppe an, f&uuml;r die der gegebene
<I>Name</I> der Master-Alternative-Name ist. Die aktuelle Auswahl ist mit bq*'
markiert. Sie werden dann aufgefordert, Ihre Auswahl bez&uuml;glich der
Linkgruppe anzugeben. Abh&auml;ngig von der getroffenen Auswahl k&ouml;nnte sich die
Link-Gruppe nicht mehr im <I>automatischen</I> Modus befinden. Sie m&uuml;ssen dann
die Option <B>--auto</B> verwenden, um wieder in den automatischen Zustand
zur&uuml;ckzukehren (oder Sie k&ouml;nnen <B>--config</B> erneut ausf&uuml;hren und den als
automatisch markierten Eintrag ausw&auml;hlen).
<P>

Falls Sie nicht-interaktiv konfigurieren m&ouml;chten, k&ouml;nnen Sie stattdessen die
Option <B>--set</B> verwenden (siehe unten).
<P>

Verschiedene Pakete, die die gleiche Datei bereitstellen, m&uuml;ssen dies
<B>kooperativ</B> durchf&uuml;hren. Anders gesagt ist in diesem Fall die Verwendung
von <B>update-alternatives</B> f&uuml;r alle beteiligten Pakete <B>zwingend</B>. Es ist
nicht m&ouml;glich, sich &uuml;ber eine Datei in einem Paket hinwegzusetzen, welches
den <B>update-alternatives</B>-Mechanismus nicht verwendet.
<A NAME="lbAE">&nbsp;</A>
<H2>BEGRIFFE</H2>

Da die T&auml;tigkeiten von <B>update-alternatives</B> recht komplex sind, sollen
einige spezielle Begriffe helfen, seine Vorgehensweise zu erl&auml;utern.
<DL COMPACT>
<DT id="1">generischer Name (oder Alternativ-Link)<DD>
Ein Name wie <I>/usr/bin/editor</I>, der sich &uuml;ber das Alternativ-System auf
eine Reihe von Dateien mit &auml;hnlicher Funktionalit&auml;t bezieht.
<DT id="2">Alternativ-Name<DD>
Der Name eines symbolischen Links im Alternativ-Verzeichnis.
<DT id="3">Alternative (oder Alternativ-Pfad)<DD>
Der Name einer speziellen Datei im Dateisystem, die mittels eines
generischen Namens &uuml;ber das Alternativ-System zugreifbar gemacht werden
kann.
<DT id="4">Alternativ-Verzeichnis<DD>
Ein Verzeichnis, standardm&auml;&szlig;ig <I>/etc/alternatives</I>, das die Symlinks
enth&auml;lt.
<DT id="5">administratives Verzeichnis<DD>
Ein Verzeichnis, standardm&auml;&szlig;ig <I>/var/lib/dpkg/alternatives</I>, das die
<B>update-alternatives</B> Zustandsinformationen enth&auml;lt.
<DT id="6">Linkgruppe<DD>
Ein Satz zusammengeh&ouml;render Symlinks, die als Gruppe aktualisiert werden
sollen.
<DT id="7">Master-Link<DD>
Der Alternativ-Link in einer Linkgruppe der bestimmt, wie die anderen Links
in der Gruppe konfiguriert werden.
<DT id="8">Slave-Link<DD>
Ein Alternativ-Link in einer Linkgruppe, der durch die Einstellung des
Master-Links gesteuert wird.
<DT id="9">automatischer Modus<DD>
Ist eine Linkgruppe im automatischen Modus, dann sorgt das Alternativ-System
daf&uuml;r, dass die Links in der Gruppe auf die f&uuml;r die Gruppe passende
Alternative mit der h&ouml;chsten Priorit&auml;t zeigen.
<DT id="10">manueller Modus<DD>
Ist eine Linkgruppe im manuellen Modus, dann f&uuml;hrt das Alternativ-System
keine &Auml;nderungen an den Einstellungen des Systemadministrators durch.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>BEFEHLE</H2>

<DL COMPACT>
<DT id="11"><B>--install</B> <I>Link Name Pfad Priorit&auml;t</I> [<B>--slave</B> <I>Link Name Pfad</I>] …<DD>
F&uuml;ge eine Gruppe von Alternativen zum System hinzu. <I>Link</I> ist der
generische Name des Master-Links, <I>Name</I> ist der Name seines Symlinks im
Alternativ-Verzeichnis und <I>Pfad</I> ist die Alternative, die f&uuml;r den
Master-Link eingef&uuml;hrt wird. Die Argumente nach <B>--slave</B> sind der
generische Name, Symlink-Name in dem Alternativ-Verzeichnis und der
Alternativ-Pfad f&uuml;r den Slave-Link. Null oder mehrere <B>--slave</B>-Optionen,
jede von drei Argumenten gefolgt, k&ouml;nnen spezifiziert werden. Beachten Sie,
dass die Master-Alternative existieren muss, ansonsten schl&auml;gt der Aufruf
fehl. Falls allerdings eine Slave-Alternative nicht existiert wird der
zugeh&ouml;rige Slave-Alternative-Link einfach nicht installiert (es wird noch
eine Warnung ausgegeben). Falls eine echte Datei an einer Stelle installiert
wird, an der ein Alternativ-Link installiert werden muss, wird diese
beibehalten, solange <B>--force</B> nicht verwandt wird.
<DT id="12"><DD>
Falls der angegebene Alternativ-Name bereits in den Aufzeichnungen des
Alternativ-Systems existiert, werden die angegebenen Informationen als neuer
Satz von Alternativen f&uuml;r die Gruppe hinzugef&uuml;gt. Andernfalls wird eine neue
Gruppe, eingestellt im automatischen Modus, mit dieser Information
hinzugef&uuml;gt. Falls die Gruppe sich im automatischen Modus befindet und die
Priorit&auml;t der neu hinzugef&uuml;gten Alternative h&ouml;her ist als die jeder anderen
installierten Alternative f&uuml;r diese Gruppe werden die Symlinks aktualisiert,
so dass sie auf die neu hinzugef&uuml;gte Alternative zeigen.
<DT id="13"><B>--set</B> <I>Name Pfad</I><DD>
Setzt das Programm <I>Pfad</I> als Alternative f&uuml;r <I>Name</I>. Dies ist &auml;quivalent
zu <B>--config</B>, ist aber nicht interaktiv und kann somit geskriptet werden.
<DT id="14"><B>--remove</B> <I>Name Pfad</I><DD>
Entferne eine Alternative und alle zugeh&ouml;rigen Slave-Links. <I>Name</I> ist ein
Name im Alternativ-Verzeichnis, und <I>Pfad</I> ist ein absoluter Dateiname zu
dem <I>Name</I> gelinkt werden k&ouml;nnte. Falls <I>Name</I> tats&auml;chlich nach <I>Pfad</I>
gelinkt ist, dann wird <I>Name</I> aktualisiert, um auf eine andere geeignete
Alternative zu zeigen (und die Gruppe wird wieder in den automatischen Modus
versetzt) oder entfernt, falls keine solche Alternative &uuml;brig
bleibt. Zugeh&ouml;rige Slave-Links werden entsprechend aktualisiert oder
entfernt. Falls der Link derzeit nicht auf <I>Pfad</I> zeigt, werden keine Links
ge&auml;ndert; nur die Information &uuml;ber die Alternative wird entfernt.
<DT id="15"><B>--remove-all</B> <I>Name</I><DD>
Entferne alle Alternativen und deren zugeh&ouml;rige Slave-Links. <I>Name</I> ist ein
Name im Alternativ-Verzeichnis.
<DT id="16"><B>--all</B><DD>
Ruft <B>--config</B> f&uuml;r alle Alternativen auf. In der Kombination mit
<B>--skip-auto</B> kann dies n&uuml;tzlich sein, um alle Alternativen zu pr&uuml;fen und
zu konfigurieren, die sich nicht im automatischen Modus befinden. Defekte
Alternativen werden auch angezeigt. Um alle defekten Alternativen zu
reparieren dient daher ein einfacher Aufruf von <B>yes '' |
update-alternatives --force --all</B>.
<DT id="17"><B>--auto</B> <I>Name</I><DD>
&Uuml;berf&uuml;hrt die Linkgruppe hinter der Alternative mit Name <I>Name</I> in den
automatischen Modus. Bei diesem Prozess werden der Master-Symlink und seine
Slave-Links aktualisiert, um auf die installierte Alternative mit h&ouml;chster
Priorit&auml;t zu zeigen.
<DT id="18"><B>--display</B> <I>Name</I><DD>
Zeige Informationen &uuml;ber die Linkgruppe an. Die angezeigten Informationen
enthalten den Modus der Gruppe (automatisch oder manuell), die Master- und
Slave-Links, auf welche Alternative der Master-Link derzeit zeigt, welche
weiteren Alternativen zur Verf&uuml;gung stehen (und ihre zugeh&ouml;rigen
Slave-Alternativen), und die installierte Alternative mit der h&ouml;chsten
Priorit&auml;t.
<DT id="19"><B>--get-selections</B><DD>
F&uuml;hre alle Master-Alternativ-Namen (die eine Linkgruppe steuern) mit ihrem
Status auf (seit Version 1.15.0). Jede Zeile enth&auml;lt bis zu 3 Felder
(getrennt durch mindestens ein Leerzeichen). Im ersten Feld steht der
Alternativ-Name, im zweiten der Status (entweder <B>auto</B> oder <B>manual</B>) und
im letzten die derzeitige Wahl der Alternative (Achtung: Dies ist ein
Dateiname, der Leerzeichen enthalten kann).
<DT id="20"><B>--set-selections</B><DD>
Lese eine Konfiguration von Alternativen &uuml;ber die Standardeingabe im von
&raquo;<B>--get-selections</B>&laquo; generierten Format und konfiguriere die Alternativen
entsprechend neu (seit Version 1.15.0).
<DT id="21"><B>--query</B> <I>Name</I><DD>
Zeige alle Informationen &uuml;ber die Linkgruppe an, wie dies auch von
<B>--display</B> erfolgt, allerdings in einem maschinenlesbaren Format (seit
Version 1.15.0, siehe Abschnitt <B>ABFRAGE-FORMAT</B> unten).
<DT id="22"><B>--list</B> <I>Name</I><DD>
Zeige alle Ziele der Linkgruppe an.
<DT id="23"><B>--config</B> <I>Name</I><DD>
Zeige die verf&uuml;gbaren Alternativen f&uuml;r eine Linkgruppe an und erlaube es dem
Benutzer interaktiv auszuw&auml;hlen, welche zu benutzen ist. Die Linkgruppe wird
aktualisiert.
<DT id="24"><B>--help</B><DD>
Zeige den Bedienungshinweis und beende.
<DT id="25"><B>--version</B><DD>
Gebe die Version aus und beende sich.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>OPTIONEN</H2>

<DL COMPACT>
<DT id="26"><B>--altdir</B><I> Verzeichnis</I><DD>
Spezifiziert das Alternativ-Verzeichnis, wenn sich dieses von der
Standardeinstellung unterscheiden soll.
<DT id="27"><B>--admindir</B><I> Verzeichnis</I><DD>
Spezifiziert das administrative Verzeichnis, wenn sich dieses von der
Standardeinstellung unterscheiden soll.
<DT id="28"><B>--log</B><I> Datei</I><DD>
Gibt die Protokolldatei an (seit Version 1.15.0), wenn diese sich von der
Vorgabe (/var/log/alternatives.log) unterscheiden soll.
<DT id="29"><B>--force</B><DD>
Erlaubt die Ersetzung oder Entfernung von echten Dateien, die sich an
Stellen befinden, an denen ein Alternativ-Link installiert werden muss.
<DT id="30"><B>--skip-auto</B><DD>
&Uuml;berspringt die Konfigurationsabfrage f&uuml;r Alternativen, die korrekt im
automatische Modus konfiguriert sind. Diese Option ist nur mit <B>--config</B>
oder <B>--all</B> relevant.
<DT id="31"><B>--quiet</B><DD>
Erzeuge keine Kommentare, es sei denn, ein Fehler tritt auf.
<DT id="32"><B>--verbose</B><DD>
Erzeugt mehr Kommentare dar&uuml;ber, was getan wird.
<DT id="33"><B>--debug</B><DD>
Erzeugt mehr Kommentare dar&uuml;ber, hilfreich f&uuml;r die Fehlersuche, was getan
wird (seit Version 1.19.3).
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>R&Uuml;CKGABEWERT</H2>

<DL COMPACT>
<DT id="34"><B>0</B><DD>
Die angeforderte Aktion wurde erfolgreich ausgef&uuml;hrt.
<DT id="35"><B>2</B><DD>
Beim Lesen der Befehlszeile oder beim Ausf&uuml;hren der Aktion traten Probleme
auf.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>UMGEBUNG</H2>

<DL COMPACT>
<DT id="36"><B>DPKG_ADMINDIR</B><DD>
Falls gesetzt und die Option <B>--admindir</B> nicht angegeben wurde, wird dies
als Basis-Administrationsverzeichnis verwandt.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>DATEIEN</H2>

<DL COMPACT>
<DT id="37"><I>/etc/alternatives/</I><DD>
Das standardm&auml;&szlig;ige Alternativ-Verzeichnis. Kann mittels der Option
<B>--altdir</B> ge&auml;ndert werden.
<DT id="38"><I>/var/lib/dpkg/alternatives/</I><DD>
Das standardm&auml;&szlig;ige administrative Verzeichnis. Kann mittels der
<B>--admindir</B> Option ge&auml;ndert werden.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>ABFRAGE-FORMAT</H2>

Das Format von <B>--query</B> ist ein RFC822-artiges, flaches Format. Es besteht
aus <I>n</I>+1 Bl&ouml;cken, wobei <I>n</I> die Anzahl der in einer abgefragten
Linkgruppe verf&uuml;gbaren Alternativen ist. Der erste Block enth&auml;lt die
folgenden Felder:
<DL COMPACT>
<DT id="39"><B>Name:</B><I> Name</I><DD>
Der alternative Name im Alternativ-Verzeichnis.
<DT id="40"><B>Link:</B><I> Link</I><DD>
Der generische Name der Alternative.
<DT id="41"><B>Slaves:</B><I> Liste-von-Slaves</I><DD>
Wenn diese Feld vorhanden ist enth&auml;lt die <B>n&auml;chste</B> Zeile alle Slave-Links,
die dem Masterlink dieser Alternativen zugeordnet sind. Pro Zeile wird ein
Slave aufgef&uuml;hrt. Jede Zeile enth&auml;lt ein Leerzeichen, den generischen Namen
des Slaves, ein weiteres Leerzeichen und den Pfad zu dem Slave-Link.
<DT id="42"><B>Status:</B><I> Status</I><DD>
Der Status der Alternative (<B>auto</B> oder <B>manual</B>).
<DT id="43"><B>Best:</B><I> beste-Wahl</I><DD>
Der Pfad der besten Alternative f&uuml;r diese Linkgruppe. Nicht vorhanden, falls
keine Alternative verf&uuml;gbar ist.
<DT id="44"><B>Value:</B><I> derzeit-ausgew&auml;hlte-Alternative</I><DD>
Der Pfad der derzeit ausgew&auml;hlten Alternative. Es akzeptiert auch den
magischen Wert <B>none</B>, der verwandt wird, falls der Link nicht existiert.
</DL>
<P>

Die anderen Bl&ouml;cke beschreiben die verf&uuml;gbaren Alternativen in der
abgefragten Linkgruppe:
<DL COMPACT>
<DT id="45"><B>Alternative:</B><I> Pfad-dieser-Alternativen</I><DD>
Pfad zum Block dieser Alternativen.
<DT id="46"><B>Priority:</B><I> Priorit&auml;tswert</I><DD>
Wert der Priorit&auml;t dieser Alternativen.
<DT id="47"><B>Slaves:</B><I> Liste-von-Slaves</I><DD>
Wenn dieses Feld vorhanden ist enth&auml;lt die <B>n&auml;chste</B> Zeile alle
Slave-Alternativen, die dem Masterlink dieser Alternativen zugeordnet
sind. Pro Zeile wird ein Slave aufgef&uuml;hrt. Jede Zeile enth&auml;lt ein
Leerzeichen, den generischen Namen des Slaves, ein weiteres Leerzeichen und
den Pfad zu der Slave-Alternative.
</DL>
<A NAME="lbAL">&nbsp;</A>
<H3>Beispiel</H3>

<PRE>
$ update-alternatives --query editor
Name: editor
Link: /usr/bin/editor
Slaves:
 editor.1.gz /usr/share/man/man1/editor.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/editor.1.gz
 editor.it.1.gz /usr/share/man/it/man1/editor.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/editor.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/editor.1.gz
Status: auto
Best: /usr/bin/vim.basic
Value: /usr/bin/vim.basic

Alternative: /bin/ed
Priority: -100
Slaves:
 editor.1.gz /usr/share/man/man1/ed.1.gz

Alternative: /usr/bin/vim.basic
Priority: 50
Slaves:
 editor.1.gz /usr/share/man/man1/vim.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/vim.1.gz
 editor.it.1.gz /usr/share/man/it/man1/vim.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/vim.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/vim.1.gz
</PRE>

<A NAME="lbAM">&nbsp;</A>
<H2>DIAGNOSE</H2>

Mit <B>--verbose</B> quatscht <B>update-alternatives</B> ohne Unterlass &uuml;ber seine
Aktivit&auml;ten auf seinem Standardausgabekanal. Falls Probleme auftreten, gibt
<B>update-alternatives</B> eine Fehlermeldung auf seinem Standardfehlerkanal aus
und beendet sich mit dem Exit-Status 2. Die Diagnostiken sollten
selbsterkl&auml;rend sein; falls Sie dies nicht so empfinden, melden Sie dies
bitte als Fehler.
<A NAME="lbAN">&nbsp;</A>
<H2>BEISPIELE</H2>

Es gibt mehrere Pakete, die einen zum <B>vi</B>-kompatiblen Texteditor
bereitstellen, beispielsweise <B>nvi</B> und <B>vim</B>. Welcher benutzt wird, wird
durch die Linkgruppe <B>vi</B> eingestellt, welche Links f&uuml;r das Programm selber
und die zugeh&ouml;rige Handbuchseite beinhaltet.
<P>

Um alle verf&uuml;gbaren Programme anzuzeigen, die <B>vi</B> bereitstellen, und die
dazu geh&ouml;rigen Einstellungen, benutzen Sie die Aktion <B>--display</B>:
<P>

<DL COMPACT><DT id="48"><DD>
<B>update-alternatives --display vi</B>
</DL>

<P>

Um eine bestimmte <B>vi</B>-Implementation auszuw&auml;hlen, benutzen Sie als Root
den folgenden Befehl und w&auml;hlen dann eine Zahl aus der Liste aus:
<P>

<DL COMPACT><DT id="49"><DD>
<B>update-alternatives --config vi</B>
</DL>

<P>

Um zur automatischen Auswahl der <B>vi</B>-Implementation zur&uuml;ckzukehren, f&uuml;hren
Sie folgendes als Root aus:
<P>

<DL COMPACT><DT id="50"><DD>
<B>update-alternatives --auto vi</B>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?1+ln">ln</A></B>(1), FHS, der Dateisystem Hierarchie-Standard (Filesystem Hierarchy
Standard).
<A NAME="lbAP">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="51"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="52"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="53"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="54"><A HREF="#lbAE">BEGRIFFE</A><DD>
<DT id="55"><A HREF="#lbAF">BEFEHLE</A><DD>
<DT id="56"><A HREF="#lbAG">OPTIONEN</A><DD>
<DT id="57"><A HREF="#lbAH">R&Uuml;CKGABEWERT</A><DD>
<DT id="58"><A HREF="#lbAI">UMGEBUNG</A><DD>
<DT id="59"><A HREF="#lbAJ">DATEIEN</A><DD>
<DT id="60"><A HREF="#lbAK">ABFRAGE-FORMAT</A><DD>
<DL>
<DT id="61"><A HREF="#lbAL">Beispiel</A><DD>
</DL>
<DT id="62"><A HREF="#lbAM">DIAGNOSE</A><DD>
<DT id="63"><A HREF="#lbAN">BEISPIELE</A><DD>
<DT id="64"><A HREF="#lbAO">SIEHE AUCH</A><DD>
<DT id="65"><A HREF="#lbAP">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
