
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of update-alternatives</TITLE>
</HEAD><BODY>
<H1>update-alternatives</H1>
Section: suite dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

update-alternatives - mantiene collegamenti simbolici che determinano i
comandi predefiniti
<A NAME="lbAC">&nbsp;</A>
<H2>SINTASSI</H2>

<B>update-alternatives</B> [<I>opzione</I>...] <I>comando</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIZIONE</H2>

<B>update-alternatives</B> crea, rimuove, mantiene e visualizza informazioni sui
collegamenti simbolici che costituiscono il sistema di alternative di
Debian.
<P>

&Egrave; possibile che in un dato momento nel sistema siano installati pi&ugrave;
programmi che hanno la stessa funzione o una funzione simile. Per esempio,
molti sistemi hanno diversi editor di testo installati
contemporaneamente. Questo d&agrave; agli utenti del sistema una possibilit&agrave; di
scelta, permettendo a ciascuno di usare un editor diverso, se lo desidera,
ma rende difficile per un programma fare una buona scelta quando deve
invocare un editor se l'utente non ha impostato una preferenza specifica.
<P>

Il sistema delle alternative Debian mira a risolvere questo problema. Nel
file system tutti i file che forniscono una funzionalit&agrave; intercambiabile
condividono un nome generico. Il sistema delle alternative e
l'amministratore di sistema insieme determinano a quale file faccia
effettivamente riferimento questo nome generico. Per esempio, se sul sistema
sono installati entrambi gli editor di testo <B><A HREF="/cgi-bin/man/man2html?1+ed">ed</A></B>(1) e <B><A HREF="/cgi-bin/man/man2html?1+nvi">nvi</A></B>(1), il
sistema delle alternative far&agrave; s&igrave; che il nome generico <I>/usr/bin/editor</I>
faccia in modo predefinito riferimento a <I>/usr/bin/nvi</I>. L'amministratore
di sistema pu&ograve; sovrascrivere ci&ograve; e far s&igrave; che esso faccia invece riferimento
a <I>/usr/bin/ed</I>, e il sistema delle alternative non modificher&agrave; questa
impostazione se ci&ograve; non viene esplicitamente richiesto.
<P>

Il nome generico non &egrave; un collegamento simbolico diretto all'alternativa
selezionata. &Egrave; invece un collegamento simbolico a un nome nella <I>directory</I>
<I>alternatives</I>, che &egrave; a sua volta un collegamento simbolico all'effettivo
file referenziato. Tutto questo perch&eacute; cos&igrave; le modifiche fatte
dall'amministratore di sistema possono rimanere confinate nella directory
<I>/etc</I>: il FHS (q.v.) spiega le ragioni per cui questa &egrave; una Cosa Buona e
Giusta.
<P>

Al momento dell'installazione, cambiamento o rimozione di ogni pacchetto che
fornisce un file con una particolare funzionalit&agrave;, viene invocato
<B>update-alternatives</B> per aggiornare le informazioni su quel file nel
sistema delle alternative. <B>update-alternatives</B> viene solitamente chiamato
dagli script <B>postinst</B> (configurazione) o <B>prerm</B> (rimozione e
deconfigurazione) dei pacchetti Debian.
<P>

Spesso &egrave; utile che un certo numero di alternative siano sincronizzate, in
modo da venir modificate in gruppo; per esempio, quando sono installate
diverse versioni dell'editor <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1), la pagina di manuale a cui fa
riferimento <I>/usr/share/man/man1/vi.1</I> dovrebbe corrispondere
all'eseguibile a cui fa riferimento <I>/usr/bin/vi</I>. <B>update-alternatives</B>
gestisce questo usando collegamenti <I>principali</I> e <I>secondari</I>; quando
viene modificato il principale, anche tutti i secondari ad esso associati
vengono modificati. Un collegamento principale e tutti i suoi secondari
associati compongono un <I>gruppo di</I> <I>collegamenti</I>.
<P>

In qualsiasi momento, ogni gruppo di collegamenti &egrave; in una di due modalit&agrave;:
automatica o manuale. Quando un gruppo &egrave; in modalit&agrave; automatica, il sistema
delle alternative decider&agrave; automaticamente se e come aggiornare i
collegamenti quando i pacchetti vengono installati o rimossi. In modalit&agrave;
manuale, il sistema delle alternative preserva le scelte dell'amministratore
ed evita di modificare i collegamenti (tranne quando qualcosa non &egrave;
corretto).
<P>

I gruppi di collegamenti sono inizialmente in modalit&agrave; automatica, quando
vengono introdotti nel sistema. Se l'amministratore del sistema fa modifiche
alle impostazioni automatiche del sistema, queste verranno notate alla
successiva esecuzione di <B>update-alternatives</B> sul gruppo di collegamenti
modificato e il gruppo automaticamente verr&agrave; passato alla modalit&agrave; manuale.
<P>

Ogni alternativa &egrave; associata ad una <I>priorit&agrave;</I>. Quando un gruppo di
collegamenti &egrave; in modalit&agrave; automatica, le alternative a cui puntano i membri
del gruppo saranno quelle con la priorit&agrave; pi&ugrave; alta.
<P>

When using the <B>--config</B> option, <B>update-alternatives</B> will list all of
the choices for the link group of which given <I>name</I> is the master
alternative name.  The current choice is marked with a '*'.  You will then
be prompted for your choice regarding this link group.  Depending on the
choice made, the link group might no longer be in <I>auto</I> mode. You will
need to use the <B>--auto</B> option in order to return to the automatic mode
(or you can rerun <B>--config</B> and select the entry marked as automatic).
<P>

Se si vuole fare la configurazione in modo non interattivo, si pu&ograve; usare
invece l'opzione <B>--set</B> (vedere in seguito).
<P>

Pacchetti diversi che forniscono lo stesso file devono farlo
<B>cooperando</B>. In altre parole, l'uso di <B>update-alternatives</B> &egrave;
<B>obbligatorio</B> per tutti i pacchetti coinvolti in un caso simile. Non &egrave;
possibile sovrascrivere un file in un pacchetto che non utilizza il
meccanismo <B>update-alternatives</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>TERMINOLOGIA</H2>

Dato che le attivit&agrave; di <B>update-alternatives</B> sono piuttosto convolute,
alcuni termini specifici aiutano a spiegare il suo funzionamento.
<DL COMPACT>
<DT id="1">nome generico (o collegamento dell'alternativa)<DD>
Un nome, come <I>/usr/bin/editor</I>, che fa riferimento, utilizzando il sistema
delle alternative, ad uno di svariati file con funzione similare.
<DT id="2">nome dell'alternativa<DD>
Il nome di un collegamento simbolico nella directory delle alternative.
<DT id="3">alternativa (o percorso alternativo)<DD>
Il nome di uno specifico file nel file system, che pu&ograve; essere reso
accessibile attraverso un nome generico utilizzando il sistema delle
alternative.
<DT id="4">directory delle alternative<DD>
Una directory, in modo predefinito <I>/etc/alternatives</I>, che contiene i
collegamenti simbolici.
<DT id="5">directory di amministrazione<DD>
Una directory, in modo predefinito <I>/var/lib/dpkg/alternatives</I>, che contiene
le informazioni di stato di <B>update-alternatives</B>.
<DT id="6">gruppo di collegamenti<DD>
Un insieme di collegamenti simbolici correlati, pensato per essere
aggiornato in gruppo.
<DT id="7">collegamento principale<DD>
Il collegamento dell'alternativa, in un gruppo di collegamenti, che
determina come sono configurati gli altri collegamenti nel gruppo
<DT id="8">collegamento secondario<DD>
Un collegamento dell'alternativa, in un gruppo di collegamenti, che &egrave;
controllato dall'impostazione del collegamento principale.
<DT id="9">modalit&agrave; automatica<DD>
Quando un gruppo di collegamenti &egrave; in modalit&agrave; automatica, il sistema delle
alternative assicura che i collegamenti nel gruppo puntino all'alternativa
con la priorit&agrave; pi&ugrave; alta appropriata per il gruppo.
<DT id="10">modalit&agrave; manuale<DD>
Quando un gruppo di collegamenti &egrave; in modalit&agrave; manuale, il sistema delle
alternative non fa alcuna modifica alle impostazioni dell'amministratore di
sistema.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>COMANDI</H2>

<DL COMPACT>
<DT id="11"><B>--install</B> <I>collegamento nome percorso priorit&agrave;</I> [<B>--slave</B> <I>collegamento nome percorso</I>]...<DD>
Aggiunge un gruppo di alternative al sistema. <I>collegamento</I> &egrave; il nome
generico del collegamento principale, <I>nome</I> &egrave; il nome del suo collegamento
simbolico nella directory delle alternative e <I>percorso</I> &egrave; l'alternativa
che viene introdotta per il collegamento principale. Gli argomenti che
seguono <B>--slave</B> sono il nome generico, il nome del collegamento simbolico
nella directory delle alternative e il percorso dell'alternativa per un
collegamento secondario. Possono essere specificate zero o pi&ugrave; opzioni
<B>--slave</B>, ciascuna fatta seguire da tre argomenti. Notare che
l'alternativa principale deve esistere o la chiamata non avr&agrave;
successo. Tuttavia, se un'alternativa secondaria non esiste, il collegamento
corrispondente semplicemente non verr&agrave; installato (verr&agrave; comunque
visualizzato un messaggio di avvertimento). Se dove deve essere installato
un collegamento di un'alternativa &egrave; installato un qualche file reale, esso
viene conservato, a meno che non venga usata l'opzione <B>--force</B>.
<DT id="12"><DD>
Se il nome dell'alternativa specificato esiste gi&agrave; nel registro del sistema
delle alternative, le informazioni fornite verranno aggiunte come un nuovo
insieme di alternative per il gruppo. Altrimenti viene aggiunto un nuovo
gruppo con queste informazioni, impostato in modalit&agrave; automatica. Se il
gruppo &egrave; in modalit&agrave; automatica, e la priorit&agrave; delle alternative appena
aggiunte &egrave; pi&ugrave; alta di qualsiasi altra alternativa installata per questo
gruppo, i collegamenti simbolici verranno aggiornati per puntare alle
alternative appena aggiunte.
<DT id="13"><B>--set</B> <I>nome percorso</I><DD>
Imposta il programma <I>percorso</I> come alternativa per <I>nome</I>. &Egrave; equivalente
a <B>--config</B> ma non &egrave; interattivo e perci&ograve; &egrave; utilizzabile in script.
<DT id="14"><B>--remove</B> <I>nome percorso</I><DD>
Rimuove un'alternativa e tutti i collegamenti secondari associati. <I>nome</I> &egrave;
il nome nella directory delle alternative e <I>percorso</I> &egrave; un nome file
assoluto a cui pu&ograve; essere collegato <I>nome</I>. Se <I>nome</I> &egrave; in effetti
collegato a <I>percorso</I>, <I>nome</I> sar&agrave; aggiornato in modo da puntare ad
un'altra alternativa appropriata (e il gruppo verr&agrave; rimesso in modalit&agrave;
automatica), oppure rimosso se non c'&egrave; pi&ugrave; alcuna alternativa corretta. I
collegamenti secondari associati verranno analogamente aggiornati o
rimossi. Se il collegamento attualmente non punta a <I>percorso</I>, non verr&agrave;
modificato alcun collegamento; verranno solamente rimosse le informazioni
riguardanti l'alternativa.
<DT id="15"><B>--remove-all</B> <I>nome</I><DD>
Rimuove tutte le alternative e tutti i loro collegamenti secondari
associati. <I>nome</I> &egrave; un nome nella directory delle alternative.
<DT id="16"><B>--all</B><DD>
Invoca <B>--config</B> su tutte le alternative. Pu&ograve; essere proficuamente
combinato con <B>--skip-auto</B> per rivedere e configurare tutte le alternative
che non sono configurate in modalit&agrave; automatica. Vengono mostrate anche le
alternative non corrette. Perci&ograve; un modo semplice per correggere tutte le
alternative difettose &egrave; di chiamare <B>yes '' | update-alternatives --force
--all</B>.
<DT id="17"><B>--auto</B> <I>nome</I><DD>
Fa passare in modalit&agrave; automatica il gruppo di collegamenti relativo
all'alternativa per <I>nome</I>. Nel fare ci&ograve;, il collegamento simbolico
principale e i suoi collegamenti secondari sono aggiornati in modo da
puntare alle alternative installate con la priorit&agrave; pi&ugrave; alta.
<DT id="18"><B>--display</B> <I>nome</I><DD>
Display information about the link group.  Information displayed includes
the group's mode (auto or manual), the master and slave links, which
alternative the master link currently points to, what other alternatives are
available (and their corresponding slave alternatives), and the highest
priority alternative currently installed.
<DT id="19"><B>--get-selections</B><DD>
List all master alternative names (those controlling a link group)  and
their status (since version 1.15.0).  Each line contains up to 3 fields
(separated by one or more spaces). The first field is the alternative name,
the second one is the status (either <B>auto</B> or <B>manual</B>), and the last one
contains the current choice in the alternative (beware: it's a filename and
thus might contain spaces).
<DT id="20"><B>--set-selections</B><DD>
Read configuration of alternatives on standard input in the format generated
by <B>--get-selections</B> and reconfigure them accordingly (since version
1.15.0).
<DT id="21"><B>--query</B> <I>nome</I><DD>
Display information about the link group like <B>--display</B> does, but in a
machine parseable way (since version 1.15.0, see section <B>QUERY FORMAT</B>
below).
<DT id="22"><B>--list</B> <I>nome</I><DD>
Visualizza tutte le destinazioni del gruppo di collegamenti
<DT id="23"><B>--config</B> <I>nome</I><DD>
Visualizza le alternative disponibili per un gruppo di collegamenti e
permette all'utente di selezionare in modo interattivo quale usare. Il
gruppo di collegamenti viene aggiornato.
<DT id="24"><B>--help</B><DD>
Mostra il messaggio sull'uso ed esce.
<DT id="25"><B>--version</B><DD>
Mostra la versione ed esce.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>OPZIONI</H2>

<DL COMPACT>
<DT id="26"><B>--altdir</B><I> directory</I><DD>
Specifica la directory delle alternative, quando deve essere diversa da
quella predefinita.
<DT id="27"><B>--admindir</B><I> directory</I><DD>
Specifica la directory di amministrazione, quando deve essere diversa da
quella predefinita.
<DT id="28"><B>--log</B><I> file</I><DD>
Specifies the log file (since version 1.15.0), when this is to be different
from the default (/var/log/alternatives.log).
<DT id="29"><B>--force</B><DD>
Allow replacing or dropping any real file that is installed where an
alternative link has to be installed or removed.
<DT id="30"><B>--skip-auto</B><DD>
Salta la richiesta di input sulla configurazione per le alternative che sono
configurate in modo corretto in modalit&agrave; automatica. Questa opzione &egrave;
rilevante solo con <B>--config</B> o <B>--all</B>.
<DT id="31"><B>--quiet</B><DD>
Do not generate any comments unless errors occur.
<DT id="32"><B>--verbose</B><DD>
Generate more comments about what is being done.
<DT id="33"><B>--debug</B><DD>
Generate even more comments, helpful for debugging, about what is being done
(since version 1.19.3).
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>STATO D'USCITA</H2>

<DL COMPACT>
<DT id="34"><B>0</B><DD>
L'azione richiesta &egrave; stata effettuata con successo.
<DT id="35"><B>2</B><DD>
Si sono verificati dei problemi nell'analisi della riga di comando o
nell'effettuare l'azione.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>AMBIENTE</H2>

<DL COMPACT>
<DT id="36"><B>DPKG_ADMINDIR</B><DD>
Se impostata e l'opzione <B>--admindir</B> non &egrave; stata specificata, verr&agrave; usata
come directory di amministrazione di base.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>FILE</H2>

<DL COMPACT>
<DT id="37"><I>/etc/alternatives/</I><DD>
La directory delle alternative predefinita. La directory considerata pu&ograve;
essere modificata usando l'opzione <B>--altdir</B>.
<DT id="38"><I>/var/lib/dpkg/alternatives/</I><DD>
La directory di amministrazione predefinita. La directory considerata pu&ograve;
essere modificata usando l'opzione <B>--admindir</B>.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>FORMATO DI QUERY</H2>

The <B>--query</B> format is using an RFC822-like flat format. It's made of <I>n</I>
+ 1 blocks where <I>n</I> is the number of alternatives available in the queried
link group. The first block contains the following fields:
<DL COMPACT>
<DT id="39"><B>Name:</B><I> nome</I><DD>
Il nome dell'alternativa nella directory delle alternative.
<DT id="40"><B>Link:</B><I> collegamento</I><DD>
Il nome generico dell'alternativa.
<DT id="41"><B>Slaves:</B><I> elenco di collegamenti secondari</I><DD>
Quando &egrave; presente questo campo, le righe <B>successive</B> contengono tutti i
collegamenti secondari associati con il collegamento principale
dell'alternativa, uno per riga. Ogni riga contiene uno spazio, il nome
generico dell'alternativa secondaria, un altro spazio e il percorso del
collegamento secondario.
<DT id="42"><B>Status:</B><I> stato</I><DD>
Lo stato dell'alternativa (<B>auto</B> o <B>manual</B>).
<DT id="43"><B>Best:</B><I> scelta-migliore</I><DD>
Il percorso all'alternativa migliore per questo gruppo di collegamenti; non
&egrave; presente se non c'&egrave; alcuna alternativa disponibile.
<DT id="44"><B>Value:</B><I> alternativa-attualmente-selezionata</I><DD>
Il percorso dell'alternativa attualmente selezionata. Pu&ograve; anche avere il
valore magico <B>none</B>. Viene usato se il collegamento non esiste.
</DL>
<P>

Gli altri blocchi descrivono le alternative disponibili nel gruppo di
collegamenti interrogato:
<DL COMPACT>
<DT id="45"><B>Alternative:</B><I> percorso-di-questa-alternativa</I><DD>
Percorso dell'alternativa di questo blocco.
<DT id="46"><B>Priority:</B><I> valore-priorit&agrave;</I><DD>
Valore della priorit&agrave; di questa alternativa.
<DT id="47"><B>Slaves:</B><I> elenco di collegamenti secondari</I><DD>
Quando &egrave; presente questo campo, le righe <B>successive</B> contengono tutte le
alternative secondarie associate con il collegamento principale
dell'alternativa, uno per riga. Ogni riga contiene uno spazio, il nome
generico dell'alternativa secondaria, un altro spazio e il percorso
dell'alternativa secondaria.
</DL>
<A NAME="lbAL">&nbsp;</A>
<H3>Example</H3>

<PRE>
$ update-alternatives --query editor
Name: editor
Link: /usr/bin/editor
Slaves:
 editor.1.gz /usr/share/man/man1/editor.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/editor.1.gz
 editor.it.1.gz /usr/share/man/it/man1/editor.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/editor.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/editor.1.gz
Status: auto
Best: /usr/bin/vim.basic
Value: /usr/bin/vim.basic

Alternative: /bin/ed
Priority: -100
Slaves:
 editor.1.gz /usr/share/man/man1/ed.1.gz

Alternative: /usr/bin/vim.basic
Priority: 50
Slaves:
 editor.1.gz /usr/share/man/man1/vim.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/vim.1.gz
 editor.it.1.gz /usr/share/man/it/man1/vim.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/vim.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/vim.1.gz
</PRE>

<A NAME="lbAM">&nbsp;</A>
<H2>DIAGNOSTICA</H2>

Con <B>--verbose</B>, <B>update-alternatives</B> si dilunga sul suo standard output
in modo incessante su cosa sta facendo. Se si verificano dei problemi,
<B>update-alternatives</B> produce in output messaggi di errore nel suo canale
dello standard error e restituisce uno stato di uscita 2. Questi messaggi
diagnostici dovrebbero essere autoesplicativi; se non li si ritiene tali,
segnalare la cosa come un bug.
<A NAME="lbAN">&nbsp;</A>
<H2>ESEMPI</H2>

Ci sono svariati pacchetti che forniscono un editor di testo compatibile con
<B>vi</B>, per esempio <B>nvi</B> e <B>vim</B>. Quello da usarsi &egrave; controllato dal
gruppo di collegamenti <B>vi</B>, che include i collegamenti per il programma
stesso e per la pagina di manuale associata.
<P>

Per visualizzare tutti i pacchetti disponibili che forniscono <B>vi</B> e la sua
impostazione attuale, usare l'azione <B>--display</B>:
<P>

<DL COMPACT><DT id="48"><DD>
<B>update-alternatives --display vi</B>
</DL>

<P>

Per scegliere una particolare implementazione di <B>vi</B>, usare questo comando
da root e poi selezionare un numero dall'elenco:
<P>

<DL COMPACT><DT id="49"><DD>
<B>update-alternatives --config vi</B>
</DL>

<P>

Per ritornare alla scelta automatica dell'implementazione di <B>vi</B>, usare
questo da root:
<P>

<DL COMPACT><DT id="50"><DD>
<B>update-alternatives --auto vi</B>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>VEDERE ANCHE</H2>

<B><A HREF="/cgi-bin/man/man2html?1+ln">ln</A></B>(1), FHS: lo standard per la gerarchia del file system.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="51"><A HREF="#lbAB">NOME</A><DD>
<DT id="52"><A HREF="#lbAC">SINTASSI</A><DD>
<DT id="53"><A HREF="#lbAD">DESCRIZIONE</A><DD>
<DT id="54"><A HREF="#lbAE">TERMINOLOGIA</A><DD>
<DT id="55"><A HREF="#lbAF">COMANDI</A><DD>
<DT id="56"><A HREF="#lbAG">OPZIONI</A><DD>
<DT id="57"><A HREF="#lbAH">STATO D'USCITA</A><DD>
<DT id="58"><A HREF="#lbAI">AMBIENTE</A><DD>
<DT id="59"><A HREF="#lbAJ">FILE</A><DD>
<DT id="60"><A HREF="#lbAK">FORMATO DI QUERY</A><DD>
<DL>
<DT id="61"><A HREF="#lbAL">Example</A><DD>
</DL>
<DT id="62"><A HREF="#lbAM">DIAGNOSTICA</A><DD>
<DT id="63"><A HREF="#lbAN">ESEMPI</A><DD>
<DT id="64"><A HREF="#lbAO">VEDERE ANCHE</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:04 GMT, March 31, 2021
</BODY>
</HTML>
