
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_PREFERENCES</TITLE>
</HEAD><BODY>
<H1>APT_PREFERENCES</H1>
Section: APT (5)<BR>Updated: 17&nbsp;gennaio&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt_preferences - file di controllo delle preferenze per APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIZIONE</H2>

<P>

Il file delle preferenze di APT,
/etc/apt/preferences
e i file frammento nella directory
/etc/apt/preferences.d/
possono essere usati per controllare quale versione verr&agrave; selezionata per l'installazione.
<P>

Quando il file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
contiene riferimenti a pi&ugrave; di una distribuzione, potrebbero essere disponibili per l'installazione diverse versioni di un pacchetto (ad esempio
stable
e
testing). APT assegna una priorit&agrave; a ciascuna versione che &egrave; disponibile. Tenendo in considerazione i limiti imposti dalle dipendenze,
<B>apt-get</B>
seleziona per l'installazione la versione con la pi&ugrave; alta priorit&agrave;. Le preferenze di APT scavalcano le priorit&agrave; che APT assegna in modo predefinito alle versioni dei pacchetti, dando perci&ograve; all'utente il controllo su quale venga selezionata per l'installazione.
<P>

Quando il file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
contiene riferimenti a pi&ugrave; di una fonte, potrebbero essere disponibili pi&ugrave; istanze della stessa versione di un pacchetto. In questo caso
<B>apt-get</B>
scarica l'istanza elencata per prima nel file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). Le preferenze di APT non hanno effetto sulla scelta dell'istanza, ma solo sulla scelta della versione.
<P>

Le preferenze sono uno strumento potente nelle mani di un amministratore di sistema, ma possono anche diventare il suo incubo peggiore se usate con poca cautela! APT non mette in dubbio le preferenze scelte, perci&ograve; impostazioni sbagliate possono avere come risultato pacchetti non installabili o decisioni sbagliate durante l'aggiornamento dei pacchetti. Se vengono mescolati pi&ugrave; rilasci di distribuzione pu&ograve; sorgere un numero ancora pi&ugrave; grande di problemi, se non si sono capiti bene i concetti spiegati nei prossimi paragrafi. I pacchetti inclusi in uno specifico rilascio non sono testati (e perci&ograve; non sempre funzionano come atteso) in rilasci pi&ugrave; vecchi o pi&ugrave; nuovi, o insieme ad altri pacchetti da altri rilasci. Ci si consideri avvertiti.
<P>

Notare che i file nella directory
/etc/apt/preferences.d
vengono analizzati in ordine alfanumerico crescente e i loro nomi devono conformarsi alle seguenti convenzioni: non devono avere estensione o avere estensione &quot;pref&quot;, e possono contenere solo caratteri alfanumerici, trattini (-), trattini bassi (_) e punti (.). In caso contrario APT stampa un messaggio che informa che un file &egrave; stato ignorato, a meno che tale file non corrisponda ad un modello nell'elenco di configurazione
Dir::Ignore-Files-Silently, nel qual caso viene ignorato in modo silenzioso.
<A NAME="lbAD">&nbsp;</A>
<H3>Assegnazioni della priorit&agrave; predefinite di APT</H3>

<P>

Se non c'&egrave; alcun file di preferenze o non c'&egrave; nel file una voce applicabile ad una versione particolare, allora la priorit&agrave; assegnata a quella versione &egrave; la priorit&agrave; della distribuzione a cui essa appartiene. &Egrave; possibile distinguere una distribuzione, il &laquo;rilascio obiettivo&raquo;, che riceve in modo predefinito una priorit&agrave; maggiore delle altre distribuzioni. Il rilascio obiettivo pu&ograve; essere impostato nella riga di comando di
<B>apt-get</B>
o nel file di configurazione di APT,
/etc/apt/apt.conf. Notare che questa impostazione ha precedenza rispetto a qualsiasi priorit&agrave; generale sia stata impostata nel file
/etc/apt/preferences
descritto in seguito, ma non rispetto a pacchetti per cui &egrave; specificatamente indicato un pin. Per esempio,
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<B>apt-get install -t testing </B><B></B><I>un-pacchetto</I>
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
APT::Default-Release &quot;stable&quot;;
</PRE>

</DL>




<P>

Se il rilascio obiettivo &egrave; stato specificato, allora APT usa il seguente algoritmo per impostare le priorit&agrave; delle versioni di un pacchetto. Assegna:
<P>

priorit&agrave; 1
<DL COMPACT><DT id="3"><DD>
alle versioni che provengono da archivi che, nei loro file
Release, sono contrassegnati come &laquo;NotAutomatic: yes&raquo;, ma non come &laquo;ButAutomaticUpgrades: yes&raquo;, come l'archivio Debian
experimental.
</DL>

<P>

priorit&agrave; 100
<DL COMPACT><DT id="4"><DD>
alla versione che &egrave; gi&agrave; installata (se esiste) e alla versioni che provengono da archivi che, nei loro file
Release, sono contrassegnati come &laquo;NotAutomatic: yes&raquo; e &laquo;ButAutomaticUpgrades: yes&raquo;, come l'archivio Debian backports a partire da
squeeze-backports.
</DL>

<P>

priorit&agrave; 500
<DL COMPACT><DT id="5"><DD>
alle versioni che non appartengono al rilascio obiettivo.
</DL>

<P>

priorit&agrave; 990
<DL COMPACT><DT id="6"><DD>
alle versioni che appartengono al rilascio obiettivo.
</DL>

Alla versione viene assegnata la pi&ugrave; alta di queste priorit&agrave; la cui descrizione corrisponde alla versione.
<P>

Se il rilascio obiettivo non &egrave; stato specificato, allora APT assegna semplicemente la priorit&agrave; 100 a tutte le versioni di pacchetto installate e la priorit&agrave; 500 a tutte le versioni di pacchetto non installate, tranne le versioni che provengono da archivi che, nei loro file
Release, sono contrassegnati come &laquo;NotAutomatic: yes&raquo;; queste ultime versioni hanno priorit&agrave; 1, oppure priorit&agrave; 100 se sono in aggiunta contrassegnate come &laquo;ButAutomaticUpgrades: yes&raquo;.
<P>

Per determinare quale versione di un pacchetto installare APT applica poi le seguenti regole, elencate in ordine di precedenza.
<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Non retrocede mai ad una versione pi&ugrave; bassa, a meno che la priorit&agrave; della versione disponibile non sia maggiore di 1000. (&laquo;Retrocedere&raquo; significa installare una versione meno recente di un pacchetto al posto di una pi&ugrave; recente. Notare che nessuna delle priorit&agrave; predefinite di APT &egrave; maggiore di 1000; priorit&agrave; cos&igrave; alte possono solo essere impostate nel file delle preferenze. Notare inoltre che retrocedere un pacchetto pu&ograve; essere rischioso.)
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Installa la versione con la priorit&agrave; pi&ugrave; alta.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Se due o pi&ugrave; versioni hanno la stessa priorit&agrave;, installa la versione pi&ugrave; recente (cio&egrave; quella con il numero di versione pi&ugrave; alto).
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Se due o pi&ugrave; versioni hanno la stessa priorit&agrave; e lo stesso numero di versione, ma hanno una qualche differenza in alcuni dei loro metadati, oppure viene usata l'opzione
--reinstall, installa quella non installata.
</DL>

<P>

In una situazione tipica, la versione installata di un pacchetto (priorit&agrave; 100) non &egrave; cos&igrave; recente come una delle versioni disponibili dalle fonti elencate nel file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
(priorit&agrave; 500 o 990). Quindi il pacchetto viene aggiornato quando viene eseguito
<B>apt-get install </B><B></B><I>un-pacchetto</I>
o
<B>apt-get upgrade</B>.
<P>

Pi&ugrave; raramente, la versione installata di un pacchetto &egrave;
<I>pi&ugrave;</I>
recente di qualsiasi altra versione disponibile. Il pacchetto non viene retrocesso quando viene eseguito
<B>apt-get install </B><B></B><I>un-pacchetto</I>
o
<B>apt-get upgrade</B>.
<P>

A volte la versione installata di un pacchetto &egrave; pi&ugrave; recente di quella che appartiene al rilascio obiettivo, ma non cos&igrave; recente come la versione che appartiene a qualche altra distribuzione. Un tale pacchetto verr&agrave; di fatto aggiornato quando viene eseguito
<B>apt-get install </B><B></B><I>un-pacchetto</I>
o
<B>apt-get upgrade</B>, perch&eacute; almeno
<I>una</I>
delle versioni disponibili ha una priorit&agrave; pi&ugrave; alta di quella installata.
<A NAME="lbAE">&nbsp;</A>
<H3>L'effetto delle preferenze di APT</H3>

<P>

Il file delle preferenze di APT permette all'amministratore di sistema di controllare l'assegnazione delle priorit&agrave;. Il file consiste di uno o pi&ugrave; record su pi&ugrave; righe, separati da righe vuote. I record possono avere una tra due forme: una forma specifica e una forma generica.
<P>
<DL COMPACT><DT id="11"><DD>
&bull;


La forma specifica assegna una priorit&agrave; (una &laquo;Pin-Priority&raquo;) ad uno o pi&ugrave; pacchetti specifici con una versione o un intervallo di versioni specifici. Ad esempio, il record seguente assegna una priorit&agrave; alta a tutte le versioni del pacchetto
perl
il cui numero di versione inizia con &laquo;5.20&raquo;. Pi&ugrave; pacchetti possono essere separati da spazi.
<P>
<DL COMPACT><DT id="12"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001
</PRE>

</DL>




</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


La forma generica assegna una priorit&agrave; a tutte le versioni di pacchetto in una data distribuzione (cio&egrave; a tutte le versioni dei pacchetti che sono elencati in un determinato file
Release) o a tutte le versioni di pacchetto che provengono da un particolare sito Internet identificato in base al suo nome di dominio pienamente qualificato.
<P>
Queste voci in forma generica nel file di preferenze di APT si applicano solo ai gruppi di pacchetti. Per esempio, il record seguente assegna una priorit&agrave; alta a tutte le versioni di pacchetto disponibili dal sito locale.
<P>
<DL COMPACT><DT id="14"><DD>



<PRE>
Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Un avvertimento: la parola chiave usata in questo caso &egrave; &laquo;origin&raquo; e pu&ograve; essere usata per indicare un nome host. Il record seguente assegna una priorit&agrave; alta a tutte le versioni disponibili dal server identificato dal nome host &laquo;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&raquo;
<P>
<DL COMPACT><DT id="15"><DD>



<PRE>
Package: *
Pin: origin &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Questo
<I>non</I>
deve essere confuso con l'Origine di una distribuzione come indicata in un file
Release. Ci&ograve; che segue il tag &laquo;Origin:&raquo; in un file
Release
non &egrave; un indirizzo Internet, ma un nome di autore o produttore, come &laquo;Debian&raquo; o &laquo;Ximian&raquo;.
<P>
Il record seguente assegna una priorit&agrave; bassa a tutte le versioni di pacchetto che appartengono ad una qualsiasi distribuzione il cui nome di archivio &egrave; &laquo;unstable&raquo;.
<P>
<DL COMPACT><DT id="16"><DD>



<PRE>
Package: *
Pin: release a=unstable
Pin-Priority: 50
</PRE>

</DL>




<P>
Il record seguente assegna una priorit&agrave; alta a tutte le versioni di pacchetto che appartengono ad una qualsiasi distribuzione il cui nome in codice &egrave; &laquo;bullseye&raquo;.
<P>
<DL COMPACT><DT id="17"><DD>



<PRE>
Package: *
Pin: release n=bullseye
Pin-Priority: 900
</PRE>

</DL>




<P>
Il record seguente assegna una priorit&agrave; alta a tutte le versioni di pacchetto che appartengono ad un qualsiasi rilascio il cui nome di archivio &egrave; &laquo;stable&raquo; e il cui numero di versione del rilascio &egrave; &laquo;10&raquo;.
<P>
<DL COMPACT><DT id="18"><DD>



<PRE>
Package: *
Pin: release a=stable, v=10
Pin-Priority: 500
</PRE>

</DL>




</DL>

<P>
L'effetto dell'operatore virgola &egrave; simile ad un &laquo;AND&raquo; nella logica: tutte le condizioni devono essere soddisfatte affinche il pin faccia corrispondenza. Esiste una sola eccezione: per ciascun tipo di condizione (come due condizioni &laquo;a&raquo;), solo l'ultima di queste condizioni viene controllata.
<A NAME="lbAF">&nbsp;</A>
<H3>Sintassi per le espressioni regolari e <A HREF="/cgi-bin/man/man2html?7+glob">glob</A>(7)</H3>

<P>

APT permette anche di impostare priorit&agrave; di pin usando espressioni
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
ed espressioni regolari racchiuse tra sbarre (&laquo;/&raquo;). L'esempio seguente assegna, ad esempio, la priorit&agrave; 500 a tutti i pacchetti da experimental il cui nome inizia con gnome (indicato con un'espressione in stile
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)) oppure contiene la parola kde (indicato in forma di espressione regolare estesa POSIX racchiusa tra sbarre).
<P>
<DL COMPACT><DT id="19"><DD>



<PRE>
Package: gnome* /kde/
Pin: release a=experimental
Pin-Priority: 500
</PRE>

</DL>




<P>

Di norma queste espressioni possono essere utilizzate ovunque c'&egrave; una stringa. Perci&ograve; il pin seguente assegna la priorit&agrave; 990 a tutti i pacchetti provenienti da un rilascio il cui nome inizia con focal.
<P>
<DL COMPACT><DT id="20"><DD>



<PRE>
Package: *
Pin: release n=focal*
Pin-Priority: 990
</PRE>

</DL>




<P>

Se un'espressione regolare viene usata in un campo
Package, il comportamento &egrave; equivalente a quello che si otterrebbe se l'espressione regolare fosse sostituita da un elenco di tutti i nomi di pacchetto a cui corrisponde. Non &egrave; chiaro se questo comportamento verr&agrave; modificato in futuro; perci&ograve; si dovrebbero sempre indicare per primi i pin con caratteri jolly, in modo che i pin specifici successivi abbiano precedenza su di essi. Il modello &laquo;*&raquo; in un campo Package non viene considerato come un'espressione
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7).
<A NAME="lbAG">&nbsp;</A>
<H3>Pinning by source package</H3>

<P>

APT supports pinning by source packages. To pin by a source package, prepend &quot;src:&quot; to the package name.
<P>

For example, to pin all binaries produced by the apt source package of this APT's version to 990, you can do:
<P>
<DL COMPACT><DT id="21"><DD>



<PRE>
Package: src:apt
Pin: version 2.0.4
Pin-Priority: 990
</PRE>

</DL>




<P>

Source package pinning can be combined with regular expressions and glob patterns, and can also take a binary architecture.
<P>

For example, let's pin all binaries for all architectures produced by any source package containing apt in its name to 990:
<P>
<DL COMPACT><DT id="22"><DD>



<PRE>
Package: src:*apt*:any
Pin: version *
Pin-Priority: 990
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H3>Come APT interpreta le priorit&agrave;</H3>

<P>

Le priorit&agrave; (P) assegnate nel file delle preferenze di APT devono essere rappresentate da interi positivi o negativi. Vengono interpretate nel modo seguente (semplificando le cose):
<P>

P &gt;= 1000
<DL COMPACT><DT id="23"><DD>
causa l'installazione di una versione anche se ci&ograve; costituisce una retrocessione del pacchetto
</DL>

<P>

990 &lt;= P &lt; 1000
<DL COMPACT><DT id="24"><DD>
causa l'installazione di una versione anche se non proviene dal rilascio obiettivo, a meno che la versione installata non sia pi&ugrave; recente
</DL>

<P>

500 &lt;= P &lt; 990
<DL COMPACT><DT id="25"><DD>
causa l'installazione di una versione, a meno che non ci sia una versione disponibile appartenente al rilascio obiettivo o la versione installata non sia pi&ugrave; recente
</DL>

<P>

100 &lt;= P &lt; 500
<DL COMPACT><DT id="26"><DD>
causa l'installazione di una versione, a meno che non ci sia una versione disponibile appartenente ad una qualche altra distribuzione o la versione installata non sia pi&ugrave; recente
</DL>

<P>

0 &lt; P &lt; 100
<DL COMPACT><DT id="27"><DD>
causa l'installazione di una versione solo se nessuna versione del pacchetto &egrave; installata
</DL>

<P>

P &lt; 0
<DL COMPACT><DT id="28"><DD>
impedisce l'installazione della versione
</DL>

<P>

P = 0
<DL COMPACT><DT id="29"><DD>
ha un comportamento non definito, non usarlo.
</DL>

<P>

Il primo record in forma specifica, che corrisponde ad una versione di pacchetto disponibile, determina la priorit&agrave; della versione del pacchetto. In caso contrario, la priorit&agrave; del pacchetto viene definita come il valore massimo di tutte le priorit&agrave; definite da record in forma generica che corrispondono alla versione. I record definiti usando modelli nel campo Pin diversi da &laquo;*&raquo; sono trattati come record in forma specifica.
<P>

Per esempio, supponendo che il file di preferenze di APT contenga i tre record descritti in precedenza:
<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001

Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999

Package: *
Pin: release unstable
Pin-Priority: 50
</PRE>

</DL>




<P>

Allora:
<P>
<DL COMPACT><DT id="31"><DD>
&bull;


Verr&agrave; installata la pi&ugrave; recente versione disponibile del pacchetto
perl, fintanto che il suo numero di versione inizia con &laquo;5.20&raquo;. Se &egrave; disponibile
<I>una qualsiasi</I>
versione 5.20* di
perl
e la versione installata &egrave; 5.24*, allora
perl
verr&agrave; retrocesso.
</DL>

<P>
<DL COMPACT><DT id="32"><DD>
&bull;


Una versione di un qualsiasi pacchetto diverso da
perl
che sia disponibile sul sistema locale ha la priorit&agrave; rispetto ad altre versioni, incluse quelle che appartengono al rilascio obiettivo.
</DL>

<P>
<DL COMPACT><DT id="33"><DD>
&bull;


Una versione di un pacchetto la cui origine non sia il sistema locale, ma un qualche altro sito elencato in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
e che appartiene ad una distribuzione
unstable, viene installata solamente se &egrave; selezionata per l'installazione e nessuna versione del pacchetto &egrave; gi&agrave; installata.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H3>Determinazione delle propriet&agrave; di versione del pacchetto e di distribuzione</H3>

<P>

Le posizioni elencate nel file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
dovrebbero fornire i file
Packages
e
Release
che descrivono i pacchetti disponibili in quelle posizioni.
<P>

Il file
Packages
si trova normalmente nella directory
.../dists/<I>nome-dist</I>/<I>componente</I>/<I>arch</I>: per esempio,
.../dists/stable/main/binary-i386/Packages. &Egrave; costituito da una serie di record su pi&ugrave; righe, uno per ogni pacchetto disponibile in tale directory. In ciascun record solo due righe sono rilevanti per l'impostazione delle priorit&agrave; di APT:
<P>

la riga Package:
<DL COMPACT><DT id="34"><DD>
indica il nome del pacchetto
</DL>

<P>

la riga Version:
<DL COMPACT><DT id="35"><DD>
indica il numero di versione per il pacchetto indicato
</DL>

<P>

Il file
Release
si trova normalmente nella directory
.../dists/<I>nome-dist</I>: ad esempio,
.../dists/stable/Release
o
.../dists/buster/Release. Consiste di un record su pi&ugrave; righe che si applica a
<I>tutti</I>
i pacchetti nell'albero di directory sottostante alla directory genitrice. A differenza di ci&ograve; che avviene per il file
Packages, quasi tutte le righe in un file
Release
sono importanti per l'impostazione delle priorit&agrave; di APT:
<P>

la riga Archive: o Suite:
<DL COMPACT><DT id="36"><DD>
indica l'archivio a cui appartengono tutti i pacchetti nell'albero di directory. Per esempio, la riga &laquo;Archive: stable&raquo; o &laquo;Suite: stable&raquo; specifica che tutti i pacchetti nell'albero di directory sottostante la directory che contiene il file
Release
sono nell'archivio
stable. Per specificare questo valore nelle preferenze di APT si deve usare la riga:
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
Pin: release a=stable
</PRE>

</DL>




</DL>

<P>

la riga Codename:
<DL COMPACT><DT id="38"><DD>
indica il nome in codice a cui appartengono tutti i pacchetti nell'albero di directory. Per esempio, la riga &laquo;Codename: bullseye&raquo; specifica che tutti i pacchetti nell'albero di directory sottostante la directory che contiene il file
Release
appartengono ad una versione chiamata
bullseye. Per specificare questo valore nelle preferenze di APT si deve usare la riga:
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
Pin: release n=bullseye
</PRE>

</DL>




</DL>

<P>

la riga Version:
<DL COMPACT><DT id="40"><DD>
indica la versione del rilascio. Per esempio, i pacchetti nell'albero potrebbero appartenere alla versione 10 del rilascio Debian. Notare che normalmente non esiste un numero di versione per le distribuzioni
testing
e
unstable, perch&eacute; non sono ancora state rilasciate. Per specificare questo valore nelle preferenze di APT si deve usare una delle seguenti righe:
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Pin: release v=10
Pin: release a=stable, v=10
Pin: release 10
</PRE>

</DL>




</DL>

<P>

la rigaComponent:
<DL COMPACT><DT id="42"><DD>
indica le componenti con le varie licenze associate ai pacchetti nell'albero di directory del file
Release. Per esempio, la riga &laquo;Component: main&raquo; specifica che tutti i pacchetti nell'albero di directory provengono dalla componente
main, e quindi che sono rilasciati nei termini elencati nelle Linee guida per il Software Libero di Debian. Per specificare questa componente nelle preferenze di APT si deve usare la riga:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Pin: release c=main
</PRE>

</DL>




</DL>

<P>

la riga Origin:
<DL COMPACT><DT id="44"><DD>
indica l'origine dei pacchetti nell'albero di directory del file
Release. Normalmente &egrave;
Debian. Per specificare questa origine nelle preferenze di APT si deve usare la riga:
<P>
<DL COMPACT><DT id="45"><DD>



<PRE>
Pin: release o=Debian
</PRE>

</DL>




</DL>

<P>

la riga Label:
<DL COMPACT><DT id="46"><DD>
indica l'etichetta dei pacchetti nell'albero di directory del file
Release. Normalmente &egrave;
Debian. Per specificare questa etichetta nelle preferenze di APT si deve usare la riga:
<P>
<DL COMPACT><DT id="47"><DD>



<PRE>
Pin: release l=Debian
</PRE>

</DL>




</DL>

<P>

Tutti i file
Packages
e
Release
recuperati dalle posizioni elencate nel file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
sono memorizzati nella directory
/var/lib/apt/lists
o nel file indicato dalla variabile
Dir::State::Lists
nel file
apt.conf. Per esempio, il file
debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release
contiene il file
Release
recuperato dal sito
debian.lcs.mit.edu
per i file dell'architettura
binary-i386
nella componente
contrib
della distribuzione
unstable.
<A NAME="lbAJ">&nbsp;</A>
<H3>Righe opzionali in un record delle preferenze di APT</H3>

<P>

Ogni record nel file delle preferenze di APT pu&ograve; iniziare opzionalmente con una o pi&ugrave; righe che cominciano con la parola
Explanation:. Ci&ograve; fornisce un posto dove mettere commenti.
<A NAME="lbAK">&nbsp;</A>
<H2>ESEMPI</H2>

<A NAME="lbAL">&nbsp;</A>
<H3>Seguire Stable in modo continuativo</H3>

<P>

Il seguente file di preferenze di APT fa s&igrave; che APT assegni una priorit&agrave; pi&ugrave; alta di quella predefinita (500) a tutte le versioni di pacchetto che appartengono alla distribuzione
stable, e una priorit&agrave; eccezionalmente bassa alle versioni di pacchetto che appartengono alle altre distribuzioni
Debian.
<P>
<DL COMPACT><DT id="48"><DD>



<PRE>
Explanation: Disinstallare o non installare ogni versione di
Explanation: pacchetto originata da Debian che non sia nella
Explanation: distribuzione stable
Package: *
Pin: release a=stable
Pin-Priority: 900

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Con un file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
adatto e il file di preferenze descritto sopra, uno qualsiasi dei seguenti comandi far&agrave; s&igrave; che APT aggiorni il sistema alle versioni pi&ugrave; recenti di
stable.
<P>
<DL COMPACT><DT id="49"><DD>



<PRE>
apt-get install <I>nome-pacchetto</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Il seguente comando far&agrave; s&igrave; che APT aggiorni il pacchetto specificato alla versione pi&ugrave; recente nella distribuzione
testing; il pacchetto non verr&agrave; successivamente aggiornato a meno di non usare nuovamente questo comando.
<P>
<DL COMPACT><DT id="50"><DD>



<PRE>
apt-get install <I>pacchetto</I>/testing
</PRE>

</DL>




<P>
<A NAME="lbAM">&nbsp;</A>
<H3>Seguire Testing o Unstable in modo continuativo</H3>

<P>

Il seguente file di preferenze di APT fa s&igrave; che APT assegni una priorit&agrave; alta alle versioni di pacchetto nella distribuzione
testing, una priorit&agrave; pi&ugrave; bassa alle versioni di pacchetto nella distribuzione
unstable, e una priorit&agrave; eccezionalmente bassa alle versioni di pacchetto nelle altre distribuzioni
Debian.
<P>
<DL COMPACT><DT id="51"><DD>



<PRE>
Package: *
Pin: release a=testing
Pin-Priority: 900

Package: *
Pin: release a=unstable
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Con un file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
adatto e il file di preferenze descritto sopra, uno qualsiasi dei seguenti comandi far&agrave; s&igrave; che APT aggiorni il sistema alle versioni pi&ugrave; recenti di
testing.
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
apt-get install <I>nome-pacchetto</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Il comando seguente far&agrave; s&igrave; che APT aggiorni il pacchetto specificato alla pi&ugrave; recente versione nella distribuzione
unstable. Successivamente,
<B>apt-get upgrade</B>
aggiorner&agrave; il pacchetto alla versione pi&ugrave; recente in
testing, se &egrave; pi&ugrave; nuova di quella installata, altrimenti alla pi&ugrave; recente versione in
unstable
se &egrave; pi&ugrave; recente di quella installata.
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
apt-get install <I>pacchetto</I>/unstable
</PRE>

</DL>




<P>
<A NAME="lbAN">&nbsp;</A>
<H3>Seguire l'evoluzione di un rilascio in base al nome in codice</H3>

<P>

Il seguente file delle preferenze di APT far&agrave; s&igrave; che APT assegni una priorit&agrave; pi&ugrave; alta di quella predefinita (500) a tutte le versioni di pacchetto che appartengono alla distribuzione con il nome in codice specificato, e una priorit&agrave; eccezionalmente bassa alle versioni di pacchetto che appartengono ad altre distribuzioni, nomi in codice e archivi
Debian. Notare che con questa preferenza, APT segue la migrazione di un rilascio dall'archivio
testing
a
stable
e successivamente a
oldstable. Se si vuole seguire il progresso, ad esempio, di
testing
indipendentemente dai cambi di nome in codice si devono usare le configurazioni negli esempi precedenti.
<P>
<DL COMPACT><DT id="54"><DD>



<PRE>
Explanation: Disinstallare o non installare qualsiasi versione di pacchetto
Explanation: originata da Debian che non sia nella distribuzione con
Explanation: nome in codice bullseye o sid
Package: *
Pin: release n=bullseye
Pin-Priority: 900

Explanation: Debian unstable ha sempre il nome in codice side
Package: *
Pin: release n=sid
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Con un file
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
adatto e il file di preferenze descritto sopra, uno qualsiasi dei seguenti comandi far&agrave; s&igrave; che APT aggiorni il sistema alle versioni pi&ugrave; recenti nel rilascio con nome in codice
bullseye.
<P>
<DL COMPACT><DT id="55"><DD>



<PRE>
apt-get install <I>nome-pacchetto</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Il comando seguente far&agrave; s&igrave; che APT aggiorni il pacchetto specificato alla pi&ugrave; recente versione nella distribuzione
sid. Successivamente,
<B>apt-get upgrade</B>
aggiorner&agrave; il pacchetto alla versione pi&ugrave; recente in
bullseye, se &egrave; pi&ugrave; nuova di quella installata, altrimenti alla pi&ugrave; recente versione in
sid
se &egrave; pi&ugrave; recente di quella installata.
<P>
<DL COMPACT><DT id="56"><DD>



<PRE>
apt-get install <I>pacchetto</I>/sid
</PRE>

</DL>




<P>
<A NAME="lbAO">&nbsp;</A>
<H2>FILE</H2>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="57"><DD>
File di preferenze di versione. Qui si specifica il &quot;pinning&quot;, ossia una preferenza a prendere determinati pacchetti da una fonte separata o da una diversa versione di una distribuzione. Voce di configurazione:
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="58"><DD>
Frammenti di file per le preferenze di versione. Voce di configurazione:
Dir::Etc::PreferencesParts.
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>VEDERE ANCHE</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>BUG</H2>

<P>

m[blue]<B>Pagina dei bug di APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se si desidera segnalare un bug in APT, vedere
/usr/share/doc/debian/bug-reporting.txt
o il comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAR">&nbsp;</A>
<H2>TRADUZIONE</H2>

<P>

Traduzione in italiano a cura del Team italiano di localizzazione di Debian
&lt;<A HREF="mailto:debian-l10n-italian@lists.debian.org">debian-l10n-italian@lists.debian.org</A>&gt;. In particolare hanno contribuito Eugenia Franzoni (2000), Hugh Hartmann (2000-2012), Gabriele Stilli (2012), Beatrice Torracca (2012, 2014, 2015).
<P>

Notare che questa versione tradotta del documento pu&ograve; contenere parti non tradotte. Ci&ograve; &egrave; voluto, per evitare di perdere contenuti quando la traduzione non &egrave; aggiornata rispetto all'originale.
<A NAME="lbAS">&nbsp;</A>
<H2>AUTORE</H2>

<P>

<B>Team APT</B>
<DL COMPACT><DT id="59"><DD>
</DL>

<A NAME="lbAT">&nbsp;</A>
<H2>NOTE</H2>

<DL COMPACT>
<DT id="60"> 1.<DD>
Pagina dei bug di APT
<DL COMPACT><DT id="61"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="62"><A HREF="#lbAB">NOME</A><DD>
<DT id="63"><A HREF="#lbAC">DESCRIZIONE</A><DD>
<DL>
<DT id="64"><A HREF="#lbAD">Assegnazioni della priorit&agrave; predefinite di APT</A><DD>
<DT id="65"><A HREF="#lbAE">L'effetto delle preferenze di APT</A><DD>
<DT id="66"><A HREF="#lbAF">Sintassi per le espressioni regolari e glob(7)</A><DD>
<DT id="67"><A HREF="#lbAG">Pinning by source package</A><DD>
<DT id="68"><A HREF="#lbAH">Come APT interpreta le priorit&agrave;</A><DD>
<DT id="69"><A HREF="#lbAI">Determinazione delle propriet&agrave; di versione del pacchetto e di distribuzione</A><DD>
<DT id="70"><A HREF="#lbAJ">Righe opzionali in un record delle preferenze di APT</A><DD>
</DL>
<DT id="71"><A HREF="#lbAK">ESEMPI</A><DD>
<DL>
<DT id="72"><A HREF="#lbAL">Seguire Stable in modo continuativo</A><DD>
<DT id="73"><A HREF="#lbAM">Seguire Testing o Unstable in modo continuativo</A><DD>
<DT id="74"><A HREF="#lbAN">Seguire l'evoluzione di un rilascio in base al nome in codice</A><DD>
</DL>
<DT id="75"><A HREF="#lbAO">FILE</A><DD>
<DT id="76"><A HREF="#lbAP">VEDERE ANCHE</A><DD>
<DT id="77"><A HREF="#lbAQ">BUG</A><DD>
<DT id="78"><A HREF="#lbAR">TRADUZIONE</A><DD>
<DT id="79"><A HREF="#lbAS">AUTORE</A><DD>
<DT id="80"><A HREF="#lbAT">NOTE</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:04 GMT, March 31, 2021
</BODY>
</HTML>
