
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-version</TITLE>
</HEAD><BODY>
<H1>deb-version</H1>
Section: suite dpkg (7)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-version - Format du num&eacute;ro de version des paquets Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

[<I>epoch</I><B>:</B>]<I>version_amont</I>[<B>-</B><I>r&eacute;vision_debian</I>]
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Les num&eacute;ros de version utilis&eacute;s pour les paquets sources et binaires se
composent de trois parties. Celles-ci sont&nbsp;:
<DL COMPACT>
<DT id="1"><I>epoch</I><DD>
Ce nombre est un entier positif (usuellement petit). Il peut &ecirc;tre omis (dans
ce cas, la valeur nulle est implicite). S'il est omis, la <I>version_amont</I>
peut ne pas contenir de caract&egrave;re deux-points.
<DT id="2"><DD>
Cette valeur est destin&eacute;e &agrave; permettre de g&eacute;rer des erreurs dans les anciens
num&eacute;ros de version d'un paquet ou un changement dans la m&eacute;thode de
num&eacute;rotation des versions amont.
<DT id="3"><I>version_amont</I><DD>
Cela est la partie principale du num&eacute;ro de version. Cela correspond
normalement au num&eacute;ro de version du paquet d'origine (&laquo;&nbsp;upstream&nbsp;&raquo;) qui a
servi &agrave; cr&eacute;er le fichier <I>.deb</I>, si cela peut s'appliquer. Le format
d'origine sp&eacute;cifi&eacute; par l'auteur est g&eacute;n&eacute;ralement conserv&eacute;&nbsp;; cependant, il
arrive qu'il soit n&eacute;cessaire d'adapter ce num&eacute;ro pour qu'il se conforme au
format du syst&egrave;me de gestion de paquet et du proc&eacute;d&eacute; de comparaison des
num&eacute;ros de version.
<DT id="4"><DD>
Le principe de comparaison du syst&egrave;me de gestion de paquets en ce qui
concerne la <I>version_amont</I> est d&eacute;crit ci-dessous. La partie
<I>version_amont</I> du num&eacute;ro de version est obligatoire.
<DT id="5"><DD>
La <I>version_amont</I> ne doit contenir que des caract&egrave;res alphanum&eacute;riques
(&laquo;&nbsp;A-Za-z0-9&nbsp;&raquo;) et les caract&egrave;res <B>.</B> <B>+</B> <B>-</B> <B>:</B> <B>~</B> (point, plus,
tiret, deux-points, tilde) et devrait commencer par un chiffre. S'il n'y a
pas de partie <I>r&eacute;vision_Debian</I> alors le tiret n'est pas autoris&eacute;&nbsp;; s'il
n'y a pas d'<I>epoch</I>, alors c'est le caract&egrave;re deux-points qui n'est pas
autoris&eacute;.
<DT id="6"><I>r&eacute;vision_Debian</I><DD>
Cette partie du num&eacute;ro de version indique la version du paquet Debian &agrave;
partir du num&eacute;ro de la version amont. Elle ne doit contenir que des symboles
alphanum&eacute;riques et les caract&egrave;res <B>+</B> <B>.</B> <B>~</B> (plus, point, tilde). Elle
est analys&eacute;e de la m&ecirc;me fa&ccedil;on que la <I>version_amont</I>.
<DT id="7"><DD>
Cette partie est facultative&nbsp;; si elle n'est pas pr&eacute;sente, la
<I>version_amont</I> ne doit pas contenir de tiret. Ce format est pr&eacute;vu pour le
cas o&ugrave; un logiciel a &eacute;t&eacute; directement con&ccedil;u comme paquet Debian, il n'y a
donc qu'une seule &laquo;&nbsp;debianisation&nbsp;&raquo; et donc par la suite pas besoin
d'indication de r&eacute;vision.
<DT id="8"><DD>
Il est convenu de repartir &agrave; &laquo;&nbsp;1&nbsp;&raquo; pour la <I>r&eacute;vision_Debian</I> &agrave; chaque fois
que la <I>version_amont</I> est incr&eacute;ment&eacute;e.
<DT id="9"><DD>
Dpkg s'arr&ecirc;tera au dernier tiret du num&eacute;ro de version (s'il y en a un) pour
d&eacute;terminer la partie <I>version_amont</I> et la <I>r&eacute;vision_Debian</I>. L'absence de
<I>r&eacute;vision_Debian</I> est compar&eacute;e avant sa pr&eacute;sence, mais il faut noter que la
<I>r&eacute;vision_Debian</I> est la partie la moins significative du num&eacute;ro de
version.
</DL>
<A NAME="lbAE">&nbsp;</A>
<H3>Algorithme de tri</H3>

Les parties <I>version_amont</I> et <I>r&eacute;vision_Debian</I> sont compar&eacute;es par le
syst&egrave;me de gestion de paquet en utilisant le m&ecirc;me algorithme&nbsp;:
<P>

Les cha&icirc;nes sont compar&eacute;es de la gauche vers la droite.
<P>

Pour commencer, la premi&egrave;re partie de chaque cha&icirc;ne compos&eacute;e uniquement de
caract&egrave;res non num&eacute;riques est d&eacute;termin&eacute;e. Puis ces deux parties (l'une peut
&ecirc;tre vide) sont compar&eacute;es lexicalement. Si une diff&eacute;rence est trouv&eacute;e, elle
est renvoy&eacute;e. La comparaison lexicale est effectu&eacute;e sur une version modifi&eacute;e
des valeurs ASCII afin que les lettres passent avant les autres caract&egrave;res
et que les tildes (&quot;~&quot;) passent avant tous les caract&egrave;res, m&ecirc;me la fin d'une
partie. Par exemple, les &eacute;l&eacute;ments suivants sont ordonn&eacute;s ainsi&nbsp;: &laquo;&nbsp;~~&nbsp;&raquo;,
&laquo;&nbsp;~~a&nbsp;&raquo;, &laquo;&nbsp;~&nbsp;&raquo;, partie vide, &laquo;&nbsp;a&nbsp;&raquo;.
<P>

Puis, le d&eacute;but de ce qui reste des cha&icirc;nes de caract&egrave;res qui ne doivent plus
contenir que des chiffres est d&eacute;termin&eacute;. Ces valeurs num&eacute;riques sont
compar&eacute;es et les diff&eacute;rences sont remont&eacute;es. Dans le cas d'une cha&icirc;ne vide
(ce qui peut arriver si une cha&icirc;ne est plus longue que l'autre lors de la
comparaison) elle compte pour un z&eacute;ro.
<P>

Ces deux &eacute;tapes (comparaison et suppression des caract&egrave;res non num&eacute;riques
puis de suppression des caract&egrave;res num&eacute;riques dans le d&eacute;but de la cha&icirc;ne)
sont r&eacute;p&eacute;t&eacute;es jusqu'&agrave; ce qu'une diff&eacute;rence soit trouv&eacute;e ou la fin des
cha&icirc;nes atteinte.
<P>

Notez que le r&ocirc;le de epoch est de permettre de se sortir des probl&egrave;mes de
num&eacute;rotation de version, et de faire face &agrave; des situations de changement de
logique de num&eacute;rotation. Cela n'est <B>pas</B> destin&eacute; &agrave; faire face &agrave; des
num&eacute;ros de version qui contiennent des cha&icirc;nes de lettres que le syst&egrave;me de
gestion de paquet ne sait pas interpr&eacute;ter (comme &laquo;&nbsp;ALPHA&nbsp;&raquo;, &laquo;&nbsp;pre-&nbsp;&raquo;) ou
d'autres choses stupides.
<A NAME="lbAF">&nbsp;</A>
<H2>NOTES</H2>

Le caract&egrave;re tilde (&laquo;&nbsp;~&nbsp;&raquo;) et sa propri&eacute;t&eacute; sp&eacute;ciale pour les comparaisons
ont &eacute;t&eacute; introduites dans la version&nbsp;1.10 de dpkg. Ce n'est qu'&agrave; partir des
versions sup&eacute;rieures (1.10.x) que certaines parties des scripts de
construction de dpkg ont commenc&eacute; &agrave; g&eacute;rer ce syst&egrave;me.
<A NAME="lbAG">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<A NAME="lbAH">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="10"><A HREF="#lbAB">NOM</A><DD>
<DT id="11"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="12"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DL>
<DT id="13"><A HREF="#lbAE">Algorithme de tri</A><DD>
</DL>
<DT id="14"><A HREF="#lbAF">NOTES</A><DD>
<DT id="15"><A HREF="#lbAG">VOIR AUSSI</A><DD>
<DT id="16"><A HREF="#lbAH">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
