
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CACHE</TITLE>
</HEAD><BODY>
<H1>APT-CACHE</H1>
Section: APT (8)<BR>Updated: 04&nbsp;kwiecień&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAZWA</H2>

apt-cache - odpytanie bufora APT
<A NAME="lbAC">&nbsp;</A>
<H2>STRESZCZENIE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cache</B> [<B>-agipns</B>] [<B>-o=</B><B></B><I>opcja_konfiguracji</I>] [<B>-c=</B><B></B><I>plik_konfiguracyjny</I>] {gencaches | showpkg&nbsp;<I>pakiet</I>...  | showsrc&nbsp;<I>pakiet</I>...  | stats | dump | dumpavail | unmet | search&nbsp;<I>wyr_regularne</I>...  | show&nbsp;<I>pakiet</I>&nbsp;[{=<I>nr_wersji_pakietu</I>&nbsp;|&nbsp;/<I>wydanie_docelowe</I>}]...  | depends&nbsp;<I>pakiet</I>&nbsp;[{=<I>nr_wersji_pakietu</I>&nbsp;|&nbsp;/<I>wydanie_docelowe</I>}]...  | rdepends&nbsp;<I>pakiet</I>&nbsp;[{=<I>nr_wersji_pakietu</I>&nbsp;|&nbsp;/<I>wydanie_docelowe</I>}]...  | pkgnames&nbsp;[<I>prefiks</I>]  | dotty&nbsp;<I>pakiet</I>&nbsp;[{=<I>nr_wersji_pakietu</I>&nbsp;|&nbsp;/<I>wydanie_docelowe</I>}]...  | xvcg&nbsp;<I>pakiet</I>&nbsp;[{=<I>nr_wersji_pakietu</I>&nbsp;|&nbsp;/<I>wydanie_docelowe</I>}]...  | policy&nbsp;[<I>pakiet</I>...]  | madison&nbsp;<I>pakiet</I>...  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>OPIS</H2>

<P>

<B>apt-cache</B>
<DD>performs a variety of operations on APT's package cache.
<B>apt-cache</B>
does not manipulate the state of the system but does provide operations to search and generate interesting output from the package metadata. The metadata is acquired and updated via the 'update' command of e.g.
<B>apt-get</B>, so that it can be outdated if the last update is too long ago, but in exchange
<B>apt-cache</B>
works independently of the availability of the configured sources (e.g. offline).
<P>

Jedno z poniższych poleceń musi być użyte, chyba że zosta&#x142;a podana opcja
<B>-h</B>
albo
<B>--help</B>.
<P>

<B>gencaches</B>
<DL COMPACT><DT id="2"><DD>
gencaches
tworzy bufor (cache) APT pakiet&oacute;w. Wywo&#x142;ywane jest automatycznie przez wszystkie polecenia potrzebujące bufora, jeśli nie istnieje lub jest przestarza&#x142;y.
</DL>

<P>

<B>showpkg</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="3"><DD>
showpkg
wyświetla informacje na temat pakiet&oacute;w podanych w linii poleceń. Pozosta&#x142;ymi argumentami są nazwy pakiet&oacute;w. Wyświetlane są dostępne wersje oraz odwrotne zależności każdego z podanych pakiet&oacute;w, jak r&oacute;wnież zwyk&#x142;e zależności dla każdej z wersji Normalne (zwyk&#x142;e) zależności to są pakiety, od kt&oacute;rych dany pakiet zależy, odwrotne zależności stanowią te pakiety, kt&oacute;re zależą od danego pakietu. Tak więc, pakiet musi spe&#x142;niać normalne zależności, ale odwrotnych zależności - nie musi. Na przyk&#x142;ad,
<B>apt-cache showpkg libreadline2</B>
wypisze wyjście podobne do poniższego:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Package: libreadline2
Versions: 2.1-12(/var/state/apt/lists/foo_Packages),
Reverse Depends: 
  libreadlineg2,libreadline2
  libreadline2-altdev,libreadline2
Dependencies:
2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null))
Provides:
2.1-12 - 
Reverse Provides: 
</PRE>

</DL>




Jak widać libreadline2 w wersji 2.1-12 zależy od libc5 i ncurses3.0, kt&oacute;re muszą być zainstalowane, aby libreadline2 dzia&#x142;a&#x142;a. Z kolei libreadlineg2 i libreadline2-altdev zależą od libreadline2. Jeżeli libreadline2 jest zainstalowany, to libc5 i ncurses3.0 (i ldso) muszą być także zainstalowane; natomiast libreadlineg2 oraz libreadline2-altdev nie muszą być zainstalowane. W celu zrozumienia, co oznaczają pozosta&#x142;e linie, najlepiej przejrzeć kod źr&oacute;d&#x142;owy programu apt.
</DL>

<P>

<B>stats</B>
<DL COMPACT><DT id="5"><DD>
stats
wyświetla statystyki dotyczące bufora pakiet&oacute;w. Nie wymaga żadnych argument&oacute;w. Wypisywane są następujące statystyki:
<P>
<DL COMPACT><DT id="6"><DD>
&bull;


Ca&#x142;kowita liczba nazw pakiet&oacute;w (Total package names)
- liczba nazw pakiet&oacute;w znajdujących się w buforze.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Zwyk&#x142;e pakiety (Normal packages)
jest to liczba zwyk&#x142;ych, regularnych nazw pakiet&oacute;w; są to pakiety, dla kt&oacute;rych istnieje relacja &quot;jeden do jednego&quot; między ich nazwami a nazwami używanymi przez inne pakiety jako zależności. Większość pakiet&oacute;w należy do tej kategorii.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Czyste pakiety wirtualne (Pure virtual packages)
określa liczbę pakiet&oacute;w, kt&oacute;re istnieją tylko jako nazwa pakietu wirtualnego; to jest pewne pakiety &quot;dostarczają&quot; tej nazwy wirtualnej, ale żaden pakiet nie używa tej nazwy. Na przyk&#x142;ad &quot;mail-transport-agent&quot; w systemie Debian jest czystym pakietem wirtualnym; kilka pakiet&oacute;w dostarcza &quot;mail-transport-agenta&quot;, ale żaden pakiet nie nazywa się &quot;mail-transport-agent&quot;.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Pojedyncze pakiety wirtualne (Single virtual packages)
- liczba pakiet&oacute;w, dla kt&oacute;rych istnieje tylko jeden pakiet, kt&oacute;ry dostarcza danego pakietu wirtualnego. Na przyk&#x142;ad, w systemie Debian &quot;X11-text-viewer&quot; jest pakietem wirtualnym, ale tylko jeden pakiet, mianowicie &quot;xless&quot;,dostarcza &quot;X11-text-viewer&quot;.
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Mieszane pakiety wirtualne (Mixed virtual packages)
- liczba pakiet&oacute;w, kt&oacute;re albo dostarczają poszczeg&oacute;lnych pakiet&oacute;w wirtualnych, albo nazywają się tak, jak nazwa pakietu wirtualnego. Na przyk&#x142;ad w systemie Debian &quot;debconf&quot; jest zar&oacute;wno zwyk&#x142;ym pakietem, jak i jest pakietem dostarczanym przez pakiet &quot;debconf-tiny&quot;.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


Brakujące (Missing)
jest liczbą nazw pakiet&oacute;w, do kt&oacute;rych odnoszą się jakieś zależności, ale kt&oacute;re nie są spe&#x142;nione przez żaden z dostępnych pakiet&oacute;w. Brakujące pakiety mogą być dowodem, że nie ma dostępu do ca&#x142;ej dystrybucji albo że pakiet (rzeczywisty lub wirtualny) zosta&#x142; usunięty z dystrybucji. Zazwyczaj odniesienia takie znajdują się w zależnościach typu &quot;Conflicts&quot; lub &quot;Breaks&quot;.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


Total distinct
versions is the number of package versions found in the cache. If more than one distribution is being accessed (for instance, &quot;stable&quot; and &quot;unstable&quot;), this value can be considerably larger than the number of total package names.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Ca&#x142;kowite zależności (Total dependencies)
to liczba więz&oacute;w zależności wymaganych przez wszystkie pakiety w buforze.
</DL>

<P>
</DL>

<P>

<B>showsrc</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="14"><DD>
showsrc
displays all the source package records that match the given package names. All versions are shown, as well as all records that declare the name to be a binary package. Use
<B>--only-source</B>
to display only source package names.
</DL>

<P>

<B>dump</B>
<DL COMPACT><DT id="15"><DD>
dump
pokazuje kr&oacute;tką listę wszystkich pakiet&oacute;w w buforze. Jest używany g&#x142;&oacute;wnie w celu odpluskwiania.
</DL>

<P>

<B>dumpavail</B>
<DL COMPACT><DT id="16"><DD>
dumpavail
wypisuje na standardowe wyjście (stdout) listę dostępnych pakiet&oacute;w. Jest to polecenie odpowiednie do użycia z programem
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
i jest używane w metodzie
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
tego programu.
</DL>

<P>

<B>unmet</B>
<DL COMPACT><DT id="17"><DD>
unmet
pokazuje podsumowanie wszystkich niespe&#x142;nionych zależności w buforze pakiet&oacute;w
</DL>

<P>

<B>show</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="18"><DD>
show
spe&#x142;nia funkcje podobne do
<B>dpkg --print-avail</B>; pokazuje szczeg&oacute;&#x142;owe informacje o podanych pakietach.
</DL>

<P>

<B>search</B> <B></B><I>wyr_regularne</I><B>...</B>
<DL COMPACT><DT id="19"><DD>
search
performs a full text search on all available package lists for the POSIX regex pattern given, see
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7). It searches the package names and the descriptions for an occurrence of the regular expression and prints out the package name and the short description, including virtual package names. If
<B>--full</B>
is given then output identical to
show
is produced for each matched package, and if
<B>--names-only</B>
is given then the long description is not searched, only the package name and provided packages are.
<P>
Oddzielne argumenty mogą być używane do podania kilku wzorc&oacute;w, kt&oacute;re będą traktowane jakby by&#x142;y po&#x142;ączone sp&oacute;jnikiem logicznym &quot;i&quot;.
</DL>

<P>

<B>depends</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="20"><DD>
depends
wyświetla listę wszystkich zależności danego pakietu i wszystkie możliwe pakiety, kt&oacute;re mogą spe&#x142;nić te zależności.
</DL>

<P>

<B>rdepends</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="21"><DD>
rdepends
pokazuje listę wszystkich odwrotnych zależności danego pakietu.
</DL>

<P>

<B>pkgnames</B> [<I>prefiks</I>]
<DL COMPACT><DT id="22"><DD>
To polecenie wyświetla nazwy wszystkich pakiet&oacute;w znanych systemowi APT. Opcjonalnym argumentem jest przedrostek nazwy pakiet&oacute;w. Wynik jest odpowiedni do użycia z funkcją pow&#x142;oki (shella) uzupe&#x142;niania nazw za pomocą klawisza tabulacji i jest wypisywany bardzo szybko. Tego polecenia najlepiej używać z opcją
<B>--generate</B>.
<P>
Proszę zauważyć, że to, iż pakiet jest znany systemowi APT, niekoniecznie oznacza, że jest dostępny do pobrania i zainstalowania albo zainstalowany. Może być np. pakietem wirtualnym, kt&oacute;re także są wypisane w wygenerowanej liście.
</DL>

<P>

<B>dotty</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="23"><DD>
dotty
bierze jako argument listę pakiet&oacute;w i generuje wyjście odpowiednie dla programu dotty z pakietu
m[blue]<B>GraphViz</B>m[]<FONT SIZE="-2">[1]</FONT>. Wynikiem będzie zbi&oacute;r wierzcho&#x142;k&oacute;w i krawędzi reprezentujących powiązania między pakietami. Domyślnie podane pakiety wyśledzą wszystkie pakiety zależne. Może to spowodować wypisanie bardzo dużego grafu. Aby wypisać powiązania tylko pomiędzy pakietami podanymi w linii poleceń, należy użyć opcji
APT::Cache::GivenOnly.
<P>
Wynikowe wierzcho&#x142;ki będą mia&#x142;y r&oacute;żnorakie kszta&#x142;ty: zwyk&#x142;e pakiety są prostokątami, czyste pakiety wirtualne to tr&oacute;jkąty, mieszane pakiety wirtualne są rombami, sześciokąty oznaczają brakujące pakiety . Pomarańczowe prostokąty oznaczają koniec rekurencji (liście), niebieskie linie to pre-zależności, linie zielone to konflikty.
<P>
Uwaga: dotty nie potrafi narysować większego zbioru pakiet&oacute;w.
</DL>

<P>

<B>xvcg</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="24"><DD>
Robi to samo, co
dotty, tylko dla xvcg z
m[blue]<B>narzędzia VCG</B>m[]<FONT SIZE="-2">[2]</FONT>.
</DL>

<P>

<B>policy</B> [<I>pakiet</I>...]
<DL COMPACT><DT id="25"><DD>
policy
jest pomyślane w celu debugowania zagadnień związanych z plikiem preferencji. Jeżeli nie podano żadnych opcji, wypisane zostaną informacje o priorytecie każdego źr&oacute;d&#x142;a. W przeciwnym wypadku, wypisuje szczeg&oacute;&#x142;owe informacje o priorytecie danego pakietu.
</DL>

<P>

<B>madison</B> <B></B><I>pakiet</I><B>...</B>
<DL COMPACT><DT id="26"><DD>
polecenie
madison
z
apt-cache
pr&oacute;buje naśladować format wyjścia i część funkcjonalności programu
madison
- narzędzia zarządzania archiwum Debiana. Wyświetla dostępne wersje pakiet&oacute;w w formacie tabeli. W przeciwieństwie do orygina&#x142;u, może wyświetlić informacje tylko dla tych architektur, dla kt&oacute;rych APT pobra&#x142;o listy pakiet&oacute;w (APT::Architecture).
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPCJE</H2>

<P>

Wszystkie opcje linii poleceń mogą być ustawione w pliku konfiguracyjnym. Poniższe opisy wskazują, kt&oacute;rą opcję w pliku konfiguracyjnym należy ustawić. W przypadku opcji logicznych, można unieważnić ustawienia pliku konfiguracyjnego, używając
<B>-f-</B>,
<B>--no-f</B>,
<B>-f=no</B>
albo czegoś podobnego.
<P>

<B>-p</B>, <B>--pkg-cache</B>
<DL COMPACT><DT id="27"><DD>
Podaje nazwę pliku to przechowywania bufora pakiet&oacute;w, kt&oacute;ry jest podstawowym buforem używanym we wszystkich operacjach. Pozycja w pliku konfiguracyjnym:
Dir::Cache::pkgcache.
</DL>

<P>

<B>-s</B>, <B>--src-cache</B>
<DL COMPACT><DT id="28"><DD>
Podaje nazwę pliku to przechowywania bufora źr&oacute;de&#x142;. Jest używany tylko przez akcję
gencaches
i przechowuje sparsowaną wersję informacji o pakietach pobraną ze zdalnych źr&oacute;de&#x142;. Podczas budowania bufora pakiet&oacute;w, bufor źr&oacute;de&#x142; jest używany w celu uniknięcia ponownego parsowania wszystkich plik&oacute;w pakiet&oacute;w. Pozycja w pliku konfiguracyjnym:
Dir::Cache::srcpkgcache.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="29"><DD>
Cichy; wypisuje tylko informacje potrzebne do logowania, opuszczając wskaźniki postępu. Więcej znak&oacute;w q spowoduje jeszcze bardziej ciche wyjście, maksimum jest 2. Można także ustawić poziom cichości za pomocą
<B>-q=#</B>,nadpisując tym samym opcję z pliku konfiguracyjnego. Pozycja w pliku konfiguracyjnym:
quiet.
</DL>

<P>

<B>-i</B>, <B>--important</B>
<DL COMPACT><DT id="30"><DD>
Wyświetla tylko ważne zależności; do używania z akcjami
unmet
o
depends. Powoduje wypisanie tylko zależności typu Depends i Pre-Depends. Pozycja w pliku konfiguracyjnym:
APT::Cache::Important.
</DL>

<P>

<B>--no-pre-depends</B>, <B>--no-depends</B>, <B>--no-recommends</B>, <B>--no-suggests</B>, <B>--no-conflicts</B>, <B>--no-breaks</B>, <B>--no-replaces</B>, <B>--no-enhances</B>
<DL COMPACT><DT id="31"><DD>
Per default the
<B>depends</B>
and
<B>rdepends</B>
print all dependencies. This can be tweaked with these flags which will omit the specified dependency type. Configuration Item:
APT::Cache::Show<I>DependencyType</I>
e.g.
APT::Cache::ShowRecommends.
</DL>

<P>

<B>--implicit</B>
<DL COMPACT><DT id="32"><DD>
Per default
<B>depends</B>
and
<B>rdepends</B>
print only dependencies explicitly expressed in the metadata. With this flag it will also show dependencies implicitly added based on the encountered data. A
Conflicts: foo
e.g. expresses implicitly that this package also conflicts with the package foo from any other architecture. Configuration Item:
APT::Cache::ShowImplicit.
</DL>

<P>

<B>-f</B>, <B>--full</B>
<DL COMPACT><DT id="33"><DD>
Podczas szukania wypisuj pe&#x142;ną informację o pakiecie. Pozycja w pliku konfiguracyjnym:
APT::Cache::ShowFull.
</DL>

<P>

<B>-a</B>, <B>--all-versions</B>
<DL COMPACT><DT id="34"><DD>
Akcja show wypisuje wszystkie rekordy dla wszystkich dostępnych wersji. Jest to opcja domyślna, aby ją wy&#x142;ączyć, proszę użyć
<B>--no-all-versions</B>. Jeżeli podano
<B>--no-all-versions</B>, to będzie wyświetlana tylko wersja-kandydat (czyli ta, kt&oacute;ra by&#x142;aby wybrana do instalacji). Ta opcja ma znaczenie tylko dla polecenia
show. Pozycja w pliku konfiguracyjnym:
APT::Cache::AllVersions.
</DL>

<P>

<B>-g</B>, <B>--generate</B>
<DL COMPACT><DT id="35"><DD>
Automatycznie odbudowuje bufor pakiet&oacute;w, zamiast używać istniejącego bufora. Ta opcja jest domyślnie w&#x142;ączona, aby ją wy&#x142;ączyć, należy użyć
<B>--no-generate</B>. Pozycja w pliku konfiguracyjnym:
APT::Cache::Generate.
</DL>

<P>

<B>--names-only</B>, <B>-n</B>
<DL COMPACT><DT id="36"><DD>
Only search on the package and provided package names, not the long descriptions. Configuration Item:
APT::Cache::NamesOnly.
</DL>

<P>

<B>--all-names</B>
<DL COMPACT><DT id="37"><DD>
Powoduje, że akcja
pkgnames
wypisze nazwy wszystkich pakiet&oacute;w, &#x142;ącznie z pakietami wirtualnymi oraz pakietami mającymi brakujące zależności. Pozycja w pliku konfiguracyjnym:
APT::Cache::AllNames.
</DL>

<P>

<B>--recurse</B>
<DL COMPACT><DT id="38"><DD>
Powoduje, że zależności w poleceniach
depends
i
rdepends
będą zależnościami rekurencyjnymi, tak że wszystkie wymienione pakiety zostaną wypisane tylko raz. Pozycja w pliku konfiguracyjnym:
APT::Cache::RecurseDepends.
</DL>

<P>

<B>--installed</B>
<DL COMPACT><DT id="39"><DD>
Ogranicza wyjście poleceń
depends
i
rdepends
tylko do pakiet&oacute;w, kt&oacute;re są obecnie zainstalowane. Pozycja w pliku konfiguracyjnym:
APT::Cache::Installed.
</DL>

<P>

<B>--with-source</B> <B></B><I>nazwa_pliku</I>
<DL COMPACT><DT id="40"><DD>
Adds the given file as a source for metadata. Can be repeated to add multiple files. Supported are currently
*.deb,
*.dsc,
*.changes,
Sources
and
Packages
files as well as source package directories. Files are matched based on their name only, not their content!
<P>
Sources
and
Packages
can be compressed in any format apt supports as long as they have the correct extension. If you need to store multiple of these files in one directory you can prefix a name of your choice with the last character being an underscore (&quot;_&quot;). Example: my.example_Packages.xz
<P>
Note that these sources are treated as trusted (see
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)). Configuration Item:
APT::Sources::With.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="41"><DD>
Wyświetla kr&oacute;tkie informacje o użyciu.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="42"><DD>
Wyświetla wersję programu.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="43"><DD>
Plik konfiguracyjny. Podaje plik konfiguracyjny do użycia. Program najpierw przeczyta sw&oacute;j domyślny plik konfiguracyjny, a następnie plik podany jako argument tej opcji. Jeśli jest potrzeba ustawienia opcji konfiguracji zanim domyślny plik konfiguracyjny zostanie przetworzony, należy podać plik do użycia w zmiennej środowiskowej
<B>APT_CONFIG</B>. Informacje o sk&#x142;adni pliku można znaleźć w
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5).
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="44"><DD>
Ustawia opcję konfiguracji. Pozwala ustawić dowolną opcję konfiguracji. Sk&#x142;adnia jest następująca:
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
i
<B>--option</B>
można podać wielokrotnie - do ustawiania r&oacute;żnych opcji.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>PLIKI</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="45"><DD>
Lokalizacje, z kt&oacute;rych będą ściągane pakiety. Pozycja w pliku konfiguracyjnym:
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="46"><DD>
Części pliku zawierającego lokalizacje, z kt&oacute;rej są pobierane pakiety. Pozycja w pliku konfiguracyjnym:
Dir::Etc::SourceParts.
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="47"><DD>
Sk&#x142;adnica zawierająca informacje o każdym zasobie pakiet&oacute;w podanym w
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
Pozycja w pliku konfiguracyjnym:
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="48"><DD>
Sk&#x142;adnica obecnie pobieranych informacji o stanie pakiet&oacute;w. Pozycja w pliku konfiguracyjnym:
Dir::State::Lists
(partial
zostanie dodane automatycznie)
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>ZOBACZ TAKŻE</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGNOSTYKA</H2>

<P>

<B>apt-cache</B>
zwraca zero, gdy zakończy&#x142;o się pomyślnie, 100 - w przypadku b&#x142;ędu.
<A NAME="lbAI">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>Strona b&#x142;ęd&oacute;w APT</B>m[]<FONT SIZE="-2">[3]</FONT>. Aby zg&#x142;osić b&#x142;ąd w APT, proszę przeczytać
/usr/share/doc/debian/bug-reporting.txt
lub opis polecenia
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>T&#x141;UMACZENIE</H2>

<P>

T&#x142;umaczenie stron podręcznika: Robert Luberda
&lt;<A HREF="mailto:robert@debian.org">robert@debian.org</A>&gt;, 2000-2012. T&#x142;umaczenie przewodnika offline: Krzysztof Fiertek
&lt;<A HREF="mailto:akfedux@megapolis.pl">akfedux@megapolis.pl</A>&gt;, 2004
<P>

Proszę zauważyć, że przet&#x142;umaczony dokument może zawierać fragmenty nieprzet&#x142;umaczone. Ma to na celu uniknięcie utracenia istotnych informacji, w przypadkach gdy orygina&#x142; zostanie zaktualizowany, a t&#x142;umaczenie - nie.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTORZY</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="49"><DD>
</DL>

<P>

<B>zesp&oacute;&#x142; APT</B>
<DL COMPACT><DT id="50"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>PRZYPISY</H2>

<DL COMPACT>
<DT id="51"> 1.<DD>
GraphViz
<DL COMPACT><DT id="52"><DD>
<A HREF="http://www.research.att.com/sw/tools/graphviz/">http://www.research.att.com/sw/tools/graphviz/</A>
</DL>

<DT id="53"> 2.<DD>
narzędzia VCG
<DL COMPACT><DT id="54"><DD>
<A HREF="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html</A>
</DL>

<DT id="55"> 3.<DD>
Strona b&#x142;ęd&oacute;w APT
<DL COMPACT><DT id="56"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="57"><A HREF="#lbAB">NAZWA</A><DD>
<DT id="58"><A HREF="#lbAC">STRESZCZENIE</A><DD>
<DT id="59"><A HREF="#lbAD">OPIS</A><DD>
<DT id="60"><A HREF="#lbAE">OPCJE</A><DD>
<DT id="61"><A HREF="#lbAF">PLIKI</A><DD>
<DT id="62"><A HREF="#lbAG">ZOBACZ TAKŻE</A><DD>
<DT id="63"><A HREF="#lbAH">DIAGNOSTYKA</A><DD>
<DT id="64"><A HREF="#lbAI">BUGS</A><DD>
<DT id="65"><A HREF="#lbAJ">T&#x141;UMACZENIE</A><DD>
<DT id="66"><A HREF="#lbAK">AUTORZY</A><DD>
<DT id="67"><A HREF="#lbAL">PRZYPISY</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:20 GMT, March 31, 2021
</BODY>
</HTML>
