
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CDROM</TITLE>
</HEAD><BODY>
<H1>APT-CDROM</H1>
Section: APT (8)<BR>Updated: 30&nbsp;listopad&nbsp;2013<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAZWA</H2>

apt-cdrom - Narzędzie APT do zarządzania źr&oacute;d&#x142;ami typu CD-ROM
<A NAME="lbAC">&nbsp;</A>
<H2>STRESZCZENIE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cdrom</B> [<B>-rmfan</B>] [<B>-d=</B><B></B><I>pkt_montowania_cdromu</I>] [<B>-o=</B><B></B><I>opcja_konfiguracji</I>] [<B>-c=</B><B></B><I>plik_konfiguracyjny</I>] {add | ident | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>OPIS</H2>

<P>

<B>apt-cdrom</B>
<DD>jest używany w celu dodania nowego CD-ROM-u do listy dostępnych źr&oacute;de&#x142; programu APT.
<B>apt-cdrom</B>
określa strukturę dysku, poprawia ewentualne b&#x142;ędy powsta&#x142;e podczas produkcji CD-ROM-u i weryfikuje pliki indeks&oacute;w.
<P>

Dodanie nowych CD do systemu APT nie może być zrobione ręcznie, tak więc używanie
<B>apt-cdrom</B>
jest konieczne. Co więcej, każdy dysk w wielodyskowym archiwum musi być w&#x142;ożony i zeskanowany oddzielnie.
<P>

Jedno z poniższych poleceń musi być użyte, chyba że zosta&#x142;a podana opcja
<B>-h</B>
albo
<B>--help</B>.
<P>

<B>add</B>
<DL COMPACT><DT id="2"><DD>
add
jest używane do dodania nowego dysku do listy źr&oacute;de&#x142;. Odmontuje urządzenie CD-ROM, poprosi o w&#x142;ożenie dysku, a następnie zeskanuje go i skopiuje pliki indeksu. Jeżeli dysk nie ma w&#x142;aściwego katalogu
.disk, użytkownik zostanie poproszony o podanie opisu dysku.
<P>
APT używa identyfikatora CD-ROM-u do określenia, kt&oacute;ry dysk obecnie znajduje się w napędzie, oraz przechowuje bazę tych identyfikator&oacute;w w pliku
/var/lib/apt/cdroms.list
</DL>

<P>

<B>ident</B>
<DL COMPACT><DT id="3"><DD>
Narzędzie debugujące, wyświetlające identyfikator w&#x142;ożonego dysku oraz nazwę pliku, w kt&oacute;rym jest przechowywany.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPCJE</H2>

<P>

Wszystkie opcje linii poleceń mogą być ustawione w pliku konfiguracyjnym. Poniższe opisy wskazują, kt&oacute;rą opcję w pliku konfiguracyjnym należy ustawić. W przypadku opcji logicznych, można unieważnić ustawienia pliku konfiguracyjnego, używając
<B>-f-</B>,
<B>--no-f</B>,
<B>-f=no</B>
albo czegoś podobnego.
<P>

<B>--no-auto-detect</B>, <B>--cdrom</B>
<DL COMPACT><DT id="4"><DD>
Do not try to auto-detect the CD-ROM path. Usually combined with the
<B>--cdrom</B>
option. Configuration Item:
Acquire::cdrom::AutoDetect.
</DL>

<P>

<B>-d</B>, <B>--cdrom</B>
<DL COMPACT><DT id="5"><DD>
Punkt montowania. Podaje lokalizację katalogu, w kt&oacute;rym będzie zamontowany CD-ROM. Musi istnieć odpowiednia konfiguracja dla tego punktu montowania w pliku
/etc/fstab. Pozycja w pliku konfiguracyjnym:
Acquire::cdrom::mount.
</DL>

<P>

<B>-r</B>, <B>--rename</B>
<DL COMPACT><DT id="6"><DD>
Przemianuj dysk. Zmienia etykietę dysku lub unieważnia etykietę wcześniej daną dyskowi. Podanie tej opcji spowoduje, że
<B>apt-cdrom</B>
spyta się o nową etykietę. Pozycja w pliku konfiguracyjnym:
APT::CDROM::Rename.
</DL>

<P>

<B>-m</B>, <B>--no-mount</B>
<DL COMPACT><DT id="7"><DD>
Nie montuj. Uniemożliwia programowi
<B>apt-cdrom</B>
montowanie i odmontowywanie CDROM-u. Pozycja w pliku konfiguracyjnym:
APT::CDROM::NoMount.
</DL>

<P>

<B>-f</B>, <B>--fast</B>
<DL COMPACT><DT id="8"><DD>
Szybkie kopiowanie. Zak&#x142;ada, że pliki z pakietami są poprawne i nie sprawdza każdego pakietu. Ta opcja powinna być używana tylko wtedy, jeżeli
<B>apt-cdrom</B>
by&#x142; już uruchomiony na danym dysku i nie wykry&#x142; na nim żadnych b&#x142;ęd&oacute;w. Pozycja w pliku konfiguracyjnym:
APT::CDROM::Fast.
</DL>

<P>

<B>-a</B>, <B>--thorough</B>
<DL COMPACT><DT id="9"><DD>
Gruntowne przeglądanie pakiet&oacute;w. Ta opcja może być potrzebna do indeksowania starych dysk&oacute;w z Debianem 1.1/1.2, w kt&oacute;rych pliki Package by&#x142;y umieszczone w dziwnych miejscach. Indeksowanie ca&#x142;ego CD zabiera więcej czasu, ale znajdzie wszystkie takie pliki.
</DL>

<P>

<B>-n</B>, <B>--just-print</B>, <B>--recon</B>, <B>--no-act</B>
<DL COMPACT><DT id="10"><DD>
Bez zmian. Nie zmienia pliku
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
i nie zapisuje pik&oacute;w indeksowych. Jednakże nadal wszystko jest sprawdzane. Pozycja w pliku konfiguracyjnym:
APT::CDROM::NoAct.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="11"><DD>
Wyświetla kr&oacute;tkie informacje o użyciu.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="12"><DD>
Wyświetla wersję programu.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="13"><DD>
Plik konfiguracyjny. Podaje plik konfiguracyjny do użycia. Program najpierw przeczyta sw&oacute;j domyślny plik konfiguracyjny, a następnie plik podany jako argument tej opcji. Jeśli jest potrzeba ustawienia opcji konfiguracji zanim domyślny plik konfiguracyjny zostanie przetworzony, należy podać plik do użycia w zmiennej środowiskowej
<B>APT_CONFIG</B>. Informacje o sk&#x142;adni pliku można znaleźć w
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5).
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="14"><DD>
Ustawia opcję konfiguracji. Pozwala ustawić dowolną opcję konfiguracji. Sk&#x142;adnia jest następująca:
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
i
<B>--option</B>
można podać wielokrotnie - do ustawiania r&oacute;żnych opcji.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>ZOBACZ TAKŻE</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAG">&nbsp;</A>
<H2>DIAGNOSTYKA</H2>

<P>

<B>apt-cdrom</B>
zwraca zero, gdy zakończy&#x142;o się pomyślnie, 100 - w przypadku b&#x142;ędu.
<A NAME="lbAH">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>Strona b&#x142;ęd&oacute;w APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Aby zg&#x142;osić b&#x142;ąd w APT, proszę przeczytać
/usr/share/doc/debian/bug-reporting.txt
lub opis polecenia
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAI">&nbsp;</A>
<H2>T&#x141;UMACZENIE</H2>

<P>

T&#x142;umaczenie stron podręcznika: Robert Luberda
&lt;<A HREF="mailto:robert@debian.org">robert@debian.org</A>&gt;, 2000-2012. T&#x142;umaczenie przewodnika offline: Krzysztof Fiertek
&lt;<A HREF="mailto:akfedux@megapolis.pl">akfedux@megapolis.pl</A>&gt;, 2004
<P>

Proszę zauważyć, że przet&#x142;umaczony dokument może zawierać fragmenty nieprzet&#x142;umaczone. Ma to na celu uniknięcie utracenia istotnych informacji, w przypadkach gdy orygina&#x142; zostanie zaktualizowany, a t&#x142;umaczenie - nie.
<A NAME="lbAJ">&nbsp;</A>
<H2>AUTORZY</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="15"><DD>
</DL>

<P>

<B>zesp&oacute;&#x142; APT</B>
<DL COMPACT><DT id="16"><DD>
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>PRZYPISY</H2>

<DL COMPACT>
<DT id="17"> 1.<DD>
Strona b&#x142;ęd&oacute;w APT
<DL COMPACT><DT id="18"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="19"><A HREF="#lbAB">NAZWA</A><DD>
<DT id="20"><A HREF="#lbAC">STRESZCZENIE</A><DD>
<DT id="21"><A HREF="#lbAD">OPIS</A><DD>
<DT id="22"><A HREF="#lbAE">OPCJE</A><DD>
<DT id="23"><A HREF="#lbAF">ZOBACZ TAKŻE</A><DD>
<DT id="24"><A HREF="#lbAG">DIAGNOSTYKA</A><DD>
<DT id="25"><A HREF="#lbAH">BUGS</A><DD>
<DT id="26"><A HREF="#lbAI">T&#x141;UMACZENIE</A><DD>
<DT id="27"><A HREF="#lbAJ">AUTORZY</A><DD>
<DT id="28"><A HREF="#lbAK">PRZYPISY</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:20 GMT, March 31, 2021
</BODY>
</HTML>
