
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_PREFERENCES</TITLE>
</HEAD><BODY>
<H1>APT_PREFERENCES</H1>
Section: APT (5)<BR>Updated: 17&nbsp;styczeń&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAZWA</H2>

apt_preferences - Plik kontrolny preferencji APT
<A NAME="lbAC">&nbsp;</A>
<H2>OPIS</H2>

<P>

Plik preferencji APT
/etc/apt/preferences
i pliki częściowe w katalogu
/etc/apt/preferences.d/
są używane do określania wersji pakiet&oacute;w wybieranych do instalacji.
<P>

Jeżeli plik
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
zawiera odniesienia do więcej niż jednej dystrybucji (na przyk&#x142;ad
stable
i
testing), to do zainstalowania może być dostępnych kilka wersji tego samego pakietu. APT nadaje priorytet każdej z dostępnych wersji.
<B>apt-get</B>
wybiera do zainstalowania wersję o najwyższym priorytecie (jeśli zależności pakietu pozwalają na jego zainstalowanie). Preferencje APT nadpisują domyślne priorytety ustawiane wersjom pakiet&oacute;w, pozwalając użytkownikowi kontrolować, kt&oacute;re wersje pakiet&oacute;w są wybierane do zainstalowania.
<P>

Może być dostępnych kilka instancji tej samej wersji pakietu, jeśli plik
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
zawiera odwo&#x142;ania do więcej niż jednego źr&oacute;d&#x142;a. W takim wypadku
<B>apt-get</B>
pobierze instancję ze źr&oacute;d&#x142;a wymienionego najwcześniej w pliku
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). Preferencje APT nie mają wp&#x142;ywu na wyb&oacute;r instancji, ale na wyb&oacute;r wersji.
<P>

Preferencje są mocnym narzędziem w rękach administratora systemu, ale mogą stać się też jego największym koszmarem, jeśli zostaną nieostrożnie użyte! APT nie podważa preferencji, tak więc b&#x142;ędne ustawienia spowodują pojawienie się nieinstalowalnych pakiet&oacute;w lub podejmowanie przez APT niepoprawnych decyzji podczas aktualizacji pakiet&oacute;w. Mogą wystąpić jeszcze większe problemy, gdy w pliku preferencji APT zostanie skonfigurowanych wiele wydań dystrybucji bez zrozumienia zawartości kolejnych rozdzia&#x142;&oacute;w tej strony. Pakiety do&#x142;ączone do określonego wydania nie są testowane w po&#x142;ączeniu z pakietami z innych (starszych lub nowszych) wydań, więc w takich sytuacjach nie zawsze dzia&#x142;ają, tak jakby się tego od nich oczekiwa&#x142;o. Ostrzegamy!
<P>

Proszę zauważyć, że pliki w katalogu
/etc/apt/preferences.d
są przetwarzane w rosnącym porządku alfanumerycznym. Należy r&oacute;wnież przestrzegać następującej konwencji: pliki albo nie powinny mieć żadnego rozszerzenia, albo rozszerzeniem powinno być &quot;pref&quot;, a ich nazwy powinny zawierać tylko i wy&#x142;ącznie znaki alfanumeryczne oraz myślniki (&quot;-&quot;), podkreślenia (&quot;_&quot;) i kropki (&quot;.&quot;). W przeciwnym wypadku APT zignoruje plik o niepoprawnej nazwie i jeśli nazwa pliku nie pasuje do wzorca podanego w liście zmiennych konfiguracji
Dir::Ignore-Files-Silently, to wypisze odpowiedni komunikat.
<A NAME="lbAD">&nbsp;</A>
<H3>Domyślne przypisania priorytet&oacute;w APT</H3>

<P>

Jeśli plik preferencji nie istnieje lub nie zawiera wpisu pasującego do pewnej wersji, to priorytetem przypisanym do tej wersji jest priorytet dystrybucji, do kt&oacute;rej wersja należy. Jest możliwe wybranie jednej dystrybucji, tak zwanego &quot;wydania docelowego&quot;, kt&oacute;ra otrzyma priorytet wyższy niż priorytet domyślnie przypisywany innym dystrybucjom. To wydanie docelowe można ustawić w linii poleceń
<B>apt-get</B>
lub w pliku konfiguracyjnym APT
/etc/apt/apt.conf. Proszę zauważyć, że wydanie docelowe nadpisuje jakikolwiek og&oacute;lny priorytet ustawiony w opisanym poniżej pliku
/etc/apt/preferences, ale nie nadpisuje priorytet&oacute;w szczeg&oacute;&#x142;owych przypisanych do poszczeg&oacute;lnych pakiet&oacute;w. Na przyk&#x142;ad
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<B>apt-get install -t testing </B><B></B><I>jakiś-pakiet</I>
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
APT::Default-Release &quot;stable&quot;;
</PRE>

</DL>




<P>

Jeśli wydanie docelowe zosta&#x142;o podane, to APT używa następującego algorytmu do ustawiania priorytet&oacute;w wersjom pakietu. Przypisuje:
<P>

priorytet 1
<DL COMPACT><DT id="3"><DD>
wersjom pochodzącym z archiw&oacute;w, kt&oacute;rych pliki
Release
mają wpis &quot;NotAutomatic: yes&quot; i
<I>nie mają</I>
wpisu &quot;ButAutomaticUpgrades: yes&quot;. Przyk&#x142;adem takiego archiwum jest archiwum
experimental
Debiana.
</DL>

<P>

priorytet 100
<DL COMPACT><DT id="4"><DD>
wersji, kt&oacute;ra jest już zainstalowana (o ile jakaś jest) i wersjom pochodzącym z archiw&oacute;w, kt&oacute;re w swoich plikach
Release
mają wpisy &quot;NotAutomatic: yes&quot; i &quot;ButAutomaticUpgrades: yes&quot;, tak jak to robią archiwa backport-&oacute;w Debiana począwszy od
squeeze-backports.
</DL>

<P>

priorytet 500
<DL COMPACT><DT id="5"><DD>
to the versions that do not belong to the target release.
</DL>

<P>

priorytet 990
<DL COMPACT><DT id="6"><DD>
to the versions that belong to the target release.
</DL>

The highest of those priorities whose description matches the version is assigned to the version.
<P>

Jeśli nie określono wydania docelowego, to APT przypisuje priorytet 100 wszystkim zainstalowanym wersjom pakiet&oacute;w oraz priorytet 500 wszystkim niezainstalowanym wersjom pakiet&oacute;w, z wyjątkiem wersji pochodzących z archiw&oacute;w, kt&oacute;rych pliki
Release
są oznaczone jako &quot;NotAutomatic: yes&quot; - takie wersje otrzymują priorytet 1 lub priorytet 100, jeśli dodatkowo są oznaczone jako &quot;ButAutomaticUpgrades: yes&quot;.
<P>

APT, do określenia, kt&oacute;rą wersję pakietu należy zainstalować, stosuje wtedy następujące regu&#x142;y wymienione w kolejności, w jakiej są stosowane.
<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Nigdy nie zastępuje pakietu jego wcześniejszą wersją (tzw. &quot;downgrading&quot;), chyba że priorytet tej wcześniejszej, dostępnej wersji przekracza 1000. (Należy zauważyć, że żaden z domyślnych priorytet&oacute;w APT nie przekracza 1000; tak wysokie priorytety mogą być ustawiane tylko w pliku konfiguracyjnym. Instalowanie wcześniejszych wersji pakiet&oacute;w może być ryzykowną operacją).
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Instaluje wersję o najwyższym priorytecie.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Jeśli dwie lub więcej wersji ma ten sam priorytet, to zainstalowana zostanie wersja nowsza (czyli z większym numerem wersji).
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Jeśli dwie lub więcej wersji ma ten sam priorytet i numer wersji ale albo pakiety r&oacute;żnią się niekt&oacute;rymi metadanymi, albo użyto opcji
--reinstall, to zainstalowany zostanie pakiet jeszcze niezainstalowany.
</DL>

<P>

W typowej sytuacji zainstalowana wersja pakietu (priorytet 100) jest starsza od kt&oacute;rejś z wersji dostępnych ze źr&oacute;de&#x142; wymienionych w pliku
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
(priorytet 500 lub 999). W takim wypadku polecenia
<B>apt-get install </B><B></B><I>jakiś-pakiet</I>
lub
<B>apt-get upgrade</B>
zaktualizują ten pakiet.
<P>

Rzadziej, ale się zdarza, że zainstalowana wersja pakietu jest
<I>nowsza</I>
niż jakakolwiek inna dostępna wersja. Polecenia
<B>apt-get install </B><B></B><I>jakiś-pakiet</I>
i
<B>apt-get upgrade</B>
nie zastąpią takiego pakietu wcześniejszą wersją.
<P>

Czasami zainstalowana wersja pakietu jest nowsza niż wersja należąca do wydania docelowego, ale nie tak nowa jak wersja należąca do innej dystrybucji. Polecenia
<B>apt-get install </B><B></B><I>jakiś-pakiet</I>
oraz
<B>apt-get upgrade</B>
zaktualizują taki pakiet, ponieważ przynajmniej
<I>jedna</I>
z dostępnych wersji ma większy priorytet niż wersja zainstalowana.
<A NAME="lbAE">&nbsp;</A>
<H3>Efekt stosowania preferencji APT</H3>

<P>

Plik preferencji APT pozwala administratorowi systemu na kontrolowanie przypisań priorytet&oacute;w. Plik sk&#x142;ada się z jednego lub większej liczby wieloliniowych rekord&oacute;w rozdzielonych pustymi liniami. Rekordy mogą przyjmować jedną z dw&oacute;ch postaci: szczeg&oacute;&#x142;ową i og&oacute;lną.
<P>
<DL COMPACT><DT id="11"><DD>
&bull;


Postać szczeg&oacute;&#x142;owa przypisuje priorytet (&quot;Pin-Priority&quot;) do jednego lub większej liczby podanych pakiet&oacute;w i podanych wersji lub zakres&oacute;w wersji. Na przyk&#x142;ad następujący rekord ustawia wysoki priorytet wszystkim wersjom pakietu
perl, kt&oacute;rych numer wersji zaczyna się od &quot;5.20&quot;. Można podać wiele nazw pakiet&oacute;w, rozdzielając je od siebie spacjami.
<P>
<DL COMPACT><DT id="12"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001
</PRE>

</DL>




</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Postać og&oacute;lna przypisuje priorytet wszystkim wersjom pakiet&oacute;w w podanej dystrybucji (to jest wszystkim wersjom pakiet&oacute;w wymienionych w pewnym pliku
Release) lub wszystkim wersjom pakiet&oacute;w pochodzących ze strony internetowej identyfikowanej przez pe&#x142;ną nazwę domenową strony.
<P>
Ten wpis w postaci og&oacute;lnej w pliku preferencji APT ma zastosowanie tylko do grup pakiet&oacute;w. Na przyk&#x142;ad następujący rekord przypisuje wysoki priorytet wszystkim wersjom pakiet&oacute;w dostępnych na lokalnym komputerze.
<P>
<DL COMPACT><DT id="14"><DD>



<PRE>
Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Uwaga: s&#x142;owem kluczowym używanym tutaj jest &quot;origin&quot;, kt&oacute;re może zostać użyte do dopasowania nazwy komputera. Następujący rekord ustawi wysoki priorytet wszystkim wersjom dostępnym na serwerze identyfikowanym przez nazwę komputera &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;.
<P>
<DL COMPACT><DT id="15"><DD>



<PRE>
Package: *
Pin: origin &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
<I>Nie</I>
należy tego mylić z polem
Origin
podanym w pliku
Release. Wartością pola
Origin
w pliku
Release
jest nie adres internetowy, ale nazwa autora lub dystrybutora, taka jak &quot;Debian&quot; lub &quot;Ximian&quot;.
<P>
Następujący rekord przypisuje niski priorytet wszystkim wersjom pakiet&oacute;w należących do jakiejkolwiek dystrybucji, kt&oacute;rej nazwą archiwum jest &quot;unstable&quot;.
<P>
<DL COMPACT><DT id="16"><DD>



<PRE>
Package: *
Pin: release a=unstable
Pin-Priority: 50
</PRE>

</DL>




<P>
Następujący rekord przypisuje niski priorytet wszystkim wersjom pakiet&oacute;w należących do jakiejkolwiek dystrybucji, kt&oacute;rej nazwą kodową jest &quot;bullseye&quot;.
<P>
<DL COMPACT><DT id="17"><DD>



<PRE>
Package: *
Pin: release n=bullseye
Pin-Priority: 900
</PRE>

</DL>




<P>
Następujący rekord przypisuje wysoki priorytet wszystkim wersjom pakiet&oacute;w należącym do jakiegokolwiek wydania, kt&oacute;rego pole
Archive
(zawierające nazwę archiwum) jest r&oacute;wne &quot;stable&quot;, a pole
Version
(numer wersji wydania) wynosi &quot;10&quot;.
<P>
<DL COMPACT><DT id="18"><DD>



<PRE>
Package: *
Pin: release a=stable, v=10
Pin-Priority: 500
</PRE>

</DL>




</DL>

<P>
The effect of the comma operator is similar to an &quot;and&quot; in logic: All conditions must be satisfied for the pin to match. There is one exception: For any type of condition (such as two &quot;a&quot; conditions), only the last such condition is checked.
<A NAME="lbAF">&nbsp;</A>
<H3>Sk&#x142;adnia wyrażeń regularnych i <A HREF="/cgi-bin/man/man2html?7+glob">glob</A>(7)</H3>

<P>

APT także wspiera dopasowywanie przy użyciu wzorc&oacute;w
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
i wyrażeń regularnych otoczonych znakami /. Następujący przyk&#x142;ad ustawia priorytet 500 wszystkim pakietom z dystrybucji
experimental, kt&oacute;rych nazwa zaczyna się od
gnome
(jako wzorzec
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)) lub zawiera s&#x142;owo
kde
(jako rozszerzone wyrażenie regularne POSIX otoczone ukośnikami).
<P>
<DL COMPACT><DT id="19"><DD>



<PRE>
Package: gnome* /kde/
Pin: release a=experimental
Pin-Priority: 500
</PRE>

</DL>




<P>

Wyrażenia te mogą wystąpić wszędzie, gdzie tylko może wystąpić &#x142;ańcuch znak&oacute;w. Dlatego następujący przyk&#x142;ad przypisuje priorytet 990 wszystkim pakietom z wydania o nazwie zaczynającej się od focal.
<P>
<DL COMPACT><DT id="20"><DD>



<PRE>
Package: *
Pin: release n=focal*
Pin-Priority: 990
</PRE>

</DL>




<P>

Jeśli wyrażenie regularne występuje w polu
Package, to zachowanie jest takie samo, jakby to wyrażenie regularne zosta&#x142;o zastąpione listą wszystkich pakiet&oacute;w, kt&oacute;rych nazwy pasują do tego wyrażenia regularnego. Nie wiadomo jeszcze, czy to się nie zmieni w przysz&#x142;ości, dlatego powinno się zawsze umieszczać preferencje zawierające wzorce pakiet&oacute;w na początku, tak żeby mog&#x142;y zostać nadpisane przez preferencje dotyczące specyficznych pakiet&oacute;w. Wzorzec &quot;*&quot; w polu
Package
nie jest uznawany za wyrażenie
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7).
<A NAME="lbAG">&nbsp;</A>
<H3>Pinning by source package</H3>

<P>

APT supports pinning by source packages. To pin by a source package, prepend &quot;src:&quot; to the package name.
<P>

For example, to pin all binaries produced by the apt source package of this APT's version to 990, you can do:
<P>
<DL COMPACT><DT id="21"><DD>



<PRE>
Package: src:apt
Pin: version 2.0.4
Pin-Priority: 990
</PRE>

</DL>




<P>

Source package pinning can be combined with regular expressions and glob patterns, and can also take a binary architecture.
<P>

For example, let's pin all binaries for all architectures produced by any source package containing apt in its name to 990:
<P>
<DL COMPACT><DT id="22"><DD>



<PRE>
Package: src:*apt*:any
Pin: version *
Pin-Priority: 990
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H3>Jak APT interpretuje priorytety</H3>

<P>

Priorytety (P) przypisane w pliku preferencji APT muszą być liczbami ca&#x142;kowitymi dodatnimi lub ujemnymi. Są interpretowane następująco (og&oacute;lnie rzecz biorąc):
<P>

P &gt;= 1000
<DL COMPACT><DT id="23"><DD>
powoduje, że wersja zostanie zainstalowana, nawet jeśli oznacza to zastąpienie pakietu jego wcześniejszą wersją.
</DL>

<P>

990 &lt;= P &lt; 1000
<DL COMPACT><DT id="24"><DD>
powoduje, że wersja zostanie zainstalowana, nawet jeśli nie pochodzi z wydania docelowego, chyba że zainstalowana wersja jest nowsza.
</DL>

<P>

500 &lt;= P &lt; 990
<DL COMPACT><DT id="25"><DD>
powoduje, że wersja zostanie zainstalowana, jeśli nie ma żadnej dostępnej wersji należącej do wydania docelowego lub gdy nowsza wersja już jest zainstalowana.
</DL>

<P>

100 &lt;= P &lt; 500
<DL COMPACT><DT id="26"><DD>
powoduje, że wersja zostanie zainstalowana, o ile nie jest dostępna wersja należąca do innej dystrybucji lub nowsza wersja jest zainstalowana
</DL>

<P>

0 &lt; P &lt; 100
<DL COMPACT><DT id="27"><DD>
powoduje, że wersja zostanie zainstalowana tylko wtedy, jeżeli żadna wersja pakietu nie jest jeszcze zainstalowana
</DL>

<P>

P &lt; 0
<DL COMPACT><DT id="28"><DD>
zapobiega instalowaniu wersji
</DL>

<P>

P = 0
<DL COMPACT><DT id="29"><DD>
has undefined behaviour, do not use it.
</DL>

<P>

The first specific-form record matching an available package version determines the priority of the package version. Failing that, the priority of the package is defined as the maximum of all priorities defined by generic-form records matching the version. Records defined using patterns in the Pin field other than &quot;*&quot; are treated like specific-form records.
<P>

Na przyk&#x142;ad, za&#x142;&oacute;żmy, że plik preferencji APT zawiera trzy pokazane wcześniej rekordy:
<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001

Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999

Package: *
Pin: release unstable
Pin-Priority: 50
</PRE>

</DL>




<P>

Wtedy:
<P>
<DL COMPACT><DT id="31"><DD>
&bull;


Zostanie zainstalowana najnowsza dostępna wersja pakietu
perl, jeśli tylko numer tej wersji zaczyna się od &quot;5.20&quot;. Jeśli
<I>jakakolwiek</I>
wersja 5.20* jest dostępna, ale zainstalowana jest już wersja 5.24*, to pakiet
perl
zostanie zastąpiony tą dostępną wcześniejszą wersją 5.20*.
</DL>

<P>
<DL COMPACT><DT id="32"><DD>
&bull;


Wersja jakiegokolwiek pakietu innego niż
perl
dostępna na lokalnym systemie ma wyższy priorytet niż jakakolwiek inna wersja tego pakietu, w&#x142;ączając w to wersję należącą do wydania docelowego.
</DL>

<P>
<DL COMPACT><DT id="33"><DD>
&bull;


Wersja pakietu pochodząca nie z lokalnego systemu, ale z jakiegoś innego źr&oacute;d&#x142;a wymienionego w
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
i należąca do dystrybucji
unstable
będzie zainstalowana tylko wtedy, gdy zostanie wybrana (przez użytkownika) do instalacji i żadna inna wersja tego pakietu nie jest jeszcze zainstalowana.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H3>Określanie wersji pakietu i w&#x142;aściwości dystrybucji</H3>

<P>

Lokalizacje wymienione w pliku
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
powinny zawierać pliki
Packages
i
Release
opisujące pakiety dostępne w danej lokalizacji.
<P>

Plik
Packages
zazwyczaj znajduje się w katalogu.../dists/<I>nazwa-dystrybucji</I>/<I>komponent</I>/<I>architektura</I>: na przyk&#x142;ad
.../dists/stable/main/binary-i386/Packages. Sk&#x142;ada się z serii wieloliniowych rekord&oacute;w, po jednym na każdy pakiet dostępny w tym katalogu. Podczas ustawiania priorytet&oacute;w APT bierze pod uwagę tylko dwie linie z każdego rekordu:
<P>

linia Package:
<DL COMPACT><DT id="34"><DD>
podaje nazwę pakietu
</DL>

<P>

linia Version:
<DL COMPACT><DT id="35"><DD>
podaje numer wersji danego pakietu
</DL>

<P>

Plik
Release
znajduje się zazwyczaj w katalogu.../dists/<I>nazwa-dystrybucji</I>: na przyk&#x142;ad
.../dists/stable/Release
lub
.../dists/buster/Release. Sk&#x142;ada się z jednego wieloliniowego rekordu, kt&oacute;ry odnosi się do
<I>wszystkich</I>
pakiet&oacute;w znajdujących się w drzewie katalog&oacute;w o korzeniu w katalogu, w kt&oacute;rym znajduje się opisywany plik. W przeciwieństwie do pliku
Packages, prawie wszystkie linie z pliku
Release
są brane pod uwagę podczas ustawiania priorytet&oacute;w APT:
<P>

linia Archive: lub Suite:
<DL COMPACT><DT id="36"><DD>
nazywa archiwum, do kt&oacute;rego należą wszystkie pakiety znajdujące się w drzewie katalog&oacute;w. Na przyk&#x142;ad linia &quot;Archive: stable&quot; lub &quot;Suite: stable&quot; m&oacute;wi, że wszystkie pakiety w drzewie katalog&oacute;w poniżej katalogu nadrzędnego pliku
Release
należą do archiwum
stable. Wartość tę można podać w pliku preferencji APT w następujący spos&oacute;b:
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
Pin: release a=stable
</PRE>

</DL>




</DL>

<P>

linia Codename:
<DL COMPACT><DT id="38"><DD>
nazwa kodowa dystrybucji, do kt&oacute;rej należą wszystkie pakiety w drzewie katalog&oacute;w. Na przyk&#x142;ad linia &quot;Codename: bullseye&quot; m&oacute;wi, że wszystkie pakiety w drzewie katalog&oacute;w poniżej katalogu nadrzędnego pliku
Release
należą do wersji nazwanej
bullseye. Wartość tę można podać w pliku preferencji APT w następujący spos&oacute;b:
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
Pin: release n=bullseye
</PRE>

</DL>




</DL>

<P>

linia Version:
<DL COMPACT><DT id="40"><DD>
określa wersję wydania. Na przyk&#x142;ad pakiety w drzewie katalog&oacute;w mog&#x142;yby należeć do wersji 10 dystrybucji Debiana. Proszę zauważyć, że zazwyczaj dystrybucje
testing
i
unstable
nie mają przypisanego numeru wersji, ponieważ nie są one oficjalnie wydawane. Wersję wydania można podać w pliku preferencji APT w następujący spos&oacute;b:
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Pin: release v=10
Pin: release a=stable, v=10
Pin: release 10
</PRE>

</DL>




</DL>

<P>

linia Component:
<DL COMPACT><DT id="42"><DD>
określa komponent licencji powiązany z pakietami w drzewie katalog&oacute;w pliku
Release. Na przyk&#x142;ad linia &quot;Component: main&quot; m&oacute;wi, że wszystkie pakiety w drzewie katalog&oacute;w pochodzą z komponentu
main, co oznacza, że wszystkie są licencjonowane w 100% zgodnie z &quot;Wytycznymi Debiana dotyczącymi Wolnego Oprogramowania&quot; (&quot;Debian Free Software Guidelines&quot;). Komponent można podać w pliku preferencji APT w następujący spos&oacute;b:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Pin: release c=main
</PRE>

</DL>




</DL>

<P>

linia Origin:
<DL COMPACT><DT id="44"><DD>
określa tw&oacute;rcę pakiet&oacute;w w drzewie katalog&oacute;w pliku
Release. Najczęściej jest to
Debian. Tw&oacute;rcę pakiet&oacute;w można podać w pliku preferencji APT w następujący spos&oacute;b:
<P>
<DL COMPACT><DT id="45"><DD>



<PRE>
Pin: release o=Debian
</PRE>

</DL>




</DL>

<P>

linia Label:
<DL COMPACT><DT id="46"><DD>
określa etykietę pakiet&oacute;w w drzewie katalog&oacute;w pliku
Release. Najczęściej jest to
Debian. Etykietę tę można podać w pliku preferencji APT w następujący spos&oacute;b:
<P>
<DL COMPACT><DT id="47"><DD>



<PRE>
Pin: release l=Debian
</PRE>

</DL>




</DL>

<P>

Wszystkie pliki
Packages
i
Release
pobierane z lokalizacji podanych w pliku
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
są przechowywane w katalogu
/var/lib/apt/lists
lub w pliku o nazwie będącej wartością zmiennej
Dir::State::Lists
z pliku
apt.conf. Na przyk&#x142;ad plik o nazwie
debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release
zawiera plik
Release
pobrany z komputera
debian.lcs.mit.edu
dla plik&oacute;w komponentu
contrib
architektury
binary-i386
dystrybucji
unstable
.
<A NAME="lbAJ">&nbsp;</A>
<H3>Opcjonalne linie w rekordzie preferencji APT</H3>

<P>

Każdy rekord w pliku preferencji APT może opcjonalnie zaczynać się od jednej lub większej liczby linii zaczynających się od wyrazu
Explanation:
(tj. objaśnienie). Pozwala to na dodawanie komentarzy do rekord&oacute;w.
<A NAME="lbAK">&nbsp;</A>
<H2>PRZYK&#x141;ADY</H2>

<A NAME="lbAL">&nbsp;</A>
<H3>Śledzenie dystrybucji stabilnej</H3>

<P>

Następujący plik preferencji APT spowoduje przypisanie priorytetu większego niż domyślny (500) wszystkim wersjom pakietu należącym do dystrybucji
stable
i zakazująco niskiego priorytetu wersjom pakiet&oacute;w należącym do innych dystrybucji
Debiana.
<P>
<DL COMPACT><DT id="48"><DD>



<PRE>
Explanation: Odinstaluj lub nie instaluj wersji pakiet&oacute;w pochodzących z Debiana
Explanation: innych niż te w dystrybucji stabilnej
Package: *
Pin: release a=stable
Pin-Priority: 900

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Z odpowiednim plikiem
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
i z powyższym plikiem preferencji, każde z następujących poleceń spowoduje, że APT zaktualizuje pakiety do najnowszych wersji z dystrybucji
stable.
<P>
<DL COMPACT><DT id="49"><DD>



<PRE>
apt-get install <I>nazwa-pakietu</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Następujące polecenie spowoduje, że APT zaktualizuje podany pakiet do najnowszej wersji z dystrybucji
testing. Pakiet nie będzie aktualizowany do czasu ponownego wydania tego samego polecenia.
<P>
<DL COMPACT><DT id="50"><DD>



<PRE>
apt-get install <I>pakiet</I>/testing
</PRE>

</DL>




<P>
<A NAME="lbAM">&nbsp;</A>
<H3>Śledzenie dystrybucji testowej lub niestabilnej</H3>

<P>

Następujący plik preferencji APT spowoduje przypisanie wysokiego priorytetu wersjom pakiet&oacute;w z dystrybucji
testing, niskiego priorytetu wersjom pakiet&oacute;w z dystrybucji
unstable
oraz zakazująco niskiego priorytetu wersjom pakiet&oacute;w należącym do innych dystrybucji
Debiana.
<P>
<DL COMPACT><DT id="51"><DD>



<PRE>
Package: *
Pin: release a=testing
Pin-Priority: 900

Package: *
Pin: release a=unstable
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Z odpowiednim plikiem
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
i z powyższym plikiem preferencji, każde z następujących poleceń spowoduje, że APT zaktualizuje pakiety do najnowszych wersji z dystrybucji
testing.
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
apt-get install <I>nazwa-pakietu</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Następujące polecenie spowoduje, że APT zaktualizuje podany pakiet do najnowszej wersji z dystrybucji
unstable. Od tej pory
<B>apt-get upgrade</B>
będzie aktualizowa&#x142; pakiet do najnowszej wersji z dystrybucji
testing, jeśli ta wersja będzie nowsza od wersji zainstalowanej, lub w przeciwnym wypadku - do najnowszej wersji z dystrybucji
unstable, jeśli ta wersja będzie nowsza od wersji zainstalowanej.
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
apt-get install <I>pakiet</I>/unstable
</PRE>

</DL>




<P>
<A NAME="lbAN">&nbsp;</A>
<H3>Śledzenie ewolucji wydania o danej nazwie kodowej</H3>

<P>

Następujący plik preferencji APT spowoduje przypisanie priorytetu większego niż domyślny (500) wszystkim wersjom pakietu należącym do dystrybucji o podanej nazwie kodowej oraz zakazująco niskiego priorytetu wersjom pakiet&oacute;w należącym do innych dystrybucji
Debiana, nazw kodowych i archiw&oacute;w. Proszę zauważyć, że z tym plikiem preferencji APT będzie śledzi&#x142;o migrację wydania z archiwum
testing
przez
stable
aż do
oldstable. Aby śledzić postępy na przyk&#x142;ad w dystrybucji
testing
niezależnie od nazwy kodowej tej dystrybucji, należy użyć jednej z zaprezentowanych powyżej przyk&#x142;adowych konfiguracji.
<P>
<DL COMPACT><DT id="54"><DD>



<PRE>
Explanation: Odinstaluj lub nie instaluj wersji pakiet&oacute;w pochodzących z Debiana
Explanation: innych niż te w dystrybucji bullseye lub sid
Package: *
Pin: release n=bullseye
Pin-Priority: 900

Explanation: Debian unstable jest zawsze nazwany sid
Package: *
Pin: release n=sid
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Z odpowiednim plikiem
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
i z powyższym plikiem preferencji, każde z następujących poleceń spowoduje, że APT zaktualizuje pakiety do najnowszych wersji z wydania nazwanego
bullseye.
<P>
<DL COMPACT><DT id="55"><DD>



<PRE>
apt-get install <I>nazwa-pakietu</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Następujące polecenie spowoduje, że APT zaktualizuje podany pakiet do najnowszej wersji z dystrybucji
sid. Od tej pory
<B>apt-get upgrade</B>
będzie aktualizowa&#x142; pakiet do najnowszej wersji z dystrybucji
bullseye, jeśli ta wersja będzie nowsza od wersji zainstalowanej, lub w przeciwnym wypadku - do najnowszej wersji z dystrybucji
sid, jeśli ta wersja będzie nowsza od wersji zainstalowanej.
<P>
<DL COMPACT><DT id="56"><DD>



<PRE>
apt-get install <I>pakiet</I>/sid
</PRE>

</DL>




<P>
<A NAME="lbAO">&nbsp;</A>
<H2>PLIKI</H2>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="57"><DD>
Plik zawierający preferencje wyboru wersji. Jest to miejsce, w kt&oacute;rym określa się tzw. &quot;pinning&quot;, tj. preferencje, skąd brać pewne pakiety - z innego źr&oacute;d&#x142;a, z innej dystrybucji lub o innej wersji. Pozycja w pliku konfiguracyjnym:Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="58"><DD>
Części pliku preferencji wyboru wersji. Pozycja w pliku konfiguracyjnym:
Dir::Etc::PreferencesParts.
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>ZOBACZ TAKŻE</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>Strona b&#x142;ęd&oacute;w APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Aby zg&#x142;osić b&#x142;ąd w APT, proszę przeczytać
/usr/share/doc/debian/bug-reporting.txt
lub opis polecenia
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAR">&nbsp;</A>
<H2>T&#x141;UMACZENIE</H2>

<P>

T&#x142;umaczenie stron podręcznika: Robert Luberda
&lt;<A HREF="mailto:robert@debian.org">robert@debian.org</A>&gt;, 2000-2012. T&#x142;umaczenie przewodnika offline: Krzysztof Fiertek
&lt;<A HREF="mailto:akfedux@megapolis.pl">akfedux@megapolis.pl</A>&gt;, 2004
<P>

Proszę zauważyć, że przet&#x142;umaczony dokument może zawierać fragmenty nieprzet&#x142;umaczone. Ma to na celu uniknięcie utracenia istotnych informacji, w przypadkach gdy orygina&#x142; zostanie zaktualizowany, a t&#x142;umaczenie - nie.
<A NAME="lbAS">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>zesp&oacute;&#x142; APT</B>
<DL COMPACT><DT id="59"><DD>
</DL>

<A NAME="lbAT">&nbsp;</A>
<H2>PRZYPISY</H2>

<DL COMPACT>
<DT id="60"> 1.<DD>
Strona b&#x142;ęd&oacute;w APT
<DL COMPACT><DT id="61"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="62"><A HREF="#lbAB">NAZWA</A><DD>
<DT id="63"><A HREF="#lbAC">OPIS</A><DD>
<DL>
<DT id="64"><A HREF="#lbAD">Domyślne przypisania priorytet&oacute;w APT</A><DD>
<DT id="65"><A HREF="#lbAE">Efekt stosowania preferencji APT</A><DD>
<DT id="66"><A HREF="#lbAF">Sk&#x142;adnia wyrażeń regularnych i glob(7)</A><DD>
<DT id="67"><A HREF="#lbAG">Pinning by source package</A><DD>
<DT id="68"><A HREF="#lbAH">Jak APT interpretuje priorytety</A><DD>
<DT id="69"><A HREF="#lbAI">Określanie wersji pakietu i w&#x142;aściwości dystrybucji</A><DD>
<DT id="70"><A HREF="#lbAJ">Opcjonalne linie w rekordzie preferencji APT</A><DD>
</DL>
<DT id="71"><A HREF="#lbAK">PRZYK&#x141;ADY</A><DD>
<DL>
<DT id="72"><A HREF="#lbAL">Śledzenie dystrybucji stabilnej</A><DD>
<DT id="73"><A HREF="#lbAM">Śledzenie dystrybucji testowej lub niestabilnej</A><DD>
<DT id="74"><A HREF="#lbAN">Śledzenie ewolucji wydania o danej nazwie kodowej</A><DD>
</DL>
<DT id="75"><A HREF="#lbAO">PLIKI</A><DD>
<DT id="76"><A HREF="#lbAP">ZOBACZ TAKŻE</A><DD>
<DT id="77"><A HREF="#lbAQ">BUGS</A><DD>
<DT id="78"><A HREF="#lbAR">T&#x141;UMACZENIE</A><DD>
<DT id="79"><A HREF="#lbAS">AUTOR</A><DD>
<DT id="80"><A HREF="#lbAT">PRZYPISY</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:20 GMT, March 31, 2021
</BODY>
</HTML>
