
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-split</TITLE>
</HEAD><BODY>
<H1>dpkg-split</H1>
Section: Dpkg-sviten (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NAMN</H2>

dpkg-split - Verktyg f&ouml;r att dela/sl&aring; ihop Debianpaket
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPS</H2>

<B>dpkg-split</B> [<I>flaggor</I>...] <I>&aring;tg&auml;rd</I>
<A NAME="lbAD">&nbsp;</A>
<H2>BESKRIVNING</H2>

<B>dpkg-split</B> delar upp bin&auml;ra Debianpaketfiler i mindre delar och sl&aring;r
samman dem igen, f&ouml;r att g&ouml;ra det m&ouml;jligt att lagra stora paketfiler p&aring; sm&aring;
media, till exempel disketter.
<P>
Programmet kan k&ouml;ras manuellt med flaggorna <B>--split</B>, <B>--join</B> och
<B>--info</B>.
<P>
Det har &auml;ven ett automatiskt l&auml;ge, vilket aktiveras med flaggan <B>--auto</B>. I
det l&auml;get hanterar det en k&ouml; av delar som setts men &auml;nnu inte &aring;terst&auml;llts,
och &aring;terst&auml;ller en paketfil n&auml;r den sett alla dess delar. Flaggorna
<B>--listq</B> and <B>--discard</B> g&ouml;r det m&ouml;jligt att hantera k&ouml;n.
<P>
Alla funktioner f&ouml;r uppdelning, sammanslagning och k&ouml;ande visar informativa
meddelanden p&aring; standard ut; dessa kan ignoreras.
<A NAME="lbAE">&nbsp;</A>
<H2>KOMMANDON</H2>

<DL COMPACT>
<DT id="1"><B>-s</B>, <B>--split</B> <I>helt-arkiv</I> [<I>prefix</I>]<DD>
Delar ett ensamt bin&auml;rt Debianpaket i flera delar.
<P>
Delarna namnges som <I>prefix</I><B>.</B><I>N</I><B>of</B><I>M</I><B>.deb</B> d&auml;r <I>N</I> &auml;r numret p&aring;
delen, r&auml;knat fr&aring;n 1, och <I>M</I> &auml;r det totala antalet delar (b&aring;da angivna
decimalt).
<P>
Om inget <I>prefix</I> ges tas filnamnet f&ouml;r <I>helt-arkiv</I>, inklusive
katalognamn, med den avslutande <B>.deb</B> borttagen.
<DT id="2"><B>-j</B>, <B>--join</B> <I>del</I>...<DD>
Sl&aring;r samman de olika paketdelarna, och &aring;terskapar den ursprungliga filen som
den s&aring;g ut innan den delades.
<P>
Delfilerna som ges som argument m&aring;ste alla vara delar av exakt samma
ursprungliga bin&auml;rfil. Varje m&aring;ste finnas exakt en g&aring;ng i argumentlistan,
men de beh&ouml;ver inte listas i ordning.
<P>
Delarna m&aring;ste naturligtvis alla ha genererats med samma delstorlek n&auml;r
uppdelningen skedde, vilket betyder att de vanligtvis m&aring;ste ha genererats
vid samma k&ouml;rning av <B>dpkg-split --split</B>.
<P>
Delarnas filnamn &auml;r inte signifikanta f&ouml;r sammanslagningsproceduren.
<P>
F&ouml;rvalt namn p&aring; utdatafilen &auml;r <I>paket</I><B>_</B><I>version</I><B>_</B><I>ark</I><B>.deb</B>.
<P>
<DT id="3"><B>-I</B>, <B>--info</B> <I>del</I>...<DD>
Skriver ut information, i m&auml;nniskol&auml;sbar form, om delfilerna som
anges. Argument som inte &auml;r delar av bin&auml;rpaket resulterar i ett meddelande
som talar om detta (men fortfarande p&aring; standard ut).
<DT id="4"><B>-a</B>, <B>--auto -o</B><I> fullst&auml;ndig-utdata del</I><DD>
K&ouml;a automatiskt delarna och &aring;terskapa paketet om m&ouml;jligt.
<P>
Den <I>del</I> som anges unders&ouml;ks och j&auml;mf&ouml;rs med andra delar av samma paket
(om s&aring;dana existerar) i k&ouml;n av delar av paket.
<P>
Om alla delar av ett paket av vilket <I>del</I> &auml;r en del av &auml;r tillg&auml;ngliga
kommer paketet att &aring;terskapas och skrivas till <I>fullst&auml;ndig-utdata</I> (vilken
vanligtvis inte redan b&ouml;r existera, &auml;ven om det inte vore ett fel om det
gjorde det).
<P>
Om inte kommer <I>del</I> att kopieras till k&ouml;n och <I>fullst&auml;ndig-utdata</I> skapas
inte.
<P>
Om <I>del</I> inte &auml;r en del av ett delat bin&auml;rpaket kommer <B>dpkg-split</B> att
avsluta med returv&auml;rde <B>1</B>; om n&aring;got annat fel uppst&aring;r avslutar det med
returv&auml;rde <B>2</B>.
<P>
Flaggan <B>--output</B> eller <B>-o</B> m&aring;ste ges d&aring; <B>--auto</B>anv&auml;nds.  (Om detta
inte vore ett krav skulle det anropande programmet inte veta vilken
utdatafil som f&ouml;rv&auml;ntades.)
<DT id="5"><B>-l</B>, <B>--listq</B><DD>
Listar inneh&aring;llet i k&ouml;n &ouml;ver paket att &aring;terst&auml;lla.
<P>
F&ouml;r varje paketfil f&ouml;r vilken delar finns i k&ouml;n visas i utdata namnet p&aring;
paketet, antal delar i k&ouml;n, och det totala antalet byte som &auml;r lagrade i
k&ouml;n.
<DT id="6"><B>-d</B>, <B>--discard</B> [<I>paket</I>...]<DD>
Kastar bort delar fr&aring;n k&ouml;n &ouml;ver de som v&auml;ntar p&aring; &aring;terst&aring;ende delar av paket.
<P>
Om inget <I>paket</I> anges t&ouml;ms k&ouml;n helt; om paket anges kastas bara delar f&ouml;r
de(t) paket som anges.
<DT id="7"><B>-?</B>, <B>--help</B><DD>
Visar hj&auml;lpsk&auml;rm och avslutar.
<DT id="8"><B>--version</B><DD>
Visar version och avslutar.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>FLAGGOR</H2>

<DL COMPACT>
<DT id="9"><B>--depotdir</B><I> katalog</I><DD>
Anger en alternativ katalog f&ouml;r k&ouml;n av delar som v&auml;ntar p&aring; automatisk
sammanslagning. F&ouml;rvalet &auml;r <B>/var/lib/dpkg</B>.
<DT id="10"><B>-S</B>, <B>--partsize</B> <I>kibibyte</I><DD>
Anger maximal storlek vid delning, i kibibyte (1024 byte). F&ouml;rval &auml;r 450
KiB.
<DT id="11"><B>-o</B>, <B>--output</B> <I>fullst&auml;ndig-utdata</I><DD>
Anger filnamnet f&ouml;r utdata vid sammanslagning.
<P>
Anv&auml;nds ist&auml;llet f&ouml;r f&ouml;rvalet vid manuell sammanslagning (<B>--join</B>) och
kr&auml;vs f&ouml;r automatisk k&ouml;a-eller-sammansl&aring; (<B>--auto</B>).
<DT id="12"><B>-Q</B>, <B>--npquiet</B><DD>
Vid automatisk k&ouml;a-eller-sammansl&aring; skriver <B>dpkg-split</B> normalt ett
meddelande om den matas med en <I>del</I> som inte &auml;r en bin&auml;r paketdel. Denna
flagga undertrycker meddelandet, vilket g&ouml;r det m&ouml;jligt f&ouml;r program s&aring;som
<B>dpkg</B> att hantera b&aring;de delade och odelade paket utan att producera
felaktiga meddelanden.
<DT id="13"><B>--msdos</B><DD>
Tvingar utdatafilnamn skapade av <B>--split</B> att vara msdos-kompatibla.
<P>
Misshandlar prefixet - antingen f&ouml;rvalet taget fr&aring;n indatafilnamnet, eller
det som angetts som argument: alfanumeriska tecken g&ouml;rs till gemener,
plustecken ers&auml;tts med <B>x</B> och alla andra tecken kastas.
<P>
Resultatet trunkeras s&aring; l&aring;ngt som m&ouml;jligt, och filnamn p&aring; formen
<I>prefixN</I><B>of</B><I>M</I><B>.deb</B> genereras.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>RETURV&Auml;RDE</H2>

<DL COMPACT>
<DT id="14"><B>0</B><DD>
Den efterfr&aring;gade delningen, sammanslagningen eller annan &aring;tg&auml;rd
lyckades. <B>--info</B>-kommandon lyckas &auml;ven om indatafilen inte &auml;r en del av
ett bin&auml;rpaket.
<DT id="15"><B>1</B><DD>
Uppkommer endast med <B>--auto</B> och anger att <I>del</I>filen inte var en del av
ett bin&auml;rpaket.
<DT id="16"><B>2</B><DD>
Fatal or unrecoverable error due to invalid command-line usage, a file that
looked like a package part file but was corrupted, or interactions with the
system, such as accesses to the database, memory allocations, etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>MILJ&Ouml;VARIABLER</H2>

<DL COMPACT>
<DT id="17"><B>DPKG_COLORS</B><DD>
Sets the color mode (since dpkg 1.18.5).  The currently accepted values are:
<B>auto</B> (default), <B>always</B> and <B>never</B>.
<DT id="18"><B>SOURCE_DATE_EPOCH</B><DD>
If set, it will be used as the timestamp (as seconds since the epoch) in the
<B><A HREF="/cgi-bin/man/man2html?5+deb-split">deb-split</A></B>(5)'s <B><A HREF="/cgi-bin/man/man2html?5+ar">ar</A></B>(5) container.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>FILER</H2>

<DL COMPACT>
<DT id="19"><B>/var/lib/dpkg/parts</B><DD>
F&ouml;rvald k&ouml;-katalog f&ouml;r delfiler som v&auml;ntar p&aring; automatisk sammanslagning.
<P>
Filnamnen som anv&auml;nds i katalogen &auml;r i ett internt format f&ouml;r <B>dpkg-split</B>
och &auml;r knappast anv&auml;ndbara f&ouml;r andra program, och hur som helst kan inte
formatet p&aring; filnamnen litas p&aring;.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>PROGRAMFEL</H2>

Kompletta detaljer f&ouml;r paket i k&ouml;n kan inte f&aring;s utan att sj&auml;lv gr&auml;va i
k&ouml;-katalogen.
<P>
Det finns inget l&auml;tt s&auml;tta att testa om en fil som kan vara en del av ett
bin&auml;rpaket faktiskt &auml;r det.
<A NAME="lbAK">&nbsp;</A>
<H2>SE &Auml;VEN</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<A NAME="lbAL">&nbsp;</A>
<H2>&Ouml;VERS&Auml;TTNING</H2>

Peter Krefting och Daniel Nylander.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="20"><A HREF="#lbAB">NAMN</A><DD>
<DT id="21"><A HREF="#lbAC">SYNOPS</A><DD>
<DT id="22"><A HREF="#lbAD">BESKRIVNING</A><DD>
<DT id="23"><A HREF="#lbAE">KOMMANDON</A><DD>
<DT id="24"><A HREF="#lbAF">FLAGGOR</A><DD>
<DT id="25"><A HREF="#lbAG">RETURV&Auml;RDE</A><DD>
<DT id="26"><A HREF="#lbAH">MILJ&Ouml;VARIABLER</A><DD>
<DT id="27"><A HREF="#lbAI">FILER</A><DD>
<DT id="28"><A HREF="#lbAJ">PROGRAMFEL</A><DD>
<DT id="29"><A HREF="#lbAK">SE &Auml;VEN</A><DD>
<DT id="30"><A HREF="#lbAL">&Ouml;VERS&Auml;TTNING</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:23 GMT, March 31, 2021
</BODY>
</HTML>
