
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of update-alternatives</TITLE>
</HEAD><BODY>
<H1>update-alternatives</H1>
Section: Dpkg-sviten (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NAMN</H2>

update-alternatives - underh&aring;ller symboliska l&auml;nkar f&ouml;r att best&auml;mma
standardkommandon
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPS</H2>

<B>update-alternatives</B> [<I>flagga</I>...] <I>&aring;tg&auml;rd</I>
<A NAME="lbAD">&nbsp;</A>
<H2>BESKRIVNING</H2>

<B>update-alternatives</B> skapar, tar bort, underh&aring;ller och visar information
om de symboliska l&auml;nkar som ing&aring;r i Debians alternativsystem.
<P>

Det &auml;r m&ouml;jligt f&ouml;r flera kommandon som tillhandah&aring;ller identisk eller
liknande funktionalitet att vara installerade p&aring; ett system samtidigt. Till
exempel har m&aring;nga system flera textredigeringsprogram installerade
samtidigt, vilket ger anv&auml;ndarna p&aring; systemet valm&ouml;jligheter, var och en kan
anv&auml;nda olika textredigeringsprogram om de s&aring; &ouml;nskar, men det g&ouml;r det sv&aring;rt
f&ouml;r ett program att g&ouml;ra ett bra val av textredigerare att anropa om en
anv&auml;ndare inte har gjort ett specifikt val.
<P>

Debians alternativsystem f&ouml;rs&ouml;ker l&ouml;sa detta problem. Ett generiskt namn i
filsystemet delas av alla filer som tillhandah&aring;ller utbytbar
funktionalitet. Alternativsystemet och systemadministrat&ouml;ren anger
tillsammans vilken specifik fil som skall refereras av sitt generiska
namn. Till exempel kan alternativsystemet l&aring;ta det generiska namnet
<I>/usr/bin/editor</I> att peka mot <I>/usr/bin/nvi</I> som standard om b&aring;de
textredigeringsprogrammet <B><A HREF="/cgi-bin/man/man2html?1+ed">ed</A></B>(1) och <B><A HREF="/cgi-bin/man/man2html?1+nvi">nvi</A></B>(1) b&aring;da &auml;r installerade p&aring;
systemet. Systemadministrat&ouml;ren kan &ouml;verstyra detta och l&aring;ta det peka p&aring;
<I>/usr/bin/ed</I> ist&auml;llet, och alternativsystemet kommer inte &auml;ndra denna
inst&auml;llning f&ouml;rr&auml;n det ombeds att g&ouml;ra det.
<P>

Det generiska namnet &auml;r inte en direkt symbolisk l&auml;nk till det valda
alternativet. Ist&auml;llet &auml;r det en symbolisk l&auml;nk till ett namn i katalogen
<I>alternatives</I>, vilket i sin tur &auml;r en symbolisk l&auml;nk till den faktiska fil
det pekar mot. Detta g&ouml;rs s&aring; att systemadministrat&ouml;rens &auml;ndringar kan
begr&auml;nsas till katalogen <I>/etc</I>: FHS (se detta) ger orsaker till
varf&ouml;r detta &auml;r Bra.
<P>

N&auml;r ett paket som tillhandah&aring;ller en fil med en specifik funktionalitet
installeras, &auml;ndras eller tas bort, anropas <B>update-alternatives</B> f&ouml;r att
uppdatera information om filen i alternativsystemet. <B>update-alternatives</B>
anropas normalt fr&aring;n <B>postinst</B>- (configure) eller <B>prerm</B>-skripten
(remove och deconfigure) i Debianpaket.
<P>

Det &auml;r ofta l&auml;mpligt f&ouml;r ett antal alternativ att vara synkroniserade, s&aring;
att de &auml;ndras i grupp. Till exempel, om det &auml;r flera versioner av
textredigeraren <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1) installerade b&ouml;r manualsidan som refereras till av
<I>/usr/share/man/man1/vi.1</I> motsvara den bin&auml;r som refereras till av
<I>/usr/bin/vi</I>. <B>update-alternatives</B> hanterar detta genom <I>huvud</I>- och
<I>slav</I>-l&auml;nkar. N&auml;r huvudl&auml;nken uppdateras &auml;ndras &auml;ven anslutna
slavl&auml;nkar. En huvudl&auml;nk och dess anslutna slavar utg&ouml;r en <I>l&auml;nkgrupp</I>.
<P>

En l&auml;nkgrupp kan vid varje given tidpunkt vara i ett av tv&aring; l&auml;gen:
automatisk eller manuell. N&auml;r en grupp &auml;r i automatiskt l&auml;ge kommer
alternativsystemet automatiskt att best&auml;mma n&auml;r och hur l&auml;nkar skall
uppdateras d&aring; paket installeras eller tas bort. I manuellt l&auml;ge kommer
alternativsystemet att beh&aring;lla administrat&ouml;rens val och undvika att &auml;ndra
l&auml;nkarna (f&ouml;rutom om n&aring;got &auml;r trasigt).
<P>

L&auml;nkgrupper &auml;r i automatiskt l&auml;ge n&auml;r de f&ouml;rst introduceras p&aring; systemet. Om
systemadministrat&ouml;ren g&ouml;r &auml;ndringar till systemets automatiska inst&auml;llningar
kommer detta att noteras n&auml;sta g&aring;ng <B>update-alternatives</B> k&ouml;rs p&aring; den
&auml;ndrade l&auml;nkens grupp och gruppen kommer automatiskt att v&auml;xlas till
manuellt l&auml;ge.
<P>

Varje alternativ har en <I>prioritet</I> kopplad till sig. N&auml;r en l&auml;nkgrupp &auml;r i
automatiskt l&auml;ge kommer det alternativ som medlemmar i gruppen pekar mot
vara den med den h&ouml;gsta prioriteten.
<P>

When using the <B>--config</B> option, <B>update-alternatives</B> will list all of
the choices for the link group of which given <I>name</I> is the master
alternative name.  The current choice is marked with a '*'.  You will then
be prompted for your choice regarding this link group.  Depending on the
choice made, the link group might no longer be in <I>auto</I> mode. You will
need to use the <B>--auto</B> option in order to return to the automatic mode
(or you can rerun <B>--config</B> and select the entry marked as automatic).
<P>

Om du vill konfigurera icke-interaktivt kan du anv&auml;nda flaggan <B>--set</B> i
st&auml;llet (se nedan).
<P>

Olika paket som tillhandah&aring;ller samma fil m&aring;ste g&ouml;ra s&aring; i
<B>samf&ouml;rst&aring;nd</B>. Det betyder att det &auml;r ett <B>krav</B> att alla involverade
paket anv&auml;nder sig av <B>update-alternatives</B>. Det &auml;r inte m&ouml;jligt att
&ouml;verstyra en fil ett paket som inte anv&auml;nder
<B>update-alternatives</B>-mekanismen.
<A NAME="lbAE">&nbsp;</A>
<H2>TERMINOLOGI</H2>

Efter <B>update-alternatives</B> aktiviteter &auml;r ganska komplexa blir det enklare
att f&ouml;rst&aring; hur det fungerar genom att vi f&ouml;rklarar n&aring;gra specifika termer.
<DL COMPACT>
<DT id="1">generiskt namn (eller alternativl&auml;nk).<DD>
Ett namn, till exempel <I>/usr/bin/editor</I>, som via alternativsystemet pekar
p&aring; en av flera filer med liknande funktionalitet.
<DT id="2">alternativnamn<DD>
Namnet p&aring; en symbolisk l&auml;nk i alternativkatalogen.
<DT id="3">alternativ (eller alternativs&ouml;kv&auml;g)<DD>
Namnet p&aring; en specifik fil i filsystemet, som kan vara tillg&auml;nglig via ett
generiskt namn med hj&auml;lp av alternativsystemet.
<DT id="4">alternativkatalog<DD>
En katalog, som standard <I>/etc/alternatives</I>, som inneh&aring;ller de
symboliska l&auml;nkarna.
<DT id="5">administrativ katalog<DD>
En katalog, som standard <I>/var/lib/dpkg/alternatives</I>, som inneh&aring;ller
tillst&aring;ndsinformation f&ouml;r <B>update-alternatives</B>.
<DT id="6">l&auml;nkgrupp<DD>
En upps&auml;ttning relaterade symboliska l&auml;nkar, avsedda att uppdateras som en
grupp.
<DT id="7">huvudl&auml;nk<DD>
Alternativl&auml;nken i en l&auml;nkgrupp som best&auml;mmer hur de andra l&auml;nkarna i
gruppen st&auml;lls in.
<DT id="8">slavl&auml;nk<DD>
En alternativl&auml;nk i en l&auml;nkgrupp som styrs av hur huvudl&auml;nken st&auml;lls in.
<DT id="9">automatiskt l&auml;ge<DD>
N&auml;r en l&auml;nkgrupp &auml;r i automatiskt l&auml;ge f&ouml;rs&auml;krar alternativsystemet att
l&auml;nkarna i gruppen pekar p&aring; det h&ouml;gstprioriterade alternativet som &auml;r
l&auml;mpligt f&ouml;r gruppen.
<DT id="10">manuellt l&auml;ge<DD>
N&auml;r en grupp &auml;r i manuellt l&auml;ge kommer inte alternativsystemet att utf&ouml;ra
n&aring;gra &auml;ndringar till systemadministrat&ouml;rens inst&auml;llningar.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>KOMMANDON</H2>

<DL COMPACT>
<DT id="11"><B>--install</B> <I>l&auml;nk namn s&ouml;kv&auml;g prioritet</I> [<B>--slave</B> <I>l&auml;nk namn s&ouml;kv&auml;g</I>]...<DD>
L&auml;gg till en grupp med alternativ till systemet. <I>l&auml;nk</I> &auml;r det generiska
namnet f&ouml;r huvudl&auml;nken, <I>namn</I> &auml;r namnet p&aring; dess symboliska l&auml;nk i
alternativkatalogen och <I>s&ouml;kv&auml;g</I> &auml;r alternativet som introduceras f&ouml;r
huvudl&auml;nken. Argumenten efter <B>--slave</B> &auml;r det generiska namnet, namnet p&aring;
den symboliska l&auml;nken i alternativkatalogen och alternativet f&ouml;r
slavl&auml;nken. Noll eller flera <B>--slave</B>-flaggor kan anges, d&auml;r alla f&ouml;ljs av
tre argument. Observera att om ett slavalternativ inte finns kommer
motsvarande slavl&auml;nk helt enkelt inte att installeras (en varning kommer
fortfarande att visas). Om en verklig fil &auml;r installerad d&auml;r en
alternativl&auml;nk m&aring;ste installeras beh&aring;lls den s&aring;vida inte <B>--force</B> anv&auml;nds.
<DT id="12"><DD>
Om det angivna alternativnamnet redan finns i alternativsystemets databas
kommer informationen som anges att l&auml;ggas in som en ny upps&auml;ttning av
alternativ f&ouml;r gruppen. Om inte kommer en ny grupp, inst&auml;lld p&aring; automatiskt
l&auml;ge, att l&auml;ggas till med given information. Om gruppen &auml;r i automatiskt
l&auml;ge och det alternativ som l&auml;ggs in har h&ouml;gre prioritet &auml;n alla andra
installerade alternativ f&ouml;r gruppen kommer de symboliska l&auml;nkarna att
uppdateras s&aring; att de pekar p&aring; de nyligen tillagda alternativen.
<DT id="13"><B>--set</B> <I>namn s&ouml;kv&auml;g</I><DD>
S&auml;tt programmet <I>s&ouml;kv&auml;g</I> som ett alternativ till <I>namn</I>. Detta motsvarar
<B>--config</B> men &auml;r icke-interaktivt och kan d&auml;rmed anv&auml;ndas i ett skript.
<DT id="14"><B>--remove</B> <I>namn s&ouml;kv&auml;g</I><DD>
Ta bort ett alternativ och alla dess anknutna slavl&auml;nkar. <I>namn</I> &auml;r ett
namn i alternativkatalogen och <I>s&ouml;kv&auml;g</I> &auml;r ett absolut filnamn till vilket
<I>namn</I> kunde l&auml;nkas. Om <I>namn</I> faktiskt &auml;r l&auml;nkat till <I>s&ouml;kv&auml;g</I> kommer
<I>namn</I> att uppdateras till att peka p&aring; ett annat l&auml;mpligt alternativ (och
gruppen st&auml;lls tillbaka till automatiskt l&auml;ge), eller att tas bort om det
inte finns n&aring;got alternativ kvar. Anknutna slavl&auml;nkar kommer uppdateras
eller tas bort p&aring; motsvarande vis. Om l&auml;nken inte f&ouml;r tillf&auml;llet pekar p&aring;
<I>s&ouml;kv&auml;g</I> kommer inga l&auml;nkar att uppdateras, endast informationen om
alternativet tas bort.
<DT id="15"><B>--remove-all</B> <I>namn</I><DD>
Tar bort alla alternativ och alla deras anslutna slavl&auml;nkar. <I>namn</I> &auml;r ett
namn i alternativkatalogen.
<DT id="16"><B>--all</B><DD>
Anropar <B>--config</B> p&aring; alla alternativ. Kan med framg&aring;ng kombineras med
<B>--skip-auto</B> f&ouml;r att g&aring; igenom och konfigurera alla alternativ som inte &auml;r
st&auml;llda i automatiskt l&auml;ge. Trasiga alternativ visas ocks&aring;. Ett enkelt s&auml;tt
att fixa alla trasiga alternativ &auml;r d&auml;rmed att anropa <B>yes '' |
update-alternatives --force --all</B>.
<DT id="17"><B>--auto</B> <I>namn</I><DD>
St&auml;ll in l&auml;nkgruppen bakom alternativet f&ouml;r <I>namn</I> till automatiskt
l&auml;ge. Detta f&aring;r till f&ouml;ljd att den huvudsakliga symboliska l&auml;nken och dess
slavar uppdateras till att peka p&aring; det h&ouml;gst prioriterade installerade
alternativet.
<DT id="18"><B>--display</B> <I>namn</I><DD>
Display information about the link group.  Information displayed includes
the group's mode (auto or manual), the master and slave links, which
alternative the master link currently points to, what other alternatives are
available (and their corresponding slave alternatives), and the highest
priority alternative currently installed.
<DT id="19"><B>--get-selections</B><DD>
List all master alternative names (those controlling a link group)  and
their status (since version 1.15.0).  Each line contains up to 3 fields
(separated by one or more spaces). The first field is the alternative name,
the second one is the status (either <B>auto</B> or <B>manual</B>), and the last one
contains the current choice in the alternative (beware: it's a filename and
thus might contain spaces).
<DT id="20"><B>--set-selections</B><DD>
Read configuration of alternatives on standard input in the format generated
by <B>--get-selections</B> and reconfigure them accordingly (since version
1.15.0).
<DT id="21"><B>--query</B> <I>namn</I><DD>
Display information about the link group like <B>--display</B> does, but in a
machine parseable way (since version 1.15.0, see section <B>QUERY FORMAT</B>
below).
<DT id="22"><B>--list</B> <I>namn</I><DD>
Visar alla m&aring;l f&ouml;r l&auml;nkgruppen.
<DT id="23"><B>--config</B> <I>namn</I><DD>
Visa tillg&auml;ngliga alternativ f&ouml;r en l&auml;nkgrupp och l&aring;t anv&auml;ndaren att
interaktivt v&auml;lja vilken som skall anv&auml;ndas. L&auml;nkgruppen uppdateras.
<DT id="24"><B>--help</B><DD>
Visar hj&auml;lpsk&auml;rm och avslutar.
<DT id="25"><B>--version</B><DD>
Visar version och avslutar.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>FLAGGOR</H2>

<DL COMPACT>
<DT id="26"><B>--altdir</B><I> katalog</I><DD>
Anger alternativkatalogen om detta inte skall vara standardv&auml;rdet.
<DT id="27"><B>--admindir</B><I> katalog</I><DD>
Anger den administrativa katalogen om detta inte skall vara standardv&auml;rdet.
<DT id="28"><B>--log</B> <I>fil</I><DD>
Specifies the log file (since version 1.15.0), when this is to be different
from the default (/var/log/alternatives.log).
<DT id="29"><B>--force</B><DD>
Allow replacing or dropping any real file that is installed where an
alternative link has to be installed or removed.
<DT id="30"><B>--skip-auto</B><DD>
Hoppa &ouml;ver konfigureringsfr&aring;gor f&ouml;r alternativ som &auml;r korrekt konfigurerade
i automatiskt l&auml;ge. Denna flagga &auml;r endast relevant f&ouml;r <B>--config</B> och
<B>--all</B>.
<DT id="31"><B>--quiet</B><DD>
Do not generate any comments unless errors occur.
<DT id="32"><B>--verbose</B><DD>
Generate more comments about what is being done.
<DT id="33"><B>--debug</B><DD>
Generate even more comments, helpful for debugging, about what is being done
(since version 1.19.3).
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>RETURV&Auml;RDE</H2>

<DL COMPACT>
<DT id="34"><B>0</B><DD>
Den &ouml;nskade funktionen utf&ouml;rdes utan fel.
<DT id="35"><B>2</B><DD>
Problem uppstod vid tolkning av kommandoraden eller n&auml;r funktionen skulle
utf&ouml;ras.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>MILJ&Ouml;VARIABLER</H2>

<DL COMPACT>
<DT id="36"><B>DPKG_ADMINDIR</B><DD>
Om satt och flaggan <B>--admindir</B> inte har angivits anv&auml;nds det som
bas-administrativ katalog.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>FILER</H2>

<DL COMPACT>
<DT id="37"><I>/etc/alternatives/</I><DD>
Den f&ouml;rvalda alternativkatalogen. Kan &ouml;verstyras med flaggan <B>--altdir</B>.
<DT id="38"><I>/var/lib/dpkg/alternatives/</I><DD>
Den f&ouml;rvalda administrativa katalogen. Kan &ouml;verstyras med flaggan
<B>--admindir</B>.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>FR&Aring;GEFORMAT</H2>

The <B>--query</B> format is using an RFC822-like flat format. It's made of <I>n</I>
+ 1 blocks where <I>n</I> is the number of alternatives available in the queried
link group. The first block contains the following fields:
<DL COMPACT>
<DT id="39"><B>Namn:</B> <I>namn</I><DD>
Alternativets namn i den alternativa katalogen.
<DT id="40"><B>Link:</B><I> l&auml;nk</I><DD>
Generiskt namn f&ouml;r alternativet.
<DT id="41"><B>Slaves:</B><I> lista-&ouml;ver-slavar</I><DD>
N&auml;r detta f&auml;lt &auml;r tillg&auml;ngligt inneh&aring;ller <B>next</B>-raderna alla slavl&auml;nkar
som kopplas till huvudl&auml;nken f&ouml;r alternativet. Varje rad beskriver en
slav. Varje rad inneh&aring;ller ett blanksteg, det generiska namnet p&aring;
slavalternativet, ytterligare ett blanksteg, och s&ouml;kv&auml;gen till
slavalternativet.
<DT id="42"><B>Status:</B><I> status</I><DD>
Status f&ouml;r alternativet (<B>auto</B> eller <B>manual</B>).
<DT id="43"><B>Best:</B><I> b&auml;sta-val</I><DD>
S&ouml;kv&auml;gen till det b&auml;sta alternativet i l&auml;nkgruppen. Tas inte med om inget
alternativ &auml;r tillg&auml;ngligt.
<DT id="44"><B>Value:</B><I> f&ouml;r-n&auml;rvarande-valt-alternativ</I><DD>
S&ouml;kv&auml;gen till det f&ouml;r n&auml;rvarande valda alternativet. Kan &auml;ven ta det magiska
v&auml;rdet <B>none</B> (inget). Det anv&auml;nds om det inte finns n&aring;gon l&auml;nk.
</DL>
<P>

&Ouml;vriga block beskriver tillg&auml;ngliga alternativ i den efterfr&aring;gade
l&auml;nkgruppen:
<DL COMPACT>
<DT id="45"><B>Alternative:</B><I> s&ouml;kv&auml;g-till-alternativet</I><DD>
S&ouml;kv&auml;g till alternativet som beskrivs i blocket.
<DT id="46"><B>Priority:</B><I> prioritetsv&auml;rde</I><DD>
V&auml;rdet f&ouml;r prioriteten p&aring; alternativet.
<DT id="47"><B>Slaves:</B><I> lista-&ouml;ver-slavar</I><DD>
N&auml;r detta f&auml;lt anges inneh&aring;ller <B>next</B>-raderna alla slavalternativ som
kopplas till huvudl&auml;nken f&ouml;r alternativet. Varje rad beskriver en
slav. Varje rad inneh&aring;ller ett blanksteg, det generiska namnet p&aring;
slavalternativet, ytterligare ett blanksteg, och s&ouml;kv&auml;gen till
slavalternativet.
</DL>
<A NAME="lbAL">&nbsp;</A>
<H3>Example</H3>

<PRE>
$ update-alternatives --query editor
Name: editor
Link: /usr/bin/editor
Slaves:
 editor.1.gz /usr/share/man/man1/editor.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/editor.1.gz
 editor.it.1.gz /usr/share/man/it/man1/editor.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/editor.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/editor.1.gz
Status: auto
Best: /usr/bin/vim.basic
Value: /usr/bin/vim.basic

Alternative: /bin/ed
Priority: -100
Slaves:
 editor.1.gz /usr/share/man/man1/ed.1.gz

Alternative: /usr/bin/vim.basic
Priority: 50
Slaves:
 editor.1.gz /usr/share/man/man1/vim.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/vim.1.gz
 editor.it.1.gz /usr/share/man/it/man1/vim.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/vim.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/vim.1.gz
</PRE>

<A NAME="lbAM">&nbsp;</A>
<H2>DIAGNOSTIK</H2>

Med <B>--verbose</B> kommer <B>update-alternatives</B> att beskriva i det o&auml;ndliga
vad det g&ouml;r p&aring; sin standard ut-kanal. Om ett fel uppst&aring;r skriver
<B>update-alternatives</B> ut felmeddelanden p&aring; sin standard fel-kanal och
avslutar med felkoden 2. Diagnostikinformationen b&ouml;r vara sj&auml;lvf&ouml;rklarande,
s&auml;nd in en felrapport om du inte tycker att den &auml;r det.
<A NAME="lbAN">&nbsp;</A>
<H2>EXEMPEL</H2>

Det &auml;r flera paket som tillhandah&aring;ller en textredigerare kompatibel med
<B>vi</B>, till exempel <B>nvi</B> och <B>vim</B>. Vilken best&auml;ms via l&auml;nkgruppen <B>vi</B>,
vilken inneh&aring;ller l&auml;nkar b&aring;de f&ouml;r sj&auml;lva programmet och dessa anknutna
manualsida.
<P>

F&ouml;r att visa vilka tillg&auml;ngliga paket som tillhandah&aring;ller <B>vi</B>, samt dess
aktuella inst&auml;llning, anv&auml;nd kommandot <B>--display</B>:
<P>

<DL COMPACT><DT id="48"><DD>
<B>update-alternatives --display vi</B>
</DL>

<P>

F&ouml;r att v&auml;lja en specifik implementation av <B>vi</B>, utf&ouml;r detta kommando som
root och v&auml;lj sedan ett tal fr&aring;n listan:
<P>

<DL COMPACT><DT id="49"><DD>
<B>update-alternatives --config vi</B>
</DL>

<P>

F&ouml;r att &aring;terg&aring; till att <B>vi</B>-implementationen v&auml;ljs automatiskt, utf&ouml;r
detta som root:
<P>

<DL COMPACT><DT id="50"><DD>
<B>update-alternatives --auto vi</B>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>SE &Auml;VEN</H2>

<B><A HREF="/cgi-bin/man/man2html?1+ln">ln</A></B>(1), FHS, Filesystem Hierarchy Standard.
<A NAME="lbAP">&nbsp;</A>
<H2>&Ouml;VERS&Auml;TTNING</H2>

Peter Krefting och Daniel Nylander.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="51"><A HREF="#lbAB">NAMN</A><DD>
<DT id="52"><A HREF="#lbAC">SYNOPS</A><DD>
<DT id="53"><A HREF="#lbAD">BESKRIVNING</A><DD>
<DT id="54"><A HREF="#lbAE">TERMINOLOGI</A><DD>
<DT id="55"><A HREF="#lbAF">KOMMANDON</A><DD>
<DT id="56"><A HREF="#lbAG">FLAGGOR</A><DD>
<DT id="57"><A HREF="#lbAH">RETURV&Auml;RDE</A><DD>
<DT id="58"><A HREF="#lbAI">MILJ&Ouml;VARIABLER</A><DD>
<DT id="59"><A HREF="#lbAJ">FILER</A><DD>
<DT id="60"><A HREF="#lbAK">FR&Aring;GEFORMAT</A><DD>
<DL>
<DT id="61"><A HREF="#lbAL">Example</A><DD>
</DL>
<DT id="62"><A HREF="#lbAM">DIAGNOSTIK</A><DD>
<DT id="63"><A HREF="#lbAN">EXEMPEL</A><DD>
<DT id="64"><A HREF="#lbAO">SE &Auml;VEN</A><DD>
<DT id="65"><A HREF="#lbAP">&Ouml;VERS&Auml;TTNING</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:24 GMT, March 31, 2021
</BODY>
</HTML>
