
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-CACHE</TITLE>
</HEAD><BODY>
<H1>APT-CACHE</H1>
Section: APT (8)<BR>Updated: 04&nbsp;Abril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOMBRE</H2>

apt-cache - Realiza consultas al cach&eacute; de APT
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSIS</H2>

<DL COMPACT>
<DT id="1">
<B>apt-cache</B> [<B>-agipns</B>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>config_file</I>] {gencaches | showpkg&nbsp;<I>pkg</I>...  | showsrc&nbsp;<I>pkg</I>...  | stats | dump | dumpavail | unmet | search&nbsp;<I>regex</I>...  | show&nbsp;<I>pkg</I>&nbsp;[{=<I>pkg_version_number</I>&nbsp;|&nbsp;/<I>target_release</I>}]...  | depends&nbsp;<I>pkg</I>&nbsp;[{=<I>pkg_version_number</I>&nbsp;|&nbsp;/<I>target_release</I>}]...  | rdepends&nbsp;<I>pkg</I>&nbsp;[{=<I>pkg_version_number</I>&nbsp;|&nbsp;/<I>target_release</I>}]...  | pkgnames&nbsp;[<I>prefix</I>]  | dotty&nbsp;<I>pkg</I>&nbsp;[{=<I>pkg_version_number</I>&nbsp;|&nbsp;/<I>target_release</I>}]...  | xvcg&nbsp;<I>pkg</I>&nbsp;[{=<I>pkg_version_number</I>&nbsp;|&nbsp;/<I>target_release</I>}]...  | policy&nbsp;[<I>pkg</I>...]  | madison&nbsp;<I>pkg</I>...  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPCI&Oacute;N</H2>

<P>

<B>apt-cache</B>
<DD>performs a variety of operations on APT's package cache.
<B>apt-cache</B>
does not manipulate the state of the system but does provide operations to search and generate interesting output from the package metadata. The metadata is acquired and updated via the 'update' command of e.g.
<B>apt-get</B>, so that it can be outdated if the last update is too long ago, but in exchange
<B>apt-cache</B>
works independently of the availability of the configured sources (e.g. offline).
<P>

A menos que se use la opci&oacute;n
<B>-h</B>
o
<B>--help</B>, una de las siguientes &oacute;rdenes debe estar presente.
<P>

<B>gencaches</B>
<DL COMPACT><DT id="2"><DD>
gencaches
genera la cach&eacute; de paquetes de APT. Todas las &oacute;rdenes realizan esta acci&oacute;n de forma impl&iacute;cita si no se detecta la cach&eacute; o si est&aacute; obsoleta.
</DL>

<P>

<B>showpkg</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="3"><DD>
showpkg
muestra la informaci&oacute;n relativa a los paquetes listados en la l&iacute;nea de &oacute;rdenes. Los argumentos restantes se consideran nombres de paquetes. Para cada paquete de la lista se listan las versiones y dependencias inversas disponibles, as&iacute; como las dependencias de cada versi&oacute;n. Las dependencias (normales) son los paquetes de los que depende el paquete en cuesti&oacute;n, las dependencias inversas son los paquetes que dependen del paquete en cuesti&oacute;n. Por ello, las dependencias se deben satisfacer para un paquete, pero las dependencias inversas no. Por ejemplo,
<B>apt-cache showpkg libreadline2</B>
producir&iacute;a una salida similar a la siguiente:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Paquete: libreadline2
Versiones: 2.1-12(/var/state/apt/lists/foo_Packages),
Dependencias inversas: 
  libreadlineg2,libreadline2
  libreadline2-altdev,libreadline2
Dependencias:
2.1-12 - libc5 (2 5.4.0-0) ncurses3.0 (0 (null))
Provides:
2.1-12 - 
Reverse Provides: 
</PRE>

</DL>




La informaci&oacute;n de salida muestra que libreadline2, con versi&oacute;n 2.1-12, depende de libc5 y ncurses3.0, que se deben instalar para que libreadline2 funcione. Adem&aacute;s, libreadlineg2 y libreadline2-altdev dependen de libreadline2. De modo que si libreadline2 est&aacute; instalado, libc5 y ncurses3.0 (y ldso) tambi&eacute;n deben estar instalados, pero libreadlineg2 y libreadline2-altdev no tienen que estarlo. Para el significado espec&iacute;fico del resto de la salida lo mejor es consultar el c&oacute;digo fuente de apt.
</DL>

<P>

<B>stats</B>
<DL COMPACT><DT id="5"><DD>
stats
muestra algunas estad&iacute;sticas sobre la cach&eacute;. No necesita ning&uacute;n argumento adicional. Las estad&iacute;sticas que muestra son:
<P>
<DL COMPACT><DT id="6"><DD>
&bull;


Total de nombres de paquetes
es el n&uacute;mero de paquetes encontrados en la cach&eacute;.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Paquetes normales
es el n&uacute;mero de nombres de paquetes normales. Estos paquetes tienen una correspondencia un&iacute;voca entre sus nombres y los nombres que usan otros paquetes al listarlos en sus dependencias. La mayor&iacute;a de los paquetes pertenecen a este grupo.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Paquetes virtuales puros
es el n&uacute;mero de paquetes que existen s&oacute;lo como nombre de un paquete virtual, esto es, paquetes que s&oacute;lo &laquo;proporcionan&raquo; el nombre del paquete virtual, y no hay ning&uacute;n paquete m&aacute;s que use el nombre. Por ejemplo, &laquo;mail-transport-agent&raquo; en un sistema Debian es un paquete virtual puro, varios paquetes proporcionan &laquo;mail-transport-agent&raquo;, pero no hay ning&uacute;n paquete que se llame &laquo;mail-transport-agent&raquo;.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Paquetes virtuales &uacute;nicos
es el n&uacute;mero de paquetes con un &uacute;nico paquete que proporciona un paquete virtual en concreto. Por ejemplo, en un sistema Debian, &laquo;X11-text-viewer&raquo; es un paquete virtual, pero s&oacute;lo un paquete, xless, proporciona &laquo;X11-text-viewer&raquo;.
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Paquetes virtuales mixtos
es el n&uacute;mero de paquetes que o bien proporcionan un determinado paquete virtual o tienen el mismo nombre como paquete virtual y como paquete normal. Por ejemplo, en un sistema Debian, &laquo;debconf&raquo; es a la vez un paquete normal, y que proporciona el paquete debconf-tiny.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


No encontrados
es el n&uacute;mero de nombres de paquetes mencionados como dependencia pero que ning&uacute;n paquete los proporciona. Estos paquetes pueden ser una prueba de que no se tiene acceso a toda la distribuci&oacute;n, o de la eliminaci&oacute;n de alg&uacute;n paquete (real o virtual) dentro de la distribuci&oacute;n. Normalmente se hace referencia a ellos desde los campos &laquo;Conflicts&raquo; o &laquo;Breaks&raquo; de la descripci&oacute;n de los paquetes.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


Total distinct
versions is the number of package versions found in the cache. If more than one distribution is being accessed (for instance, &quot;stable&quot; and &quot;unstable&quot;), this value can be considerably larger than the number of total package names.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Total de dependencias
es el n&uacute;mero total de relaciones de dependencia de todos los paquetes de la cach&eacute;.
</DL>

<P>
</DL>

<P>

<B>showsrc</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="14"><DD>
showsrc
displays all the source package records that match the given package names. All versions are shown, as well as all records that declare the name to be a binary package. Use
<B>--only-source</B>
to display only source package names.
</DL>

<P>

<B>dump</B>
<DL COMPACT><DT id="15"><DD>
dump
muestra una peque&ntilde;a lista de todos los paquetes en la cach&eacute;. Fundamentalmente para depuraci&oacute;n.
</DL>

<P>

<B>dumpavail</B>
<DL COMPACT><DT id="16"><DD>
dumpavail
muestra por la salida est&aacute;ndar una lista de los paquetes disponibles. Esta lista es apropiada para su uso con
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
y, adem&aacute;s, la usa el m&eacute;todo
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1).
</DL>

<P>

<B>unmet</B>
<DL COMPACT><DT id="17"><DD>
unmet
muestra un resumen de todas las dependencias no satisfechas en la cach&eacute; de paquetes.
</DL>

<P>

<B>show</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="18"><DD>
show
realiza una funci&oacute;n similar a
<B>dpkg --print-avail</B>, muestra los campos del paquete para los paquetes nombrados.
</DL>

<P>

<B>search</B> <B></B><I>regex</I><B>...</B>
<DL COMPACT><DT id="19"><DD>
search
performs a full text search on all available package lists for the POSIX regex pattern given, see
<B><A HREF="/cgi-bin/man/man2html?7+regex">regex</A></B>(7). It searches the package names and the descriptions for an occurrence of the regular expression and prints out the package name and the short description, including virtual package names. If
<B>--full</B>
is given then output identical to
show
is produced for each matched package, and if
<B>--names-only</B>
is given then the long description is not searched, only the package name and provided packages are.
<P>
Se pueden usar argumentos separados para especificar varios patrones de b&uacute;squeda que se juntar&aacute;n mediante una &laquo;Y l&oacute;gica&raquo;.
</DL>

<P>

<B>depends</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="20"><DD>
depends
muestra una lista de todas la dependencias de un paquete y de todos los dem&aacute;s paquetes que la pueden satisfacer.
</DL>

<P>

<B>rdepends</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="21"><DD>
rdepends
muestra las dependencias inversas de un paquete.
</DL>

<P>

<B>pkgnames</B> [<I>prefix</I>]
<DL COMPACT><DT id="22"><DD>
Esta orden muestra el nombre de todos los paquetes que APT conoce. El argumento opcional es un prefijo para filtrar la lista de nombres. La salida es apropiada para su uso junto con la funci&oacute;n de completado autom&aacute;tico mediante tabulador en un int&eacute;rprete de &oacute;rdenes y se genera de forma extremadamente r&aacute;pida. El mejor uso de la orden es con la opci&oacute;n
<B>--generate</B>.
<P>
Tenga en cuenta que un paquete que conoce APT puede no estar necesariamente disponible para descargar, instalar o instalado, por ejemplo: los paquetes virtuales tambi&eacute;n aparecen en la lista generada.
</DL>

<P>

<B>dotty</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="23"><DD>
dotty
toma una lista de paquetes de la l&iacute;nea de ordenes y genera una salida apropiada para su uso con dotty, del paquete
m[blue]<B>GraphViz</B>m[]<FONT SIZE="-2">[1]</FONT>. El resultado ser&aacute; un conjunto de nodos y uniones representando las relaciones entre los paquetes. De forma predeterminada, los paquetes proporcionados mostrar&aacute;n todas sus dependencias, lo que puede producir un grafo muy grande. Para limitar la salida s&oacute;lo a los paquetes listados en la l&iacute;nea de &oacute;rdenes, active la opci&oacute;n
APT::Cache::GivenOnly.
<P>
Los nodos resultantes tendr&aacute;n varias formas: los paquetes normales son cajas, los paquetes virtuales puros son tri&aacute;ngulos, los paquetes virtuales mixtos son diamantes y los paquetes no encontrados son hex&aacute;gonos. Las cajas naranjas simbolizan que el recorrido se detuvo en paquetes que ning&uacute;n otro declara como dependencia, las l&iacute;neas azules son pre-dependencias y las l&iacute;neas verdes son conflictos.
<P>
Tenga cuidado, dotty no puede dibujar grandes conjuntos de paquetes.
</DL>

<P>

<B>xvcg</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="24"><DD>
Lo mismo que
dotty, s&oacute;lo para xvcg de la
m[blue]<B>herramienta VCG</B>m[]<FONT SIZE="-2">[2]</FONT>.
</DL>

<P>

<B>policy</B> [<I>pkg</I>...]
<DL COMPACT><DT id="25"><DD>
policy
est&aacute; pensado para ayudar a depurar asuntos relacionados con el fichero de preferencias. Sin argumentos mostrar&aacute; las prioridades de cada fuente. De forma alternativa, muestra una informaci&oacute;n detallada acerca de la prioridad de selecci&oacute;n del paquete nombrado.
</DL>

<P>

<B>madison</B> <B></B><I>pkg</I><B>...</B>
<DL COMPACT><DT id="26"><DD>
La orden
madison
de
apt-cache
intenta imitar el formato de salida y parte de la funcionalidad de la herramienta para la gesti&oacute;n del archivo de Debian,
madison. Muestra las versiones disponibles de un determinado paquete en un formato tabular. A diferencia del
madison
original, s&oacute;lo puede mostrar informaci&oacute;n para la arquitectura para la que APT obtuvo las listas de paquetes (APT::Architecture).
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>OPCIONES</H2>

<P>

Todas las opciones de la l&iacute;nea de &oacute;rdenes se pueden definir mediante el fichero de configuraci&oacute;n, las descripciones indican la opci&oacute;n de la configuraci&oacute;n a definir. Para opciones de tipo &laquo;boolean&raquo; puede invalidar el fichero de configuraci&oacute;n utilizando algo como
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
u otras muchas variaciones.
<P>

<B>-p</B>, <B>--pkg-cache</B>
<DL COMPACT><DT id="27"><DD>
Define el fichero donde guardar la cach&eacute; de paquetes. La cach&eacute; de paquetes es la cach&eacute; primaria usada para todas las operaciones. Opci&oacute;n de configuraci&oacute;n:
Dir::Cache::pkgcache.
</DL>

<P>

<B>-s</B>, <B>--src-cache</B>
<DL COMPACT><DT id="28"><DD>
Escoge el fichero para guardar la cach&eacute; fuente. S&oacute;lo
gencaches
usa esta cach&eacute; y guarda una versi&oacute;n analizada de la informaci&oacute;n de los paquetes de las fuentes remotas. Cuando se genera la cach&eacute; de paquetes la cach&eacute; fuente se usa para evitar analizar todos los ficheros de paquetes. Opci&oacute;n de configuraci&oacute;n:
Dir::Cache::srcpkgcache.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="29"><DD>
Produce una salida adecuada para su almacenamiento, omitiendo los indicadores de progreso. M&aacute;s &laquo;q&raquo; producir&aacute;n una salida m&aacute;s silenciosa, hasta un m&aacute;ximo de dos. Tambi&eacute;n se puede usar
<B>-q=#</B>
para definir el nivel de silencio, ignorando el fichero de configuraci&oacute;n. Opci&oacute;n de configuraci&oacute;n:
quiet.
</DL>

<P>

<B>-i</B>, <B>--important</B>
<DL COMPACT><DT id="30"><DD>
Muestra s&oacute;lo las dependencias importantes, se usa junto con
unmet
y
depends. Hace que s&oacute;lo se muestren las dependencias y pre-dependencias. Opci&oacute;n de configuraci&oacute;n:
APT::Cache::Important.
</DL>

<P>

<B>--no-pre-depends</B>, <B>--no-depends</B>, <B>--no-recommends</B>, <B>--no-suggests</B>, <B>--no-conflicts</B>, <B>--no-breaks</B>, <B>--no-replaces</B>, <B>--no-enhances</B>
<DL COMPACT><DT id="31"><DD>
Per default the
<B>depends</B>
and
<B>rdepends</B>
print all dependencies. This can be tweaked with these flags which will omit the specified dependency type. Configuration Item:
APT::Cache::Show<I>DependencyType</I>
e.g.
APT::Cache::ShowRecommends.
</DL>

<P>

<B>--implicit</B>
<DL COMPACT><DT id="32"><DD>
Per default
<B>depends</B>
and
<B>rdepends</B>
print only dependencies explicitly expressed in the metadata. With this flag it will also show dependencies implicitly added based on the encountered data. A
Conflicts: foo
e.g. expresses implicitly that this package also conflicts with the package foo from any other architecture. Configuration Item:
APT::Cache::ShowImplicit.
</DL>

<P>

<B>-f</B>, <B>--full</B>
<DL COMPACT><DT id="33"><DD>
Muestra todos los campos de informaci&oacute;n cuando se realiza una b&uacute;squeda. Opci&oacute;n de configuraci&oacute;n:
APT::Cache::ShowFull.
</DL>

<P>

<B>-a</B>, <B>--all-versions</B>
<DL COMPACT><DT id="34"><DD>
Muestra los campos completos de todas las versiones disponibles. Es el comportamiento predeterminado, para desactivarlo utilice
<B>--no-all-versions</B>. Si se especifica
<B>--no-all-versions</B>, s&oacute;lo se muestra la versi&oacute;n candidata (la que se escoger&iacute;a para instalar). Esta opci&oacute;n s&oacute;lo se aplica a la orden
show. Opci&oacute;n de configuraci&oacute;n:
APT::Cache::AllVersions.
</DL>

<P>

<B>-g</B>, <B>--generate</B>
<DL COMPACT><DT id="35"><DD>
Realiza una regeneraci&oacute;n completa de la cach&eacute; de paquetes, en vez de usarla tal y como est&aacute;. Esta es la opci&oacute;n predeterminada, para desactivarla use
<B>--no-generate</B>. Opci&oacute;n de configuraci&oacute;n:
APT::Cache::Generate.
</DL>

<P>

<B>--names-only</B>, <B>-n</B>
<DL COMPACT><DT id="36"><DD>
Only search on the package and provided package names, not the long descriptions. Configuration Item:
APT::Cache::NamesOnly.
</DL>

<P>

<B>--all-names</B>
<DL COMPACT><DT id="37"><DD>
Hace que
pkgnames
muestre todos los nombres, incluyendo los paquetes virtuales y las dependencias no encontradas. Opci&oacute;n de configuraci&oacute;n:
APT::Cache::AllNames.
</DL>

<P>

<B>--recurse</B>
<DL COMPACT><DT id="38"><DD>
Hace que
depends
y
rdepends
sean recursivos de modo que todos los paquetes mencionados se muestran s&oacute;lo una vez. Opci&oacute;n de configuraci&oacute;n
APT::Cache::RecurseDepends.
</DL>

<P>

<B>--installed</B>
<DL COMPACT><DT id="39"><DD>
Limita la salida de
depends
y
rdepends
a paquetes actualmente instalados. Opci&oacute;n de configuraci&oacute;n:
APT::Cache::Installed.
</DL>

<P>

<B>--with-source</B> <B></B><I>filename</I>
<DL COMPACT><DT id="40"><DD>
Adds the given file as a source for metadata. Can be repeated to add multiple files. Supported are currently
*.deb,
*.dsc,
*.changes,
Sources
and
Packages
files as well as source package directories. Files are matched based on their name only, not their content!
<P>
Sources
and
Packages
can be compressed in any format apt supports as long as they have the correct extension. If you need to store multiple of these files in one directory you can prefix a name of your choice with the last character being an underscore (&quot;_&quot;). Example: my.example_Packages.xz
<P>
Note that these sources are treated as trusted (see
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)). Configuration Item:
APT::Sources::With.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="41"><DD>
Muestra un mensaje corto sobre el uso.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="42"><DD>
Muestra la versi&oacute;n del programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="43"><DD>
Fichero de configuraci&oacute;n: Especifica el fichero de configuraci&oacute;n a usar. El programa leer&aacute; el fichero de configuraci&oacute;n predeterminado y, despu&eacute;s, este fichero de configuraci&oacute;n. Si necesita que ciertas opciones de configuraci&oacute;n se definan antes que el an&aacute;lisis de los de los ficheros de configuraci&oacute;n predeterminados, defina un fichero con la variable de entorno
<B>APT_CONFIG</B>. Consulte
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informaci&oacute;n sobre la sintaxis.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="44"><DD>
Define una opci&oacute;n de configuraci&oacute;n: Esto definir&aacute; una opci&oacute;n arbitraria de configuraci&oacute;n. La sintaxis es
<B>-o Algo::Cosa=cosa</B>.
<B>-o</B>
y
<B>--option</B>
se pueden usar varias veces para definir diferentes opciones.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>FICHEROS</H2>

<P>

/etc/apt/sources.list
<DL COMPACT><DT id="45"><DD>
Ubicaciones de d&oacute;nde conseguir los paquetes. Opci&oacute;n de configuraci&oacute;n:
Dir::Etc::SourceList.
</DL>

<P>

/etc/apt/sources.list.d/
<DL COMPACT><DT id="46"><DD>
Fragmentos de fichero para las ubicaciones de d&oacute;nde descargar los paquetes. Opci&oacute;n de configuraci&oacute;n:
Dir::Etc::SourceParts.
</DL>

<P>

/var/lib/apt/lists/
<DL COMPACT><DT id="47"><DD>
&Aacute;rea de almacenamiento para la informaci&oacute;n del estado de cada fuente de paquetes especificado en
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
Opci&oacute;n de configuraci&oacute;n:
Dir::State::Lists.
</DL>

<P>

/var/lib/apt/lists/partial/
<DL COMPACT><DT id="48"><DD>
&Aacute;rea de almacenamiento para la informaci&oacute;n de estado en tr&aacute;nsito. Elemento de configuraci&oacute;n:
Dir::State::Lists
(se a&ntilde;ade
partial
de forma impl&iacute;cita)
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>V&Eacute;ASE TAMBI&Eacute;N</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<A NAME="lbAH">&nbsp;</A>
<H2>DIAGN&Oacute;STICOS</H2>

<P>

<B>apt-cache</B>
devuelve cero si no hay ning&uacute;n error, y el valor 100 en caso de error.
<A NAME="lbAI">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>P&aacute;gina de errores de APT</B>m[]<FONT SIZE="-2">[3]</FONT>. Si quiere informar de un error en APT, consulte
/usr/share/doc/debian/bug-reporting.txt
o use la orden
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCCI&Oacute;N</H2>

<P>

La traducci&oacute;n al espa&ntilde;ol la realizaron Ismael Fanlo, Carlos Mestre, Rudy Godoy, Gustavo Saldumbide, Javier Fern&aacute;ndez-Sanguino y Rub&eacute;n Porras Campo entre los a&ntilde;os 2003 y 2004. La traducci&oacute;n fue actualizada por Francisco Javier Cuadrado y Omar Campagne Polaino entre los a&ntilde;os 2009 y 2012 .
<P>

Tenga en cuenta que este documento puede contener secciones sin traducir. Esto es intencionado para evitar perder contenido cuando la traducci&oacute;n no est&aacute; actualizada con respecto al documento original.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="49"><DD>
</DL>

<P>

<B>Equipo de APT</B>
<DL COMPACT><DT id="50"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="51"> 1.<DD>
GraphViz
<DL COMPACT><DT id="52"><DD>
<A HREF="http://www.research.att.com/sw/tools/graphviz/">http://www.research.att.com/sw/tools/graphviz/</A>
</DL>

<DT id="53"> 2.<DD>
herramienta VCG
<DL COMPACT><DT id="54"><DD>
<A HREF="http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html">http://rw4.cs.uni-sb.de/users/sander/html/gsvcg1.html</A>
</DL>

<DT id="55"> 3.<DD>
P&aacute;gina de errores de APT
<DL COMPACT><DT id="56"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="57"><A HREF="#lbAB">NOMBRE</A><DD>
<DT id="58"><A HREF="#lbAC">SINOPSIS</A><DD>
<DT id="59"><A HREF="#lbAD">DESCRIPCI&Oacute;N</A><DD>
<DT id="60"><A HREF="#lbAE">OPCIONES</A><DD>
<DT id="61"><A HREF="#lbAF">FICHEROS</A><DD>
<DT id="62"><A HREF="#lbAG">V&Eacute;ASE TAMBI&Eacute;N</A><DD>
<DT id="63"><A HREF="#lbAH">DIAGN&Oacute;STICOS</A><DD>
<DT id="64"><A HREF="#lbAI">BUGS</A><DD>
<DT id="65"><A HREF="#lbAJ">TRADUCCI&Oacute;N</A><DD>
<DT id="66"><A HREF="#lbAK">AUTORES</A><DD>
<DT id="67"><A HREF="#lbAL">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:00 GMT, March 31, 2021
</BODY>
</HTML>
