
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT.CONF</TITLE>
</HEAD><BODY>
<H1>APT.CONF</H1>
Section: APT (5)<BR>Updated: 04&nbsp;avril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt.conf - Fichier de configuration pour APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Le fichier
apt.conf
est le fichier de configuration principal du l'ensemble de programmes APT, mais n'est de loin pas le seul endroit o&ugrave; des choix d'options peuvent &ecirc;tre effectu&eacute;s. L'ensemble des outils partagent leur analyse de la ligne de commande, ce qui permet de garantir un environnement d'utilisation uniforme.
<P>

Lorsqu'un programme de l'ensemble APT est utilis&eacute;, il lit le fichier de configuration dans l'ordre suivant&nbsp;:
<P>
<DL COMPACT><DT id="1"><DD>
 1.


fichier indiqu&eacute; par la variable d'environnement
<B>APT_CONFIG</B>
si elle existe
</DL>

<P>
<DL COMPACT><DT id="2"><DD>
 2.


tous les fichiers de
Dir::Etc::Parts
dans l'ordre alphanum&eacute;rique ascendant qui ont soit l'extension &quot;conf&quot;, soit aucune extension et qui ne contiennent que des caract&egrave;res alphanum&eacute;riques, des tirets (-), des caract&egrave;res de soulignement (_) et des points (.), les autres fichiers &eacute;tant ignor&eacute;s. Dans le cas contraire, APT affichera un avertissement indiquant qu'il a ignor&eacute; un fichier si celui-ci ne correspond par &agrave; un motif d&eacute;fini dans
Dir::Ignore-Files-Silently
(les fichiers correspondant &agrave; cette variable de configuration &eacute;tant, eux, ignor&eacute;s silencieusemennt).
</DL>

<P>
<DL COMPACT><DT id="3"><DD>
 3.


le fichier de configuration d&eacute;fini par
Dir::Etc::Main
</DL>

<P>
<DL COMPACT><DT id="4"><DD>
 4.


toutes les options d&eacute;finie dans le sous-arbre binaire de configuration sp&eacute;cifique sont d&eacute;plac&eacute;es &agrave; la racine de l'arbre.
</DL>

<P>
<DL COMPACT><DT id="5"><DD>
 5.


les options de ligne de commande sont appliqu&eacute;es pour remplacer les directives de configuration ou pour charger d'autres fichiers de configuration.
</DL>

<A NAME="lbAD">&nbsp;</A>
<H2>SYNTAXE</H2>

<P>

Le fichier de configuration est construit comme un arbre d'options organis&eacute;es en groupes fonctionnels. On se sert du double deux points (&laquo;&nbsp;::&nbsp;&raquo;) pour indiquer une option&nbsp;; par exemple,
APT::Get::Assume-Yes
est une option pour le groupe d'outils APT, destin&eacute;e &agrave; l'outil Get. Il n'y a pas d'h&eacute;ritage des options des groupes parents.
<P>

Syntaxiquement, le langage de configuration est con&ccedil;u sur le m&ecirc;me mod&egrave;le que les langages utilis&eacute;s par des outils ISC tels que bind et dhcp. Une ligne qui commence par
//
est trait&eacute;e comme un commentaire et ignor&eacute;e, de m&ecirc;me que les sections de texte plac&eacute;es entre
/*
et
*/, tout comme les commentaires C/C++. Chaque ligne est de la forme&nbsp;:
APT::Get::Assume-Yes &quot;true&quot;;. Les guillemets et le point-virgule final sont obligatoires. La valeur doit tenir sur une seule ligne et il n'existe pas de fusion de cha&icirc;nes. Elle ne doit pas comporter de guillemets et de barre oblique invers&eacute;e. Le nom d'une option peut contenir des caract&egrave;res alphanum&eacute;riques et &laquo;&nbsp;/-:._+&nbsp;&raquo;. On peut d&eacute;clarer un nouveau champ d'action avec des accolades, comme suit&nbsp;:
<P>
<DL COMPACT><DT id="6"><DD>



<PRE>
   
APT {
  Get {
    Assume-Yes &quot;true&quot;;
    Fix-Broken &quot;true&quot;;
  };
};
</PRE>

</DL>




<P>

avec des retours &agrave; la ligne pour faciliter la lecture. On peut cr&eacute;er une liste en ouvrant un champ d'action et en y ins&eacute;rant une cha&icirc;ne entre guillemets suivie d'un point virgule. Des entr&eacute;es multiples peuvent &ecirc;tre incluses, s&eacute;par&eacute;es par des points-virgules.
<P>
<DL COMPACT><DT id="7"><DD>



<PRE>
   
DPkg::Pre-Install-Pkgs {&quot;/usr/sbin/dpkg-preconfigure --apt&quot;;};
</PRE>

</DL>




<P>

Les mod&egrave;les
/usr/share/doc/apt/examples/configure-index.gz
montrent &agrave; quoi devrait ressembler le fichier de configuration.
<P>

Les identifiants des options de configuration ne sont pas sensibles &agrave; la casse. Dans l'exemple pr&eacute;c&eacute;dent, on pourrait donc aussi bien utiliser
dpkg::pre-install-pkgs.
<P>

Les noms des &eacute;l&eacute;ments de configuration sont optionnels si une liste est d&eacute;finie, comme cela peut se voir avec l'exemple
DPkg::Pre-Install-Pkgs
pr&eacute;c&eacute;dent. Si vous n'indiquez pas de nom, une nouvelle entr&eacute;e ajoutera une nouvelle option &agrave; la liste. Dans le cas contraire, l'option correspondante peut &ecirc;tre remplac&eacute;e, comme toute autre option, en lui r&eacute;affectant une valeur.
<P>

Deux &eacute;l&eacute;ments sp&eacute;ciaux sont autoris&eacute;s&nbsp;:
#include
(qui est obsol&egrave;te et n'est plus g&eacute;r&eacute; par des impl&eacute;mentations alternatives) et
#clear.
#include
inclut le fichier donn&eacute; en param&egrave;tre, &agrave; moins que le nom ne se termine par une barre oblique auquel cas le r&eacute;pertoire entier est inclus.
#clear
sert &agrave; effacer une partie de l'arbre de configuration. L'&eacute;l&eacute;ment d&eacute;sign&eacute; et tout ses descendants sont supprim&eacute;s. Veuillez noter que ces lignes doivent &eacute;galement se terminer avec un point-virgule.
<P>

La commande
#clear
est la seule fa&ccedil;on de supprimer une liste ou un champ d'action (&laquo;&nbsp;scope&nbsp;&raquo;). La r&eacute;ouverture d'un scope ou le style &laquo;&nbsp;::&nbsp;&raquo; d&eacute;crit plus loin ne remplaceront
<I>pas</I>
les entr&eacute;es &eacute;crites pr&eacute;c&eacute;demment. Les options ne peuvent &ecirc;tre remplac&eacute;es qu'en leur affectant une nouvelle valeur. Les listes et les champs d'action ne peuvent &ecirc;tre remplac&eacute;s mais seulement effac&eacute;s.
<P>

Tous les outils d'APT poss&egrave;dent une option
<B>-o</B>
qui permet de sp&eacute;cifier une configuration quelconque depuis la ligne de commande. La syntaxe consiste en un nom complet d'option (par exemple
APT::Get::Assume-Yes) suivi par un signe &eacute;gal, puis par la nouvelle valeur de l'option. On peut compl&eacute;ter une liste en ajoutant un
::
final au nom de la liste. Comme on peut s'en douter, la syntaxe de champ d'action (&laquo;&nbsp;scope&nbsp;&raquo;) ne peut pas &ecirc;tre indiqu&eacute;e &agrave; la ligne de commande.
<P>

Veuillez noter que vous ne pouvez utiliser
::
que pour ajouter un &eacute;l&eacute;ment par ligne &agrave; la liste et que cela ne devrait pas &ecirc;tre utilis&eacute; en combinaison avec la syntaxe de champ d'action (&laquo;&nbsp;scope&nbsp;&raquo;) qui inclut implicitement
::. L'utilisation simultan&eacute;e des deux syntaxes d&eacute;clenchera un bogue dont certains utilisateurs se servent comme d'une fonctionnalit&eacute;&nbsp;: une option avec le nom inhabituel &laquo;&nbsp;::&nbsp;&raquo; se comportera comme toute autre option nomm&eacute;e. Cela risque d'avoir de nombreux probl&egrave;mes comme cons&eacute;quence, par exemple si un utilisateur &eacute;crit plusieurs lignes avec cette syntaxe
<I>erron&eacute;e</I>
afin de faire un ajout &agrave; la liste, l'effet obtenu sera inverse puisque seule la derni&egrave;re valeur pour l'option &laquo;&nbsp;::&nbsp;&raquo; sera utilis&eacute;e. Les futures versions d'APT retourneront une erreur et l'ex&eacute;cution sera interrompue si cette utilisation incorrecte est rencontr&eacute;e. Il est donc conseill&eacute; de corriger ces d&eacute;fauts tant qu'APT ne s'en plaint pas explicitement.
<A NAME="lbAE">&nbsp;</A>
<H2>LE GROUPE APT</H2>

<P>

Ce groupe d'options contr&ocirc;le le comportement global d'APT et contient &eacute;galement des options communes &agrave; tous les outils.
<P>

<B>Architecture</B>
<DL COMPACT><DT id="8"><DD>
L'architecture du syst&egrave;me&nbsp;; cette option positionne l'architecture &agrave; utiliser pour r&eacute;cup&eacute;rer des fichiers et analyser des listes de paquets. La valeur interne par d&eacute;faut est l'architecture pour laquelle APT a &eacute;t&eacute; compil&eacute;.
</DL>

<P>

<B>Architectures</B>
<DL COMPACT><DT id="9"><DD>
Toutes les architectures g&eacute;r&eacute;es par le syst&egrave;me. Par exemple, les processeurs qui mettent en &oelig;uvre le jeu d'instructions
amd64
(aussi appel&eacute;
x86-64) peuvent ex&eacute;cuter des binaires compil&eacute;s pour le jeu d'instructionsi386
(x86). Cette liste est utilis&eacute; pour r&eacute;cup&eacute;rer des fichiers et analyser les listes de paquets. La valeur par d&eacute;faut initiale est toujours celle de l'architecture native du syst&egrave;me (APT::Architecture) et les autres architectures sont ajout&eacute;es &agrave; la liste par d&eacute;faut lorsqu'elles sont enregistr&eacute;es avec
<B>dpkg --add-architecture</B>.
</DL>

<P>

<B>Compressor</B>
<DL COMPACT><DT id="10"><DD>
Ce champ d'action (&laquo;&nbsp;scope&nbsp;&raquo;) d&eacute;finit quels formats de compression sont g&eacute;r&eacute;s, comment la compression et la d&eacute;compression peuvent &ecirc;tre r&eacute;alis&eacute;es si ce format n'est pas pris en charge directement dans APT et une indication du co&ucirc;t d'une compression dans ce format. Dans cet exemple, le paragraphe suivant de la configuration permettra &agrave; APT de t&eacute;l&eacute;charger, d&eacute;compresser, cr&eacute;er et stocker des fichiers avec l'extension de fichier &agrave; bas co&ucirc;t
.reversed
qu'il passera &agrave; la commande
<B>rev</B>
sans param&egrave;tre suppl&eacute;mentaire en ligne de commande pour la compression et la d&eacute;compression&nbsp;:
<P>
<DL COMPACT><DT id="11"><DD>



<PRE>
APT::Compressor::rev {
        Name &quot;rev&quot;;
        Extension &quot;.reversed&quot;;
        Binary &quot;rev&quot;;
        CompressArg {};
        UncompressArg {};
        Cost &quot;10&quot;;
};
</PRE>

</DL>




</DL>

<P>

<B>Build-Profiles</B>
<DL COMPACT><DT id="12"><DD>
Liste de tous les profils de construction activ&eacute;s pour la r&eacute;solution de d&eacute;pendances de construction, sans le pr&eacute;fixe de l'espace de nommage du &quot;profile.&quot;. Par d&eacute;faut, cette liste est vide. La variable
<B>DEB_BUILD_PROFILES</B>
comme l'utilise
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)
annule la notation de liste.
</DL>

<P>

<B>Default-Release</B>
<DL COMPACT><DT id="13"><DD>
Indique la distribution &agrave; utiliser par d&eacute;faut lors de l'installation d'un paquet si plusieurs versions sont disponibles. La valeur peut &ecirc;tre un nom de distribution ou un num&eacute;ro de version. Exemples&nbsp;: &laquo;&nbsp;stable&nbsp;&raquo;, &laquo;&nbsp;testing&nbsp;&raquo;, &laquo;&nbsp;buster&nbsp;&raquo;, &laquo;&nbsp;bullseye&nbsp;&raquo;, &laquo;&nbsp;4.0&nbsp;&raquo;, &laquo;&nbsp;5.0*&nbsp;&raquo;. Voir aussi
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
</DL>

<P>

<B>Ignore-Hold</B>
<DL COMPACT><DT id="14"><DD>
Ignore les paquets &laquo;&nbsp;gel&eacute;s&nbsp;&raquo;&nbsp;; cette option globale indique au syst&egrave;me de r&eacute;solution de ne pas tenir compte des paquets &laquo;&nbsp;gel&eacute;s&nbsp;&raquo; dans sa prise de d&eacute;cision.
</DL>

<P>

<B>Clean-Installed</B>
<DL COMPACT><DT id="15"><DD>
Avec cette option qui est activ&eacute;e par d&eacute;faut, la fonctionnalit&eacute; &laquo;&nbsp;autoclean&nbsp;&raquo; supprime du cache tout paquet qui ne peut plus &ecirc;tre r&eacute;cup&eacute;r&eacute;. Quand cette option est d&eacute;sactiv&eacute;e, les paquets qui sont install&eacute;s localement sont aussi exclus du nettoyage - mais notez que APT ne fournit aucun moyen direct pour les r&eacute;installer.
</DL>

<P>

<B>Immediate-Configure</B>
<DL COMPACT><DT id="16"><DD>
La valeur par d&eacute;faut est &laquo;&nbsp;on&nbsp;&raquo; ce qui a pour cons&eacute;quence qu'APT installera les paquets essentiels et importants d&egrave;s que possible pendant les op&eacute;rations d'installation ou de mise &agrave; jour, afin de limiter les cons&eacute;quences d'un &eacute;chec de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Si cette option est d&eacute;sactiv&eacute;e, APT traitera les paquets importants comme les paquets de priorit&eacute; &laquo;&nbsp;extra&nbsp;&raquo;&nbsp;:&nbsp;entre la d&eacute;compaction du paquet A et sa configuration, de nombreuses op&eacute;rations de d&eacute;compaction ou de configuration peuvent prendre place pour des paquets B ou C qui n'ont rien &agrave; voir. Si ces op&eacute;rations provoquent un &eacute;chec de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
(par exemple si les scripts du responsable du paquet B provoquent une erreur), le r&eacute;sultat est que le paquet A est d&eacute;compact&eacute; mais non configur&eacute;. En cons&eacute;quence, les paquets qui en d&eacute;pendent pourraient ne plus fonctionner puisque leurs d&eacute;pendances ne sont pas satisfaites.
<P>
Le marqueur de configuration imm&eacute;diate est &eacute;galement utilis&eacute; dans le cas potentiellement d&eacute;licat de d&eacute;pendances circulaires, car une d&eacute;pendance avec le marqueur &laquo;&nbsp;immediate&nbsp;&raquo; est &eacute;quivalent &agrave; une pr&eacute;-d&eacute;pendance. Cela permet en th&eacute;orie &agrave; APT de reconna&icirc;tre le cas o&ugrave; il ne peut effectuer de configuration imm&eacute;diate et de s'interrompre pour sugg&eacute;rer de d&eacute;sactiver temporairement l'option pour permettre aux op&eacute;rations de s'effectuer. Veuillez noter l'utilisation du terme &laquo;&nbsp;en th&eacute;orie&nbsp;&raquo;&nbsp;:&nbsp;en r&eacute;alit&eacute;, ce probl&egrave;me est rarement rencontr&eacute;, dans des versions non stables de distributions, et &eacute;tait caus&eacute; par des d&eacute;pendances incorrectes ou par un syst&egrave;me d&eacute;j&agrave; dans un &eacute;tat instable. Vous ne devriez donc pas d&eacute;sactiver cette option sans savoir ce que vous faites car le sc&eacute;nario ci-dessus n'est le seul qu'elle permet d'&eacute;viter.
<P>
Avant qu'une op&eacute;ration importante comme
dist-upgrade
ne soit ex&eacute;cut&eacute;e avec cette option d&eacute;sactiv&eacute;e, vous devriez essayer d'installer (install) explicitement le paquet qu'APT ne peut pas configurer imm&eacute;diatement. Ne manquez toutefois pas de signaler le probl&egrave;me dans votre distribution et &agrave; l'&eacute;quipe de maintenance d'APT avec le lien de syst&egrave;me de gestion de bogues ci-dessous, afin qu'ils puissent am&eacute;liorer ou corriger les processus de mise &agrave; jour.
</DL>

<P>

<B>Force-LoopBreak</B>
<DL COMPACT><DT id="17"><DD>
Ne jamais activer cette option &agrave; moins que vous ne sachiez
<I>r&eacute;ellement</I>
ce que vous faites. Elle autorise APT &agrave; supprimer temporairement un paquet essentiel pour mettre fin &agrave; une boucle Conflicts / Conflicts ou Conflicts / Pre-Depends entre deux paquets essentiels.
<I>Une telle boucle ne devrait jamais se produire&nbsp;: c'est un bogue tr&egrave;s important</I>. Cette option fonctionne si les paquets essentiels ne sont pas
<B>tar</B>,
<B>gzip</B>,
<B>libc</B>,
<B>dpkg</B>,
<B>dash</B>
ou tous les paquets dont ces paquets d&eacute;pendent.
</DL>

<P>

<B>Cache-Start</B>, <B>Cache-Grow</B>, <B>Cache-Limit</B>
<DL COMPACT><DT id="18"><DD>
&Agrave; partir de la version&nbsp;0.7.26, APT utilise un fichier de cache de taille variable index&eacute; en m&eacute;moire (&laquo;&nbsp;resizable memory mapped cache file&nbsp;&raquo;) pour conserver les informations du fichier &laquo;&nbsp;available&nbsp;&raquo;.
Cache-Start
d&eacute;finit la taille minimale de ce cache et par cons&eacute;quent la quantit&eacute; de m&eacute;moire qu'APT utilisera d&egrave;s son lancement. La valeur par d&eacute;faut est de 20971520&nbsp;octets (environ 20&nbsp;Mo). Il est indispensable que l'ensemble de cette m&eacute;moire soit disponible, sinon APT ne pourra se lancer. Il peut donc &ecirc;tre n&eacute;cessaire de diminuer cette valeur sur des syst&egrave;mes disposant de peu de m&eacute;moire. Au contraire, pour des syst&egrave;mes qui utilisent de nombreuses sources de paquet, il peut &ecirc;tre n&eacute;cessaire de l'augmenter. La valeur de
Cache-Grow
d&eacute;finit, en octets, la quantit&eacute; de m&eacute;moire suppl&eacute;mentaire qui peut &ecirc;tre allou&eacute;e au cache si la valeur d&eacute;finie par
Cache-Start
est insuffisante. La valeur par d&eacute;faut de
Cache-Grow
est de 1048576&nbsp;octets (environ 1&nbsp;Mo). Cette augmentation se fera tant que la taille du cache sera insuffisante pour contenir toutes les informations n&eacute;cessaires ou qu'elle atteint la valeur limite d&eacute;finie par
Cache-Limit. La valeur par d&eacute;faut de
Cache-Limit
est nulle (il n'existe donc pas de limite &agrave; la taille maximale du cache). Si
Cache-Grow
est &eacute;gal &agrave;&nbsp;0, l'augmentation automatique de la taille du cache est d&eacute;sactiv&eacute;e.
</DL>

<P>

<B>Build-Essential</B>
<DL COMPACT><DT id="19"><DD>
Cette option d&eacute;finit les paquets qui sont consid&eacute;r&eacute;s comme faisant partie des d&eacute;pendances essentielles pour la construction de paquets.
</DL>

<P>

<B>Get</B>
<DL COMPACT><DT id="20"><DD>
La sous-section
Get
contr&ocirc;le l'outil
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8), veuillez consulter sa documentation pour avoir plus d'informations sur les options en question.
</DL>

<P>

<B>Cache</B>
<DL COMPACT><DT id="21"><DD>
La sous-section
Cache
contr&ocirc;le l'outil
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8), veuillez consulter sa documentation pour avoir plus d'informations sur les options en question.
</DL>

<P>

<B>CDROM</B>
<DL COMPACT><DT id="22"><DD>
La sous-section
CDROM
contr&ocirc;le l'outil
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8), veuillez consulter sa documentation pour avoir plus d'informations sur les options en question.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>LE GROUPE ACQUIRE</H2>

<P>

Le groupe d'options
Acquire
contr&ocirc;le le t&eacute;l&eacute;chargement des paquets ainsi que les diff&eacute;rentes &laquo;&nbsp;m&eacute;thodes d'acquisition&nbsp;&raquo; qui effectuent ce t&eacute;l&eacute;chargement (voir aussi
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)).
<P>

<B>Check-Date</B>
<DL COMPACT><DT id="23"><DD>
Les options relatives &agrave; la s&eacute;curit&eacute; sont positionn&eacute;es par d&eacute;faut &agrave; &laquo;&nbsp;true&nbsp;&raquo;,permettant des v&eacute;rifications relatives &agrave; l'heure. Leur d&eacute;sactivation signifie qu'on ne peut pas faire confiance &agrave; l'heure de la machine, et APT de ce fait d&eacute;sactivera toutes les v&eacute;rifications de ce type, telles que
<B>Check-Valid-Until</B>
et la v&eacute;rification que le champ Date d'un fichier Release n'est pas dans le futur.
</DL>

<P>

<B>Max-FutureTime</B>
<DL COMPACT><DT id="24"><DD>
Dur&eacute;e maximale (en secondes) pendant laquelle un fichier Release est consid&eacute;r&eacute; comme valable, &agrave; partir du moment de sa cr&eacute;ation (tel que cela est indiqu&eacute; dans l'en-t&ecirc;te
Date). La valeur par d&eacute;faut est
10. Un r&eacute;glage sp&eacute;cifique pour une archive donn&eacute;e peut &ecirc;tre d&eacute;fini en ajoutant l'&eacute;tiquette de l'archive au nom de l'option. De pr&eacute;f&eacute;rence, le m&ecirc;me r&eacute;sultat peut &ecirc;tre obtenu pour des entr&eacute;es particuli&egrave;res de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
en utilisant ici l'option
<B>Date-Max-Future</B>.
</DL>

<P>

<B>Check-Valid-Until</B>
<DL COMPACT><DT id="25"><DD>
L'activation de l'option de s&eacute;curit&eacute; qui permet de mettre une limite temporelle de validit&eacute; au fichier Release permet d'&eacute;viter des attaques de type &laquo;&nbsp;replay&nbsp;&raquo; et permet d'&eacute;viter d'utiliser des miroirs qui ne sont plus &agrave; jour. Cependant, cette fonctionnalit&eacute; a besoin que l'horloge du syst&egrave;me soit &agrave; jour. Les gestionnaires d'archives devraient cr&eacute;er des fichiers Release comportant l'en-t&ecirc;te
Valid-Until. Cependant, si cet en-t&ecirc;te est absent, ou si une valeur plus stricte est d&eacute;sir&eacute;e, la valeur du param&egrave;tre
Max-ValidTime
est alors utilis&eacute;e. L'option
<B>Check-Valid-Until</B>
des entr&eacute;es de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
devrait &ecirc;tre pr&eacute;f&eacute;r&eacute;e pour d&eacute;sactiver s&eacute;lectivement la v&eacute;rification plut&ocirc;t que d'utiliser ce remplacement global.
</DL>

<P>

<B>Max-ValidTime</B>
<DL COMPACT><DT id="26"><DD>
Dur&eacute;e maximale (en secondes) pendant laquelle un fichier Release est consid&eacute;r&eacute; comme valable, &agrave; partir du moment de sa cr&eacute;ation (tel que cela est indiqu&eacute; dans l'en-t&ecirc;te
Date). Si ce fichier lui-m&ecirc;me comporte un en-t&ecirc;te
Valid-Until
la plus ancienne des deux dates est utilis&eacute;e comme date d'expiration. La valeur par d&eacute;faut (0) signifie &laquo;&nbsp;valable &eacute;ternellement&nbsp;&raquo;. Un r&eacute;glage sp&eacute;cifique pour une archive donn&eacute;e peut &ecirc;tre d&eacute;fini en ajoutant l'&eacute;tiquette de l'archive au nom de l'option. De pr&eacute;f&eacute;rence, le m&ecirc;me r&eacute;sultat peut &ecirc;tre obtenu pour des entr&eacute;es particuli&egrave;res de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
en utilisant ici l'option
<B>Valid-Until-Max</B>.
</DL>

<P>

<B>Min-ValidTime</B>
<DL COMPACT><DT id="27"><DD>
Dur&eacute;e minimale (en secondes) pendant laquelle un fichier Release est consid&eacute;r&eacute; comme valable, &agrave; partir du moment de sa cr&eacute;ation (tel que cela est indiqu&eacute; dans l'en-t&ecirc;te
Date). Il est conseill&eacute; d'utiliser ce r&eacute;glage si vous utilisez un miroir mis &agrave; jour ponctuellement (par exemple un miroir local) d'une archive mise &agrave; jour plus fr&eacute;quemment avec un en-t&ecirc;te
Valid-Until
plut&ocirc;t que de d&eacute;sactiver compl&egrave;tement le contr&ocirc;le des dates d'expiration. Un r&eacute;glage sp&eacute;cifique pour une archive donn&eacute;e peut &ecirc;tre d&eacute;fini en ajoutant l'&eacute;tiquette de l'archive au nom de l'option. De pr&eacute;f&eacute;rence, le m&ecirc;me r&eacute;sultat peut &ecirc;tre obtenu pour des entr&eacute;es particuli&egrave;res de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
en utilisant ici l'option
<B>Valid-Until-Min</B>.
</DL>

<P>

<B>AllowTLS</B>
<DL COMPACT><DT id="28"><DD>
Permet l'utilisation de la prise en charge interne de TLS dans la m&eacute;thode http. Si la valeur de l'option est &laquo;&nbsp;false&nbsp;&raquo;, cela d&eacute;sactive totalement la prise en charge de TLS dans les m&eacute;thodes propres d'Apt (&agrave; l'exclusion de la m&eacute;thode https bas&eacute;e sur curl). Plus aucune des fonctions li&eacute;es &agrave; TLS ne peut &ecirc;tre appel&eacute;e.
</DL>

<P>

<B>PDiffs</B>
<DL COMPACT><DT id="29"><DD>
Essayer de t&eacute;l&eacute;charger les fichiers diff&eacute;rentiels appel&eacute;s
PDiffs
pour les index (par exemple les fichiers
Packages), plut&ocirc;t que de les t&eacute;l&eacute;charger enti&egrave;rement. Par d&eacute;faut &agrave; &laquo;&nbsp;true&nbsp;&raquo;. De pr&eacute;f&eacute;rence, cela peut &ecirc;tre d&eacute;fini pour des entr&eacute;es particuli&egrave;res de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
ou des fichiers d'index en utilisant ici l'option
<B>PDiffs</B>.
<P>
Deux sous-options permettant de limiter l'utilisation de fichiers &laquo;&nbsp;pdiff&nbsp;&raquo; sont &eacute;galement disponibles.
FileLimit
permet d'indiquer le nombre maximal de fichiers de diff&eacute;rences peuvent &ecirc;tre t&eacute;l&eacute;charg&eacute;s pour modifier un fichier.
SizeLimit
permet par ailleurs de limiter la taille combin&eacute;e des fichiers de diff&eacute;rences r&eacute;cup&eacute;r&eacute;s &agrave; un certain pourcentage du fichier &agrave; modifier. Si une de ces limites est d&eacute;pass&eacute;e, le fichier complet est t&eacute;l&eacute;charg&eacute; au lieu de t&eacute;l&eacute;charger les fichiers de diff&eacute;rences.
</DL>

<P>

<B>By-Hash</B>
<DL COMPACT><DT id="30"><DD>
Essayer de t&eacute;l&eacute;charger les index avec un URI construit &agrave; partir de la somme de hachage du fichier attendu plut&ocirc;t que de les t&eacute;l&eacute;charger &agrave; partir d'un nom de fichier stable bien connu. Par d&eacute;faut &agrave; &laquo;&nbsp;true&nbsp;&raquo;, mais automatiquement d&eacute;sactiv&eacute; si la source n'indique pas sa prise en charge. Son utilisation peut &ecirc;tre forc&eacute;e avec la valeur sp&eacute;ciale &laquo;&nbsp;force&nbsp;&raquo;. De pr&eacute;f&eacute;rence, cela peut &ecirc;tre d&eacute;fini pour des entr&eacute;es particuli&egrave;res de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
ou des fichiers d'index en utilisant ici l'option
<B>By-Hash</B>.
</DL>

<P>

<B>Queue-Mode</B>
<DL COMPACT><DT id="31"><DD>
Mode de file d'attente&nbsp;;
Queue-Mode
peut prendre les valeurs
host
ou
access, ce qui d&eacute;termine comment APT parall&eacute;lise les connexions sortantes.
Host
signifie qu'une connexion par cible sera initi&eacute;e, tandis que
access
signifie qu'une connexion par type d'URI sera initi&eacute;e.
</DL>

<P>

<B>Retries</B>
<DL COMPACT><DT id="32"><DD>
Nombre d'essais &agrave; effectuer. Si ce nombre n'est pas nul, APT essaie de r&eacute;cup&eacute;rer, le nombre donn&eacute; de fois, les fichiers dont la r&eacute;cup&eacute;ration a &eacute;chou&eacute;.
</DL>

<P>

<B>Source-Symlinks</B>
<DL COMPACT><DT id="33"><DD>
Utilise des liens symboliques pour les archives de sources. Positionn&eacute;e &agrave; &laquo;&nbsp;true&nbsp;&raquo;, cette option cr&eacute;e si possible des liens symboliques vers les archives de sources au lieu de les copier. Par d&eacute;faut &agrave; &laquo;&nbsp;true&nbsp;&raquo;.
</DL>

<P>

<B>http</B> <B>https</B>
<DL COMPACT><DT id="34"><DD>
Les options dans ces champs d'action configurent les transports d'acquisition d'APT pour les protocoles HTTP et HTTPS et sont document&eacute;es dans les pages de manuel
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
et
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-https">apt-transport-https</A></B>(1)
respectivement.
</DL>

<P>

<B>ftp</B>
<DL COMPACT><DT id="35"><DD>
ftp::Proxy
est le mandataire (proxy) FTP &agrave; utiliser par d&eacute;faut pour les URI FTP. Il se pr&eacute;sente sous la forme standard&nbsp;:
<A HREF="ftp://[[user][:pass]@]host[:port]/.">ftp://[[user][:pass]@]host[:port]/.</A> On peut sp&eacute;cifier un mandataire particulier par h&ocirc;te distant en utilisant la syntaxe&nbsp;:
ftp::Proxy::&lt;h&ocirc;te&gt;. Le mot-cl&eacute; sp&eacute;cial
DIRECT
indique alors de n'utiliser aucun mandataire pour l'h&ocirc;te. Si aucun des param&egrave;tres pr&eacute;c&eacute;dents n'est d&eacute;finis, la variable d'environnement
<B>ftp_proxy</B>
annule et replace toutes les options de mandataire FTP. Pour utiliser un mandataire FTP, vous devrez renseigner l'entr&eacute;e
ftp::ProxyLogin
dans le fichier de configuration. Cette entr&eacute;e sp&eacute;cifie les commandes &agrave; envoyer au mandataire pour lui pr&eacute;ciser &agrave; quoi il doit se connecter. Voyez
/usr/share/doc/apt/examples/configure-index.gz
pour savoir comment faire. Les variables de substitution qui repr&eacute;sentent le composant d'URI correspondant sont&nbsp;:
$(PROXY_USER),
$(PROXY_PASS),
$(SITE_USER),
$(SITE_PASS),
$(SITE)
et
$(SITE_PORT).
<P>
L'option
timeout
positionne le compteur d'expiration du d&eacute;lai (timeout) utilis&eacute; par la m&eacute;thode. Cela s'applique aussi bien &agrave; la connexion qu'aux donn&eacute;es.
<P>
Plusieurs options de configuration sont fournies pour contr&ocirc;ler le mode passif. Il est g&eacute;n&eacute;ralement plus s&ucirc;r d'activer le mode passif et cela marche dans presque tous les environnements. Cependant, certaines situations n&eacute;cessitent que le mode passif soit d&eacute;sactiv&eacute; et que le mode &laquo;&nbsp;port&nbsp;&raquo; de ftp soit utilis&eacute; &agrave; la place. On peut le faire globalement, pour des connexions qui passent par un mandataire ou pour une machine sp&eacute;cifique (examinez le mod&egrave;le de fichier de configuration).
<P>
Il est possible de faire transiter le trafic FTP par un mandataire HTTP en positionnant la variable d'environnement
<B>ftp_proxy</B>
&agrave; une URL HTTP -- consultez la m&eacute;thode http ci-dessus pour la syntaxe. On ne peut pas le faire dans le fichier de configuration et il n'est de toute fa&ccedil;on pas recommand&eacute; d'utiliser FTP au travers de HTTP en raison de la faible efficacit&eacute; de cette m&eacute;thode.
<P>
L'option
ForceExtended
contr&ocirc;le l'utilisation des commandes li&eacute;es &agrave; la RFC&nbsp;2428,
EPSV
et
EPRT. Par d&eacute;faut, elle vaut &laquo;&nbsp;false&nbsp;&raquo; ce qui signifie que ces commandes ne sont utilis&eacute;es que pour une connexion de type IPv6. Quand elle vaut &laquo;&nbsp;true&nbsp;&raquo;, on les utilise m&ecirc;me si la connexion est de type IPv4. La plupart des serveurs FTP ne suivent pas la RFC&nbsp;2428.
</DL>

<P>

<B>cdrom</B>
<DL COMPACT><DT id="36"><DD>
La seule option de configuration pour les URI qui utilisent la m&eacute;thode
cdrom
est le point de montage&nbsp;:
cdrom::Mount&nbsp;; il doit repr&eacute;senter le point de montage du lecteur de CD-ROM (ou DVD, etc.) indiqu&eacute; dans
/etc/fstab. D'autres commandes de montage et de d&eacute;montage peuvent &ecirc;tre fournies quand le point de montage ne peut &ecirc;tre list&eacute; dans le fichier
/etc/fstab. Syntaxiquement, il faut placer
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
/cdrom/::Mount &quot;foo&quot;;
</PRE>

</DL>




<P>
dans le bloc
cdrom. La barre oblique finale est importante. Les commandes de d&eacute;montage peuvent &ecirc;tre sp&eacute;cifi&eacute;es en utilisant
UMount.
</DL>

<P>

<B>gpgv</B>
<DL COMPACT><DT id="38"><DD>
La seule option pour les URI GPGV est
gpgv::Options, qui permet de passer des param&egrave;tres &agrave; gpgv
</DL>

<P>

<B>CompressionTypes</B>
<DL COMPACT><DT id="39"><DD>
Cette option indique la liste des types de compression comprises par les m&eacute;thodes d'acquisition. Des fichiers comme
Packages
peuvent &ecirc;tre disponibles dans divers formats de compression. Par d&eacute;faut, les m&eacute;thodes d'acquisition d&eacute;compressent et recompressent dans beaucoup de formats courants les fichiers compress&eacute;s comme avec
<B>xz</B>
et
<B>gzip</B>&nbsp;; ce champ d'action permet de rechercher les formats pris en charge ou de les modifier, et l'ajout de prise en charge de formats suppl&eacute;mentaires est aussi possible (voir aussi
<B>APT::Compressor</B>). La syntaxe &agrave; utiliser est&nbsp;:&nbsp;
<P>
<DL COMPACT><DT id="40"><DD>



<PRE>
Acquire::CompressionTypes::<I>ExtensionFichier</I> &quot;<I>NomMethode</I>&quot;;
</PRE>

</DL>




<P>
Le sous-groupe
Order
peut &ecirc;tre &eacute;galement utilis&eacute; pour d&eacute;finir l'ordre dans lequel le syst&egrave;me d'acquisition tentera de t&eacute;l&eacute;charger les fichiers compress&eacute;s. Le premier syst&egrave;me mentionn&eacute; sera essay&eacute; en premier, puis le suivant en cas d'&eacute;chec. Ainsi, pour privil&eacute;gier un format par rapport &agrave; un autre, il suffit de le placer en premier dans cette liste. Les types qui ne sont pas d&eacute;j&agrave; indiqu&eacute;s seront ajout&eacute;s implicitement &agrave; la fin de la liste. Ainsi, par exemple,
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Acquire::CompressionTypes::Order:: &quot;gz&quot;;
</PRE>

</DL>




<P>
peut &ecirc;tre utilis&eacute; pour pr&eacute;f&eacute;rer les fichiers compress&eacute;s avec
<B>gzip</B>
par rapport &agrave; tous les autres formats de compression. Si l'objectif est d'utiliser
<B>xz</B>
en priorit&eacute; par rapport &agrave;
<B>gzip</B>
et
<B>bzip2</B>, ce r&eacute;glage doit ressembler &agrave;
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
Acquire::CompressionTypes::Order { &quot;xz&quot;; &quot;gz&quot;; };
</PRE>

</DL>




<P>
. Il est inutile d'ajouter explicitement
bz2
&agrave; liste car il sera ajout&eacute; automatiquement.
<P>
Veuillez noter que
Dir::Bin::<I>NomMethode</I>
sera contr&ocirc;l&eacute; &agrave; l'ex&eacute;cution&nbsp;: si cette option est utilis&eacute;e et que la prise en charge de ce format n'est pas construite dans APT, la m&eacute;thode ne sera utilis&eacute;e que si ce fichier existe. Ainsi, pour la m&eacute;thode
bzip2, le r&eacute;glage (utilis&eacute; en interne) est
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Dir::Bin::bzip2 &quot;/bin/bzip2&quot;;
</PRE>

</DL>




<P>
. Veuillez &eacute;galement noter que les &eacute;l&eacute;ments de liste indiqu&eacute;s &agrave; la ligne de commande seront ajout&eacute;s &agrave; la fin de la liste indiqu&eacute;e dans les fichiers de configuration, mais avant les valeurs par d&eacute;faut. Dans ce cas, pour &eacute;tablir une pr&eacute;f&eacute;rence par rapport aux types mentionn&eacute;s dans les fichiers de configuration, il est possible de placer l'option directement, pas sous forme de liste. Cela ne remplacera pas la liste par d&eacute;faut mais elle sera simplement pr&eacute;fix&eacute;e avec l'option en question.
<P>
Le type sp&eacute;cial
uncompressed
peut servir &agrave; donner la pr&eacute;f&eacute;rence aux fichiers non compress&eacute;s. Veuillez noter que la plupart des archives ne fournissent pas de fichiers non compress&eacute;s, donc ce r&eacute;glage est surtout destin&eacute; aux miroirs locaux.
</DL>

<P>

<B>GzipIndexes</B>
<DL COMPACT><DT id="44"><DD>
Lorsque des index compress&eacute;s par gzip doivent &ecirc;tre utilis&eacute;s (pour les fichiers Packages, Sources, Translations), ceux-ci seront compress&eacute;s avec gzip au lieu d'&ecirc;tre laiss&eacute;s d&eacute;compress&eacute;s. Cela peut permettre de gagner beaucoup d'espace disque au prix d'une utilisation plus importante du processeur lorsque les caches locaux sont cr&eacute;&eacute;s. Valeur par d&eacute;faut&nbsp;:&nbsp;Faux (&laquo;&nbsp;False&nbsp;&raquo;).
</DL>

<P>

<B>Languages</B>
<DL COMPACT><DT id="45"><DD>
La sous-section &laquo;&nbsp;Languages&nbsp;&raquo; contr&ocirc;le quels fichiers
Translation
sont t&eacute;l&eacute;charg&eacute;s et dans quel ordre APT les utilisera pour afficher les traductions de descriptions. APT recherchera d'abord la premi&egrave;re traduction disponible pour le champ Description dans la langue choisie en premier. Les langues peuvent &ecirc;tre indiqu&eacute;es par leur code long ou court. Veuillez noter que tous les d&eacute;p&ocirc;ts ne fournissent pas les fichiers
Translation
pour toutes les langues, les codes longs de langues &eacute;tant particuli&egrave;rement rares.
<P>
La liste par d&eacute;faut contient &laquo;&nbsp;environment&nbsp;&raquo; et &laquo;&nbsp;en&nbsp;&raquo;. La valeur &laquo;&nbsp;environment&nbsp;&raquo; a une signification sp&eacute;ciale&nbsp;: elle sera remplac&eacute;e, &agrave; l'ex&eacute;cution, par les codes de langues utilis&eacute;s dans la variable d'environnement
LC_MESSAGES. Les codes utilis&eacute;s en double ne seront pas inclus deux fois dans la liste. Si
LC_MESSAGES
contient &laquo;&nbsp;C&nbsp;&raquo;, seul le fichier
Translation-en
sera utilis&eacute;, s'il est disponible. Pour forcer APT &agrave; n'utiliser aucun fichier de traduction, il est n&eacute;cessaire d'utiliser le r&eacute;glage
Acquire::Languages=none. La valeur &laquo;&nbsp;none&nbsp;&raquo; a une signification sp&eacute;ciale et indique de ne rechercher aucun fichier
Translation. Cela indique &agrave; APT de t&eacute;l&eacute;charger ces traductions, sans n&eacute;cessairement les utiliser sauf si la variable d'environnement indique ces langues. Ainsi, dans l'exemple qui suit, l'ordre utilis&eacute; sera &laquo;&nbsp;en, fr&nbsp;&raquo; si dans un environnement configur&eacute; pour l'anglais et &laquo;&nbsp;fr, en&nbsp;&raquo; pour un environnement configur&eacute; en fran&ccedil;ais. Les fichiers pour l'allemand seront &eacute;galement t&eacute;l&eacute;charg&eacute;s mais ne sont utilis&eacute;s que dans un environnement configur&eacute; pour l'allemand. Dans ce dernier cas, l'ordre est alors &laquo;&nbsp;de, fr, en&nbsp;&raquo;.
<P>
<DL COMPACT><DT id="46"><DD>



<PRE>
Acquire::Languages { &quot;environment&quot;; &quot;fr&quot;; &quot;en&quot;; &quot;none&quot;; &quot;de&quot;; };
</PRE>

</DL>




<P>
Note&nbsp;: afin d'&eacute;viter des probl&egrave;mes lorsqu'APT est ex&eacute;cut&eacute; dans diff&eacute;rents environnements (p.&nbsp;ex. par diff&eacute;rents utilisateurs ou diff&eacute;rents programmes), tous les fichiers &laquo;&nbsp;Translation&nbsp;&raquo;qui sont trouv&eacute;s dans
/var/lib/apt/lists/
seront ajout&eacute;s &agrave; la fin de la liste (apr&egrave;s un &laquo;&nbsp;none&nbsp;&raquo; implicite).
</DL>

<P>

<B>ForceIPv4</B>
<DL COMPACT><DT id="47"><DD>
Utilisation impos&eacute;e du protocole IPv4 lors des t&eacute;l&eacute;chargements.
</DL>

<P>

<B>ForceIPv6</B>
<DL COMPACT><DT id="48"><DD>
Utilisation impos&eacute;e du protocole IPv6 lors des t&eacute;l&eacute;chargements.
</DL>

<P>

<B>MaxReleaseFileSize</B>
<DL COMPACT><DT id="49"><DD>
La taille maximale des fichiers Release/Release.gpg/InRelease. La taille par d&eacute;faut est 10&nbsp;Mo.
</DL>

<P>

<B>EnableSrvRecords</B>
<DL COMPACT><DT id="50"><DD>
Cette option v&eacute;rifie si APT utilisera l'entr&eacute;e de serveur DNS SRV telle que d&eacute;finie dans la RFC&nbsp;2782 pour choisir un serveur alternatif auquel se connecter. La valeur par d&eacute;faut est &laquo;&nbsp;true&nbsp;&raquo;.
</DL>

<P>

<B>AllowInsecureRepositories</B>
<DL COMPACT><DT id="51"><DD>
Autoriser les op&eacute;rations de mise &agrave; jour &agrave; charger des fichiers de donn&eacute;es &agrave; partir de d&eacute;p&ocirc;ts sans informations de s&eacute;curit&eacute; suffisantes. La valeur par d&eacute;faut est &laquo;&nbsp;false&nbsp;&raquo;. Le concept, les implications ainsi que les alternatives sont d&eacute;taill&eacute;s dans
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>AllowWeakRepositories</B>
<DL COMPACT><DT id="52"><DD>
Autoriser les op&eacute;rations de mise &agrave; jour &agrave; charger des fichiers de donn&eacute;es &agrave; partir de d&eacute;p&ocirc;ts qui fournissent des informations de s&eacute;curit&eacute;, mais qui ne sont plus consid&eacute;r&eacute;s comme suffisamment robustes sur le plan de la cryptographie. La valeur par d&eacute;faut est &laquo;&nbsp;false&nbsp;&raquo;. Le concept, les implications ainsi que les alternatives sont d&eacute;taill&eacute;s dans
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>AllowDowngradeToInsecureRepositories</B>
<DL COMPACT><DT id="53"><DD>
Permettre qu'un d&eacute;p&ocirc;t qui &eacute;tait auparavant sign&eacute; par pgp devienne non sign&eacute; durant l'op&eacute;ration de la mise &agrave; jour. Quand il n'y a pas de signature valable pour un ancien d&eacute;p&ocirc;t de confiance, APT refusera la mise &agrave; jour. Cette option peut &ecirc;tre utilis&eacute;e pour contourner cette protection. Vous ne souhaiterez presque certainement jamais activer cette option. La valeur pas d&eacute;faut est &laquo;&nbsp;false&nbsp;&raquo;. Le concept, les implications ainsi que les alternatives sont d&eacute;taill&eacute;s dans
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>Changelogs::URI</B> champ d'action
<DL COMPACT><DT id="54"><DD>
La r&eacute;cup&eacute;ration des journaux des modifications n'est possible que si l'URI o&ugrave; les t&eacute;l&eacute;charger est connu. De pr&eacute;f&eacute;rence, le fichier Release l'indique dans un champ &laquo;&nbsp;Changelogs&nbsp;&raquo;. S'il n'est pas disponible, les champs Label ou Origine du fichier Release sont utilis&eacute;s pour v&eacute;rifier si les options
Acquire::Changelogs::URI::Label::<I>LABEL</I>
ou
Acquire::Changelogs::URI::Origin::<I>ORIGINE</I>
existent, et si c'est le cas, cette valeur est prise. La valeur dans le fichier Release peut &ecirc;tre contourn&eacute;e par
Acquire::Changelogs::URI::Override::Label::<I>LABEL</I>
ou
Acquire::Changelogs::URI::Override::Origin::<I>ORIGINE</I>. La valeur devrait &ecirc;tre un URI normal vers un fichier texte, &agrave; l'exception que les donn&eacute;es sp&eacute;cifiques du paquet sont remplac&eacute;es par le param&egrave;tre
@CHANGEPATH@. Sa valeur est la suivante&nbsp;: 1. si le paquet provient d'un composant (par exemple
main) il constitue la premi&egrave;re partie, sinon elle est omise&nbsp;; 2. est la premi&egrave;re lettre du nom du paquet source, sauf si le nom du paquet source commence par
lib
auquel cas les quatre premi&egrave;res lettres seront utilis&eacute;es&nbsp;; 3. le nom complet du paquet source&nbsp;; 4. le nom complet une fois de plus&nbsp;; 5. la version de la source. Les quatres premi&egrave;res parties (ou trois si le composant est absent) sont s&eacute;par&eacute;es par des barres obliques (&laquo;&nbsp;/&nbsp;&raquo;), et les deux derni&egrave;res sont s&eacute;par&eacute;es par un caract&egrave;re de soulignement (&laquo;&nbsp;_&nbsp;&raquo;). La valeur sp&eacute;ciale &laquo;&nbsp;no&nbsp;&raquo; est disponible pour indiquer que cette source ne peut &ecirc;tre utilis&eacute;e pour r&eacute;cup&eacute;rer les fichiers changelog. Dans ce cas, une autre source sera essay&eacute;e.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>CONFIGURATION SP&Eacute;CIFIQUE DEX&Eacute;CUTABLE</H2>

<P>

Particuli&egrave;rement avec l'introduction de l'ex&eacute;cutable
<B>apt</B>
il peut &ecirc;tre utile de configurer certaines options seulement pour un ex&eacute;cutable particulier dans la mesure ou m&ecirc;me des options qui semblent affecter seulement certains binaires telles que
<B>APT::Get::Show-Versions</B>
affectent
<B>apt-get</B>
autant qu'<B>apt</B>.
<P>

La configuration d'une option pour un ex&eacute;cutable particulier peut &ecirc;tre r&eacute;alis&eacute;e en r&eacute;glant l'option dans le champ d'action
<B>Binary::</B><B></B><I>ex&eacute;cutable-sp&eacute;cifique</I>. Affecter l'option
<B>APT::Get::Show-Versions</B>
&agrave;
<B>apt</B>
seulement peut &ecirc;tre fait, par exemple en configurant plut&ocirc;t
<B>Binary::apt::APT::Get::Show-Versions</B>.
<P>

Veuillez noter que comme cela est indiqu&eacute; dans la section DESCRIPTION plus haut, il n'est pas possible de configurer les options sp&eacute;cifiques aux ex&eacute;cutables en ligne de commande ni dans des fichiers de configuration charg&eacute;s par la ligne de commande.
<A NAME="lbAH">&nbsp;</A>
<H2>LES R&Eacute;PERTOIRES</H2>

<P>

Les r&eacute;pertoires de la section
Dir::State
concernent le syst&egrave;me local.
lists
est le r&eacute;pertoire o&ugrave; placer les listes de paquets t&eacute;l&eacute;charg&eacute;s et
status
est le nom du fichier d'&eacute;tat de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
preferences
concerne APT&nbsp;: c'est le nom du fichier
preferences.
Dir::State
contient le r&eacute;pertoire par d&eacute;faut pr&eacute;fix&eacute; &agrave; tous les sous-&eacute;l&eacute;ments, quand ceux-ci ne commencent pas par
/
ou
./.
<P>

Dir::Cache
contient les emplacements qui renseignent sur le cache local&nbsp;: par exemple, les deux caches de paquets
srcpkgcache
et
pkgcache, ainsi que l'endroit o&ugrave; sont plac&eacute;es les archives t&eacute;l&eacute;charg&eacute;es,
Dir::Cache::archives. On peut emp&ecirc;cher la cr&eacute;ation des caches en positionnant
pkgcache
ou
srcpkgcache
&agrave; la valeur
&quot;&quot;. Cela ralentit le d&eacute;marrage mais &eacute;conomise de l'espace disque. Il vaut mieux se passer du cache
pkgcache
plut&ocirc;t que se passer du cache
srcpkgcache. Comme pour
Dir::State, le r&eacute;pertoire par d&eacute;faut est contenu dans
Dir::Cache.
<P>

Dir::Etc
contient l'emplacement des fichiers de configuration,
sourcelist
indique l'emplacement de la liste de sources et
main
est le fichier de configuration par d&eacute;faut (le modifier n'a aucun effet, &agrave; moins qu'on ne le modifie avec le fichier de configuration indiqu&eacute; par la variable
<B>APT_CONFIG</B>).
<P>

Dir::Parts
lit, par ordre d'entr&eacute;e, tous les fragments de configuration dans le r&eacute;pertoire indiqu&eacute;. Ensuite, le fichier principal de configuration est charg&eacute;.
<P>

Les programmes binaires sont point&eacute;s par
Dir::Bin. L'emplacement des gestionnaires de m&eacute;thodes est indiqu&eacute; par
Dir::Bin::Methods&nbsp;;
gzip,
bzip2,
lzma,
dpkg,
apt-get,
dpkg-source,
dpkg-buildpackage
et
apt-cache
indiquent l'emplacement des programmes correspondants.
<P>

L'option de configuration
RootDir
a une signification particuli&egrave;re. Lorsqu'elle est d&eacute;finie, tous les chemins sont consid&eacute;r&eacute;s relativement &agrave;
RootDir,
<I>m&ecirc;me les chemins sp&eacute;cifi&eacute;s de mani&egrave;re absolue</I>. Ainsi par exemple si
RootDir
est d&eacute;fini comme
/tmp/staging, et que chemin du fichier d'&eacute;tat
Dir::State::status
est d&eacute;clar&eacute; comme
/var/lib/dpkg/status
alors ce fichier sera cherch&eacute; dans
/tmp/staging/var/lib/dpkg/status. Si vous souhaitez seulement pr&eacute;fixer des chemins relatifs, d&eacute;finissez plut&ocirc;t
Dir.
<P>

La liste
Ignore-Files-Silently
permet d'indiquer quels sont les fichiers qu'APT peut ignorer sans avertissement dans les r&eacute;pertoires contenant des fragments de configuration. Par d&eacute;faut, les fichiers qui se terminent par
.disabled,
~,
.bak
ou
.dpkg-[a-z]+
sont ignor&eacute;s. Comme cela est visible dans le dernier &eacute;l&eacute;ment de cette liste, il est possible d'utiliser la syntaxe des expressions rationnelles.
<A NAME="lbAI">&nbsp;</A>
<H2>APT ET DSELECT</H2>

<P>

Quand APT est utilis&eacute; comme une m&eacute;thode de
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1), plusieurs directives contr&ocirc;lent le comportement par d&eacute;faut. On les trouve dans la section
DSelect.
<P>

<B>Clean</B>
<DL COMPACT><DT id="55"><DD>
Mode de nettoyage du cache&nbsp;; cette variable peut prendre l'une des valeurs suivantes&nbsp;: &laquo;&nbsp;always&nbsp;&raquo;, &laquo;&nbsp;prompt&nbsp;&raquo;, &laquo;&nbsp;auto&nbsp;&raquo;, &laquo;&nbsp;pre-auto&nbsp;&raquo; et &laquo;&nbsp;never&nbsp;&raquo;. &laquo;&nbsp;always&nbsp;&raquo; et &laquo;&nbsp;prompt&nbsp;&raquo; suppriment tous les paquets du cache apr&egrave;s la mise &agrave; niveau&nbsp;; &laquo;&nbsp;prompt&nbsp;&raquo; (valeur par d&eacute;faut) les supprime apr&egrave;s une demande et &laquo;&nbsp;auto&nbsp;&raquo; ne supprime que les archives qui ne peuvent plus &ecirc;tre t&eacute;l&eacute;charg&eacute;es (remplac&eacute;es, par exemple, par une nouvelle version). &laquo;&nbsp;pre-auto&nbsp;&raquo; les supprime avant de r&eacute;cup&eacute;rer de nouveaux paquets.
</DL>

<P>

<B>options</B>
<DL COMPACT><DT id="56"><DD>
Le contenu de cette variable est pass&eacute; comme options de ligne de commande &agrave;
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
lors de la phase d'installation.
</DL>

<P>

<B>Updateoptions</B>
<DL COMPACT><DT id="57"><DD>
Le contenu de cette variable est pass&eacute; comme options de ligne de commande &agrave;
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
lors de la phase de mise &agrave; jour.
</DL>

<P>

<B>PromptAfterUpdate</B>
<DL COMPACT><DT id="58"><DD>
Si cette option est &laquo;&nbsp;true&nbsp;&raquo;, l'op&eacute;ration [U]pdate de
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
interroge toujours l'utilisateur avant de continuer. Par d&eacute;faut, ce n'est qu'en cas d'erreur que l'on propose &agrave; l'utilisateur d'intervenir.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>M&Eacute;THODE DAPPEL DE <A HREF="/cgi-bin/man/man2html?1+DPKG">DPKG</A>(1) PAR APT</H2>

<P>

Plusieurs directives de configuration contr&ocirc;lent la mani&egrave;re dont APT invoque
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)&nbsp;: elles figurent dans la section
DPkg.
<P>

<B>options</B>
<DL COMPACT><DT id="59"><DD>
Il s'agit d'une liste d'options &agrave; passer &agrave;
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Les options doivent &ecirc;tre d&eacute;clar&eacute;es en utilisant la notation de liste et chaque &eacute;l&eacute;ment de la liste est pass&eacute; comme un seul param&egrave;tre &agrave;
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>

<B>Path</B>
<DL COMPACT><DT id="60"><DD>
Il s'agit d'une cha&icirc;ne qui d&eacute;finit la variable d'environnement
<B>PATH</B>
utilis&eacute;e lors de l'ex&eacute;cution de dpkg. Elle peut &ecirc;tre d&eacute;finie &agrave; n'importe quelle valeur valable pour cette variable d'environnement ou &ecirc;tre une cha&icirc;ne vide, dans ce cas la variable n'est pas modifi&eacute;e.
</DL>

<P>

<B>Pre-Invoke</B>, <B>Post-Invoke</B>
<DL COMPACT><DT id="61"><DD>
Il s'agit d'une liste de commandes shell &agrave; ex&eacute;cuter avant ou apr&egrave;s l'appel de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Tout comme pour
Options, on doit utiliser la notation de liste. Les commandes sont appel&eacute;es dans l'ordre, en utilisant
/bin/sh&nbsp;: APT s'arr&ecirc;te d&egrave;s que l'une d'elles &eacute;choue.
</DL>

<P>

<B>Pre-Install-Pkgs</B>
<DL COMPACT><DT id="62"><DD>
Il s'agit d'une liste de commandes shell &agrave; ex&eacute;cuter avant d'appeler
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Tout comme pour
Options, on doit utiliser la notation de liste. Les commandes sont appel&eacute;es dans l'ordre, en utilisant
/bin/sh&nbsp;: APT s'arr&ecirc;te d&egrave;s que l'une d'elles &eacute;choue. APT transmet aux commandes les noms de tous les fichiers .deb qu'il va installer, &agrave; raison d'un par ligne sur le descripteur de fichier demand&eacute;, par d&eacute;faut sur l'entr&eacute;e standard.
<P>
La version&nbsp;2 de ce protocole envoie plus d'informations &agrave; travers le descripteur du fichier requis&nbsp;: une ligne avec le texte
VERSION&nbsp;2, l'espace de configuration d'APT et une liste d'actions de paquet avec le nom de fichier et l'information de version.
<P>
Chaque ligne de directive de configuration a la forme
cl&eacute;=valeur. Les caract&egrave;res sp&eacute;ciaux (signes &eacute;gal, fin de ligne, caract&egrave;res non imprimables, guillemets et signe pourcentage dans
cl&eacute;
et fin de ligne, caract&egrave;res non imprimables et signe pourcentage dans
valeur) sont %-encod&eacute;s (encodage URL). Les listes sont repr&eacute;sent&eacute;s par des lignes
cl&eacute;::=valeur
multiples avec la m&ecirc;me cl&eacute;. Les sections de la configuration se terminent par une ligne vide.
<P>
Les lignes d'action de paquet consistent en cinq champs dans la version&nbsp;2&nbsp;: le nom du paquet (sans qualification d'architecture, m&ecirc;me si c'est une architecture suppl&eacute;mentaire -&nbsp;&laquo;&nbsp;foreign&nbsp;&raquo;), la version ancienne, la direction du changement de version (&lt; pour les mises &agrave; niveau, &gt; pour les retours en arri&egrave;re, = pour pas de modification), la nouvelle version, l'action. Les champs versions sont &laquo;&nbsp;-&nbsp;&raquo; pour pas de version du tout (par exemple lors de la premi&egrave;re installation d'un paquet&nbsp;; pas de version est trait&eacute; comme ant&eacute;rieur &agrave; n'importe quelle version r&eacute;elle, ainsi c'est une mise &agrave; jour, indiqu&eacute;e comme
- &lt; 1.23.4). Le champ action est &laquo;&nbsp;**CONFIGURE**&nbsp;&raquo; si le paquet est en cours de configuration, &laquo;&nbsp;**REMOVE**&nbsp;&raquo; s'il est en cours de suppression, ou bien le nom d'un fichier .deb s'il est en cours de d&eacute;paquetage.
<P>
Dans la Version&nbsp;3, apr&egrave;s chaque champ version, se trouve l'architecture de cette version qui est &laquo;&nbsp;-&nbsp;&raquo; s'il n'y a pas de version, puis un champ montrant le type MultiArch &laquo;&nbsp;same&nbsp;&raquo;, &laquo;&nbsp;foreign&nbsp;&raquo;, &laquo;&nbsp;allowed&nbsp;&raquo; ou &laquo;&nbsp;none&nbsp;&raquo;. Veuillez noter que &laquo;&nbsp;none&nbsp;&raquo; est un nom de type incorrect qui est juste conserv&eacute; pour des raisons de compatibilit&eacute;, il devrait &ecirc;tre lu comme &laquo;&nbsp;no&nbsp;&raquo; et les utilisateurs sont encourag&eacute;s &agrave; prendre en charge les deux.
<P>
La version du protocole qu'il faut utiliser pour la commande
<I>cmd</I>
peut &ecirc;tre choisie en r&eacute;glant
DPkg::Tools::options::<I>cmd</I>::Version
en cons&eacute;quence, la version par d&eacute;faut &eacute;tant la premi&egrave;re. Si APT ne g&egrave;re pas la version demand&eacute;e, il enverra les informations dans la version la plus haute qu'il g&egrave;re.
<P>
Le descripteur de fichier &agrave; utiliser pour l'envoi des informations peut &ecirc;tre demand&eacute; avec l'option
DPkg::Tools::options::<I>cmd</I>::InfoFD
qui est par d&eacute;faut
0
comme entr&eacute;e standard&nbsp;; l'option est disponible depuis la version&nbsp;0.9.11. La prise en charge de l'option peut &ecirc;tre d&eacute;tect&eacute;e en regardant la variable d'environnement
<B>APT_HOOK_INFO_FD</B>
qui contient comme confirmation le num&eacute;ro du descripteur de fichier utilis&eacute;.
</DL>

<P>

<B>Run-Directory</B>
<DL COMPACT><DT id="63"><DD>
APT se place dans ce r&eacute;pertoire avant d'appeler
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)&nbsp;; par d&eacute;faut, c'est le r&eacute;pertoire
/.
</DL>

<P>

<B>Build-options</B>
<DL COMPACT><DT id="64"><DD>
Ces options sont pass&eacute;es &agrave;
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)
lors de la compilation des paquets&nbsp;; par d&eacute;faut la signature est d&eacute;sactiv&eacute;e et tous les binaires sont cr&eacute;&eacute;s.
</DL>

<P>

<B>DPkg::ConfigurePending</B>
<DL COMPACT><DT id="65"><DD>
Si cette option est choisie, APT lancera
<B>dpkg --configure --pending</B>
pour laisser
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
g&eacute;rer les configurations de paquets et les actions diff&eacute;r&eacute;es. Cette option est automatiquement activ&eacute;e. Il peut par contre &ecirc;tre utile de la d&eacute;sactiver pour lancer APT plusieurs fois successives, par exemple quand il est utilis&eacute; depuis un outil d'installation. Dans ce cas, seul le dernier de tous les appels successifs peut conserver l'option active.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>OPTIONS &laquo;&nbsp;PERIODIC&nbsp;&raquo; ET &laquo;&nbsp;ARCHIVE&nbsp;&raquo;</H2>

<P>

Les groupes d'options
APT::Periodic
et
APT::Archive
configurent les comportements p&eacute;riodiques r&eacute;alis&eacute;s par le script
/usr/lib/apt/apt.systemd.daily, lanc&eacute; quotidiennement.
<A NAME="lbAL">&nbsp;</A>
<H2>LES OPTIONS DE D&Eacute;BOGAGE</H2>

<P>

Les options de la section
Debug::
servent soit &agrave; provoquer l'affichage d'informations de d&eacute;bogage sur la sortie d'erreur standard du programme qui utilise les biblioth&egrave;ques APT, soit &agrave; activer des modes de fonctionnement sp&eacute;ciaux qui sont principalement utiles pour d&eacute;boguer le comportement de
APT. La plupart de ces options n'ont pas d'int&eacute;r&ecirc;t pour un utilisateur normal, mais certaines peuvent tout de m&ecirc;me &ecirc;tre utiles&nbsp;:
<P>
<DL COMPACT><DT id="66"><DD>
&bull;


Debug::pkgProblemResolver
affiche d'int&eacute;ressantes informations sur les d&eacute;cisions prises par les commandes
dist-upgrade, upgrade, install, remove et purge.
</DL>

<P>
<DL COMPACT><DT id="67"><DD>
&bull;


Debug::NoLocking
d&eacute;sactive le verrouillage de fichier de mani&egrave;re &agrave; ce qu'APT puisse effectuer quelques op&eacute;rations (telles que
apt-get -s install) sans avoir les privil&egrave;ges du superutilisateur.
</DL>

<P>
<DL COMPACT><DT id="68"><DD>
&bull;


Debug::pkgDPkgPM
affiche la ligne de commande &agrave; chaque appel de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>
<DL COMPACT><DT id="69"><DD>
&bull;


<P>
Debug::IdentCdrom
d&eacute;sactive l'inclusion de donn&eacute;es de type statfs dans les identifiants de CD.
</DL>

<P>

Liste compl&egrave;te des options de d&eacute;bogage de APT&nbsp;:
<P>

<B>Debug::Acquire::cdrom</B>
<DL COMPACT><DT id="70"><DD>
Affiche les informations concernant les sources de type
cdrom://
</DL>

<P>

<B>Debug::Acquire::ftp</B>
<DL COMPACT><DT id="71"><DD>
Affiche les informations concernant le t&eacute;l&eacute;chargement de paquets par FTP.
</DL>

<P>

<B>Debug::Acquire::http</B>
<DL COMPACT><DT id="72"><DD>
Affiche les informations concernant le t&eacute;l&eacute;chargement de paquets par HTTP.
</DL>

<P>

<B>Debug::Acquire::https</B>
<DL COMPACT><DT id="73"><DD>
Print information related to downloading packages using HTTPS.
</DL>

<P>

<B>Debug::Acquire::gpgv</B>
<DL COMPACT><DT id="74"><DD>
Affiche les informations relatives &agrave; la v&eacute;rification de signatures cryptographiques avec
gpg.
</DL>

<P>

<B>Debug::aptcdrom</B>
<DL COMPACT><DT id="75"><DD>
Affiche des informations concernant l'acc&egrave;s aux collections de paquets stock&eacute;es sur CD.
</DL>

<P>

<B>Debug::BuildDeps</B>
<DL COMPACT><DT id="76"><DD>
D&eacute;crit le processus de r&eacute;solution des d&eacute;pendances pour la construction de paquets source (&nbsp;&laquo;&nbsp;build-dependencies&nbsp;&raquo;&nbsp;) par
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8).
</DL>

<P>

<B>Debug::Hashes</B>
<DL COMPACT><DT id="77"><DD>
Affiche toutes les cl&eacute;s de hachage cryptographiques cr&eacute;&eacute;es par les librairies d'apt.
</DL>

<P>

<B>Debug::IdentCDROM</B>
<DL COMPACT><DT id="78"><DD>
D&eacute;sactive l'inclusion des donn&eacute;es de type
statfs
pour la g&eacute;n&eacute;ration des identifiants de CD, c'est-&agrave;-dire le nombre de blocs libres et utilis&eacute;s sur le syst&egrave;me de fichier du CD.
</DL>

<P>

<B>Debug::NoLocking</B>
<DL COMPACT><DT id="79"><DD>
D&eacute;sactive le verrouillage de fichiers. Cela permet par exemple de lancer deux instances de
&laquo;&nbsp;apt-get update&nbsp;&raquo;
en m&ecirc;me temps.
</DL>

<P>

<B>Debug::pkgAcquire</B>
<DL COMPACT><DT id="80"><DD>
Trace les ajouts et suppressions d'&eacute;l&eacute;ments de la queue globale de t&eacute;l&eacute;chargement.
</DL>

<P>

<B>Debug::pkgAcquire::Auth</B>
<DL COMPACT><DT id="81"><DD>
Affiche les d&eacute;tails de la v&eacute;rification des sommes de contr&ocirc;le et des signatures cryptographiques des fichiers t&eacute;l&eacute;charg&eacute;s, ainsi que les erreurs &eacute;ventuelles.
</DL>

<P>

<B>Debug::pkgAcquire::Diffs</B>
<DL COMPACT><DT id="82"><DD>
Affiche les informations de t&eacute;l&eacute;chargement et de prise en compte des fichiers diff&eacute;rentiels des indexes de paquets, ainsi que les erreurs &eacute;ventuelles.
</DL>

<P>

<B>Debug::pkgAcquire::RRed</B>
<DL COMPACT><DT id="83"><DD>
Affiche les d&eacute;tails de l'application des fichiers de diff&eacute;rences aux listes de paquets d'APT quand ces fichiers de diff&eacute;rences sont t&eacute;l&eacute;charg&eacute;s &agrave; la place des fichiers complets.
</DL>

<P>

<B>Debug::pkgAcquire::Worker</B>
<DL COMPACT><DT id="84"><DD>
Affiche toutes les interactions avec les processus enfants qui se chargent effectivement des t&eacute;l&eacute;chargements.
</DL>

<P>

<B>Debug::pkgAutoRemove</B>
<DL COMPACT><DT id="85"><DD>
Affiche les changements concernant le marquage des paquets comme install&eacute;s automatiquement, et la suppression des paquets inutiles.
</DL>

<P>

<B>Debug::pkgDepCache::AutoInstall</B>
<DL COMPACT><DT id="86"><DD>
Cr&eacute;e les informations de d&eacute;bogage d&eacute;crivant quels paquets sont install&eacute;s automatiquement pour satisfaire les d&eacute;pendances. Cela concerne la passe initiale d'installation automatique effectu&eacute;e par exemple par
apt-get install
et pas le syst&egrave;me de r&eacute;solution de d&eacute;pendances complet de APT&nbsp;; voir
Debug::pkgProblemResolver
pour ce dernier.
</DL>

<P>

<B>Debug::pkgDepCache::Marker</B>
<DL COMPACT><DT id="87"><DD>
Cr&eacute;e les informations de d&eacute;bogage d&eacute;crivant quels paquets sont gard&eacute;s/install&eacute;s/supprim&eacute;s pendant le travail de l'outil de r&eacute;solution de probl&egrave;mes. Chaque ajout ou suppression peut impliquer des actions suppl&eacute;mentaires&nbsp;;&nbsp;elles sont alors indiqu&eacute;es avec une indentation de deux espaces de plus que l'action qui les a d&eacute;clench&eacute;es. Le format de chaque ligne est
MarkKeep,
MarkDelete
ou
MarkInstall
suivi de
nom-paquet &lt;a.b.c -&gt; d.e.f | x.y.z&gt; (section)
o&ugrave;
a.b.c
est la version actuelle du paquet,
d.e.f
la version devant &ecirc;tre install&eacute;e et
x.y.z
une version plus r&eacute;cente qui n'est pas pr&eacute;vue pour &ecirc;tre install&eacute;e (&agrave; cause d'un score plus faible). Ces deux derniers &eacute;l&eacute;ments peuvent ne pas &ecirc;tre mentionn&eacute;s s'ils ne sont pas pertinents o&ugrave; lorsque ils sont identiques &agrave; la version install&eacute;e.
section
est le nom de la section o&ugrave; figure le paquet.automatiquement pour satisfaire les d&eacute;pendances. Cela concerne la passe initiale d'installation automatique effectu&eacute;e par exemple par
apt-get install
et pas le syst&egrave;me de r&eacute;solution de d&eacute;pendances complet de APT&nbsp;; voir
Debug::pkgProblemResolver
pour ce dernier.
</DL>

<P>

<B>Debug::pkgDPkgPM</B>
<DL COMPACT><DT id="88"><DD>
Affiche la commande exacte d'invocation de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
&agrave; chaque appel&nbsp;; les param&egrave;tres sont s&eacute;par&eacute;s par des espaces.
</DL>

<P>

<B>Debug::pkgDPkgProgressReporting</B>
<DL COMPACT><DT id="89"><DD>
Affiche l'ensemble des informations re&ccedil;ues de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
par l'interm&eacute;diaire du descripteur de fichier d'&eacute;tat, et les &eacute;ventuelles erreurs d'analyse de ce fichier.
</DL>

<P>

<B>Debug::pkgOrderList</B>
<DL COMPACT><DT id="90"><DD>
Affiche les &eacute;tapes de l'algorithme utilis&eacute; pour choisir l'ordre dans lequel
apt
passe les paquets &agrave;
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>

<B>Debug::pkgPackageManager</B>
<DL COMPACT><DT id="91"><DD>
Affiche le d&eacute;tail des op&eacute;rations li&eacute;es &agrave; l'invocation de
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>

<B>Debug::pkgPolicy</B>
<DL COMPACT><DT id="92"><DD>
Affiche, au lancement, la priorit&eacute; de chaque liste de paquets.
</DL>

<P>

<B>Debug::pkgProblemResolver</B>
<DL COMPACT><DT id="93"><DD>
Affiche la trace d'ex&eacute;cution du syst&egrave;me de r&eacute;solution de d&eacute;pendances (ne concerne que les cas o&ugrave; un probl&egrave;me de d&eacute;pendances complexe se pr&eacute;sente).
</DL>

<P>

<B>Debug::pkgProblemResolver::ShowScores</B>
<DL COMPACT><DT id="94"><DD>
Affiche la liste de tous les paquets install&eacute;s avec leur score calcul&eacute; par l'outil de r&eacute;solution de probl&egrave;mes. La description du paquet est celle qui est d&eacute;crite dans
Debug::pkgDepCache::Marker.
</DL>

<P>

<B>Debug::sourceList</B>
<DL COMPACT><DT id="95"><DD>
Affiche les fournisseurs d&eacute;clar&eacute;s dans le fichier
/etc/apt/vendors.list.
</DL>

<P>

<B>Debug::RunScripts</B>
<DL COMPACT><DT id="96"><DD>
Affiche les commandes externes qui sont appel&eacute;s par le point d'entr&eacute;e apt. Cela inclut par exemple les options de configuration
DPkg::{Pre,Post}-Invoke
ou
APT::Update::{Pre,Post}-Invoke.
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>EXEMPLES</H2>

<P>

Le fichier
/usr/share/doc/apt/examples/configure-index.gz
contient un mod&egrave;le de fichier montrant des exemples pour toutes les options existantes.
<A NAME="lbAN">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/apt/apt.conf
<DL COMPACT><DT id="97"><DD>
Fichier de configuration d'APT. &Eacute;l&eacute;ment de configuration :
Dir::Etc::Main.
</DL>

<P>

/etc/apt/apt.conf.d/
<DL COMPACT><DT id="98"><DD>
Fragments du fichier de configuration d'APT. &Eacute;l&eacute;ment de configuration&nbsp;:
Dir::Etc::Parts.
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<P>
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
<A NAME="lbAP">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAQ">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAR">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="99"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="100"><DD>
</DL>

<P>

<B>Daniel Burrows</B> &lt;<A HREF="mailto:dburrows@debian.org">dburrows@debian.org</A>&gt;
<DL COMPACT><DT id="101"><DD>
Documentation initiale de Debug::*.
</DL>

<A NAME="lbAS">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="102"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="103"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="104"><A HREF="#lbAB">NOM</A><DD>
<DT id="105"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="106"><A HREF="#lbAD">SYNTAXE</A><DD>
<DT id="107"><A HREF="#lbAE">LE GROUPE APT</A><DD>
<DT id="108"><A HREF="#lbAF">LE GROUPE ACQUIRE</A><DD>
<DT id="109"><A HREF="#lbAG">CONFIGURATION SP&Eacute;CIFIQUE DEX&Eacute;CUTABLE</A><DD>
<DT id="110"><A HREF="#lbAH">LES R&Eacute;PERTOIRES</A><DD>
<DT id="111"><A HREF="#lbAI">APT ET DSELECT</A><DD>
<DT id="112"><A HREF="#lbAJ">M&Eacute;THODE DAPPEL DE DPKG(1) PAR APT</A><DD>
<DT id="113"><A HREF="#lbAK">OPTIONS &laquo;&nbsp;PERIODIC&nbsp;&raquo; ET &laquo;&nbsp;ARCHIVE&nbsp;&raquo;</A><DD>
<DT id="114"><A HREF="#lbAL">LES OPTIONS DE D&Eacute;BOGAGE</A><DD>
<DT id="115"><A HREF="#lbAM">EXEMPLES</A><DD>
<DT id="116"><A HREF="#lbAN">FICHIERS</A><DD>
<DT id="117"><A HREF="#lbAO">VOIR AUSSI</A><DD>
<DT id="118"><A HREF="#lbAP">BOGUES</A><DD>
<DT id="119"><A HREF="#lbAQ">TRADUCTEURS</A><DD>
<DT id="120"><A HREF="#lbAR">AUTEURS</A><DD>
<DT id="121"><A HREF="#lbAS">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
