
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_PREFERENCES</TITLE>
</HEAD><BODY>
<H1>APT_PREFERENCES</H1>
Section: APT (5)<BR>Updated: 17&nbsp;janvier&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt_preferences - Fichier de contr&ocirc;le des pr&eacute;f&eacute;rences pour APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Le fichier d'APT,
/etc/apt/preferences
et les fichiers fragments situ&eacute;s dans le dossier
/etc/apt/preferences.d/, peuvent &ecirc;tre utilis&eacute;s pour choisir la version des paquets que l'on veut installer.
<P>

Quand le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
contient des r&eacute;f&eacute;rences &agrave; plusieurs distributions (par exemple,
stable
et
testing), plusieurs versions d'un paquet peuvent &ecirc;tre install&eacute;es. APT affecte une priorit&eacute; &agrave; chaque version disponible. La commande
<B>apt-get</B>, tenant compte des contraintes de d&eacute;pendance, installe la version qui poss&egrave;de la priorit&eacute; la plus haute. Le fichier
preferences
annule les priorit&eacute;s assign&eacute;es par d&eacute;faut aux versions des paquets&nbsp;: ainsi l'utilisateur peut choisir la version qu'il veut installer.
<P>

Si le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
contient, pour une m&ecirc;me distribution, des r&eacute;f&eacute;rences &agrave; plusieurs sites de t&eacute;l&eacute;chargement, il peut exister plusieurs exemplaires de la m&ecirc;me version d'un paquet. Dans ce cas,
<B>apt-get</B>
t&eacute;l&eacute;charge l'exemplaire qui appara&icirc;t en premier dans le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). Le fichier
preferences
n'influe pas sur le choix des exemplaires, seulement sur le choix de la version.
<P>

Les pr&eacute;f&eacute;rences sont un outil puissant pour les administrateurs syst&egrave;me mais peuvent devenir leur pire cauchemar si elles sont utilis&eacute;es sans pr&eacute;cautions. APT ne remettra pas en doute les r&eacute;glages choisis. Des valeurs erron&eacute;es pourront alors conduire &agrave; des paquets non installables ou &agrave; des d&eacute;cisions incorrectes lors de la mise &agrave; jour des paquets. Des probl&egrave;mes suppl&eacute;mentaires peuvent survenir si des distributions multiples sont m&eacute;lang&eacute;es sans une bonne compr&eacute;hension des paragraphes qui suivent.
<P>

Veuillez noter que les fichiers du r&eacute;pertoire
/etc/apt/preferences.d
sont analys&eacute;s par ordre alphanum&eacute;rique ascendant, doivent avoir l'extension &quot;pref&quot; ou aucune extension et ne peuvent contenir que des caract&egrave;res alphanum&eacute;riques, des tirets (-), des caract&egrave;res de soulignement (_) et des points (.). Dans le cas contraire, APT affichera un avertissement indiquant qu'il a ignor&eacute; un fichier si celui-ci ne correspond par &agrave; un motif d&eacute;fini dans
Dir::Ignore-Files-Silently
(les fichiers correspondant &agrave; cette variable de configuration &eacute;tant, eux, ignor&eacute;s silencieusemennt).
<A NAME="lbAD">&nbsp;</A>
<H3>Priorit&eacute;s affect&eacute;es par d&eacute;faut</H3>

<P>

Quand le fichier des pr&eacute;f&eacute;rences n'existe pas, ou quand aucune entr&eacute;e de ce fichier ne s'applique &agrave; une version pr&eacute;cise, la priorit&eacute; affect&eacute;e &agrave; cette version est la priorit&eacute; de la distribution &agrave; laquelle elle appartient. On peut distinguer une distribution et lui donner une priorit&eacute; plus haute que celle des autres distributions&nbsp;: on l'appelle la distribution par d&eacute;faut ou &laquo;&nbsp;target release&nbsp;&raquo; et elle peut &ecirc;tre d&eacute;finie sur la ligne de commande de
<B>apt-get</B>
ou dans le fichier de configuration d'APT,
/etc/apt/apt.conf. Par exemple&nbsp;:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<B>apt-get install -t testing </B><B></B><I>paquet</I>
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
APT::Default-Release &quot;stable&quot;;
</PRE>

</DL>




<P>

Quand une distribution par d&eacute;faut a &eacute;t&eacute; indiqu&eacute;e, APT utilise l'algorithme suivant pour d&eacute;terminer la priorit&eacute; des versions d'un paquet&nbsp;:
<P>

priorit&eacute; 1
<DL COMPACT><DT id="3"><DD>
pour les versions issues d'archives dont le fichier
Release
comporte la mention &laquo;&nbsp;NotAutomatic: yes&nbsp;&raquo; mais
<I>pas</I>
&laquo;&nbsp;ButAutomaticUpgrades: yes&nbsp;&raquo; comme l'archive
experimental
de Debian.
</DL>

<P>

une priorit&eacute; &eacute;gale &agrave; 100
<DL COMPACT><DT id="4"><DD>
pour les versions issues d'archives dont le fichier
Release
comporte la mention &laquo;&nbsp;NotAutomatic: yes&nbsp;&raquo; et &laquo;&nbsp;ButAutomaticUpgrades: yes&nbsp;&raquo; comme l'archive des r&eacute;troportages de Debian depuis
squeeze-backports.
</DL>

<P>

une priorit&eacute; &eacute;gale &agrave;&nbsp;500
<DL COMPACT><DT id="5"><DD>
est affect&eacute;e aux versions qui n'appartiennent pas &agrave; la distribution par d&eacute;faut.
</DL>

<P>

une priorit&eacute; &eacute;gale &agrave;&nbsp;990
<DL COMPACT><DT id="6"><DD>
est affect&eacute;e aux versions qui appartiennent &agrave; la distribution par d&eacute;faut.
</DL>

La priorit&eacute; la plus &eacute;lev&eacute;e dont la description correspond &agrave; la version est affect&eacute;e &agrave; la version.
<P>

Quand aucune distribution par d&eacute;faut n'a &eacute;t&eacute; indiqu&eacute;e, APT affecte simplement une priorit&eacute; &eacute;gale &agrave;&nbsp;100 &agrave; toute version install&eacute;e d'un paquet et une priorit&eacute; &eacute;gale &agrave;&nbsp;500 &agrave; tout version non install&eacute;e. Cela &agrave; l'exception des versions issues des archives qui ont la mention &laquo;&nbsp;NotAutomatic: yes&nbsp;&raquo; dans leur fichier
Release, qui auront alors une priorit&eacute; &eacute;gale &agrave;&nbsp;1 ou &agrave;&nbsp;100 si elles sont &eacute;galement marqu&eacute;es avec &laquo;&nbsp;ButAutomaticUpgrades: yes&nbsp;&raquo;.
<P>

Puis APT applique les r&egrave;gles suivantes pour d&eacute;terminer la version du paquet qu'il faut installer (par ordre de priorit&eacute;)&nbsp;:
<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Ne jamais revenir en arri&egrave;re, sauf si la priorit&eacute; d'une version disponible d&eacute;passe&nbsp;1000. &laquo;&nbsp;Revenir en arri&egrave;re&nbsp;&raquo; signifie installer une version moins r&eacute;cente que la version install&eacute;e. Il faut noter qu'aucune des priorit&eacute;s par d&eacute;faut n'exc&egrave;de&nbsp;1000&nbsp;; de telles valeurs ne peuvent &ecirc;tre d&eacute;finies que dans le fichier des pr&eacute;f&eacute;rences. Notez aussi qu'il est risqu&eacute; de revenir en arri&egrave;re.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Installer la version qui poss&egrave;de la priorit&eacute; la plus haute.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Quand deux (ou plus) versions ont la m&ecirc;me priorit&eacute;, installer la version la plus r&eacute;cente (c.-&agrave;-d. celle dont le num&eacute;ro de version est le plus grand).
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Quand deux (ou plus) versions ont la m&ecirc;me priorit&eacute; et le m&ecirc;me num&eacute;ro de version, mais soit les paquets diff&egrave;rent par certaines m&eacute;tadonn&eacute;es, soit l'option
--reinstall
a &eacute;t&eacute; donn&eacute;e, installer la version qui n'est pas install&eacute;e.
</DL>

<P>

En g&eacute;n&eacute;ral, la version install&eacute;e d'un paquet (priorit&eacute;&nbsp;100) n'est pas aussi r&eacute;cente que les versions disponibles dans les sources list&eacute;es dans le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
(priorit&eacute;&nbsp;500 ou&nbsp;990). Et donc le paquet sera mis &agrave; niveau avec la commande&nbsp;:
<B>apt-get install </B><B></B><I>paquet</I>
ou
<B>apt-get dist-upgrade</B>.
<P>

La version install&eacute;e d'un paquet peut &ecirc;tre - rarement -
<I>plus</I>
r&eacute;cente que tout autre version disponible. Les commandes
<B>apt-get install </B><B></B><I>paquet</I>
ou
<B>apt-get upgrade</B>
ne provoquent pas de retour en arri&egrave;re.
<P>

Parfois, la version install&eacute;e d'un paquet est plus r&eacute;cente que la version appartenant &agrave; la distribution par d&eacute;faut, mais moins r&eacute;cente que la version appartenant &agrave; une autre distribution. Une telle version sera mise &agrave; niveau par les commandes
<B>apt-get install </B><B></B><I>paquet</I>
ou
<B>apt-get upgrade</B>
car au moins
<I>l'une</I>
des versions disponibles poss&egrave;de une plus haute priorit&eacute; que celle de la version install&eacute;e.
<A NAME="lbAE">&nbsp;</A>
<H3>Cons&eacute;quences des pr&eacute;f&eacute;rences</H3>

<P>

Le fichier des pr&eacute;f&eacute;rences permet &agrave; l'administrateur syst&egrave;me de contr&ocirc;ler l'affectation des priorit&eacute;s. Ce fichier est constitu&eacute; d'une ou plusieurs entr&eacute;es s&eacute;par&eacute;es par des lignes blanches. Ces entr&eacute;es peuvent avoir deux formes, une forme particuli&egrave;re et une forme g&eacute;n&eacute;rale.
<P>
<DL COMPACT><DT id="11"><DD>
&bull;


La forme particuli&egrave;re affecte une priorit&eacute; (<I>Pin-Priority</I>) &agrave; un paquet pr&eacute;cis, &agrave; une version pr&eacute;cise ou &agrave; un intervalle sp&eacute;cifiant plusieurs versions. Par exemple, l'entr&eacute;e suivante affecte une priorit&eacute; haute &agrave; toutes les versions du paquet
perl
dont le num&eacute;ro de version commence par
5.20.
<P>
<DL COMPACT><DT id="12"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001
</PRE>

</DL>




</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


La forme g&eacute;n&eacute;rale affecte une priorit&eacute; &agrave; toutes les versions d'un paquet dans une distribution donn&eacute;e (c'est-&agrave;-dire, &agrave; toutes les versions d'un paquet qui sont list&eacute;es dans un fichier
Release), ou &agrave; toutes les versions d'un paquet provenant d'un site Internet identifi&eacute; par un nom compl&egrave;tement qualifi&eacute;.
<P>
Cette forme g&eacute;n&eacute;rale des entr&eacute;es du fichier des pr&eacute;f&eacute;rences s'applique seulement aux groupes de paquets. Par exemple, l'entr&eacute;e suivante affecte une priorit&eacute; haute &agrave; toutes les versions disponibles dans le site local.
<P>
<DL COMPACT><DT id="14"><DD>



<PRE>
Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Il est important de noter que le mot-cl&eacute; utilis&eacute; ici est &laquo;&nbsp;origin&nbsp;&raquo; qui peut servir &agrave; indiquer un nom d'h&ocirc;te. Dans l'exemple qui suit, une haute priorit&eacute; est donn&eacute;e &agrave; toutes les versions disponibles sur le serveur identifi&eacute; par le nom d'h&ocirc;te &laquo;&nbsp;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&nbsp;&raquo;.
<P>
<DL COMPACT><DT id="15"><DD>



<PRE>
Package: *
Pin: origin &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Veuillez noter que le mot-cl&eacute; utilis&eacute; ici,
origin, ne doit pas &ecirc;tre confondu avec l'Origine d'une distribution indiqu&eacute;e dans un fichier
Release. Ce qui suit l'&eacute;tiquette &laquo;&nbsp;Origin:&nbsp;&raquo; dans un fichier
Release
n'est pas une adresse Internet mais le nom d'un auteur ou d'un distributeur, comme &laquo;&nbsp;Debian&nbsp;&raquo; ou &laquo;&nbsp;Ximian&nbsp;&raquo;.
<P>
L'entr&eacute;e suivante affecte une priorit&eacute; basse &agrave; toutes les versions d'un paquet appartenant &agrave; toute distribution dont le nom d'&laquo;&nbsp;Archive&nbsp;&raquo; est
unstable.
<P>
<DL COMPACT><DT id="16"><DD>



<PRE>
Package: *
Pin: release a=unstable
Pin-Priority: 50
</PRE>

</DL>




<P>
L'entr&eacute;e suivante affecte une priorit&eacute; haute &agrave; toutes les versions d'un paquet appartenant &agrave; toute distribution dont le nom de code est
bullseye.
<P>
<DL COMPACT><DT id="17"><DD>



<PRE>
Package: *
Pin: release n=bullseye
Pin-Priority: 900
</PRE>

</DL>




<P>
L'entr&eacute;e suivante affecte une priorit&eacute; haute &agrave; toutes les versions d'un paquet appartenant &agrave; toute distribution dont le nom d'&laquo;&nbsp;Archive&nbsp;&raquo; est
stable
et dont le num&eacute;ro de &laquo;&nbsp;Version&nbsp;&raquo; est
10.
<P>
<DL COMPACT><DT id="18"><DD>



<PRE>
Package: *
Pin: release a=stable, v=10
Pin-Priority: 500
</PRE>

</DL>




</DL>

<P>
L'effet de l'op&eacute;rateur virgule est identique &agrave; un &laquo;&nbsp;and&nbsp;&raquo; logique&nbsp;: toutes les conditions doivent &ecirc;tre satisfaites pour que l'&eacute;pinglage corresponde. Il existe une exception&nbsp;: pour chaque type de condition (telles que deux conditions &laquo;&nbsp;a&nbsp;&raquo;), seule la derni&egrave;re condition est v&eacute;rifi&eacute;e.
<A NAME="lbAF">&nbsp;</A>
<H3>Expressions r&eacute;guli&egrave;res et syntaxe <A HREF="/cgi-bin/man/man2html?7+glob">glob</A>(7)</H3>

<P>

APT g&eacute;re &eacute;galement l'&eacute;pinglage (&laquo;&nbsp;pinning&nbsp;&raquo;) avec des expressions
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
et des expressions r&eacute;guli&egrave;res entour&eacute;es par des barres obliques. Par exemple, l'exemple qui suit affecte une priorit&eacute; de&nbsp;500 &agrave; tous les paquets d'experimental dont le nom commence par gnome (en tant qu'expression de type
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)) ou contient le mot kde (sous format d'une expression r&eacute;guli&egrave;re POSIX &eacute;tendue, entour&eacute;e de barres obliques).
<P>
<DL COMPACT><DT id="19"><DD>



<PRE>
Package: gnome* /kde/
Pin: release a=experimental
Pin-Priority: 500
</PRE>

</DL>




<P>

La r&egrave;gle pour ces expressions est qu'elles peuvent prendre place d&egrave;s que la cha&icirc;ne correspondante est trouv&eacute;e. Ainsi, l'&eacute;pinglage qui suit affecte une priorit&eacute; de 990 &agrave; tous les paquets d'une version de distribution commen&ccedil;ant par focal.
<P>
<DL COMPACT><DT id="20"><DD>



<PRE>
Package: *
Pin: release n=focal*
Pin-Priority: 990
</PRE>

</DL>




<P>

Si une expression r&eacute;guli&egrave;re est rencontr&eacute;e dans un champ
Package, le comportement sera celui qui aurait eu lieu si cette expression &eacute;tait remplac&eacute;e par la liste de tous les paquets auxquels elle correspond. Il n'est pas encore d&eacute;cid&eacute; si cela sera conserv&eacute; dans le futur&nbsp;:&nbsp;il est donc conseill&eacute; d'utiliser des &eacute;pinglages avec caract&egrave;res g&eacute;n&eacute;riques en premier afin qu'ils soient remplac&eacute;s par des &eacute;pinglages plus sp&eacute;cifiques. Le motif &laquo;&nbsp;*&nbsp;&raquo; dans un champ Package n'est pas consid&eacute;r&eacute; comme une expression
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
en soi.
<A NAME="lbAG">&nbsp;</A>
<H3>Pinning by source package</H3>

<P>

APT supports pinning by source packages. To pin by a source package, prepend &quot;src:&quot; to the package name.
<P>

For example, to pin all binaries produced by the apt source package of this APT's version to 990, you can do:
<P>
<DL COMPACT><DT id="21"><DD>



<PRE>
Package: src:apt
Pin: version 2.0.4
Pin-Priority: 990
</PRE>

</DL>




<P>

Source package pinning can be combined with regular expressions and glob patterns, and can also take a binary architecture.
<P>

For example, let's pin all binaries for all architectures produced by any source package containing apt in its name to 990:
<P>
<DL COMPACT><DT id="22"><DD>



<PRE>
Package: src:*apt*:any
Pin: version *
Pin-Priority: 990
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H3>M&eacute;thode d'interpr&eacute;tation des priorit&eacute;s par APT</H3>

<P>

Les priorit&eacute;s (P) indiqu&eacute;es dans le fichier des pr&eacute;f&eacute;rences doivent &ecirc;tre des entiers positifs ou n&eacute;gatifs. Ils sont interpr&eacute;t&eacute;s &agrave; peu pr&egrave;s comme suit&nbsp;:
<P>

P &gt;= 1000
<DL COMPACT><DT id="23"><DD>
cette priorit&eacute; entra&icirc;ne l'installation du paquet m&ecirc;me s'il s'agit d'un retour en arri&egrave;re.
</DL>

<P>

990 &lt;= P &lt; 1000
<DL COMPACT><DT id="24"><DD>
la version sera install&eacute;e, m&ecirc;me si elle n'appartient pas &agrave; la distribution par d&eacute;faut&nbsp;; mais elle ne sera pas install&eacute;e si la version install&eacute;e est plus r&eacute;cente.
</DL>

<P>

500 &lt;= P &lt; 990
<DL COMPACT><DT id="25"><DD>
La version sera install&eacute;e, sauf s'il existe une version appartenant &agrave; la distribution par d&eacute;faut ou si la version install&eacute;e est plus r&eacute;cente.
</DL>

<P>

100 &lt;= P &lt; 500
<DL COMPACT><DT id="26"><DD>
la version sera install&eacute;e, sauf s'il existe une version appartenant &agrave; une autre distribution ou si la version install&eacute;e est plus r&eacute;cente.
</DL>

<P>

0 &lt; P &lt; 100
<DL COMPACT><DT id="27"><DD>
la version sera install&eacute;e si aucune version du paquet n'est install&eacute;e.
</DL>

<P>

P &lt; 0
<DL COMPACT><DT id="28"><DD>
cette priorit&eacute; emp&ecirc;che l'installation de la version.
</DL>

<P>

P = 0
<DL COMPACT><DT id="29"><DD>
a un comportement ind&eacute;fini, ne pas l'utiliser.
</DL>

<P>

La premi&egrave;re entr&eacute;e de forme particuli&egrave;re correspondant &agrave; une version disponible de paquet d&eacute;termine la priorit&eacute; de la version du paquet. S'il n'en existe pas, la priorit&eacute; du paquet est d&eacute;finie comme la plus haute de toutes les priorit&eacute;s par les entr&eacute;es de forme g&eacute;n&eacute;rale correspondant &agrave; la version. Les entr&eacute;es d&eacute;finies en utilisant des motifs dans le champ Pin autre que &laquo;&nbsp;*&nbsp;&raquo; sont trait&eacute;es comme des entr&eacute;es de forme g&eacute;n&eacute;rale.
<P>

Supposons par exemple que le fichier des pr&eacute;f&eacute;rences contienne les trois entr&eacute;es d&eacute;crites ci-dessous&nbsp;:
<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001

Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999

Package: *
Pin: release unstable
Pin-Priority: 50
</PRE>

</DL>




<P>

Alors&nbsp;:
<P>
<DL COMPACT><DT id="31"><DD>
&bull;


La version la plus r&eacute;cente du paquet
perl
sera install&eacute; pour autant que son num&eacute;ro de version commence par
5.20. Si l'<I>une</I>
des versions 5.20* existe et si la version install&eacute;e est une version 5.24*, il y aura un retour en arri&egrave;re.
</DL>

<P>
<DL COMPACT><DT id="32"><DD>
&bull;


Les versions des paquets (autres que
perl) disponibles dans le site local ont priorit&eacute; sur les autres versions, m&ecirc;me celles appartenant &agrave; la distribution par d&eacute;faut.
</DL>

<P>
<DL COMPACT><DT id="33"><DD>
&bull;


La version d'un paquet dont l'origine n'est pas le site local mais un site Internet mentionn&eacute; dans
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
et qui appartient &agrave; une distribution
unstable, ne sera install&eacute;e que si aucune version du paquet n'est d&eacute;j&agrave; install&eacute;e.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H3>D&eacute;termination de la version des paquets et des propri&eacute;t&eacute;s des distributions</H3>

<P>

Chaque source indiqu&eacute;e dans le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
doit fournir les fichiers
Packages
et
Release
qui d&eacute;crivent les paquets disponibles &agrave; cet endroit.
<P>

Le fichier
Packages
se trouve normalement dans le r&eacute;pertoire
.../dists/<I>dist-name</I>/<I>component</I>/<I>arch</I>, par exemple,
.../dists/stable/main/binary-i386/Packages. Il consiste en entr&eacute;es compos&eacute;es de lignes, une pour chaque paquet disponible dans le r&eacute;pertoire. Seules deux lignes des entr&eacute;es sont pertinentes pour la d&eacute;termination des priorit&eacute;s&nbsp;:
<P>

la ligne Package:
<DL COMPACT><DT id="34"><DD>
donne le nom du paquet
</DL>

<P>

la ligne Version:
<DL COMPACT><DT id="35"><DD>
donne le num&eacute;ro de version du paquet
</DL>

<P>

Le fichier
Release
se trouve normalement dans le r&eacute;pertoire
.../dists/<I>nom-distribution</I>, par exemple,
.../dists/stable/Release, ou
.../dists/buster/Release. Il consiste en une seule entr&eacute;e compos&eacute;e de plusieurs lignes qui s'applique &agrave;
<I>tous</I>
les paquets situ&eacute;s dans les r&eacute;pertoires sous le r&eacute;pertoire parent. Contrairement au fichier
Packages, presque toutes les lignes du fichier
Release
sont pertinentes pour d&eacute;terminer les priorit&eacute;s&nbsp;:
<P>

La ligne Archive: ou Suite:
<DL COMPACT><DT id="36"><DD>
nomme l'archive &agrave; laquelle appartiennent tous les paquets situ&eacute;s dans les r&eacute;pertoires. Par exemple, la ligne
Archive: stable
indique que tous les paquets dans les r&eacute;pertoires situ&eacute;s sous le r&eacute;pertoire parent du fichier
Release
appartiennent &agrave; l'archive
stable. Indiquer cette valeur dans le fichier des pr&eacute;f&eacute;rences demanderait cette ligne&nbsp;:
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
Pin: release a=stable
</PRE>

</DL>




</DL>

<P>

la ligne Codename:
<DL COMPACT><DT id="38"><DD>
indique le nom de code auquel appartiennent tous les paquets situ&eacute;s dans les r&eacute;pertoires. Par exemple, la ligne
Codename: bullseye
indique que tous les paquets dans les r&eacute;pertoires situ&eacute;s sous le r&eacute;pertoire parent du fichier
Release
appartiennent &agrave; la version portant le nom de code
bullseye. Indiquer cette valeur dans le fichier des pr&eacute;f&eacute;rences demanderait cette ligne&nbsp;:
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
Pin: release n=bullseye
</PRE>

</DL>




</DL>

<P>

la ligne Version:
<DL COMPACT><DT id="40"><DD>
indique la version de la distribution. Par exemple, les paquets dans les r&eacute;pertoires peuvent appartenir &agrave; la distribution Debian version 10. Il n'y a pas de num&eacute;ro de version pour les distributions
testing
et
unstable
car elles n'ont pas encore &eacute;t&eacute; publi&eacute;es. Indiquer cette valeur dans le fichier des pr&eacute;f&eacute;rences demanderait ces lignes&nbsp;:
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Pin: release v=10
Pin: release a=stable, v=10
Pin: release 10
</PRE>

</DL>




</DL>

<P>

La ligne Component:
<DL COMPACT><DT id="42"><DD>
nomme un composant qui indique le type de licence associ&eacute;e aux paquets situ&eacute;s dans les r&eacute;pertoires sous le fichier
Release. Par exemple, la ligne
Component: main
indique que tous les exemplaires dans les r&eacute;pertoires appartiennent au composant
main, c'est-&agrave;-dire que leur licence est en accord avec les Directives Debian pour le logiciel libre. Indiquer ce composant dans le fichier des pr&eacute;f&eacute;rences demanderait cette ligne&nbsp;:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Pin: release c=main
</PRE>

</DL>




</DL>

<P>

La ligne Origin:
<DL COMPACT><DT id="44"><DD>
nomme l'origine des paquets situ&eacute;s dans les r&eacute;pertoires sous le fichier
Release. En g&eacute;n&eacute;ral, c'est
Debian. Indiquer cette origine dans le fichier des pr&eacute;f&eacute;rences demanderait cette ligne&nbsp;:
<P>
<DL COMPACT><DT id="45"><DD>



<PRE>
Pin: release o=Debian
</PRE>

</DL>




</DL>

<P>

La ligne Label:
<DL COMPACT><DT id="46"><DD>
indique une &eacute;tiquette pour les paquets qui se trouvent dans les r&eacute;pertoires sous le fichier
Release. En g&eacute;n&eacute;ral, c'est
Debian. Indiquer cette origine dans le fichier des pr&eacute;f&eacute;rences demanderait cette ligne&nbsp;:
<P>
<DL COMPACT><DT id="47"><DD>



<PRE>
Pin: release l=Debian
</PRE>

</DL>




</DL>

<P>

Tous les fichiers
Packages
et
Release
r&eacute;cup&eacute;r&eacute;s dans des sources indiqu&eacute;es dans le fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
sont conserv&eacute;s dans le r&eacute;pertoire
/var/lib/apt/lists
ou dans le fichier sp&eacute;cifi&eacute; par la variable
Dir::State::Lists
dans le fichier
apt.conf. Par exemple, le fichier
debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release
contient le fichier
Release
du site
debian.lcs.mit.edu, architecture
binary-i386
et composant
contrib
de la distribution
unstable.
<A NAME="lbAJ">&nbsp;</A>
<H3>Lignes facultatives dans le fichier des pr&eacute;f&eacute;rences</H3>

<P>

Toute entr&eacute;e du fichier des pr&eacute;f&eacute;rences peut commencer par une ou plusieurs lignes contenant le mot
Explanation:. Cela permet des commentaires.
<A NAME="lbAK">&nbsp;</A>
<H2>EXEMPLES</H2>

<A NAME="lbAL">&nbsp;</A>
<H3>M&eacute;thode pour suivre Stable</H3>

<P>

Le fichier des pr&eacute;f&eacute;rences suivant affecte une priorit&eacute; plus haute que la priorit&eacute; par d&eacute;faut (500) &agrave; tous les exemplaires appartenant &agrave; la distribution
stable
et une priorit&eacute; prohibitivement basse &agrave; tous les exemplaires appartenant &agrave; d'autres distributions
Debian.
<P>
<DL COMPACT><DT id="48"><DD>



<PRE>
Explanation: Ne pas installer des exemplaires d'origine Debian
Explanation: sauf ceux de la distribution stable
Package: *
Pin: release a=stable
Pin-Priority: 900

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Avec le fichier des pr&eacute;f&eacute;rences ci-dessus et un fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
ad&eacute;quat, les commandes suivantes utiliseront les versions les plus r&eacute;centes de
stable
pour faire la mise &agrave; niveau&nbsp;:
<P>
<DL COMPACT><DT id="49"><DD>



<PRE>
apt-get install <I>paquet</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

La commande suivante utilisera la version la plus r&eacute;cente de la distribution
testing
pour mettre &agrave; niveau le paquet sp&eacute;cifi&eacute;&nbsp;; cependant les mises &agrave; niveau ult&eacute;rieures du paquet ne se feront pas &agrave; moins de relancer la commande.
<P>
<DL COMPACT><DT id="50"><DD>



<PRE>
apt-get install <I>paquet</I>/testing
</PRE>

</DL>




<P>
<A NAME="lbAM">&nbsp;</A>
<H3>M&eacute;thode pour suivre Testing ou Unstable</H3>

<P>

Le fichier des pr&eacute;f&eacute;rences suivant affecte une priorit&eacute; haute aux versions des paquets appartenant &agrave; la distribution
testing, une priorit&eacute; moindre aux versions appartenant &agrave; la distribution
unstable
et une priorit&eacute; prohibitivement basse aux versions appartenant &agrave; d'autres distributions
Debian.
<P>
<DL COMPACT><DT id="51"><DD>



<PRE>
Package: *
Pin: release a=testing
Pin-Priority: 900

Package: *
Pin: release a=unstable
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Avec un fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
appropri&eacute; et le fichier des pr&eacute;f&eacute;rences ci-dessus, les commandes suivantes utiliseront les versions les plus r&eacute;centes de
testing
pour faire la mise &agrave; niveau&nbsp;:
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
apt-get install <I>paquet</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

La commande suivante utilisera la version la plus r&eacute;cente de la distribution
unstable
pour mettre &agrave; niveau le paquet sp&eacute;cifi&eacute;&nbsp;; Par la suite,
<B>apt-get upgrade</B>
mettra le paquet &agrave; jour avec la plus r&eacute;cente version dans
testing
si elle est plus r&eacute;cente que la version install&eacute;e ou avec la plus r&eacute;cente version dans
unstable
si elle est plus r&eacute;cente que la version install&eacute;e.
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
apt-get install <I>paquet</I>/unstable
</PRE>

</DL>




<P>
<A NAME="lbAN">&nbsp;</A>
<H3>Suivre l'&eacute;volution d'une version par son nom de code</H3>

<P>

Le fichier des pr&eacute;f&eacute;rences suivant affecte une priorit&eacute; plus haute que la priorit&eacute; par d&eacute;faut (500) &agrave; tous les exemplaires appartenant &agrave; la version portant le nom de code indiqu&eacute; et une priorit&eacute; prohibitivement basse &agrave; tous les exemplaires appartenant &agrave; d'autres distributions
Debian. Veuillez noter qu'avec ce fichier de pr&eacute;f&eacute;rences, APT suivra la transformation d'une version
testing
en
stable
puis
oldstable. Si, au contraire, vous souhaitez suivre la version
testing, vous devriez utiliser un des exemples pr&eacute;c&eacute;dents.
<P>
<DL COMPACT><DT id="54"><DD>



<PRE>
Explanation: Ne pas installer des exemplaires d'origine Debian
Explanation: sauf ceux de la distribution bullseye ou sid
Package: *
Pin: release n=bullseye
Pin-Priority: 900

Explanation: Debian unstable porte toujours le nom sid
Package: *
Pin: release n=sid
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Avec le fichier des pr&eacute;f&eacute;rences ci-dessus et un fichier
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
ad&eacute;quat, les commandes suivantes utiliseront les versions les plus r&eacute;centes de
bullseye
pour faire la mise &agrave; niveau&nbsp;:
<P>
<DL COMPACT><DT id="55"><DD>



<PRE>
apt-get install <I>paquet</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

La commande suivante utilisera la version la plus r&eacute;cente de la distribution
sid
pour mettre &agrave; niveau le paquet sp&eacute;cifi&eacute;&nbsp;; Par la suite,
<B>apt-get upgrade</B>
mettra le paquet &agrave; jour avec la plus r&eacute;cente version dans
bullseye
si elle est plus r&eacute;cente que la version install&eacute;e ou avec la plus r&eacute;cente version dans
sid
si elle est plus r&eacute;cente que la version install&eacute;e.
<P>
<DL COMPACT><DT id="56"><DD>



<PRE>
apt-get install <I>paquet</I>/sid
</PRE>

</DL>




<P>
<A NAME="lbAO">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="57"><DD>
Fichier des pr&eacute;f&eacute;rences. C'est dans ce fichier qu'on peut faire de l'&eacute;pinglage (pinning) c'est-&agrave;-dire, choisir d'obtenir des paquets d'une source distincte ou d'une distribution diff&eacute;rente. &Eacute;l&eacute;ment de configuration :
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="58"><DD>
Fragments de fichiers pour la pr&eacute;f&eacute;rence des versions. &Eacute;l&eacute;ment de configuration :
Dir::Etc::PreferencesParts.
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAR">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAS">&nbsp;</A>
<H2>AUTEUR</H2>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="59"><DD>
</DL>

<A NAME="lbAT">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="60"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="61"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="62"><A HREF="#lbAB">NOM</A><DD>
<DT id="63"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DL>
<DT id="64"><A HREF="#lbAD">Priorit&eacute;s affect&eacute;es par d&eacute;faut</A><DD>
<DT id="65"><A HREF="#lbAE">Cons&eacute;quences des pr&eacute;f&eacute;rences</A><DD>
<DT id="66"><A HREF="#lbAF">Expressions r&eacute;guli&egrave;res et syntaxe glob(7)</A><DD>
<DT id="67"><A HREF="#lbAG">Pinning by source package</A><DD>
<DT id="68"><A HREF="#lbAH">M&eacute;thode d'interpr&eacute;tation des priorit&eacute;s par APT</A><DD>
<DT id="69"><A HREF="#lbAI">D&eacute;termination de la version des paquets et des propri&eacute;t&eacute;s des distributions</A><DD>
<DT id="70"><A HREF="#lbAJ">Lignes facultatives dans le fichier des pr&eacute;f&eacute;rences</A><DD>
</DL>
<DT id="71"><A HREF="#lbAK">EXEMPLES</A><DD>
<DL>
<DT id="72"><A HREF="#lbAL">M&eacute;thode pour suivre Stable</A><DD>
<DT id="73"><A HREF="#lbAM">M&eacute;thode pour suivre Testing ou Unstable</A><DD>
<DT id="74"><A HREF="#lbAN">Suivre l'&eacute;volution d'une version par son nom de code</A><DD>
</DL>
<DT id="75"><A HREF="#lbAO">FICHIERS</A><DD>
<DT id="76"><A HREF="#lbAP">VOIR AUSSI</A><DD>
<DT id="77"><A HREF="#lbAQ">BOGUES</A><DD>
<DT id="78"><A HREF="#lbAR">TRADUCTEURS</A><DD>
<DT id="79"><A HREF="#lbAS">AUTEUR</A><DD>
<DT id="80"><A HREF="#lbAT">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
