
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_AUTH.CONF</TITLE>
</HEAD><BODY>
<H1>APT_AUTH.CONF</H1>
Section: APT (5)<BR>Updated: 02&nbsp;d&eacute;cembre&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

apt_auth.conf - Fichier de configuration de connexion pour les sources et les mandataires d'APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Les fichiers de configuration d'APT tels que
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
ou
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
doivent pouvoir &ecirc;tre accessibles &agrave; tous ceux qui utilisent les outils d'APT sur le syst&egrave;me pour acc&eacute;der &agrave; toutes les informations relatives aux paquets telles que les paquets disponibles dans un d&eacute;p&ocirc;t. Les informations de connexion n&eacute;cessaires pour se connecter &agrave; un mandataire ou pour t&eacute;l&eacute;charger des donn&eacute;es &agrave; partir d'un d&eacute;p&ocirc;t, d'un autre c&ocirc;t&eacute;, ne devraient pas toujours &ecirc;tre accessibles &agrave; tous et ne peuvent donc pas &ecirc;tre mises dans un fichier dot&eacute; de droits de lecture universels.
<P>

Le fichier auth.conf d'APT
/etc/apt/auth.conf
ainsi que les fichiers .conf dans
/etc/apt/auth.conf.d
peuvent &ecirc;tre utilis&eacute;s pour stocker les informations de connexion dans un format de type netrc avec des droits d'acc&egrave;s restreints.
<A NAME="lbAD">&nbsp;</A>
<H2>FORMAT DE TYPE NETRC</H2>

<P>

Le format d&eacute;fini ici est analogue au format du fichier
~/.netrc
utilis&eacute; par
<B><A HREF="/cgi-bin/man/man2html?1+ftp">ftp</A></B>(1)
et des programmes similaires interagissant avec des serveurs. C'est un format simple bas&eacute; sur les jetons qui reconna&icirc;t les jetons suivants&nbsp;; les jetons inconnus seront ignor&eacute;s. Les jetons peuvent &ecirc;tre s&eacute;par&eacute;s par des espaces, des tabulations ou des changements de ligne.
<P>

machine <I>[protocol://]</I><I>hostname</I>[:<I>port</I>][/<I>path</I>]
<DL COMPACT><DT id="1"><DD>
Les entr&eacute;es sont trouv&eacute;es en recherchant le jeton de
<I>machine</I>
correspondant au nom d'h&ocirc;te de l'URI qui fournit les informations de connexion dont APT a besoin. Comme extension du format netrc, un num&eacute;ro de port peut &ecirc;tre d&eacute;fini. Si ce n'est pas le cas, le jeton est valide pour tous les ports. De la m&ecirc;me mani&egrave;re, le chemin est facultatif et seulement n&eacute;cessaire et utile si plusieurs d&eacute;p&ocirc;ts, avec des informations de connexion diff&eacute;rentes, sont h&eacute;berg&eacute;es sur le m&ecirc;me serveur. Un jeton de machine avec un chemin correspond si le chemin dans l'URI d&eacute;bute par le chemin donn&eacute; dans le jeton. Une fois qu'une correspondance est &eacute;tablie, les jetons suivants sont trait&eacute;s, s'arr&ecirc;tant lorsque la fin du fichier est atteinte ou qu'un autre jeton de
<I>machine</I>
est rencontr&eacute;.
<P>
If protocol is not specified, the entry only matches https and tor+https.
</DL>

<P>

login <I>nom</I>
<DL COMPACT><DT id="2"><DD>
L'identifiant &agrave; utiliser
</DL>

<P>

password <I>cha&icirc;ne</I>
<DL COMPACT><DT id="3"><DD>
Le mot de passe &agrave; utiliser.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>EXEMPLE</H2>

<P>

La fourniture d'informations de connexion pour un utilisateur nomm&eacute;
apt
avec le mot de passe
debian
pour l'entr&eacute;e de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
deb <A HREF="https://example.org/debian">https://example.org/debian</A> buster main
</PRE>

</DL>




<P>
peut se faire directement dans l'entr&eacute;e&nbsp;:
<P>
<DL COMPACT><DT id="5"><DD>



<PRE>
deb <A HREF="https://apt:debian@example.org/debian">https://apt:debian@example.org/debian</A> buster main
</PRE>

</DL>




<P>
Autrement, une entr&eacute;e dans le fichier auth.conf telle que la suivante peut &ecirc;tre utilis&eacute;e&nbsp;:
<P>
<DL COMPACT><DT id="6"><DD>



<PRE>
machine example.org
login apt
password debian
</PRE>

</DL>




<P>
Ou enfin, en une seule ligne&nbsp;:
<P>
<DL COMPACT><DT id="7"><DD>



<PRE>
machine example.org login apt password debian
</PRE>

</DL>




<P>
. Si vous avez besoin d'&ecirc;tre plus pr&eacute;cis, tout le contenu de ces lignes s'appliquera &eacute;galement &agrave; l'entr&eacute;e d'exemple&nbsp;:
<P>
<DL COMPACT><DT id="8"><DD>



<PRE>
machine example.org/deb login apt password debian
machine example.org/debian login apt password debian
machine example.org/debian/ login apt password debian
</PRE>

</DL>




<P>
En revanche, aucune des lignes suivantes ne s'applique&nbsp;:
<P>
<DL COMPACT><DT id="9"><DD>



<PRE>
machine example.org:443 login apt password debian
machine example.org/deb/ login apt password debian
machine example.org/ubuntu login apt password debian
machine example.orga login apt password debian
machine example.net login apt password debian
</PRE>

</DL>




<P>
<A NAME="lbAF">&nbsp;</A>
<H2>REMARQUE</H2>

<P>

Une prise en charge basique de cette fonctionnalit&eacute; est pr&eacute;sente depuis la version&nbsp;0.7.25, mais n'&eacute;tait pas document&eacute;e depuis des ann&eacute;es. La documentation a &eacute;t&eacute; ajout&eacute;e dans la version&nbsp;1.5, modifiant aussi l&eacute;g&egrave;rement l'impl&eacute;mentation. Pour une compatibilit&eacute; ascendante maximale, vous devriez &eacute;viter d'avoir plusieurs jetons de
machine
avec le m&ecirc;me nom d'h&ocirc;te, mais si vous devez en avoir plusieurs, il faudrait qu'un chemin soit pr&eacute;cis&eacute; dans le jeton de
machine.
<P>

Login information in auth.conf are more flexible than those in sources.list. For example, login information can be specified for parts of a repository only, or if the sources.list entry redirects elsewhere, login information for the redirect destination can be supplied.
<A NAME="lbAG">&nbsp;</A>
<H2>FICHIERS</H2>

<P>

/etc/apt/auth.conf
<DL COMPACT><DT id="10"><DD>
Informations de connexion pour les sources et les mandataires d'APT dans un format de type netrc. &Eacute;l&eacute;ment de configuration&nbsp;:
Dir::Etc::netrc.
</DL>

<P>

/etc/apt/auth.conf.d/*.conf
<DL COMPACT><DT id="11"><DD>
Informations de connexion pour les sources et les mandataires d'APT dans un format de type netrc. &Eacute;l&eacute;ment de configuration&nbsp;:
Dir::Etc::netrcparts.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAI">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTEUR</H2>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="12"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="13"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NOM</A><DD>
<DT id="16"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="17"><A HREF="#lbAD">FORMAT DE TYPE NETRC</A><DD>
<DT id="18"><A HREF="#lbAE">EXEMPLE</A><DD>
<DT id="19"><A HREF="#lbAF">REMARQUE</A><DD>
<DT id="20"><A HREF="#lbAG">FICHIERS</A><DD>
<DT id="21"><A HREF="#lbAH">VOIR AUSSI</A><DD>
<DT id="22"><A HREF="#lbAI">BOGUES</A><DD>
<DT id="23"><A HREF="#lbAJ">TRADUCTEURS</A><DD>
<DT id="24"><A HREF="#lbAK">AUTEUR</A><DD>
<DT id="25"><A HREF="#lbAL">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
