
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-src-rules</TITLE>
</HEAD><BODY>
<H1>deb-src-rules</H1>
Section: Utilitaires de dpkg (5)<BR>Updated: 2017-09-05<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>

<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-src-rules - Fichier de r&egrave;gles des paquets source Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

debian/rules
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Ce fichier fournit les instructions n&eacute;cessaires &agrave; la construction des
paquets binaires &agrave; partir de paquets sources.
<P>

Le fichier <I>debian/rules</I> est un Makefile ex&eacute;cutable avec un &laquo;&nbsp;shebang&nbsp;&raquo;
qui est habituellement positionn&eacute; sur &laquo;&nbsp;#!/usr/bin/make -f&nbsp;&raquo;.
<P>

Il doit prendre en charge les cibles &laquo;&nbsp;make&nbsp;&raquo; suivantes&nbsp;:
<P>
<DL COMPACT>
<DT id="1"><B>clean</B><DD>
Nettoyer l'arborescence des sources, en supprimant toutes les modifications
r&eacute;alis&eacute;es par toutes les constructions et cibles binaires. Cette cible sera
appel&eacute;e avec les droits du superutilisateur.
<DT id="2"><B>build-indep</B><DD>
Construction des fichiers ind&eacute;pendants de l'architecture requis pour
construire tout paquet binaire ind&eacute;pendant de l'architecture. S'il n'y a pas
de paquet binaire ind&eacute;pendant de l'architecture &agrave; cr&eacute;er, la cible doit tout
de m&ecirc;me exister mais ne fait rien. Cette cible ne doit pas requ&eacute;rir les
droits du superutilisateur.
<DT id="3"><B>build-arch</B><DD>
Construction des fichiers d&eacute;pendants de l'architecture requis pour
construire tout paquet binaire d&eacute;pendant de l'architecture. S'il n'y a pas
de paquet binaire d&eacute;pendant de l'architecture &agrave; cr&eacute;er, la cible doit tout de
m&ecirc;me exister mais ne fait rien. Cette cible ne doit pas requ&eacute;rir les droits
du superutilisateur.
<DT id="4"><B>build</B><DD>
Construction des fichiers ind&eacute;pendants et d&eacute;pendants de l'architecture, soit
en d&eacute;pendant (au moins transitivement) de <B>build-indep</B> et/ou de
<B>build-arch</B>, ou en entrant en ligne de commande ce que les cibles
feront. Cette cible ne doit pas requ&eacute;rir les droits du superutilisateur.
<DT id="5"><B>binary-indep</B><DD>
Construction des paquets binaires ind&eacute;pendants de l'architecture. Cette
cible doit d&eacute;pendre (au moins transitivement) soit de <B>build-indep</B>, soit
de <B>build</B>. Cette cible sera appel&eacute;e avec les droits du superutilisateur.
<DT id="6"><B>binary-arch</B><DD>
Construction des paquets d&eacute;pendants de l'architecture. Cette cible doit
d&eacute;pendre (au moins transitivement) soit de <B>build-arch</B>, soit de
<B>build</B>. Cette cible sera appel&eacute;e avec les droits du superutilisateur.
<DT id="7"><B>binary</B><DD>
Construction des paquets binaires ind&eacute;pendants et d&eacute;pendants de
l'architecture, soit en d&eacute;pendant (au moins transitivement) de
<B>binary-indep</B> et/ou de <B>binary-arch</B>, ou en entrant en ligne de commande
ce que les cibles feront. Cette cible sera appel&eacute;e avec les droits du
superutilisateur.
</DL>
<A NAME="lbAE">&nbsp;</A>
<H2>VOIR AUSSI</H2>



<B><A HREF="/cgi-bin/man/man2html?1+dpkg-architecture">dpkg-architecture</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-vendor">dpkg-vendor</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildflags">dpkg-buildflags</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-shlibdeps">dpkg-shlibdeps</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-gencontrol">dpkg-gencontrol</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-distaddfile">dpkg-distaddfile</A></B>(1).
<A NAME="lbAF">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="8"><A HREF="#lbAB">NOM</A><DD>
<DT id="9"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="10"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="11"><A HREF="#lbAE">VOIR AUSSI</A><DD>
<DT id="12"><A HREF="#lbAF">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
