
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-src-control</TITLE>
</HEAD><BODY>
<H1>deb-src-control</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-src-control - Format du fichier principal de contr&ocirc;le dans les paquets
source Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

debian/control
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Chaque paquet source Debian contient un fichier &laquo;&nbsp;control&nbsp;&raquo; ma&icirc;tre, qui
contient au moins deux paragraphes, s&eacute;par&eacute;s par une ligne vide. Le premier
paragraphe donne toutes les informations &agrave; propos du paquet source en
g&eacute;n&eacute;ral et chaque paragraphe qui suit d&eacute;crit exactement un paquet
binaire. Chaque paragraphe contient au moins un champ. Un champ commence par
le nom du champ, par exemple <B>Package</B> ou <B>Section</B> (la casse n'est pas
significative), suivi d'un caract&egrave;re &laquo;&nbsp;deux-points&nbsp;&raquo;, du contenu du champ et
d'un retour &agrave; la ligne. Les champs &agrave; lignes multiples sont aussi possibles,
mais chaque ligne suppl&eacute;mentaire, qui ne comporte pas de nom de champ, doit
commencer par au moins une espace. Le contenu des champs &agrave; lignes multiples
est en g&eacute;n&eacute;ral r&eacute;assembl&eacute; en une ligne unique par les outils (sauf pour le
champ <B>Description</B>, voir ci-dessous). Pour inclure des lignes vides dans
un champ &agrave; lignes multiples, il est n&eacute;cessaire de mettre un point apr&egrave;s
l'espace initiale. Les lignes commen&ccedil;ant par <B>&laquo;&nbsp;#&nbsp;&raquo;</B> sont trait&eacute;es comme
des commentaires.
<A NAME="lbAE">&nbsp;</A>
<H2>LES CHAMPS SOURCE</H2>

<DL COMPACT>
<DT id="1"><B>Source:</B> <I>nom-du-paquet-source</I> (requis)<DD>
La valeur de ce champ est le nom du paquet source et doit correspondre au
nom du paquet source dans le fichier debian/changelog. Un nom de paquet doit
&ecirc;tre constitu&eacute; uniquement de lettres minuscules (a-z), de chiffres (0-9),
des caract&egrave;res plus (+) et moins (-) et de points (.). Les noms de paquets
doivent comporter au moins deux caract&egrave;res et doivent commencer par un
caract&egrave;re alphanum&eacute;rique (a-z0-9) en minuscule.
<P>
<DT id="2"><B>Maintainer:</B> <I>nom-complet-et-adresse-&eacute;lectronique</I> (recommand&eacute;)<DD>
Le format de ce champ sera &laquo;&nbsp;Jean Dupont &lt;<A HREF="mailto:jdupont@foo.com">jdupont@foo.com</A>&gt;&nbsp;&raquo;&nbsp;; il
indique le responsable actuel du paquet, par opposition &agrave; l'auteur du
logiciel ou au responsable originel.
<P>
<DT id="3"><B>Uploaders:</B><I> nom-complet-et-adresse-&eacute;lectronique</I><DD>
Affiche les noms et les adresses &eacute;lectroniques des co-responsables du
paquet, au m&ecirc;me format que le champ <B>Maintainer</B>. Des co-responsables
multiples peuvent &ecirc;tre s&eacute;par&eacute;s par des virgules.
<P>
<DT id="4"><B>Standards-Version:</B> <I>cha&icirc;ne-de-la-version</I><DD>
Ce champ indique la version la plus r&eacute;cente des normes de la charte de la
distribution auxquelles ce paquet se conforme.
<P>
<DT id="5"><B>Description</B> <I>description-courte</I><DD>

<B> </B><I>description-longue</I>
Le format de la description du paquet est un r&eacute;sum&eacute; bref sur la premi&egrave;re
ligne (apr&egrave;s le champ <B>Description</B>). Les lignes suivantes peuvent servir &agrave;
une description plus longue et plus d&eacute;taill&eacute;e. Chaque ligne de cette
description longue doit &ecirc;tre pr&eacute;c&eacute;d&eacute;e d'une espace&nbsp;; quand c'est une ligne
blanche, elle doit contenir un seul &laquo;&nbsp;<B>.</B>&nbsp;&raquo; apr&egrave;s cette espace.
<P>
<DT id="6"><B>Homepage:</B><I> URL</I><DD>
URL de la page d'accueil du projet amont.
<P>
<DT id="7"><B>Bugs:</B><I> URL</I><DD>
L'<I>URL</I> du syst&egrave;me de suivi de bogues (BTS) de ce paquet. Le format utilis&eacute;
est <I>type_de_bts</I><B>://</B><I>adresse_du_btsE</I>, par exemple
<B>debbugs://bugs.debian.org</B>. Ce champ est en g&eacute;n&eacute;ral inutile.
<P>
<DT id="8"><B>Rules-Requires-Root:</B> <B>no</B>|<B>binary-targets</B>|<I>mots-cl&eacute;s-impl&eacute;mentation</I><DD>
Ce champ est utilis&eacute; pour indiquer si le fichier <B>debian/rules</B> exige des
droits (fake)root pour ex&eacute;cuter certaines de ses cibles et quand, si c'est
le cas.
<DL COMPACT><DT id="9"><DD>
<DL COMPACT>
<DT id="10"><B>no</B><DD>
Les cibles binaires n'exigeront aucun (fake)root.
<DT id="11"><B>binary-targets</B><DD>
Les cibles binaires doivent toujours &ecirc;tre ex&eacute;cut&eacute;es avec les droits
(fake)root. C'est la valeur par d&eacute;faut quand le champ est omis&nbsp;; l'ajout du
champ avec un <B>binary-targets</B> explicite, alors qu'il n'est pas strictement
n&eacute;cessaire, marque qu'il a &eacute;t&eacute; analys&eacute; pour cette exigence.
<DT id="12"><I>mots-cl&eacute;s-impl&eacute;mentation</I><DD>
Il s'agit d'une liste, s&eacute;par&eacute;e par des espaces, de mots-cl&eacute;s qui d&eacute;finissent
quand (fake)root est exig&eacute;.
<P>
Les mots-cl&eacute;s sont compos&eacute;s de <I>espace-de-nommage</I>/<I>cas</I>. La partie
<I>espace-de-nommage</I> ne peut pas inclure de &laquo;&nbsp;/&nbsp;&raquo; ou d'espace. La partie
<I>cas</I> ne peut pas inclure d'espace. Par ailleurs, les deux parties doivent
&ecirc;tre enti&egrave;rement compos&eacute;es de caract&egrave;res ASCII imprimables.
<P>
Chaque outil ou paquet d&eacute;finira un espace de nommage nomm&eacute; d'apr&egrave;s lui-m&ecirc;me
et fournira le nombre des cas o&ugrave; (fake)root est exig&eacute;. (Voir &laquo;&nbsp;Mots-cl&eacute;s
fournis par l'impl&eacute;mentation&nbsp;&raquo; dans <I>rootless-builds.txt</I>).
<P>
Quand le champ est d&eacute;fini pour un des <I>mots-cl&eacute;s-impl&eacute;mentation</I>, le
constructeur exposera une interface qui est utilis&eacute;e pour ex&eacute;cuter une
commande avec les droits (fake)root. (Voir &laquo;&nbsp;API pour obtenir les droits
root&nbsp;&raquo; dans <I>rootless-builds.txt</I>).
</DL>
</DL>

<P>
<DT id="13"><B>Testsuite:</B><I> liste-de-noms</I><DD>

<B>Testsuite-Triggers:</B><I> liste-de-paquets</I>
Ces champs sont d&eacute;crits dans la page de manuel de <B><A HREF="/cgi-bin/man/man2html?5+dsc">dsc</A></B>(5), car ils sont
cr&eacute;&eacute;s &agrave; partir des informations d&eacute;duites de <B>debian/tests/control</B> ou
copi&eacute;s litt&eacute;ralement dans le fichier &laquo;&nbsp;control&nbsp;&raquo; du paquet source.
<P>
<DT id="14"><B>Vcs-Arch:</B><I> URL</I><DD>

<B>Vcs-Bzr:</B><I> URL</I>

<B>Vcs-Cvs:</B><I> URL</I>

<B>Vcs-Darcs:</B><I> URL</I>

<B>Vcs-Git:</B><I> URL</I>

<B>Vcs-Hg:</B><I> URL</I>

<B>Vcs-Mtn:</B><I> URL</I>

<B>Vcs-Svn:</B><I> URL</I>
Ce champ indique l'<I>URL</I> du syst&egrave;me de gestion de version utilis&eacute; pour la
gestion du paquet. Les syst&egrave;mes g&eacute;r&eacute;s sont <B>Arch</B>, <B>Bzr</B> (Bazaar), <B>Cvs</B>,
<B>Darcs</B>, <B>Git</B>, <B>Hg</B> (Mercurial), <B>Mtn</B> (Monotone) et <B>Svn</B>
(Subversion). En g&eacute;n&eacute;ral, ce champ fait r&eacute;f&eacute;rence &agrave; la derni&egrave;re version du
paquet, c'est-&agrave;-dire la branche principale ou le &laquo;&nbsp;trunk&nbsp;&raquo;.
<P>
<DT id="15"><B>Vcs-Browser:</B><I> URL</I><DD>
Indique l'<I>URL</I> de l'interface web permettant de parcourir le d&eacute;p&ocirc;t du
syst&egrave;me de gestion de version.
<P>
<DT id="16"><B>Origin:</B><I> nom</I><DD>
Indique le nom de la distribution dont le paquet provient. Ce champ n'est
souvent pas n&eacute;cessaire.
<P>
<DT id="17"><B>Section:</B> <I>section</I><DD>
Champ g&eacute;n&eacute;ral qui indique la cat&eacute;gorie d'un paquet&nbsp;; cette cat&eacute;gorie est
fond&eacute;e sur le programme que ce paquet installe. <B>utils</B>, <B>net</B>, <B>mail</B>,
<B>text</B>, <B>x11</B>,&nbsp;etc., repr&eacute;sentent quelques cat&eacute;gories habituelles.
<P>
<DT id="18"><B>Priority:</B><I> priorit&eacute;</I><DD>
D&eacute;finit l'importance du paquet &agrave; l'int&eacute;rieur du syst&egrave;me
g&eacute;n&eacute;ral. <B>required</B>, <B>standard</B>, <B>optional</B>, <B>extra</B>,&nbsp;etc., repr&eacute;sentent
des priorit&eacute;s habituelles.
<P>
Les champs <B>Section</B> et <B>Priority</B> poss&egrave;dent un ensemble d&eacute;fini de valeurs
accept&eacute;es, tir&eacute; de la Charte particuli&egrave;re de la distribution.
<P>
<DT id="19"><B>Build-Depends:</B><I> liste-de-paquets</I><DD>
Liste de paquets &agrave; installer et configurer pour pouvoir construire &agrave; partir
du paquet source. Ces d&eacute;pendances doivent &ecirc;tre satisfaites lors de la
construction des paquets binaires d&eacute;pendant ou non de l'architecture, et des
paquets source. Ajouter une d&eacute;pendance &agrave; ce champ n'aura pas exactement le
m&ecirc;me effet que de l'inclure &agrave; la fois dans <B>Build-Depends-Arch</B> et
<B>Build-Depends-Indep</B>, parce que la d&eacute;pendance a aussi besoin d'&ecirc;tre prise
en compte lors de la construction du paquet source.
<DT id="20"><B>Build-Depends-Arch:</B><I>liste-de-paquets</I><DD>
Liste analogue &agrave; <B>Build-Depends</B>, mais restreinte aux paquets n&eacute;cessaires
pour construire les paquets d&eacute;pendants de l'architecture. Les paquets
indiqu&eacute;s dans <B>Build-Depends</B> sont alors &eacute;galement install&eacute;s. Ce champ est
g&eacute;r&eacute; depuis la version&nbsp;1.16.4 de dpkg&nbsp;;&nbsp;pour pouvoir construire des paquets
avec des versions plus anciennes de dpkg, il est pr&eacute;f&eacute;rable d'utiliser
<B>Build-Depends</B>.
<P>
<DT id="21"><B>Build-Depends-Indep:</B><I> liste-de-paquets</I><DD>
Liste analogue &agrave; <B>Build-Depends</B>, mais restreinte aux paquets n&eacute;cessaires
pour construire les paquets ind&eacute;pendants de l'architecture. Les paquets
indiqu&eacute;s dans <B>Build-Depends</B> sont alors aussi install&eacute;s.
<P>
<DT id="22"><B>Build-Conflicts:</B><I> liste de paquets</I><DD>
Liste de paquets qui ne doivent pas &ecirc;tre install&eacute;s lors de la construction
du paquet, par exemple s'ils interf&egrave;rent avec le syst&egrave;me de construction
utilis&eacute;. Si une d&eacute;pendance est ajout&eacute;e &agrave; cette liste, l'effet sera le m&ecirc;me
que si elle &eacute;tait ajout&eacute;e &agrave; la fois dans <B>Build-Conflicts-Arch</B> et
<B>Build-Conflicts-Indep</B>, en ayant de plus l'effet d'&ecirc;tre prise en compte
pour les constructions de paquets uniquement source (&laquo;&nbsp;source-only
builds&nbsp;&raquo;).
<P>
<DT id="23"><B>Build-Conflicts-Arch:</B><I> liste-de-paquets</I><DD>
Identique &agrave; <B>Build-Conflicts</B>, mais n'est prise en compte que pour les
paquets d&eacute;pendants de l'architecture. Ce champ est g&eacute;r&eacute; depuis la
version&nbsp;1.16.4 de dpkg&nbsp;; pour pouvoir construire des paquets avec des
versions plus anciennes de dpkg, il est pr&eacute;f&eacute;rable d'utiliser
<B>Build-Conflicts</B>.
<P>
<DT id="24"><B>Build-Conflicts-Indep:</B><I> liste-de-paquets</I><DD>
liste analogue &agrave; <B>Build-Conflicts</B> mais restreinte &agrave; la construction des
paquets ind&eacute;pendants de l'architecture.
<P>
</DL>
<P>

La syntaxe des champs <B>Build-Depends</B>, <B>Build-Depends-Arch</B> et
<B>Build-Depends-Indep</B> est une liste de groupes contenant des paquets
alternatifs. Chaque groupe est une liste de paquets s&eacute;par&eacute;s par des barres
verticales (le symbole du tube) &laquo;&nbsp;<B>|</B>&nbsp;&raquo;. Les groupes sont s&eacute;par&eacute;s par des
virgules &laquo;&nbsp;<B>,</B>&nbsp;&raquo;, et la liste peut finir par une virgule qui peut &ecirc;tre
&eacute;limin&eacute;e lors de la cr&eacute;ation des champs pour <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) (depuis
dpkg&nbsp;1.10.14). Une virgule repr&eacute;sente un &laquo;&nbsp;ET&nbsp;&raquo; logique et une barre
verticale repr&eacute;sente un &laquo;&nbsp;OU&nbsp;&raquo; logique&nbsp;; le tube repr&eacute;sente un lien plus
fort. Chaque nom de paquet est suivi de fa&ccedil;on optionnelle par un type
d'architecture entre crochets apr&egrave;s deux-points &laquo;&nbsp;<B>:</B>&nbsp;&raquo;, &eacute;ventuellement
suivi par un num&eacute;ro de version entre parenth&egrave;ses &laquo;&nbsp;<B>(</B>&nbsp;&raquo; et &laquo;&nbsp;<B>)</B>&nbsp;&raquo;, une
sp&eacute;cification d'architecture entre crochets &laquo;&nbsp;<B>[</B>&nbsp;&raquo; et &laquo;&nbsp;<B>]</B>&nbsp;&raquo;, et une
formule de restriction constitu&eacute;e d'une ou plusieurs listes de noms de
profil entre chevrons &laquo;&nbsp;<B>&lt;</B>&nbsp;&raquo; et &laquo;&nbsp;<B>&gt;</B>&nbsp;&raquo;.
<P>
La syntaxe des champs <B>Build-Conflicts</B>, <B>Build-Conflicts-Arch</B> et
<B>Build-Conflicts-Indep</B> est une liste de paquets s&eacute;par&eacute;s par des virgules
qui repr&eacute;sentent le &laquo;&nbsp;ET&nbsp;&raquo; logique et peut finir par une virgule qui peut
&ecirc;tre &eacute;limin&eacute;e lors de la cr&eacute;ation des champs pour <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) (depuis
dpkg&nbsp;1.10.14). L'indication de paquets alternatifs avec une barre verticale
(le symbole du tube) &laquo;&nbsp;|&nbsp;&raquo; n'est pas prise en charge. Chaque nom de paquet
peut &ecirc;tre suivi de fa&ccedil;on optionnelle par un num&eacute;ro de version entre
parenth&egrave;ses, un type d'architecture entre crochets et une formule de
restriction constitu&eacute;e d'une ou plusieurs listes de noms de profil entre
chevrons.
<P>
Un nom de type d'architecture peut &ecirc;tre un nom d'architecture r&eacute;elle de
Debian (depuis dpkg&nbsp;1.16.5), <B>any</B> (depuis dpkg&nbsp;1.16.2) ou <B>native</B>
(depuis dpkg&nbsp;1.16.5). S'il est omis, la valeur par d&eacute;faut des champs
<B>Build-Depends</B> est l'architecture de l'h&ocirc;te actuel, la valeur par d&eacute;faut
des champs <B>Build-Conflicts</B> est <B>any</B>. Un nom d'architecture r&eacute;elle de
Debian correspondra exactement &agrave; l'architecture pour ce nom de paquet,
<B>any</B> correspondra &agrave; toute architecture pour ce nom de paquet si le paquet
a &eacute;t&eacute; marqu&eacute; <B>Multi-Arch: allowed</B>, et <B>native</B> correspondra &agrave;
l'architecturede construction actuelle si le paquet n'a &eacute;t&eacute; marqu&eacute;
<B>Multi-Arch: foreign</B>.
<P>
Une contrainte sur le num&eacute;ro de version peut commencer par
&laquo;&nbsp;<B>&gt;&gt;</B>&nbsp;&raquo;, et dans ce cas toute version sup&eacute;rieure correspondra, et
il peut indiquer (ou pas) le num&eacute;ro de r&eacute;vision pour le paquet Debian (les
deux num&eacute;ros &eacute;tant s&eacute;par&eacute;s par un trait d'union). Voici les relations
accept&eacute;es pour les versions&nbsp;: &laquo;&nbsp;<B>&gt;&gt;</B>&nbsp;&raquo; pour sup&eacute;rieur &agrave;,
&laquo;&nbsp;<B>&lt;&lt;</B>&nbsp;&raquo; pour inf&eacute;rieur &agrave;, &laquo;&nbsp;<B>&gt;=</B>&nbsp;&raquo; pour sup&eacute;rieur ou &eacute;gal,
&laquo;&nbsp;<B>&lt;=</B>&nbsp;&raquo; pour inf&eacute;rieur ou &eacute;gal, et &laquo;&nbsp;<B>=</B>&nbsp;&raquo; pour &eacute;gal &agrave;.
<P>
Une indication d'architecture consiste en un ou plusieurs noms
d'architectures, s&eacute;par&eacute;s par des espaces. Un nom d'architecture peut &ecirc;tre
pr&eacute;c&eacute;d&eacute; d'un point d'exclamation qui correspond alors au &laquo;&nbsp;NON&nbsp;&raquo; logique.
<P>
Une formule de restriction consiste en une ou plusieurs listes de
restriction s&eacute;par&eacute;es par des espaces. Chaque liste de restriction est
incluse entre chevrons. Les &eacute;l&eacute;ments des listes de restriction sont des noms
de profils de construction s&eacute;par&eacute;s par des espaces et pouvant &ecirc;tre pr&eacute;fix&eacute;s
d'un point d'exclamation repr&eacute;sentant un &laquo;&nbsp;NON&nbsp;&raquo; logique. Une formule de
restriction repr&eacute;sente une forme normale disjonctive.
<P>
Veuillez noter que les d&eacute;pendances des paquets du jeu <B>build-essential</B>
peuvent &ecirc;tre omises et qu'il n'est pas possible de d&eacute;clarer des conflits
avec ces paquets. La liste des paquets concern&eacute;s est fournie par le paquet
build-essential.
<P>
<P>
<A NAME="lbAF">&nbsp;</A>
<H2>CHAMPS BINAIRES</H2>

<P>
<P>

Veuillez noter que les champs <B>Priority</B>, <B>Section</B> et <B>Homepage</B> peuvent
&ecirc;tre plac&eacute;s dans le paragraphe d'un paquet binaire et leur valeur remplace
alors celle du paquet source.
<P>
<DL COMPACT>
<DT id="25"><B>Package:</B> <I>nom-du-paquet-binaire</I> (requis)<DD>
Ce champ sert &agrave; indiquer le nom du paquet binaire. Les restrictions sont les
m&ecirc;mes que celles des paquets source.
<P>
<DT id="26"><B>Package-Type:</B> <B>deb</B>|<B>udeb</B>|<I>type</I><DD>
Ce champ indique le type de paquet. La valeur <B>udeb</B> est &agrave; utiliser pour
les paquets &agrave; taille contr&ocirc;l&eacute;e utilis&eacute;s par l'installateur Debian. La valeur
<B>deb</B> est la valeur par d&eacute;faut qui est utilis&eacute;e si le champ n'est pas
pr&eacute;sent. De nouveaux types pourraient &ecirc;tre ajout&eacute;s au fil du temps.
<P>
<DT id="27"><B>Architecture:</B> <I>arch</I>|<B>all</B>|<B>any</B> (requis)<DD>
Ce champ indique l'architecture mat&eacute;rielle sur laquelle le paquet peut &ecirc;tre
utilis&eacute;. Les paquets qui peuvent &ecirc;tre utilis&eacute;s sur toute architecture
doivent utiliser le champ <B>any</B>. Les paquets ind&eacute;pendants de
l'architecture, tels les scripts shell ou Perl ou la documentation utilisent
la valeur <B>all</B>. Pour restreindre un paquet &agrave; certaines architectures,
leurs noms doivent &ecirc;tre indiqu&eacute;s s&eacute;par&eacute;s par des espaces. Il est &eacute;galement
possible d'utiliser des noms g&eacute;n&eacute;riques d'architectures dans cette liste
(voir <B><A HREF="/cgi-bin/man/man2html?1+dpkg-architecture">dpkg-architecture</A></B>(1) pour plus d'informations sur ces architectures
g&eacute;n&eacute;riques).
<P>
<DT id="28"><B>Build-Profiles:</B> <I>formule-de-restriction</I><DD>
Ce champ pr&eacute;cise les conditions pour lesquelles ce paquet binaire est ou
n'est pas construit. Cette condition est exprim&eacute;e en utilisant la m&ecirc;me
syntaxe de formule de restriction qui provient du champ <B>Build-Depends</B>.
<P>
Si un paragraphe de paquet binaire ne contient pas ce champ, cela signifie
de fa&ccedil;on implicite que ce paquet se construit avec tous les profils de
construction (y compris aucun profil).
<P>
En d'autres termes, si un paragraphe de paquet binaire est annot&eacute; d'un champ
<B>Build-Profiles</B> non vide, alors, ce paquet binaire est cr&eacute;&eacute; si et
seulement si la condition exprim&eacute;e par l'expression en forme normale
conjonctive est &eacute;valu&eacute;e &agrave; vrai.
<P>
<DT id="29"><B>Essential:</B> <B>yes</B>|<B>no</B><DD>

<B>Build-Essential:</B> <B>yes</B>|<B>no</B>

<B>Multi-Arch:</B> <B>same</B>|<B>foreign</B>|<B>allowed</B>|<B>no</B>

<B>Tag:</B><I> liste-d'&eacute;tiquettes</I>

<B>Description:</B> <I>description-courte</I> (recommand&eacute;)
Ces champs sont d&eacute;crits dans la page de manuel de <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), car ils
sont copi&eacute;s litt&eacute;ralement dans le fichier &laquo;&nbsp;control&nbsp;&raquo; du paquet binaire.
<P>
<DT id="30"><B>Depends:</B><I> liste-de-paquets</I><DD>

<B>Pre-Depends:</B><I> liste-de-paquets</I>

<B>Recommends:</B><I> liste-de-paquets</I>

<B>Suggests:</B><I> liste-de-paquets</I>

<B>Breaks:</B><I> liste-de-paquets</I>

<B>Enhances:</B><I> liste-de-paquets</I>

<B>Replaces:</B><I> liste-de-paquets</I>

<B>Conflicts:</B><I> liste-de-paquets</I>

<B>Provides:</B><I> liste-de-paquets</I>

<B>Built-Using:</B><I> liste-de-paquets</I>
Ces champs d&eacute;clarent les relations entre les paquets. Ils sont discut&eacute;s dans
la page de manuel de <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5). Quand ces champs se trouvent dans
<I>debian/control</I>, ils peuvent aussi se terminer par une virgule (depuis
dpkg&nbsp;1.10.14)&nbsp;; ils comprennent des sp&eacute;cifications d'architecture et des
formules de restriction qui seront r&eacute;duites lors de la g&eacute;n&eacute;ration des champs
pour <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5).
<P>
<DT id="31"><B>Subarchitecture:</B><I> valeur</I><DD>

<B>Kernel-Version:</B><I> valeur</I>

<B>Installer-Menu-Item:</B><I> valeur</I>
Ces champs sont utilis&eacute;s par l'installateur dans les <B>udeb</B> et ne sont en
g&eacute;n&eacute;ral pas n&eacute;cessaires. Veuillez consulter
/usr/share/doc/debian-installer/devel/modules.txt fourni avec le paquet
<B>debian-installer</B> pour plus de d&eacute;tails.
<P>
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>LES CHAMPS UTILISATEUR</H2>

Il est autoris&eacute; d'ajouter au fichier de contr&ocirc;le des champs suppl&eacute;mentaires
d&eacute;finis par l'utilisateur. L'outil ignorera ces champs. Si vous souhaitez
que ces champs soient copi&eacute;s dans ces fichiers de sortie, tels que les
paquets binaires, vous devez utiliser un sch&eacute;ma de nommage personnalis&eacute;&nbsp;:
les champs d&eacute;marreront par un <B>X</B>, suivi de z&eacute;ro ou plusieurs des lettres
<B>SBC</B> et un trait d'union.
<P>
<DL COMPACT>
<DT id="32"><B>S</B><DD>
Ce champ appara&icirc;tra dans le fichier de contr&ocirc;le du paquet des sources, voir
<B><A HREF="/cgi-bin/man/man2html?5+dsc">dsc</A></B>(5).
<DT id="33"><B>B</B><DD>
Le champ appara&icirc;tra dans le fichier de contr&ocirc;le du paquet binaire, voir
<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5).
<DT id="34"><B>C</B><DD>
Le champ appara&icirc;tra dans le fichier de contr&ocirc;le d'envoi (.changes), voir
<B><A HREF="/cgi-bin/man/man2html?5+deb-changes">deb-changes</A></B>(5).
<P>
</DL>
<P>

Veuillez noter que les pr&eacute;fixes <B>X</B>[<B>SBC</B>]<B>-</B> sont retir&eacute;s quand les
champs sont copi&eacute;s dans les fichiers de sortie. Un champ <B>XC-Approved-By</B>
appara&icirc;tra sous la forme <B>Approved-By</B> dans le fichier des modifications et
n'appara&icirc;tra pas dans les fichiers de contr&ocirc;le des paquets binaires ou
source.
<P>
Il faut prendre en compte le fait que ces champs d&eacute;finis par l'utilisateur
se serviront de l'espace de nommage global lequel pourrait, dans le futur,
entrer en conflit avec des champs officiellement reconnus. Pour &eacute;viter de
telles situations, il est conseill&eacute; de les pr&eacute;fixer avec <B>Private-</B>
(exemple&nbsp;: <B>XB-Private-New-Field</B>).
<P>
<A NAME="lbAH">&nbsp;</A>
<H2>EXEMPLE</H2>


<PRE>
# Commentaire
Source: dpkg
Section: admin
Priority: required
Maintainer: Dpkg Developers &lt;<A HREF="mailto:debian-dpkg@lists.debian.org">debian-dpkg@lists.debian.org</A>&gt;
# ce champ est copi&eacute; dans les paquets source et binaires
XBS-Upstream-Release-Status: stable
Homepage: <A HREF="https://wiki.debian.org/Teams/Dpkg">https://wiki.debian.org/Teams/Dpkg</A>
Vcs-Browser: <A HREF="https://git.dpkg.org/cgit/dpkg/dpkg.git">https://git.dpkg.org/cgit/dpkg/dpkg.git</A>
Vcs-Git: <A HREF="https://git.dpkg.org/git/dpkg/dpkg.git">https://git.dpkg.org/git/dpkg/dpkg.git</A>
Standards-Version: 3.7.3
Build-Depends: pkg-config, debhelper (&gt;= 4.1.81),
 libselinux1-dev (&gt;= 1.28-4) [!linux-any]

Package: dpkg-dev
Section: utils
Priority: optional
Architecture: all
# champ personnalis&eacute; dans le paquet binaire
XB-Mentoring-Contact: Raphael Hertzog &lt;<A HREF="mailto:hertzog@debian.org">hertzog@debian.org</A>&gt;
Depends: dpkg (&gt;= 1.14.6), perl5, perl-modules, cpio (&gt;= 2.4.2-2), bzip2, lzma,
 patch (&gt;= 2.2-1), make, binutils, libtimedate-perl
Recommends: gcc | c-compiler, build-essential
Suggests: gnupg, debian-keyring
Conflicts: dpkg-cross (&lt;&lt; 2.0.0), devscripts (&lt;&lt; 2.10.26)
Replaces: manpages-pl (&lt;= 20051117-1)
Description: Debian package development tools
 This package provides the development tools (including dpkg-source)
 required to unpack, build and upload Debian source packages.
 .
 Most Debian source packages will require additional tools to build;
 for example, most packages need make and the C compiler gcc.
</PRE>

<P>
<P>

<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1)
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="35"><A HREF="#lbAB">NOM</A><DD>
<DT id="36"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="37"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="38"><A HREF="#lbAE">LES CHAMPS SOURCE</A><DD>
<DT id="39"><A HREF="#lbAF">CHAMPS BINAIRES</A><DD>
<DT id="40"><A HREF="#lbAG">LES CHAMPS UTILISATEUR</A><DD>
<DT id="41"><A HREF="#lbAH">EXEMPLE</A><DD>
<DT id="42"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="43"><A HREF="#lbAJ">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
