
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-substvars</TITLE>
</HEAD><BODY>
<H1>deb-substvars</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-substvars - Variables de substitution de source Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

substvars
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Avant que <B>dpkg-source</B>, <B>dpkg-gencontrol</B> et <B>dpkg-genchanges</B>
n'&eacute;crivent leurs informations de contr&ocirc;le (dans le fichier source de
contr&ocirc;le <B>.dsc</B> pour <B>dpkg-source</B> et sur la sortie standard pour
<B>dpkg-gencontrol</B> et <B>dpkg-genchanges</B>), ils r&eacute;alisent quelques
substitutions de variables dans le fichier de sortie.
<P>
Une substitution de variable est de la forme&nbsp;: <B>${</B><I>nom-variable</I><B>}</B>. Les
noms de variable consistent en caract&egrave;res alphanum&eacute;riques (a-zA-Z0-9),
traits d'union (-) et &laquo;&nbsp;deux points&nbsp;&raquo; (:)&nbsp;; ils commencent par une lettre ou
un chiffre et sont sensibles &agrave; la casse m&ecirc;me si ils se r&eacute;f&egrave;rent &agrave; d'autres
entit&eacute;s qui pr&eacute;servent la casse. La substitution se fait r&eacute;p&eacute;titivement
jusqu'&agrave; ce qu'il n'en reste aucune &agrave; faire&nbsp;; le texte entier du champ apr&egrave;s
la substitution est r&eacute;examin&eacute; pour chercher d'autres substitutions.
<P>
Quand toutes les substitutions ont &eacute;t&eacute; faites, chaque occurrence de la
cha&icirc;ne <B>${}</B> (laquelle n'est pas une substitution autoris&eacute;e) est remplac&eacute;e
par un signe <B>$</B>.
<P>
Alors que le remplacement de variables est effectu&eacute; sur tous les champs de
contr&ocirc;le, certains de ces champs sont utilis&eacute;s et n&eacute;cessaires pendant la
construction alors m&ecirc;me que la substitution n'a pas encore pu &ecirc;tre
effectu&eacute;e. Cela explique pourquoi il n'est pas possible d'utiliser de
variables dans les champs <B>Package</B>, <B>Source</B> et <B>Architecture</B>.
<P>
La substitution de variables se fait dans le contenu des champs apr&egrave;s leur
analyse. En cons&eacute;quence, si vous souhaitez qu'une variable soit remplac&eacute;e
sur plusieurs lignes, il n'est pas n&eacute;cessaire de placer une espace apr&egrave;s le
retour &agrave; la ligne. Cela se fait implicitement quand le champ est
affich&eacute;. Par exemple, si la variable <B>${Description}</B> est positionn&eacute;e sur
&laquo;&nbsp;foo est bar.${Newline}foo est super.&nbsp;&raquo; et si vous avez le champ suivant&nbsp;:
<P>
<BR>&nbsp;Description:&nbsp;application&nbsp;foo
<BR>&nbsp;&nbsp;${Description}
<BR>&nbsp;&nbsp;.
<BR>&nbsp;&nbsp;Encore&nbsp;du&nbsp;texte.
<P>
Le r&eacute;sultat final sera&nbsp;:
<P>
<BR>&nbsp;Description:&nbsp;application&nbsp;foo
<BR>&nbsp;&nbsp;foo&nbsp;est&nbsp;bar.
<BR>&nbsp;&nbsp;foo&nbsp;est&nbsp;super.
<BR>&nbsp;&nbsp;.
<BR>&nbsp;&nbsp;Encore&nbsp;du&nbsp;texte.
<P>
On peut d&eacute;finir les variables en utilisant l'option commune <B>-V</B>. On peut
aussi se servir du fichier <B>debian/substvars</B> (ou tout autre fichier avec
l'option <B>-T</B>). Ce fichier est compos&eacute; de lignes de la forme suivante&nbsp;:
<I>nom</I><B>=</B><I>valeur</I>. Les espaces r&eacute;siduelles sur chaque ligne, les lignes
vides et les lignes qui commencent par un symbole <B>#</B> sont ignor&eacute;es.
<P>
En outre, les variables standard suivantes sont disponibles&nbsp;:
<DL COMPACT>
<DT id="1"><B>Arch</B><DD>
L'architecture de l'h&ocirc;te actuel (c'est-&agrave;-dire l'architecture pour laquelle
le paquet est construit, &eacute;quivalent de <B>DEB_HOST_ARCH</B>).
<DT id="2"><B>source:Version</B><DD>
Version du paquet source (depuis dpkg&nbsp;1.13.19).
<DT id="3"><B>source:Upstream-Version</B><DD>
La version amont du paquet source, avec &eacute;ventuellement l'&laquo;&nbsp;epoch&nbsp;&raquo; de la
version Debian (depuis dpkg&nbsp;1.13.19).
<DT id="4"><B>binary:Version</B><DD>
La version du paquet binaire (qui peut &ecirc;tre diff&eacute;rente de <B>source:Version</B>
dans un binNMU par exemple&nbsp;; depuis dpkg&nbsp;1.13.19).
<DT id="5"><B>Source-Version</B><DD>
La version du paquet source, selon le fichier changelog. Cette variable est
maintenant <B>obsol&egrave;te</B> et produit une erreur lors de son utilisation car sa
signification est distincte de sa fonction. Utilisez plut&ocirc;t
<B>source:Version</B> ou <B>binary:Version</B>.
<DT id="6"><B>source:Synopsis</B><DD>
Le synopsis du paquet source, extrait du champ <B>Description</B> du paragraphe
source, s'il existe (depuis dpkg&nbsp;1.19.0).
<DT id="7"><B>source:Extended-Description</B><DD>
La description &eacute;tendue du paquet source, extraite du champ <B>Description</B> du
paragraphe source, s'il existe (depuis dpkg&nbsp;1.19.0).
<DT id="8"><B>Installed-Size</B><DD>
La taille approximative de tous les fichiers install&eacute;s du paquet. Cette
valeur est copi&eacute;e dans le champ ad&eacute;quat du fichier &laquo;&nbsp;control&nbsp;&raquo;&nbsp;; quand on
fixe cette variable, cela modifie la valeur de ce champ. Quand elle est
ind&eacute;termin&eacute;e, <B>dpkg-gencontrol</B> calcule la valeur par d&eacute;faut en
additionnant la taille de chaque fichier ordinaire et lien symbolique
arrondie en unit&eacute; d'un kio utilis&eacute;e et sur la base d'un kio pour n'importe
quel type d'objet du syst&egrave;me de fichiers.
<P>
<B>Remarque</B>&nbsp;: Il faut tenir compte que cela ne peut jamais &ecirc;tre qu'une
approximation dans la mesure o&ugrave; la taille v&eacute;ritablement occup&eacute;e sur un
syst&egrave;me install&eacute; d&eacute;pend largement du syst&egrave;me de fichiers utilis&eacute; et de ses
param&egrave;tres, ce qui pourrait finir par l'utilisation de plus ou moins
d'espace que ce qui est sp&eacute;cifi&eacute; dans ce champ.
<DT id="9"><B>Extra-Size</B><DD>
L'espace disque suppl&eacute;mentaire utilis&eacute; pour l'installation du paquet. Quand
on fixe cette variable, on ajoute sa valeur &agrave; la valeur de la variable
<B>Installed-Size</B> (qu'elle soit d&eacute;finie explicitement ou calcul&eacute;e par
d&eacute;faut) avant qu'elle soit copi&eacute;e dans le champ <B>Installed-Size</B> du fichier
&laquo;&nbsp;control&nbsp;&raquo;.
<DT id="10"><B>S:</B><I>nom-de-champ</I><DD>
La valeur du champ <I>nom-de-champ</I> du paragraphe source (qui doit &ecirc;tre
classiquement en majuscules, depuis dpkg&nbsp;1.18.11). Quand on fixe ces
variables, cela ne prend effet que l&agrave; o&ugrave; elles sont explicitement
d&eacute;velopp&eacute;es. Ces variables ne sont disponibles que lors de la cr&eacute;ation des
fichiers de contr&ocirc;le binaires.
<DT id="11"><B>F:</B><I>nom-de-champ</I><DD>
La valeur du champ <I>nom-de-champ</I> affich&eacute;e en sortie (qui doit &ecirc;tre
classiquement en majuscules). Quand on fixe ces variables, cela ne prend
effet que l&agrave; o&ugrave; elles sont explicitement d&eacute;velopp&eacute;es.
<DT id="12"><B>Format</B><DD>
La version du format du fichier <B>.changes</B> produite par la version des
scripts construisant le source. Quand on d&eacute;termine cette variable, le
contenu du champ <B>Format</B> dans le fichier <B>.changes</B> est aussi modifi&eacute;.
<DT id="13"><B>Newline</B>, <B>Space</B>, <B>Tab</B><DD>
Ces variables contiennent chacune le caract&egrave;re correspondant.
<DT id="14"><B>shlibs:</B><I>champ-d&eacute;pendance</I><DD>
Les variables d&eacute;termin&eacute;es de cette fa&ccedil;on sont produites par
<B>dpkg-shlibdeps</B>.
<DT id="15"><B>dpkg:Upstream-Version</B><DD>
La version amont de dpkg (depuis dpkg&nbsp;1.13.19).
<DT id="16"><B>dpkg:Version</B><DD>
La version compl&egrave;te de dpkg (depuis dpkg&nbsp;1.13.19).
</DL>
<P>

Quand une variable est r&eacute;f&eacute;renc&eacute;e mais n'est pas d&eacute;finie, cela produit un
avertissement et une valeur vide est suppos&eacute;e.
<A NAME="lbAE">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="17"><B>debian/substvars</B><DD>
La liste des variables de substitution et leurs valeurs.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-genchanges">dpkg-genchanges</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-gencontrol">dpkg-gencontrol</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-shlibdeps">dpkg-shlibdeps</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1).
<A NAME="lbAG">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="18"><A HREF="#lbAB">NOM</A><DD>
<DT id="19"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="20"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="21"><A HREF="#lbAE">FICHIERS</A><DD>
<DT id="22"><A HREF="#lbAF">VOIR AUSSI</A><DD>
<DT id="23"><A HREF="#lbAG">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
