
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-changelog</TITLE>
</HEAD><BODY>
<H1>deb-changelog</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-changelog - Format du fichier de journal des modifications
(&laquo;&nbsp;changelog&nbsp;&raquo;) des paquets source dpkg
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

changelog
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Les modifications de la version empaquet&eacute;e d'un projet sont expliqu&eacute;es dans
le fichier <I>debian/changelog</I>. Cela comprend les modifications r&eacute;alis&eacute;es
dans les sources par rapport au paquet amont ainsi que les autres
modifications et mises &agrave; jour du paquet.
<P>

Le format de <I>debian/changelog</I> permet aux outils de construction du paquet
de d&eacute;couvrir la version du paquet en construction et de d&eacute;couvrir d'autres
informations sp&eacute;cifiques &agrave; la version.
<P>

Ce format est une s&eacute;rie d'entr&eacute;es comme celles-ci&nbsp;:
<P>
<PRE>
<I>paquet</I> (<I>version</I>) <I>distributions</I>; <I>m&eacute;tadonn&eacute;es</I>
          [ligne(s) blanches(s) facultative(s), retir&eacute;e(s)]
  * <I>d&eacute;tails-de-modification</I>
    <I>plus-de-d&eacute;tails-de-modification</I>
          [ligne(s) blanches(s), y compris dans la sortie de
          <B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1)]
  * <I>encore-plus-de-d&eacute;tails-de-modification</I>
          [ligne(s) blanches(s) facultative(s), retir&eacute;e(s)]
 -- <I>nom-responsable</I> &lt;<I>adresse-&eacute;lectronique</I>&gt;  <I>date</I>
</PRE>

<P>
<P>

<I>paquet</I> et (<I>version</I>) sont le nom et le num&eacute;ro de version du paquet
source.
<P>

<I>distributions</I> liste une ou plusieurs distributions, s&eacute;par&eacute;es par une
espace, dans lesquelles cette version peut &ecirc;tre install&eacute;e apr&egrave;s
t&eacute;l&eacute;chargement&nbsp;; l'entr&eacute;e est copi&eacute;e dans le champ <B>Distribution</B> dans le
fichier <I>.changes</I>.
<P>

<I>metadata</I> est une liste s&eacute;par&eacute;e par des virgules de paires
<I>mot-cl&eacute;</I>=<I>valeur</I>. Les seuls <I>mots-cl&eacute;s</I> g&eacute;r&eacute;s actuellement par <B>dpkg</B>
sont <B>urgency</B> et <B>binary-only</B>. La valeur d'<B>urgency</B> est utilis&eacute;e pour
le champ <B>Urgency</B> dans le fichier <I>.changes</I> pour l'envoi. <B>binary-only</B>
avec une valeur <B>yes</B> est utilis&eacute; pour indiquer que cette entr&eacute;e de
changelog est li&eacute;e &agrave; un envoi seulement binaire (binNMU) (une reconstruction
automatique du binaire avec uniquement une modification de l'entr&eacute;e du
changelog).
<P>

Les d&eacute;tails de modification peuvent &ecirc;tre en fait une s&eacute;rie de lignes
d&eacute;marrant par au moins deux espaces, mais par convention, chaque
modification d&eacute;bute par un ast&eacute;risque et une espace de s&eacute;paration et les
lignes de continuation sont indent&eacute;es de telle mani&egrave;re qu'elles s'alignent
sur le d&eacute;but du texte au-dessus. Des lignes blanches peuvent &ecirc;tre utilis&eacute;es
pour s&eacute;parer des groupes de modifications, si d&eacute;sir&eacute;.
<P>

Si cet envoi r&eacute;sout des bogues enregistr&eacute;s dans le syst&egrave;me de suivi de
bogues de la distribution, ceux-ci peuvent &ecirc;tre automatiquement ferm&eacute;s lors
de l'inclusion de ce paquet dans l'archive de la distribution en incluant la
cha&icirc;ne&nbsp;:
<PRE>
  <B>Closes: Bug#</B><I>nnnnn</I>
</PRE>

dans les d&eacute;tails de modification (l'expression rationnelle pr&eacute;cise en Perl
est
<B>/closes:\s*(?:bug)?\#?\s?\d+(?:,\s*(?:bug)?\#?\s?\d+)*/i</B>). Cette
information est transmise &agrave; travers le champs <B>Closes</B> dans le <I>.changes</I>.
<P>

Le nom du responsable et l'adresse &eacute;lectronique utilis&eacute;s dans le changelog
seront les d&eacute;tails sur la personne qui a pr&eacute;par&eacute; cette version du paquet. Ce
ne sont <B>pas</B> n&eacute;cessairement ceux de celui qui fait l'envoi ou du
responsable habituel du paquet. Ces informations seront copi&eacute;es dans le
champ <B>Changed-By</B> du fichier <I>.changes</I>, et pourront plus tard &ecirc;tre
utilis&eacute;es pour envoyer une confirmation lorsque l'envoi a &eacute;t&eacute; install&eacute; dans
l'archive de la distribution.
<P>

La <I>date</I> est au format suivant (compatible et avec la m&ecirc;me s&eacute;mantique que
RFC2822 et RFC5322, ou avec ce que cr&eacute;e &laquo;&nbsp;date&nbsp;-R&nbsp;&raquo;)&nbsp;:
<DL COMPACT>
<DT id="1"><DD>
<I>jour-de-la-semaine</I><B>,</B> <I>jj</I> <I>mois</I> <I>aaaa</I> <I>hh</I><B>:</B><I>mm</I><B>:</B><I>ss</I>
<B>+</B><I>zzzz</I>
</DL>
<P>

o&ugrave;&nbsp;:
<DL COMPACT>
<DT id="2"><I>jour-de-la-semaine</I><DD>
C'est au choix&nbsp;: <B>Mon</B>, <B>Tue</B>, <B>Wed</B>, <B>Thu</B>, <B>Fri</B>, <B>Sat</B>, <B>Sun</B>.
<DT id="3"><I>jj</I><DD>
C'est le num&eacute;ro, &agrave; un ou deux chiffres, du jour du mois (<B>01</B>-<B>31</B>).
<DT id="4"><I>mois</I><DD>
C'est au choix&nbsp;: <B>Jan</B>, <B>Feb</B>, <B>Mar</B>, <B>Apr</B>, <B>May</B>, <B>Jun</B>, <B>Jul</B>,
<B>Aug</B>, <B>Sep</B>, <B>Oct</B>, <B>Nov</B>, <B>Dec</B>.
<DT id="5"><I>aaaa</I><DD>
C'est l'ann&eacute;e en chiffre (par exemple 2010).
<DT id="6"><I>hh</I><DD>
Il s'agit de l'heure en deux chiffres (<B>00</B>-<B>23</B>).
<DT id="7"><I>mm</I><DD>
Il s'agit des minutes en deux chiffres (<B>00</B>-<B>59</B>).
<DT id="8"><I>ss</I><DD>
Il s'agit des secondes en deux chiffres (<B>00</B>-<B>59</B>).
<DT id="9">[<B>+-</B>]<I>zzzz</I><DD>
Il s'agit du d&eacute;calage horaire par rapport au temps universel coordonn&eacute;
(UTC). &laquo;&nbsp;<B>+</B>&nbsp;&raquo; indique que l'heure est en avance (c'est-&agrave;-dire &agrave; l'est) par
rapport &agrave; l'UTC et &laquo;&nbsp;<B>-</B>&nbsp;&raquo; indique que l'heure est en retard (c'est-&agrave;-dire
&agrave; l'ouest) par rapport &agrave; l'UTC. Les deux premiers chiffres indiquent la
diff&eacute;rence d'heures par rapport &agrave; l'UTC et les deux derniers le nombre de
minutes additionnelles par rapport &agrave; l'UTC. Ces deux derniers chiffres
doivent &ecirc;tre entre <B>00</B> et <B>59</B>.
</DL>
<P>

La premi&egrave;re ligne de &laquo;&nbsp;titre&nbsp;&raquo; avec le nom du paquet doit d&eacute;buter &agrave; la marge
gauche. La ligne terminale avec les d&eacute;tails sur le responsable et la date
doit &ecirc;tre pr&eacute;c&eacute;d&eacute;e d'une espace pr&eacute;cis&eacute;ment. Les d&eacute;tails sur le responsable
et la date doivent &ecirc;tre s&eacute;par&eacute;s par exactement deux espaces.
<P>

Toute ligne qui consiste uniquement (c'est-&agrave;-dire sans espace au d&eacute;but de la
ligne) en commentaires de style <B>#</B> ou <B>/*&nbsp;*/</B>, mots-cl&eacute;s RCS.
<P>

Les lignes de mode (&laquo;&nbsp;modeline&nbsp;&raquo;) de Vim ou variables locales d'Emacs et les
anciennes entr&eacute;es de changelog avec d'autres formats &agrave; la fin du fichier
devraient &ecirc;tre accept&eacute;es et conserv&eacute;es &agrave; la sortie, mais leur contenu
pourrait &ecirc;tre autrement ignor&eacute; et l'analyse arr&ecirc;t&eacute;e &agrave; ce moment-l&agrave;.
<P>

La totalit&eacute; du journal des modifications doit &ecirc;tre encod&eacute; en UTF-8.
<A NAME="lbAE">&nbsp;</A>
<H2>FICHIERS</H2>

<DL COMPACT>
<DT id="10"><I>debian/changelog</I><DD>
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>EXEMPLES</H2>

<PRE>
dpkg (1.17.18) unstable; urgency=low

  [ Guillem Jover ]
  * Handle empty minimum versions when initializing dependency versions,
    as the code is mapping the minimum version 0 to '' to avoid outputting
    useless versions. Regression introduced in dpkg 1.17.17. Closes: #764929

  [ Updated programs translations ]
  * Catalan (Guillem Jover).

  [ Updated dselect translations ]
  * Catalan (Guillem Jover).
  * German (Sven Joachim).

 -- Guillem Jover &lt;<A HREF="mailto:guillem@debian.org">guillem@debian.org</A>&gt;  Sun, 12 Oct 2014 15:47:44 +0200
</PRE>

<A NAME="lbAG">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?5+deb-changes">deb-changes</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1).
<A NAME="lbAH">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="11"><A HREF="#lbAB">NOM</A><DD>
<DT id="12"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="13"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="14"><A HREF="#lbAE">FICHIERS</A><DD>
<DT id="15"><A HREF="#lbAF">EXEMPLES</A><DD>
<DT id="16"><A HREF="#lbAG">VOIR AUSSI</A><DD>
<DT id="17"><A HREF="#lbAH">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
