
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-triggers</TITLE>
</HEAD><BODY>
<H1>deb-triggers</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-triggers - Actions diff&eacute;r&eacute;es du paquet
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

actions diff&eacute;r&eacute;es
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Un paquet d&eacute;clare ses relations avec des actions diff&eacute;r&eacute;es en incluant un
fichier <I>triggers</I> dans son archive de contr&ocirc;le (c'est-&agrave;-dire
<I>DEBIAN/triggers</I> au moment de la cr&eacute;ation du paquet).
<P>

Ce fichier contient des directives, une par ligne. Les espaces de d&eacute;but et
fin de ligne et tout ce qui suit le premier caract&egrave;re <B>&laquo;&nbsp;#&nbsp;&raquo;</B> sont
supprim&eacute;s, et les lignes vides seront ignor&eacute;es.
<P>

Les directives actuellement g&eacute;r&eacute;es sont&nbsp;:
<DL COMPACT>
<DT id="1"><B>interest</B> <I>nom-action-diff&eacute;r&eacute;e</I><DD>

<B>interest-await</B> <I>nom-action-diff&eacute;r&eacute;e</I>

<B>interest-noawait</B> <I>nom-action-diff&eacute;r&eacute;e</I>
<DT id="2"><DD>
Indique que le paquet est concern&eacute; par l'action diff&eacute;r&eacute;e indiqu&eacute;e. Toutes
les actions diff&eacute;r&eacute;es associ&eacute;es au paquet doivent &ecirc;tre list&eacute;es en utilisant
cette directive depuis le fichier de contr&ocirc;le des actions diff&eacute;r&eacute;es.
<DT id="3"><DD>
Les variantes &laquo;&nbsp;await&nbsp;&raquo; placent le paquet qui provoque l'action diff&eacute;r&eacute;e
dans l'&eacute;tat &laquo;&nbsp;triggers-awaited&nbsp;&raquo; (actions diff&eacute;r&eacute;es attendues) selon la
mani&egrave;re dont l'action diff&eacute;r&eacute;e est activ&eacute;e. La variante &laquo;&nbsp;noawait&nbsp;&raquo; ne place
pas les paquets qui provoquent cette action diff&eacute;r&eacute;e dans l'&eacute;tat
&laquo;&nbsp;triggers-awaited&nbsp;&raquo; m&ecirc;me si le paquet d&eacute;clenchant a d&eacute;clar&eacute; une activation
&laquo;&nbsp;await&nbsp;&raquo; (par soit une directive <B>activate-await</B> ou <B>activate</B>, soit en
utilisant l'option en ligne de commande <B>dpkg-trigger</B> <B>--no-await</B>. La
variante &laquo;&nbsp;await&nbsp;&raquo; ne devrait &ecirc;tre utilis&eacute;e que lorsque la fonctionnalit&eacute;
fournie par l'action diff&eacute;r&eacute;e n'est pas critique.
<DT id="4"><B>activate</B> <I>nom-action-diff&eacute;r&eacute;e</I><DD>

<B>activate-await</B> <I>nom-action-diff&eacute;r&eacute;e</I>

<B>activate-noawait</B> <I>nom-action-diff&eacute;r&eacute;e</I>
<DT id="5"><DD>
Cette directive permet que tout changement dans l'&eacute;tat de ce paquet active
l'action diff&eacute;r&eacute;e sp&eacute;cifi&eacute;e. L'action diff&eacute;r&eacute;e sera activ&eacute;e au d&eacute;but des
op&eacute;rations suivantes&nbsp;: d&eacute;paquetage, configuration, suppression (y compris en
cas de remplacement par un paquet conflictuel), purge et d&eacute;configuration.
<DT id="6"><DD>
Les variantes &laquo;&nbsp;await&nbsp;&raquo; ne placent le paquet qui provoque cette action
diff&eacute;r&eacute;e dans l'&eacute;tat &laquo;&nbsp;triggers-awaited&nbsp;&raquo; que si la directive concern&eacute;e est
aussi &laquo;&nbsp;await&nbsp;&raquo;. La variante &laquo;&nbsp;noawait&nbsp;&raquo; ne place jamais les paquets qui
provoquent cette action diff&eacute;r&eacute;e dans l'&eacute;tat &laquo;&nbsp;triggers-awaited&nbsp;&raquo;. Elle ne
devrait &ecirc;tre utilis&eacute;e que lorsque la fonctionnalit&eacute; fournie par l'action
diff&eacute;r&eacute;e n'est pas critique.
<DT id="7"><DD>
Si ce paquet dispara&icirc;t durant le d&eacute;paquetage d'un autre paquet, l'action
diff&eacute;r&eacute;e sera activ&eacute;e lorsque la disparition est constat&eacute;e vers la fin du
d&eacute;paquetage. L'ex&eacute;cution d'une action diff&eacute;r&eacute;e, et donc le passage du statut
triggers-awaited (action-diff&eacute;r&eacute;e-attendue) &agrave; installed (install&eacute;), ne
provoquera pas l'activation. Dans le cas d'un d&eacute;paquetage, les actions
diff&eacute;r&eacute;es list&eacute;es dans l'ancienne et la nouvelle version du paquet seront
activ&eacute;es.
</DL>
<P>

Les directives inconnues sont des erreurs qui emp&ecirc;cheront l'installation du
paquet.
<P>

Les variantes &laquo;&nbsp;-noawait&nbsp;&raquo; doivent toujours &ecirc;tre privil&eacute;gi&eacute;es quand c'est
possible dans la mesure o&ugrave; les paquets provoquant une action diff&eacute;r&eacute;e ne
sont pas plac&eacute;s en &eacute;tat &laquo;&nbsp;triggers-awaited&nbsp;&raquo; (actions diff&eacute;r&eacute;es attendues),
et peuvent donc &ecirc;tre imm&eacute;diatement configur&eacute;s sans recourir &agrave; l'ex&eacute;cution de
l'action diff&eacute;r&eacute;e. Si les paquets provoquant l'action diff&eacute;r&eacute;e sont des
d&eacute;pendances d'autres paquets mis &agrave; jour, cela &eacute;vitera le lancement de
l'action diff&eacute;r&eacute;e et rendra possible l'ex&eacute;cution de l'action diff&eacute;r&eacute;e une
seule fois au cours des &eacute;tapes finales de la mise &agrave; jour.
<P>

Les variantes &laquo;&nbsp;-noawait&nbsp;&raquo; ne sont g&eacute;r&eacute;es qu'&agrave; partir de dpkg&nbsp;1.16.1 et
provoqueront des erreurs avec les versions plus anciennes.
<P>

Les alias de variantes &laquo;&nbsp;-await&nbsp;&raquo; ne sont g&eacute;r&eacute;s qu'&agrave; partir de dpkg&nbsp;1.17.21
et provoqueront des erreurs avec les versions plus anciennes.
<P>

Si un paquet fournit une directive <B>interest-noawait</B>, toute activation
mettra le paquet provoquant l'action diff&eacute;r&eacute;e en mode &laquo;&nbsp;noawait&nbsp;&raquo;,
ind&eacute;pendamment du mode d'attente demand&eacute; par l'activation (soit &laquo;&nbsp;await&nbsp;&raquo;,
soit &laquo;&nbsp;noawait&nbsp;&raquo;). Si un paquet fournit une directive <B>interest</B> ou
<B>interest-await</B>, toute activation mettra le paquet provoquant l'action
diff&eacute;r&eacute;e en mode &laquo;&nbsp;await&nbsp;&raquo; ou &laquo;&nbsp;noawait&nbsp;&raquo; selon la mani&egrave;re dont il a &eacute;t&eacute;
activ&eacute;.
<A NAME="lbAE">&nbsp;</A>
<H2>VOIR AUSSI</H2>


<B><A HREF="/cgi-bin/man/man2html?1+dpkg-trigger">dpkg-trigger</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B>/usr/share/doc/dpkg-dev/triggers.txt.gz</B>.
<A NAME="lbAF">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="8"><A HREF="#lbAB">NOM</A><DD>
<DT id="9"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="10"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="11"><A HREF="#lbAE">VOIR AUSSI</A><DD>
<DT id="12"><A HREF="#lbAF">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
