
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-buildinfo</TITLE>
</HEAD><BODY>
<H1>deb-buildinfo</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb-buildinfo - Format des fichiers d'information de construction de Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<I>nom-du-fichier</I><B>.buildinfo</B>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Chaque construction de paquet source Debian peut enregistrer les
informations de construction dans un fichier de contr&ocirc;le <B>.buildinfo</B> qui
contient un certain nombre de champs. Chaque champ commence par une
&eacute;tiquette, telle que <B>Source</B> ou <B>Binary</B> (la casse n'importe pas), suivie
d'un &laquo;&nbsp;:&nbsp;&raquo; et du contenu du champ. Les champs sont s&eacute;par&eacute;s seulement par des
&eacute;tiquettes de champ. En d'autres termes, le contenu d'un champ peut
s'&eacute;tendre sur plusieurs lignes, mais les outils d'installation joindront en
g&eacute;n&eacute;ral les lignes pendant le traitement du contenu du champ (sauf dans le
cas des champs &agrave; lignes multiples  <B>Binary-Only-Changes</B>,
<B>Installed-Build-Depends</B>, <B>Environment</B>, <B>Checksums-Md5</B>,
<B>Checksums-Sha1</B> et <B>Checksums-Sha256</B>, voir ci-dessous).
<P>

Les donn&eacute;es de contr&ocirc;le pourraient &ecirc;tre incluses dans une signature OpenPGP
&laquo;&nbsp;ASCII Armored&nbsp;&raquo;, comme sp&eacute;cifi&eacute; dans RFC4880.
<P>

Le nom du fichier <B>.buildinfo</B> d&eacute;pendra du type de construction et sera
aussi sp&eacute;cifique que n&eacute;cessaire mais pas plus&nbsp;; lorsque la construction
inclut <B>any</B>, le nom sera
<I>nom-source</I><B>_</B><I>version-binaire</I><B>_</B><I>arch</I><B>.buildinfo</B>, ou sinon pour
une construction <B>all</B> le nom sera
<I>nom-source</I><B>_</B><I>binary-version</I><B>_</B><B>all.buildinfo</B> ou encore pour une
construction qui inclut <B>source</B> le nom sera
<I>nom-source</I><B>_</B><I>version-source</I><B>_</B><B>source.buildinfo</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>LES CHAMPS</H2>

<DL COMPACT>
<DT id="1"><B>Format:</B> <I>version-format</I> (requis)<DD>
La valeur de ce champ d&eacute;clare la version du format du fichier. La syntaxe de
la valeur du champ est un num&eacute;ro de version avec un composant majeur et
mineur. Les modifications incompatibles avec les versions pr&eacute;c&eacute;dentes du
format incr&eacute;menteront la version majeure, tandis que les modifications
compatibles (telles que les ajouts de champ) incr&eacute;menteront la version
mineure. La version de format actuelle est <B>1.0</B>.
<DT id="2"><B>Source:</B> <I>nom-source</I> [<B>(</B><I>version-source</I><B>)</B>] (requis)<DD>
Le nom du paquet source. Si la version du source diff&egrave;re de la version
binaire, alors le <I>nom-source</I> sera suivi par une <I>version-source</I> entre
parenth&egrave;ses. Cela peut arriver quand la construction concerne un envoi
seulement binaire NMU (&laquo;&nbsp;non-maintainer upload&nbsp;&raquo;).
<DT id="3"><B>Binary:</B> <I>liste-paquets-binaires</I> (requis)<DD>
Ce champ coup&eacute; est une liste, s&eacute;par&eacute;e par des espaces, de paquets binaires
construits.
<DT id="4"><B>Architecture:</B> <I>liste-architectures</I> (requis)<DD>
Ce champ, s&eacute;par&eacute; par des espaces, liste les architectures des fichiers
actuellement en construction. Voici quelques architectures habituelles&nbsp;:
<B>amd64</B>, <B>armel</B>, <B>i386</B>,&nbsp;etc. Remarquez que l'option <B>all</B> signifie que
le paquet est ind&eacute;pendant de toute architecture. Si le source du paquet est
aussi en construction, l'entr&eacute;e sp&eacute;ciale <B>source</B> est aussi pr&eacute;sente. Les
architectures joker ne doivent jamais &ecirc;tre pr&eacute;sentes dans la liste.
<DT id="5"><B>Version:</B> <I>cha&icirc;ne-de-la-version</I> (requis)<DD>
C'est classiquement le num&eacute;ro de version du paquet d'origine dans la forme
choisie par l'auteur du programme. Il peut y avoir aussi un num&eacute;ro de
r&eacute;vision Debian (pour les paquets non natifs). Le format exact et
l'algorithme de tri sont d&eacute;crits dans <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7).
<DT id="6"><B>Binary-Only-Changes:</B><DD>

<I>entr&eacute;es-du-changelog</I>
Ce champ &agrave; lignes multiples contient le texte concat&eacute;n&eacute; des entr&eacute;es de
changelog pour un envoi seulement binaire (binNMU), si c'est le cas. Pour
faire de ce champ un champ &agrave; lignes multiples valable, les lignes vides sont
remplac&eacute;es par un point <B>&laquo;&nbsp;.&nbsp;&raquo;</B> et toutes les lignes sont indent&eacute;es par une
seule espace. Le contenu exact d&eacute;pend du format du changelog.
<DT id="7"><B>Checksums-Md5:</B> (requis)<DD>

<B>Checksums-Sha1:</B> (requis)

<B>Checksums-Sha256:</B> (requis)

<I>somme-de-contr&ocirc;le</I> <I>taille</I> <I>nom-du-fichier</I>
Ces champs &agrave; lignes multiples contiennent la liste des fichiers avec la
somme de contr&ocirc;le et la taille de chacun. Ces champs ont la m&ecirc;me syntaxe et
ne diff&egrave;rent que par l'algorithme de somme de contr&ocirc;le utilis&eacute;&nbsp;: MD5 pour
<B>Checksums-Md5</B>, SHA-1 pour <B>Checksums-Sha1</B> et SHA-256 pour
<B>Checksums-Sha256</B>.
<P>
La premi&egrave;re ligne de la valeur du champ (la partie sur la m&ecirc;me ligne que le
nom du champ suivi par deux-points) est toujours vide. Le contenu du champ
est exprim&eacute; par des lignes de continuation, une ligne par fichier. Chaque
ligne consiste en des entr&eacute;es s&eacute;par&eacute;es par des espaces d&eacute;crivant le
fichier&nbsp;:la somme de contr&ocirc;le, la taille du fichier et le nom du fichier.
<P>
Ces champs listent tous les fichiers qui composent la construction.
<DT id="8"><B>Build-Origin:</B> <I>nom</I><DD>
Nom de la distribution dont ce paquet provient.
<DT id="9"><B>Build-Architecture:</B> <I>arch</I> (requis)<DD>
L'architecture Debian pour l'installation des paquets en construction. Les
architectures habituelles sont <B>amd64</B>, <B>armel</B>, <B>i386</B>,&nbsp;etc.
<DT id="10"><B>Build-Date:</B> <I>date-construction</I><DD>
La date &agrave; laquelle le paquet a &eacute;t&eacute; construit. Elle peut &ecirc;tre au m&ecirc;me format
que la date dans les entr&eacute;es dans <B><A HREF="/cgi-bin/man/man2html?5+deb-changelog">deb-changelog</A></B>(5).
<DT id="11"><B>Build-Kernel-Version:</B> <I>version-du-noyau-de-construction</I><DD>
La publication et la version (dans un format non sp&eacute;cifi&eacute;) du noyau ex&eacute;cut&eacute;
dans le syst&egrave;me de construction. Ce champ va seulement &ecirc;tre pr&eacute;sent si le
constructeur l'a demand&eacute; explicitement, pour &eacute;viter de r&eacute;v&eacute;ler des
informations potentiellement sensibles.
<DT id="12"><B>Build-Path:</B> <I>chemin-de-construction</I><DD>
Le chemin de construction absolu qui correspond &agrave; l'arborescence des sources
d&eacute;paquet&eacute;e. Ce champ va seulement &ecirc;tre pr&eacute;sent si le distributeur l'a mis en
liste blanche gr&acirc;ce &agrave; une recherche de motif pour &eacute;viter de r&eacute;v&eacute;ler des
informations potentiellement sensibles.
<P>
Dans Debian et ses d&eacute;riv&eacute;s, seuls les chemins de construction d&eacute;butant par
<I>/build/</I> &eacute;mettront ce champ.
<DT id="13"><B>Build-Tainted-By:</B><DD>

<I>liste-des-raisons-de-souillure</I>
Ce champ coup&eacute; est une liste, s&eacute;par&eacute;e par des espaces, non exhaustive des
&eacute;tiquettes de raison (form&eacute;es de caract&egrave;res alphanum&eacute;riques et de tirets)
qui d&eacute;finissent pourquoi la construction actuelle a &eacute;t&eacute; souill&eacute;e (depuis
dpkg&nbsp;1.19.5).
<DT id="14"><DD>
Dans Debian et ses d&eacute;riv&eacute;es, les &eacute;tiquettes de raisons suivantes peuvent
&ecirc;tre &eacute;mises.
<DL COMPACT><DT id="15"><DD>
<DL COMPACT>
<DT id="16"><B>merged-usr-via-symlinks</B><DD>
Le syst&egrave;me poss&egrave;de un <I>/usr</I> fusionn&eacute; au moyen de liens symboliques. Cela
peut tromper <B>dpkg-query</B>, <B>dpkg-statoverride</B>, <B>dpkg-trigger</B>,
<B>update-alternatives</B> et tous les autres outils qui utilisent les noms de
chemin comme cl&eacute;s de leurs bases de donn&eacute;es, parce que cela cr&eacute;e des
probl&egrave;mes d'alias du syst&egrave;me de fichiers, et perturbe la compr&eacute;hension du
syst&egrave;me de fichiers que <B>dpkg</B> a enregistr&eacute; dans sa base de donn&eacute;es. Pour
des syst&egrave;mes construits qui codent en dur les noms de chemin vers des
binaires ou des biblioth&egrave;ques particuliers sur les objets produits, cela
peut aussi produire des paquets qui seront incompatibles avec des syst&egrave;mes
de fichiers sans <I>/usr</I> fusionn&eacute;.
<DT id="17"><B>usr-local-has-configs</B><DD>
Le syst&egrave;me a des fichiers de configuration dans <I>/usr/local/etc</I>.
<DT id="18"><B>usr-local-has-includes</B><DD>
Le syst&egrave;me a des fichiers d'en-t&ecirc;te dans <I>/usr/local/include</I>.
<DT id="19"><B>usr-local-has-programs</B><DD>
Le syst&egrave;me a des programmes dans <I>/usr/local/bin</I> ou <I>/usr/local/sbin</I>.
<DT id="20"><B>usr-local-has-libraries</B><DD>
Le syst&egrave;me a des biblioth&egrave;ques statiques ou partag&eacute;es dans
<I>/usr/local/lib</I>.
</DL>
</DL>

<DT id="21"><B>Installed-Build-Depends:</B> (requis)<DD>

<I>liste-paquets</I>
La liste des paquets install&eacute;s et configur&eacute;s que pourrait affecter le
processus de construction du paquet.
<P>
La liste contient le nom de chaque paquet, &eacute;ventuellement avec une
qualification d'architecture pour celles diff&eacute;rentes, avec une restriction
de version pr&eacute;cise, s&eacute;par&eacute;s par des virgules.
<P>
La liste inclut tous les paquets essentiels, les paquets list&eacute;s dans les
champs de contr&ocirc;le des sources <B>Build-Depends</B>, <B>Build-Depends-Arch</B>,
<B>Build-Depends-Indep</B>, chaque d&eacute;pendance interne sp&eacute;cifique au
distributeur, et toutes leurs d&eacute;pendances r&eacute;cursives. Dans Debian et ses
d&eacute;riv&eacute;s, une d&eacute;pendance interne est <B>build-essential</B>.
<P>
Pour les d&eacute;pendances provenant des champs de contr&ocirc;le des sources, toutes
les alternatives de d&eacute;pendance et tous les fournisseurs de paquets virtuels
d&eacute;pendants seront inclus.
<DT id="22"><B>Environment:</B><DD>

<I>liste-de-variables</I>
La liste des variables d'environnement qui sont connues pour affecter le
processus de construction du paquet. Chaque variable d'environnement est
suivie d'un signe &eacute;gal (&laquo;&nbsp;=&nbsp;&raquo;) et de la valeur de la variable prot&eacute;g&eacute; avec
des guillemets doubles (&laquo;&nbsp;&quot;&nbsp;&raquo;) et des barres obliques inverses (&laquo;&nbsp;\\&nbsp;&raquo;).






</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-changes">deb-changes</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-genbuildinfo">dpkg-genbuildinfo</A></B>(1).
<A NAME="lbAG">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="23"><A HREF="#lbAB">NOM</A><DD>
<DT id="24"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="25"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="26"><A HREF="#lbAE">LES CHAMPS</A><DD>
<DT id="27"><A HREF="#lbAF">VOIR AUSSI</A><DD>
<DT id="28"><A HREF="#lbAG">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
