
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb</TITLE>
</HEAD><BODY>
<H1>deb</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb - Format des paquets binaires Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<I>nom-du-fichier</I><B>.deb</B>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Le format <B>.deb</B> est le format des paquets binaires de Debian. Il est
compatible depuis la version&nbsp;0.93.76 de dpkg, et il est g&eacute;n&eacute;r&eacute; par d&eacute;faut
depuis les versions&nbsp;1.2.0 de dpkg et&nbsp;1.1.1elf (constructions i386/ELF).
<P>

Le format d&eacute;crit ici est utilis&eacute; depuis la version&nbsp;0.93 de Debian&nbsp;; les
d&eacute;tails concernant le vieux format sont consultables dans <B><A HREF="/cgi-bin/man/man2html?5+deb-old">deb-old</A></B>(5).
<A NAME="lbAE">&nbsp;</A>
<H2>FORMAT</H2>

Ce fichier est une archive <B>ar</B> avec une valeur magique de
<B>!&lt;arch&gt;</B>. Seul le format commun <B>ar</B> est g&eacute;r&eacute;, sans extension
pour les noms longs de fichiers, mais avec optionnellement un caract&egrave;re
&laquo;&nbsp;/&nbsp;&raquo; final, ce qui limite leur longueur utile &agrave; 15&nbsp;caract&egrave;res (sur les
16&nbsp;autoris&eacute;s). Les tailles de fichiers sont limit&eacute;es &agrave; 10&nbsp;chiffres d&eacute;cimaux
ASCII, ce qui permet d'utiliser des fichiers membres d'une taille jusqu'&agrave;
environ 9536,74&nbsp;Mio.
<P>

Les archives <B>tar</B> actuellement g&eacute;r&eacute;es sont le format&nbsp;v7 d'origine, le
format ustar pr&eacute;-POSIX, un sous-ensemble du format GNU (uniquement le
nouveau format de noms longs pour les chemins et les liens, g&eacute;r&eacute;s depuis
dpkg&nbsp;1.4.1.17&nbsp;; &laquo;&nbsp;large file metadata&nbsp;&raquo; depuis dpkg&nbsp;1.18.24) et le format
ustar POSIX (noms longs g&eacute;r&eacute;s depuis dpkg&nbsp;1.15.0). Les marqueurs tar
(&laquo;&nbsp;typeflags&nbsp;&raquo;) inconnus provoquent une erreur. La taille de chaque entr&eacute;e
dans une archive tar est limit&eacute;e &agrave; 11&nbsp;chiffres en octal ASCII ce qui permet
d'utiliser des entr&eacute;es tar d'une taille jusqu'&agrave; 8&nbsp;Gio. La gestion des
&laquo;&nbsp;large file metadata&nbsp;&raquo; de GNU permet des entr&eacute;es tar 95&nbsp;bits et des
horodatages n&eacute;gatifs, ainsi que des num&eacute;ros de 63&nbsp;bits d'UID, GID et de
p&eacute;riph&eacute;riques.
<P>

Le premier membre est nomm&eacute; <B>debian-binary</B> et contient une succession de
lignes, s&eacute;par&eacute;es par des caract&egrave;res saut de ligne. Pour le moment, une seule
ligne est pr&eacute;sente&nbsp;: le num&eacute;ro de version du format, <B>2.0</B> &agrave; l'heure o&ugrave; ce
document a &eacute;t&eacute; &eacute;crit. Les programmes lisant des archives Debian r&eacute;centes
doivent &ecirc;tre pr&eacute;par&eacute;s &agrave; une augmentation du num&eacute;ro de version mineur et &agrave; la
pr&eacute;sence de nouvelles lignes, et doivent les ignorer si tel est le cas.
<P>

Si le num&eacute;ro de version majeur a chang&eacute;, cela signifie qu'une modification
entra&icirc;nant une incompatibilit&eacute; entre les versions a &eacute;t&eacute; effectu&eacute;e, et le
programme doit alors s'arr&ecirc;ter. Si ce n'est pas le cas, le programme doit
&ecirc;tre en mesure de continuer &agrave; traiter correctement le fichier, &agrave; moins qu'il
ne rencontre un membre non reconnu dans l'archive (except&eacute; &agrave; la fin de cette
derni&egrave;re), comme d&eacute;crit ci-dessous.
<P>

Le second membre requis est nomm&eacute; <B>control.tar</B>. Il s'agit d'une archive
tar contenant les informations de contr&ocirc;le du paquet, soit non compress&eacute;e
(g&eacute;r&eacute;e depuis dpkg&nbsp;1.17.6) ou compress&eacute;e gr&acirc;ce &agrave; gzip (avec extension
<B>.gz</B>) ou xz (avec extension <B>.xz</B>, g&eacute;r&eacute;e depuis dpkg&nbsp;1.17.6), sous la
forme d'une s&eacute;rie de fichiers simples, parmi lesquels le fichier <B>control</B>
est strictement requis et contient les principales informations de contr&ocirc;le,
les fichiers <B>conffiles</B>, <B>triggers</B>, <B>shlibs</B> et <B>symbols</B> qui
contiennent des informations de contr&ocirc;le optionnelles, et les fichiers
<B>preinst</B>, <B>postinst</B>, <B>prerm</B> et <B>postrm</B> qui sont des scripts
optionnels du responsable. L'archive de contr&ocirc;le peut &eacute;ventuellement
contenir une entr&eacute;e pour &laquo;&nbsp;.&nbsp;&raquo;, le r&eacute;pertoire courant.
<P>

Le troisi&egrave;me et dernier membre obligatoire est appel&eacute; <B>data.tar</B>. Il
contient le syst&egrave;me de fichiers sous forme d'une archive tar, soit non
compress&eacute;e (g&eacute;r&eacute;e depuis dpkg&nbsp;1.10.24) ou compress&eacute;e avec gzip (avec
extension <B>.gz</B>), xz (avec extensions <B>.xz</B>, g&eacute;r&eacute;e depuis dpkg&nbsp;1.15.6),
bzip2 (avec extensions <B>.bz2</B>, g&eacute;r&eacute;e depuis dpkg&nbsp;1.10.24) ou lzma (avec
extension <B>.lzma</B>, g&eacute;r&eacute;e depuis dpkg&nbsp;1.13.25).
<P>

Ces membres doivent appara&icirc;tre dans cet ordre exact. Les impl&eacute;mentations
actuelles devraient ignorer tout membre additionnel apr&egrave;s
<B>data.tar</B>. D'autres membres seront &eacute;ventuellement propos&eacute;s, et (si
possible) seront plac&eacute;s apr&egrave;s ces trois derniers. Tout autre membre qui
n&eacute;cessitera d'&ecirc;tre ins&eacute;r&eacute; apr&egrave;s <B>debian-binary</B> et avant <B>control.tar</B> ou
<B>data.tar</B> et qui pourra &ecirc;tre ignor&eacute; sans probl&egrave;me par des programmes plus
anciens, aura un nom commen&ccedil;ant par un caract&egrave;re de soulignement, &laquo;&nbsp;<B>_</B>&nbsp;&raquo;.
<P>

Les nouveaux membres qui ne pourront pas &ecirc;tre ignor&eacute;s sans cons&eacute;quence
seront ins&eacute;r&eacute;s avant <B>data.tar</B> avec des noms pr&eacute;fix&eacute;s par quelque chose
d'autre qu'un caract&egrave;re de soulignement, ou impliqueront plus probablement
une incr&eacute;mentation du num&eacute;ro majeur de version.
<A NAME="lbAF">&nbsp;</A>
<H2>TYPE DE SUPPORT</H2>

<A NAME="lbAG">&nbsp;</A>
<H3>Actuel</H3>

application/vnd.debian.binary-package
<A NAME="lbAH">&nbsp;</A>
<H3>Obsol&egrave;te</H3>

application/x-debian-package
<BR>

application/x-deb
<A NAME="lbAI">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-old">deb-old</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-conffiles">deb-conffiles</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+deb-triggers">deb-triggers</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-shlibs">deb-shlibs</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-symbols">deb-symbols</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-preinst">deb-preinst</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+deb-postinst">deb-postinst</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-prerm">deb-prerm</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-postrm">deb-postrm</A></B>(5).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="1"><A HREF="#lbAB">NOM</A><DD>
<DT id="2"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="3"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="4"><A HREF="#lbAE">FORMAT</A><DD>
<DT id="5"><A HREF="#lbAF">TYPE DE SUPPORT</A><DD>
<DL>
<DT id="6"><A HREF="#lbAG">Actuel</A><DD>
<DT id="7"><A HREF="#lbAH">Obsol&egrave;te</A><DD>
</DL>
<DT id="8"><A HREF="#lbAI">VOIR AUSSI</A><DD>
<DT id="9"><A HREF="#lbAJ">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
