
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb822</TITLE>
</HEAD><BODY>
<H1>deb822</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

deb822 - Format des donn&eacute;es de contr&ocirc;le RFC822 Debian
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

Le syst&egrave;me de gestion de paquets manipule des donn&eacute;es repr&eacute;sent&eacute;es dans un
format commun, connues comme <I>donn&eacute;es de contr&ocirc;le</I>, stock&eacute;es dans les
<I>fichiers de contr&ocirc;le</I>. Les fichiers de contr&ocirc;le sont utilis&eacute;s pour les
paquets source, les paquets binaires et les fichiers <B>.changes</B> qui
contr&ocirc;lent l'installation des fichiers t&eacute;l&eacute;vers&eacute;s (les bases de donn&eacute;es
internes de <B>dpkg</B> sont dans un format similaire).
<A NAME="lbAD">&nbsp;</A>
<H2>SYNTAXE</H2>

Un fichier de contr&ocirc;le consiste en un ou plusieurs paragraphes de champs
(les paragraphes sont aussi parfois appel&eacute;s strophes, &laquo;&nbsp;stanzas&nbsp;&raquo;). Les
paragraphes sont s&eacute;par&eacute;s par des lignes vides. Les analyseurs peuvent
accepter des lignes qui ne contiennent que des caract&egrave;res U+0020 <B>ESPACE</B>
et U+0009 <B>TABULATION</B> comme s&eacute;parateurs de paragraphes, mais les fichiers
de contr&ocirc;le utiliseront des lignes vides. Certains fichiers de contr&ocirc;le
acceptent seulement un paragraphe unique, d'autres plusieurs, dans ce cas,
chaque paragraphe fait r&eacute;f&eacute;rence habituellement &agrave; un paquet diff&eacute;rent. (Par
exemple, dans les paquets source, le premier paragraphe fait r&eacute;f&eacute;rence au
paquet source, et les paragraphes suivants font r&eacute;f&eacute;rences aux paquets
binaires cr&eacute;&eacute;s &agrave; partir du source.) L'ordre des paragraphes dans les
fichiers de contr&ocirc;les est important.
<P>
Chaque paragraphe consiste en une s&eacute;rie de champs de donn&eacute;es. Chaque champ
est constitu&eacute; d'un nom de champ suivi de deux-points (U+003A &laquo;&nbsp;<B>:</B>&nbsp;&raquo;), puis
les donn&eacute;es ou valeur associ&eacute;es &agrave; ce champ. Le nom du champ est compos&eacute; de
caract&egrave;res US-ASCII &agrave; l'exception des caract&egrave;res de contr&ocirc;le, de l'espace et
des deux-points (c'est-&agrave; dire des caract&egrave;res entre U+0021 &laquo;&nbsp;<B>!</B>&nbsp;&raquo; et U+0039
&laquo;&nbsp;<B>9</B>&nbsp;&raquo;, et entre U+003B &laquo;&nbsp;<B>;</B>&nbsp;&raquo; et U+007E &laquo;&nbsp;<B>~</B>&nbsp;&raquo; compris). Les noms de
champ ne doivent pas commencer par le caract&egrave;re de commentaire &laquo;&nbsp;(U+0023
<B>#</B>&nbsp;&raquo;, ni par le caract&egrave;re trait d'union (U+002D &laquo;&nbsp;<B>-</B>&nbsp;&raquo;.
<P>
Les champs se terminent &agrave; la fin de la ligne ou &agrave; la fin de la derni&egrave;re
ligne de continuation (voir ci-dessous). Une espace horizontale (U+0020
<B>ESPACE</B> et U+0009 <B>TABULATION</B>) peut appara&icirc;tre imm&eacute;diatement avant ou
apr&egrave;s la valeur et est ignor&eacute;e dans ce cas&nbsp;; par convention, il y une espace
unique apr&egrave;s les deux-points. Par exemple, un champ pourrait &ecirc;tre&nbsp;:
<DL COMPACT><DT id="1"><DD>
<PRE>
Package: dpkg
</PRE>

</DL>

le nom du champ est <B>Package</B> et la valeur du champ <B>dpkg</B>.
<P>
Des valeurs de champ vides ne sont permises que dans les fichiers de
contr&ocirc;le des paquets source (<I>debian/control</I>). Ces champs sont ignor&eacute;s.
<P>
Un paragraphe ne doit pas contenir plus d'une instance d'un nom de champ
particulier.
<P>
Il y a trois types de champ&nbsp;:
<P>
<DL COMPACT><DT id="2"><DD>
<DL COMPACT>
<DT id="3"><B>simple</B><DD>
Ce champ, y compris sa valeur, doit &ecirc;tre une ligne unique. La coupure du
champ est interdite. Il s'agit du type de champ par d&eacute;faut lorsque la
d&eacute;finition du champ ne pr&eacute;cise pas un type diff&eacute;rent.
<DT id="4"><B>coup&eacute;</B><DD>
La valeur d'un champ coup&eacute; (&laquo;&nbsp;folded&nbsp;&raquo;) est une ligne logique qui peut
s'&eacute;tendre sur plusieurs lignes. Les lignes qui suivent la premi&egrave;re sont
appel&eacute;es ligne de continuation et doivent commencer par un caract&egrave;re U+0020
<B>ESPACE</B> ou U+0009 <B>TABULATION</B>. Une espace, y compris les caract&egrave;res saut
de ligne, n'est pas importante dans les valeurs de champ des champs coup&eacute;s.
<P>
La m&eacute;thode de coupure est similaire &agrave; RFC5322, permettant des fichiers de
contr&ocirc;le, qui contiennent seulement un paragraphe et pas des champs &agrave;
plusieurs lignes, d'&ecirc;tre lus par les analyseurs &eacute;crits pour RFC5322.
<DT id="5"><B>&agrave; lignes multiples</B><DD>
La valeur d'un champ &agrave; lignes multiples peut comprendre de multiples lignes
de continuation. La premi&egrave;re ligne de la valeur, la partie sur la m&ecirc;me ligne
que le nom du champ, a souvent une signification particuli&egrave;re ou peut devoir
&ecirc;tre vide. Les autres lignes sont ajout&eacute;es avec la m&ecirc;me syntaxe que les
lignes de continuation des champs coup&eacute;s. Une espace, y compris les
caract&egrave;res saut de ligne, est importante dans les valeurs des champs &agrave;
lignes multiples.
</DL>
</DL>

<P>
Aucune espace ne doit appara&icirc;tre dans les noms (de paquet, d'architecture,
de fichier ou n'importe quoi d'autre) ou les num&eacute;ros de version, ou entre
les caract&egrave;res des relations des versions multi-caract&egrave;res.
<P>
La pr&eacute;sence et le but d'un champ, ainsi que la syntaxe de sa valeur peuvent
diff&eacute;rer selon les types de fichiers de contr&ocirc;le.
<P>
Les noms de champ ne sont pas sensibles &agrave; la casse, mais il est habituel de
mettre en capitale l'initiale des noms de champ utilisant une casse mixte
comme indiqu&eacute; plus bas. Les valeurs de champ sont sensibles &agrave; la casse &agrave;
moins que la description du champ ne dise le contraire.
<P>
Les s&eacute;parateurs de paragraphes (lignes vides) et les lignes constitu&eacute;es
uniquement de U+0020 <B>ESPACE</B> et U+0009 <B>TABULATION</B>, ne sont pas permis
dans les valeurs de champ ou entre les champs. Les lignes vides dans les
valeurs de champ sont habituellement prot&eacute;g&eacute;es par une U+0020 <B>ESPACE</B>
suivie par un point (U+002E &laquo;&nbsp;<B>.</B>&nbsp;&raquo;).
<P>
Les lignes d&eacute;butant par un U+0023 &laquo;&nbsp;<B>#</B>&nbsp;&raquo;, sans &ecirc;tre pr&eacute;c&eacute;d&eacute;e d'une espace
sont des lignes de commentaires qui ne sont permises que dans les fichiers
de contr&ocirc;le de paquet source et dans les fichiers <B><A HREF="/cgi-bin/man/man2html?5+deb-origin">deb-origin</A></B>(5). Ces
lignes de commentaires sont ignor&eacute;es, m&ecirc;me entre deux lignes de
continuation. Elles ne peuvent terminer les lignes logiques.
<P>
Tous les fichiers de contr&ocirc;le doivent &ecirc;tre encod&eacute;s en UTF-8.





<A NAME="lbAE">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B>RFC822</B>, <B>RFC5322</B>.
<A NAME="lbAF">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="6"><A HREF="#lbAB">NOM</A><DD>
<DT id="7"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="8"><A HREF="#lbAD">SYNTAXE</A><DD>
<DT id="9"><A HREF="#lbAE">VOIR AUSSI</A><DD>
<DT id="10"><A HREF="#lbAF">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
