
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dsc</TITLE>
</HEAD><BODY>
<H1>dsc</H1>
Section: suite dpkg (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

dsc - Format du fichier de contr&ocirc;le dans les paquets source Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SYNOPSIS</H2>

<I>nom-du-fichier</I><B>.dsc</B>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPTION</H2>

Chaque paquet Debian poss&egrave;de un fichier de contr&ocirc;le .dsc qui contient un
certain nombre de champs. Chaque champ commence par une &eacute;tiquette, telle que
<B>Source</B> ou <B>Binary</B> (la casse n'importe pas), suivie d'un &laquo;&nbsp;:&nbsp;&raquo;, et du
contenu du champ. Les champs sont s&eacute;par&eacute;s seulement par des &eacute;tiquettes de
champ. En d'autres termes, le contenu d'un champ peut s'&eacute;tendre sur
plusieurs lignes, mais les outils d'installation joindront en g&eacute;n&eacute;ral les
lignes pendant le traitement du contenu du champ (sauf pour les champs &agrave;
lignes multiples <B>Package-List</B>, <B>Files</B>, <B>Checksums-Sha1</B> et
<B>Checksums-Sha256</B>, voir ci-dessous).
<P>

Les donn&eacute;es de contr&ocirc;le pourraient &ecirc;tre incluses dans une signature OpenPGP
&laquo;&nbsp;ASCII Armored&nbsp;&raquo;, comme sp&eacute;cifi&eacute; dans RFC4880.
<A NAME="lbAE">&nbsp;</A>
<H2>LES CHAMPS</H2>

<DL COMPACT>
<DT id="1"><B>Format:</B> <I>version-format</I> (requis)<DD>
La valeur de ce champ d&eacute;clare la version du format du paquet source. La
valeur du champ est utilis&eacute;e par les programmes qui agissent sur un paquet
source pour interpr&eacute;ter la liste des fichiers du paquet source et d&eacute;terminer
comment le d&eacute;paqueter. La syntaxe de la valeur du champ est un num&eacute;ro de
r&eacute;vision majeure (&laquo;&nbsp;0-9&nbsp;&raquo;), un point (&laquo;&nbsp;.&nbsp;&raquo;), un num&eacute;ro de r&eacute;vision mineure,
puis un sous-type facultatif apr&egrave;s une espace (&laquo;&nbsp;&nbsp;&nbsp;&raquo;) qui, lorsqu'il est
pr&eacute;sent, est un mot en caract&egrave;res alphanum&eacute;riques (&laquo;&nbsp;a-z0-9&nbsp;&raquo;), en
minuscules entre parenth&egrave;ses (&laquo;&nbsp;()&nbsp;&raquo;. Le sous-type est facultatif dans la
syntaxe, mais peut &ecirc;tre obligatoire pour certaines r&eacute;visions particuli&egrave;res
du format source.
<P>
Les formats source actuellement pris en charge par <B>dpkg</B> sont <B>1.0</B>,
<B>2.0</B>, <B>3.0 (native)</B>, <B>3.0 (quilt)</B>, <B>3.0 (git)</B>, <B>3.0 (bzr)</B> et <B>3.0
(custom)</B>. Voir <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1) pour leur description.
<DT id="2"><B>Source:</B> <I>nom-source</I> (requis)<DD>
La valeur de ce champ donne le nom du paquet, et la plupart des outils
d'installation s'en servent pour produire les noms des paquets.
<DT id="3"><B>Binary:</B> <I>liste-de-paquets-binaires</I><DD>
Ce champ coup&eacute; liste des paquets binaires que ce paquet source peut produire
s&eacute;par&eacute;s par des virgules.
<P>
Ce champ a maintenant &eacute;t&eacute; remplac&eacute; par le champ <B>Package-List</B> qui donne
suffisamment d'informations sur quels paquets binaires sont produits sur
quelle architecture, quel profil de construction et autres restrictions
actives.
<DT id="4"><B>Architecture:</B> <I>liste-architectures</I> (recommand&eacute;)<DD>
Une liste d'architectures et de jokers d'architecture s&eacute;par&eacute;s par des
espaces qui pr&eacute;cisent le type de mat&eacute;riel pour lequel ce paquet peut &ecirc;tre
compil&eacute;. Les noms et les jokers d'architecture courants sont <B>amd64</B>,
<B>armel</B>, <B>i386</B>, <B>linux-any</B>, <B>any-amd64</B>,&nbsp;etc.
<P>
Notez que la valeur <B>all</B> est destin&eacute;e aux paquets ind&eacute;pendants de
l'architecture et <B>any</B> &agrave; ceux qui sont d&eacute;pendants d'une architecture. La
liste peut comprendre (ou consister uniquement de) la valeur sp&eacute;ciale
<B>all</B>. Quand la liste comprend le joker d'architecture <B>any</B>, la seule
autre valeur permise dans la liste est <B>all</B>.
<P>
La valeur du champ est en g&eacute;n&eacute;ral g&eacute;n&eacute;r&eacute;e par les champs <B>Architecture</B> du
fichier <I>debian/control</I> du paquet source.
<DT id="5"><B>Version:</B> <I>cha&icirc;ne-de-la-version</I> (requis)<DD>
C'est classiquement le num&eacute;ro de version du paquet d'origine dans la forme
choisie par l'auteur du programme. Il peut y avoir aussi un num&eacute;ro de
r&eacute;vision Debian (pour les paquets non natifs). Le format exact et
l'algorithme de tri sont d&eacute;crits dans <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7).
<DT id="6"><B>Origin:</B><I> nom</I><DD>
Nom de la distribution dont ce paquet provient.
<DT id="7"><B>Maintainer:</B> <I>nom-complet-et-adresse-&eacute;lectronique</I> (recommand&eacute;)<DD>
Le format de ce champ sera &laquo;&nbsp;Jean Dupont &lt;<A HREF="mailto:jdupont@foo.com">jdupont@foo.com</A>&gt;&nbsp;&raquo;&nbsp;; et
c'est bien s&ucirc;r le cr&eacute;ateur du paquet, par opposition &agrave; l'auteur du programme
mis en paquet.
<DT id="8"><B>Uploaders:</B> <I>liste-de-noms-complets-et-adresses-&eacute;lectroniques</I><DD>
Affiche les noms et les adresses &eacute;lectroniques des co-responsables du
paquet, au m&ecirc;me format que le champ <B>Maintainer</B>. Des co-responsables
multiples peuvent &ecirc;tre s&eacute;par&eacute;s par des virgules.
<DT id="9"><B>Description</B> <I>description-courte</I><DD>

<B> </B><I>description-longue</I>
Le format de la description du paquet est un r&eacute;sum&eacute; bref sur la premi&egrave;re
ligne (apr&egrave;s le champ <B>Description</B>). Les lignes suivantes peuvent servir &agrave;
une description plus longue et plus d&eacute;taill&eacute;e. Chaque ligne de cette
description longue doit &ecirc;tre pr&eacute;c&eacute;d&eacute;e d'une espace&nbsp;; quand c'est une ligne
blanche, elle doit contenir un seul &laquo;&nbsp;<B>.</B>&nbsp;&raquo; apr&egrave;s cette espace.
<DT id="10"><B>Homepage:</B><I> URL</I><DD>
<I>URL</I> de la page d'accueil du projet amont.
<DT id="11"><B>Standards-Version:</B> <I>cha&icirc;ne-de-la-version</I> (recommand&eacute;)<DD>
Ce champ indique la version la plus r&eacute;cente des normes de la charte de la
distribution auxquelles ce paquet se conforme.
<DT id="12"><B>Vcs-Browser:</B><I> URL</I><DD>
Indique l'<I>URL</I> de l'interface web permettant de parcourir le d&eacute;p&ocirc;t du
syst&egrave;me de gestion de versions.
<DT id="13"><B>Vcs-Arch:</B><I> URL</I><DD>

<B>Vcs-Bzr:</B><I> URL</I>

<B>Vcs-Cvs:</B><I> URL</I>

<B>Vcs-Darcs:</B><I> URL</I>

<B>Vcs-Git:</B><I> URL</I>

<B>Vcs-Hg:</B><I> URL</I>

<B>Vcs-Mtn:</B><I> URL</I>

<B>Vcs-Svn:</B><I> URL</I>
Ces champs indiquent l'<I>URL</I> du d&eacute;p&ocirc;t du syst&egrave;me de gestion de versions
utilis&eacute; pour la gestion du paquet. Voir <B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5) pour plus de
d&eacute;tails.
<DT id="14"><B>Testsuite:</B><I> liste-de-noms</I><DD>
Ce champ indique que le paquet source contient les suites de tests
sp&eacute;cifi&eacute;es. La valeur est une liste des suites de tests s&eacute;par&eacute;es par des
virgules. Si la valeur <B>autopkgtest</B> est pr&eacute;sente, un fichier
<I>debian/tests/control</I> devrait &ecirc;tre pr&eacute;sent, et si la fichier est pr&eacute;sent
mais pas la valeur, alors <B>dpkg-source</B> l'ajoutera automatiquement, en
conservant les valeurs pr&eacute;c&eacute;dentes.
<DT id="15"><B>Testsuite-Triggers:</B><I> liste-de-paquets</I><DD>
Ce champ indique l'union de toutes les d&eacute;pendances de test, s&eacute;par&eacute;es par des
virgules (champs <B>Depends</B> du fichier <I>debian/tests/control</I>), toutes
restrictions supprim&eacute;es, et les d&eacute;pendances OR mises &agrave; plat (c'est-&agrave;-dire
convertie en relations AND distinctes), sauf pour les binaires g&eacute;n&eacute;r&eacute;s par
ce paquet source et son &eacute;quivalent de m&eacute;ta-d&eacute;pendance <B>@</B>.
<P>
Raison&nbsp;: ce champ est n&eacute;cessaire parce qu'autrement chaque paquet source
devrait &ecirc;tre d&eacute;paquet&eacute; pour pouvoir obtenir les d&eacute;pendances de test.
<DT id="16"><B>Build-Depends:</B><I> liste-de-paquets</I><DD>

<B>Build-Depends-Arch:</B><I>liste-de-paquets</I>

<B>Build-Depends-Indep:</B><I> liste-de-paquets</I>

<B>Build-Conflicts:</B><I> liste de paquets</I>

<B>Build-Conflicts-Arch:</B><I> liste-de-paquets</I>

<B>Build-Conflicts-Indep:</B><I> liste-de-paquets</I>
Ces champs indiquent les relations entre le paquet source et les paquets
utilis&eacute;s pour le construire. Ils sont d&eacute;taill&eacute;s dans la page de manuel
<B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5).
<DT id="17"><B>Package-List:</B><DD>

<I>paquet</I> <I>type-de-paquet</I> <I>section</I> <I>priorit&eacute;</I> <I>liste-cl&eacute;s-valeurs</I>
Ce champ &agrave; lignes multiples contient une liste des paquets binaires g&eacute;n&eacute;r&eacute;s
par le paquet source.
<P>
Le <I>paquet</I> est le nom du paquet binaire.
<P>
Le <I>type-de-paquet</I> est le type du paquet binaire, habituellement <B>deb</B>&nbsp;;
une autre valeur commune est <B>udeb</B>.
<P>
La <I>section</I> et la <I>priorit&eacute;</I> correspondent aux champs du m&ecirc;me nom du
paquet binaire.
<P>
La <I>liste-cl&eacute;s-valeurs</I> est une liste de <I>cl&eacute;s</I><B>=</B><I>valeurs</I> s&eacute;par&eacute;es par
des valeurs et les cl&eacute;s optionnelles actuellement reconnues sont&nbsp;:
<P>
<DL COMPACT><DT id="18"><DD>
<DL COMPACT>
<DT id="19"><B>arch</B><DD>
Les restrictions d'architecture &agrave; partir du champ <B>Architecture</B> du paquet
binaire avec les espaces converties en &laquo;&nbsp;,&nbsp;&raquo;.
<DT id="20"><B>profile</B><DD>
La formule normalis&eacute;e de restrictions de profil de construction &agrave; partir du
champ <B>Build-Profile</B> du paquet binaire avec les OR convertis en &laquo;&nbsp;+&nbsp;&raquo; et
les &laquo;&nbsp;AND&nbsp;&raquo; en &laquo;&nbsp;,&nbsp;&raquo;.
<DT id="21"><B>essential</B><DD>
Si le paquet binaire est essentiel, cette cl&eacute; contiendra la valeur du champ
<B>Essential</B>, qui est la valeur <B>yes</B>.
</DL>
</DL>

<DT id="22"><B>Files:</B> (requis)<DD>

<B>Checksums-Sha1:</B> (requis)

<B>Checksums-Sha256:</B> (requis)

<I>somme-de-contr&ocirc;le</I> <I>taille</I> <I>nom-du-fichier</I>
Ces champs &agrave; lignes multiples contiennent une liste de fichiers avec une
somme de contr&ocirc;le et une taille pour chacun. Ces champs ont la m&ecirc;me syntaxe
et diff&egrave;rent seulement par l'algorithme de somme de contr&ocirc;le employ&eacute;&nbsp;: MD5
pour <B>Files</B>, SHA-1 pour <B>Checksums-Sha1</B> et SHA-256 pour
<B>Checksums-Sha256</B>.
<P>
La premi&egrave;re ligne de la valeur du champ (la partie sur la m&ecirc;me ligne que le
nom du champ suivi par deux-points) est toujours vide. Le contenu du champ
est exprim&eacute; sous la forme de lignes de continuation, un ligne par
fichier. Chaque ligne consiste en la somme de contr&ocirc;le, une espace, la
taille du fichier, une espace et le nom du fichier.
<P>
Ces champs listent tous les fichiers qui composent le paquet source. La
liste de fichiers de ces champs doit correspondre &agrave; celle pr&eacute;sente dans les
autres champs relatifs.





</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>BOGUES</H2>

Le champ <B>Format</B> combine le format pour le fichier <B>.dsc</B> lui-m&ecirc;me et le
format du paquet source extrait.
<A NAME="lbAG">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1).
<A NAME="lbAH">&nbsp;</A>
<H2>TRADUCTION</H2>

Ariel VARDI &lt;<A HREF="mailto:ariel.vardi@freesbee.fr">ariel.vardi@freesbee.fr</A>&gt;, 2002.
Philippe Batailler, 2006.
Nicolas Fran&ccedil;ois, 2006.
Veuillez signaler toute erreur &agrave; &lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="23"><A HREF="#lbAB">NOM</A><DD>
<DT id="24"><A HREF="#lbAC">SYNOPSIS</A><DD>
<DT id="25"><A HREF="#lbAD">DESCRIPTION</A><DD>
<DT id="26"><A HREF="#lbAE">LES CHAMPS</A><DD>
<DT id="27"><A HREF="#lbAF">BOGUES</A><DD>
<DT id="28"><A HREF="#lbAG">VOIR AUSSI</A><DD>
<DT id="29"><A HREF="#lbAH">TRADUCTION</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
