
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of LOGIN.DEFS</TITLE>
</HEAD><BODY>
<H1>LOGIN.DEFS</H1>
Section: Formats et conversions de fich (5)<BR>Updated: 28/05/2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

login.defs - configuration de la suite des mots de passe cach&eacute;s &laquo;&nbsp;shadow password&nbsp;&raquo;
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

The
/etc/login.defs
file defines the site-specific configuration for the shadow password suite. This file is required. Absence of this file will not prevent system operation, but will probably result in undesirable operation.
<P>

Ce fichier est un fichier texte, dont chaque ligne d&eacute;crit un param&egrave;tre de configuration. Les lignes consistent en un nom et une valeur, s&eacute;par&eacute;s par une espace. Les lignes blanches et les lignes de commentaires sont ignor&eacute;es. Les commentaires commencent par un caract&egrave;re &laquo;&nbsp;#&nbsp;&raquo;, qui doit &ecirc;tre le premier caract&egrave;re non blanc de la ligne.
<P>

Parameter values may be of four types: strings, booleans, numbers, and long numbers. A string is comprised of any printable characters. A boolean should be either the value
<I>yes</I>
or
<I>no</I>. An undefined boolean parameter or one with a value other than these will be given a
<I>no</I>
value. Numbers (both regular and long) may be either decimal values, octal values (precede the value with
<I>0</I>) or hexadecimal values (precede the value with
<I>0x</I>). The maximum value of the regular and long numeric parameters is machine-dependent.
<P>

Les param&egrave;tres de configuration suivants sont fournis&nbsp;:
<P>

<B>CHFN_RESTRICT</B> (string)
<DL COMPACT><DT id="1"><DD>
This parameter specifies which values in the
<I>gecos</I>
field of the
/etc/passwd
file may be changed by regular users using the
<B>chfn</B>
program. It can be any combination of letters
<I>f</I>,
<I>r</I>,
<I>w</I>,
<I>h</I>, for Full name, Room number, Work phone, and Home phone, respectively. For backward compatibility,
<I>yes</I>
is equivalent to
<I>rwh</I>
and
<I>no</I>
is equivalent to
<I>frwh</I>. If not specified, only the superuser can make any changes. The most restrictive setting is better achieved by not installing
<B>chfn</B>
SUID.
</DL>

<P>

<B>CONSOLE_GROUPS</B> (string)
<DL COMPACT><DT id="2"><DD>
List of groups to add to the user's supplementary groups set when logging in on the console (as determined by the CONSOLE setting). Default is none.
<P>
Use with caution - it is possible for users to gain permanent access to these groups, even when not logged in on the console.
</DL>

<P>

<B>CREATE_HOME</B> (boolean)
<DL COMPACT><DT id="3"><DD>
Indiquer si un r&eacute;pertoire personnel doit &ecirc;tre cr&eacute;&eacute; par d&eacute;faut pour les nouveaux utilisateurs.
<P>
Ce r&eacute;glage ne s'applique pas pour les utilisateurs syst&egrave;me, et peut &ecirc;tre annul&eacute; sur la ligne de commande.
</DL>

<P>

<B>DEFAULT_HOME</B> (boolean)
<DL COMPACT><DT id="4"><DD>
Indiquer si la connexion est permise si on ne peut pas acc&eacute;der au r&eacute;pertoire personnel. Le r&eacute;glage par d&eacute;faut est &laquo;&nbsp;no&nbsp;&raquo;.
<P>
If set to
<I>yes</I>, the user will login in the root (/) directory if it is not possible to cd to her home directory.
</DL>

<P>

<B>ENCRYPT_METHOD</B> (string)
<DL COMPACT><DT id="5"><DD>
D&eacute;finir les algorithmes de chiffrement par d&eacute;faut du syst&egrave;me pour coder les mots de passes (si aucun algorithme n'a &eacute;t&eacute; indiqu&eacute; sur la ligne de commandes).
<P>
It can take one of these values:
<I>DES</I>
(default),
<I>MD5</I>, <I>SHA256</I>, <I>SHA512</I>.
<P>
Note: this parameter overrides the
<B>MD5_CRYPT_ENAB</B>
variable.
<P>
Remarque&nbsp;: cela n'affecte que la cr&eacute;ation des mots de passe de groupe. La cr&eacute;ation de mot de passe des utilisateurs est effectu&eacute;e par PAM en fonction de la configuration de PAM. Il est recommand&eacute; de d&eacute;finir cette variable en coh&eacute;rence avec la configuration de PAM.
</DL>

<P>

<B>ENV_HZ</B> (string)
<DL COMPACT><DT id="6"><DD>
If set, it will be used to define the HZ environment variable when a user login. The value must be preceded by
<I>HZ=</I>. A common value on Linux is
<I>HZ=100</I>.
<P>
The
<B>HZ</B>
environment variable is only set when the user (the superuser) logs in with
<B>sulogin</B>.
</DL>

<P>

<B>ENV_PATH</B> (string)
<DL COMPACT><DT id="7"><DD>
If set, it will be used to define the PATH environment variable when a regular user login. The value is a colon separated list of paths (for example
<I>/bin:/usr/bin</I>) and can be preceded by
<I>PATH=</I>. The default value is
<I>PATH=/bin:/usr/bin</I>.
</DL>

<P>

<B>ENV_SUPATH</B> (string)
<DL COMPACT><DT id="8"><DD>
If set, it will be used to define the PATH environment variable when the superuser login. The value is a colon separated list of paths (for example
<I>/sbin:/bin:/usr/sbin:/usr/bin</I>) and can be preceded by
<I>PATH=</I>. The default value is
<I>PATH=/sbin:/bin:/usr/sbin:/usr/bin</I>.
</DL>

<P>

<B>ERASECHAR</B> (number)
<DL COMPACT><DT id="9"><DD>
Terminal ERASE character (<I>010</I>
= backspace,
<I>0177</I>
= DEL).
<P>
La valeur peut &ecirc;tre pr&eacute;fix&eacute;e par &laquo;&nbsp;0&nbsp;&raquo; pour une valeur octale, ou &laquo;&nbsp;0x&nbsp;&raquo; pour une valeur hexad&eacute;cimale.
</DL>

<P>

<B>FAIL_DELAY</B> (number)
<DL COMPACT><DT id="10"><DD>
Le d&eacute;lai en secondes avant qu'un nouvel essai soit permis apr&egrave;s un &eacute;chec de connexion.
</DL>

<P>

<B>FAKE_SHELL</B> (string)
<DL COMPACT><DT id="11"><DD>
If set,
<B>login</B>
will execute this shell instead of the users' shell specified in
/etc/passwd.
</DL>

<P>

<B>GID_MAX</B> (number), <B>GID_MIN</B> (number)
<DL COMPACT><DT id="12"><DD>
Range of group IDs used for the creation of regular groups by
<B>useradd</B>,
<B>groupadd</B>, or
<B>newusers</B>.
<P>
The default value for
<B>GID_MIN</B>
(resp.
<B>GID_MAX</B>) is 1000 (resp. 60000).
</DL>

<P>

<B>HOME_MODE</B> (number)
<DL COMPACT><DT id="13"><DD>
The mode for new home directories. If not specified, the
<B>UMASK</B>
is used to create the mode.
<P>
<B>useradd</B>
and
<B>newusers</B>
use this to set the mode of the home directory they create.
</DL>

<P>

<B>HUSHLOGIN_FILE</B> (string)
<DL COMPACT><DT id="14"><DD>
Si d&eacute;finie, le fichier peut d&eacute;sactiver tous les affichages habituels durant la s&eacute;quence de connexion. Si un nom de chemin complet est sp&eacute;cifi&eacute;, alors le mode taiseux sera activ&eacute; si le nom ou l'interpr&eacute;teur de commandes de l'utilisateur sont trouv&eacute;s dans le fichier. Si ce n'est pas un nom de chemin complet, alors le mode taiseux sera activ&eacute; si le fichier existe dans le r&eacute;pertoire personnel de l'utilisateur.
</DL>

<P>

<B>KILLCHAR</B> (number)
<DL COMPACT><DT id="15"><DD>
Terminal KILL character (<I>025</I>
= CTRL/U).
<P>
La valeur peut &ecirc;tre pr&eacute;fix&eacute;e par &laquo;&nbsp;0&nbsp;&raquo; pour une valeur octale, ou &laquo;&nbsp;0x&nbsp;&raquo; pour une valeur hexad&eacute;cimale.
</DL>

<P>

<B>LASTLOG_UID_MAX</B> (number)
<DL COMPACT><DT id="16"><DD>
Highest user ID number for which the lastlog entries should be updated. As higher user IDs are usually tracked by remote user identity and authentication services there is no need to create a huge sparse lastlog file for them.
<P>
No
<B>LASTLOG_UID_MAX</B>
option present in the configuration means that there is no user ID limit for writing lastlog entries.
</DL>

<P>

<B>LOG_OK_LOGINS</B> (boolean)
<DL COMPACT><DT id="17"><DD>
Activer la journalisation des connexions r&eacute;ussies.
</DL>

<P>

<B>LOG_UNKFAIL_ENAB</B> (boolean)
<DL COMPACT><DT id="18"><DD>
Activer l'affichage des noms d'utilisateurs inconnus quand les &eacute;checs de connexions sont enregistr&eacute;s.
<P>
Remarque&nbsp;: la journalisation des noms d'utilisateurs inconnus peut &ecirc;tre un probl&egrave;me de s&eacute;curit&eacute; si un utilisateur entre son mot de passe au lieu de son nom d'utilisateur.
</DL>

<P>

<B>LOGIN_RETRIES</B> (number)
<DL COMPACT><DT id="19"><DD>
Le nombre maximum de tentatives de connexion en cas de mauvais mot de passe.
<P>
Ce sera probablement &eacute;cras&eacute; par PAM, puisque le module pam_unix est r&eacute;gl&eacute; en dur pour n'effectuer que 3 tentatives. Toutefois, il s'agit d'une solution de repli au cas o&ugrave; vous utilisez un module d'authentification qui ne fait pas appliquer PAM_MAXTRIES.
</DL>

<P>

<B>LOGIN_TIMEOUT</B> (number)
<DL COMPACT><DT id="20"><DD>
Le temps maximum en secondes pour la connexion.
</DL>

<P>

<B>MAIL_DIR</B> (string)
<DL COMPACT><DT id="21"><DD>
R&eacute;pertoire d'attente des courriels (&laquo;&nbsp;mail spool directory&nbsp;&raquo;). Ce param&egrave;tre est n&eacute;cessaire pour manipuler les bo&icirc;tes &agrave; lettres lorsque le compte d'un utilisateur est modifi&eacute; ou supprim&eacute;. S'il n'est pas sp&eacute;cifi&eacute;, une valeur par d&eacute;faut d&eacute;finie &agrave; la compilation est utilis&eacute;e.
</DL>

<P>

<B>MAIL_FILE</B> (string)
<DL COMPACT><DT id="22"><DD>
D&eacute;finir l'emplacement des bo&icirc;tes aux lettres des utilisateurs relativement &agrave; leur r&eacute;pertoire personnel.
</DL>

<P>

The
<B>MAIL_DIR</B>
and
<B>MAIL_FILE</B>
variables are used by
<B>useradd</B>,
<B>usermod</B>, and
<B>userdel</B>
to create, move, or delete the user's mail spool.
<P>

<B>MAX_MEMBERS_PER_GROUP</B> (number)
<DL COMPACT><DT id="23"><DD>
Maximum members per group entry. When the maximum is reached, a new group entry (line) is started in
/etc/group
(with the same name, same password, and same GID).
<P>
La valeur par d&eacute;faut est 0, ce qui signifie qu'il n'y a pas de limites pour le nombre de membres dans un groupe.
<P>
Cette fonctionnalit&eacute; (groupe d&eacute;coup&eacute;) permet de limiter la longueur des lignes dans le fichier de groupes. Ceci est utile pour s'assurer que les lignes pour les groupes NIS ne sont pas plus grandes que 1024 caract&egrave;res.
<P>
Si vous avez besoin de configurer cette limite, vous pouvez utiliser 25.
<P>
Remarque&nbsp;: les groupes d&eacute;coup&eacute;s ne sont peut-&ecirc;tre pas pris en charge par tous les outils (m&ecirc;me dans la suite d'outils Shadow). Vous ne devriez pas utiliser cette variable, sauf si vous en avez vraiment besoin.
</DL>

<P>

<B>MD5_CRYPT_ENAB</B> (boolean)
<DL COMPACT><DT id="24"><DD>
Indicate if passwords must be encrypted using the MD5-based algorithm. If set to
<I>yes</I>, new passwords will be encrypted using the MD5-based algorithm compatible with the one used by recent releases of FreeBSD. It supports passwords of unlimited length and longer salt strings. Set to
<I>no</I>
if you need to copy encrypted passwords to other systems which don't understand the new algorithm. Default is
<I>no</I>.
<P>
This variable is superseded by the
<B>ENCRYPT_METHOD</B>
variable or by any command line option used to configure the encryption algorithm.
<P>
This variable is deprecated. You should use
<B>ENCRYPT_METHOD</B>.
<P>
Remarque&nbsp;: cela n'affecte que la cr&eacute;ation des mots de passe de groupe. La cr&eacute;ation de mot de passe des utilisateurs est effectu&eacute;e par PAM en fonction de la configuration de PAM. Il est recommand&eacute; de d&eacute;finir cette variable en coh&eacute;rence avec la configuration de PAM.
</DL>

<P>

<B>PASS_MAX_DAYS</B> (number)
<DL COMPACT><DT id="25"><DD>
Nombre maximum de jours de validit&eacute; d'un mot de passe. Apr&egrave;s cette dur&eacute;e, une modification du mot de passe est obligatoire. S'il n'est pas pr&eacute;cis&eacute;, la valeur de -1 est utilis&eacute;e (ce qui enl&egrave;ve toute restriction).
</DL>

<P>

<B>PASS_MIN_DAYS</B> (number)
<DL COMPACT><DT id="26"><DD>
Nombre minimum de jours autoris&eacute; avant la modification d'un mot de passe. Toute tentative de modification du mot de passe avant cette dur&eacute;e est rejet&eacute;e. S'il n'est pas pr&eacute;cis&eacute;, la valeur de -1 est utilis&eacute;e (ce qui enl&egrave;ve toute restriction).
</DL>

<P>

<B>PASS_WARN_AGE</B> (number)
<DL COMPACT><DT id="27"><DD>
Nombre de jours durant lesquels l'utilisateur recevra un avertissement avant que son mot de passe n'arrive en fin de validit&eacute;. Une valeur n&eacute;gative signifie qu'aucun avertissement n'est donn&eacute;. S'il n'est pas pr&eacute;cis&eacute;, aucun avertissement n'est donn&eacute;.
</DL>

<P>

<B>PASS_MAX_DAYS</B>,
<B>PASS_MIN_DAYS</B>
and
<B>PASS_WARN_AGE</B>
are only used at the time of account creation. Any changes to these settings won't affect existing accounts.
<P>

<B>SHA_CRYPT_MIN_ROUNDS</B> (number), <B>SHA_CRYPT_MAX_ROUNDS</B> (number)
<DL COMPACT><DT id="28"><DD>
When
<B>ENCRYPT_METHOD</B>
is set to
<I>SHA256</I>
or
<I>SHA512</I>, this defines the number of SHA rounds used by the encryption algorithm by default (when the number of rounds is not specified on the command line).
<P>
Avec beaucoup de rounds, il est plus difficile de trouver le mot de passe avec une attaque par force brute. Veuillez remarquer que plus de ressources processeur seront n&eacute;cessaires pour authentifier les utilisateurs.
<P>
Si non pr&eacute;cis&eacute;e, la libc utilisera le nombre de rounds par d&eacute;faut (5000).
<P>
Les valeurs doivent &ecirc;tre comprises dans l'intervalle 1&nbsp;000&nbsp;-&nbsp;999&nbsp;999&nbsp;999.
<P>
If only one of the
<B>SHA_CRYPT_MIN_ROUNDS</B>
or
<B>SHA_CRYPT_MAX_ROUNDS</B>
values is set, then this value will be used.
<P>
If
<B>SHA_CRYPT_MIN_ROUNDS</B>
&gt;
<B>SHA_CRYPT_MAX_ROUNDS</B>, the highest value will be used.
<P>
Remarque&nbsp;: cela n'affecte que la cr&eacute;ation des mots de passe de groupe. La cr&eacute;ation de mot de passe des utilisateurs est effectu&eacute;e par PAM en fonction de la configuration de PAM. Il est recommand&eacute; de d&eacute;finir cette variable en coh&eacute;rence avec la configuration de PAM.
</DL>

<P>

<B>SULOG_FILE</B> (string)
<DL COMPACT><DT id="29"><DD>
Si d&eacute;finie, les activit&eacute;s de su seront enregistr&eacute;es dans le fichier.
</DL>

<P>

<B>SU_NAME</B> (string)
<DL COMPACT><DT id="30"><DD>
Si d&eacute;finie, le nom de la commande &agrave; afficher lorsque &laquo;&nbsp;su -&nbsp;&raquo; est ex&eacute;cut&eacute;e. Par exemple, si elle est d&eacute;finie &agrave; &laquo;&nbsp;su&nbsp;&raquo; alors un &laquo;&nbsp;ps&nbsp;&raquo; affichera la commande comme &laquo;&nbsp;-su&nbsp;&raquo;. Si non d&eacute;finie, alors &laquo;&nbsp;ps&nbsp;&raquo; affichera le nom du shell qui sera en fait ex&eacute;cut&eacute;, par exemple quelque chose comme &laquo;&nbsp;-sh&nbsp;&raquo;.
</DL>

<P>

<B>SUB_GID_MIN</B> (number), <B>SUB_GID_MAX</B> (number), <B>SUB_GID_COUNT</B> (number)
<DL COMPACT><DT id="31"><DD>
If
/etc/subuid
exists, the commands
<B>useradd</B>
and
<B>newusers</B>
(unless the user already have subordinate group IDs) allocate
<B>SUB_GID_COUNT</B>
unused group IDs from the range
<B>SUB_GID_MIN</B>
to
<B>SUB_GID_MAX</B>
for each new user.
<P>
The default values for
<B>SUB_GID_MIN</B>,
<B>SUB_GID_MAX</B>,
<B>SUB_GID_COUNT</B>
are respectively 100000, 600100000 and 65536.
</DL>

<P>

<B>SUB_UID_MIN</B> (number), <B>SUB_UID_MAX</B> (number), <B>SUB_UID_COUNT</B> (number)
<DL COMPACT><DT id="32"><DD>
If
/etc/subuid
exists, the commands
<B>useradd</B>
and
<B>newusers</B>
(unless the user already have subordinate user IDs) allocate
<B>SUB_UID_COUNT</B>
unused user IDs from the range
<B>SUB_UID_MIN</B>
to
<B>SUB_UID_MAX</B>
for each new user.
<P>
The default values for
<B>SUB_UID_MIN</B>,
<B>SUB_UID_MAX</B>,
<B>SUB_UID_COUNT</B>
are respectively 100000, 600100000 and 65536.
</DL>

<P>

<B>SYS_GID_MAX</B> (number), <B>SYS_GID_MIN</B> (number)
<DL COMPACT><DT id="33"><DD>
Range of group IDs used for the creation of system groups by
<B>useradd</B>,
<B>groupadd</B>, or
<B>newusers</B>.
<P>
The default value for
<B>SYS_GID_MIN</B>
(resp.
<B>SYS_GID_MAX</B>) is 101 (resp.
<B>GID_MIN</B>-1).
</DL>

<P>

<B>SYS_UID_MAX</B> (number), <B>SYS_UID_MIN</B> (number)
<DL COMPACT><DT id="34"><DD>
Range of user IDs used for the creation of system users by
<B>useradd</B>
or
<B>newusers</B>.
<P>
The default value for
<B>SYS_UID_MIN</B>
(resp.
<B>SYS_UID_MAX</B>) is 101 (resp.
<B>UID_MIN</B>-1).
</DL>

<P>

<B>SYSLOG_SG_ENAB</B> (boolean)
<DL COMPACT><DT id="35"><DD>
Enable &quot;syslog&quot; logging of
<B>sg</B>
activity.
</DL>

<P>

<B>SYSLOG_SU_ENAB</B> (boolean)
<DL COMPACT><DT id="36"><DD>
Enable &quot;syslog&quot; logging of
<B>su</B>
activity - in addition to sulog file logging.
</DL>

<P>

<B>TTYGROUP</B> (string), <B>TTYPERM</B> (string)
<DL COMPACT><DT id="37"><DD>
The terminal permissions: the login tty will be owned by the
<B>TTYGROUP</B>
group, and the permissions will be set to
<B>TTYPERM</B>.
<P>
By default, the ownership of the terminal is set to the user's primary group and the permissions are set to
<I>0600</I>.
<P>
<B>TTYGROUP</B>
can be either the name of a group or a numeric group identifier.
<P>
If you have a
<B>write</B>
program which is &quot;setgid&quot; to a special group which owns the terminals, define TTYGROUP to the group number and TTYPERM to 0620. Otherwise leave TTYGROUP commented out and assign TTYPERM to either 622 or 600.
</DL>

<P>

<B>TTYTYPE_FILE</B> (string)
<DL COMPACT><DT id="38"><DD>
Si d&eacute;finie, fichier qui lie les lignes de tty &agrave; la variable d'environnement TERM. Chaque ligne du fichier est dans un format ressemblant &agrave; &laquo;&nbsp;vt100 tty01&nbsp;&raquo;.
</DL>

<P>

<B>UID_MAX</B> (number), <B>UID_MIN</B> (number)
<DL COMPACT><DT id="39"><DD>
Range of user IDs used for the creation of regular users by
<B>useradd</B>
or
<B>newusers</B>.
<P>
The default value for
<B>UID_MIN</B>
(resp.
<B>UID_MAX</B>) is 1000 (resp. 60000).
</DL>

<P>

<B>UMASK</B> (number)
<DL COMPACT><DT id="40"><DD>
Valeur d'initialisation du masque de permissions. S'il n'est pas pr&eacute;cis&eacute;, le masque des permissions sera initialis&eacute; &agrave; 022.
<P>
<B>useradd</B>
and
<B>newusers</B>
use this mask to set the mode of the home directory they create if
<B>HOME_MODE</B>
is not set.
<P>
It is also used by
<B>pam_umask</B>
as the default umask value.
</DL>

<P>

<B>USERDEL_CMD</B> (string)
<DL COMPACT><DT id="41"><DD>
Si d&eacute;finie, la commande est ex&eacute;cut&eacute;e lors de la suppression d'un utilisateur. Elle pourra supprimer toutes les t&acirc;ches p&eacute;riodiques cron ou at, tous les travaux d'impression, etc. de l'utilisateur (qui sera fourni comme premier param&egrave;tre).
<P>
Le code de retour du script n'est pas pris en compte.
<P>
Here is an example script, which removes the user's cron, at and print jobs:
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
#! /bin/sh

# Check for the required argument.
if [ $# != 1 ]; then
        echo &quot;Usage: $0 username&quot;
        exit 1
fi

# Remove cron jobs.
crontab -r -u $1

# Remove at jobs.
# Note that it will remove any jobs owned by the same UID,
# even if it was shared by a different username.
AT_SPOOL_DIR=/var/spool/cron/atjobs
find $AT_SPOOL_DIR -name &quot;[^.]*&quot; -type f -user $1 -delete \;

# Remove print jobs.
lprm $1

# All done.
exit 0
      
</PRE>

</DL>




<P>
</DL>

<P>

<B>USERGROUPS_ENAB</B> (boolean)
<DL COMPACT><DT id="43"><DD>
If set to
<I>yes</I>,
<B>userdel</B>
will remove the user's group if it contains no more members, and
<B>useradd</B>
will create by default a group with the name of the user.
</DL>

<A NAME="lbAD">&nbsp;</A>
<H2>R&Eacute;F&Eacute;RENCES CROIS&Eacute;ES</H2>

<P>

Les r&eacute;f&eacute;rences crois&eacute;es ci-dessous montrent quels sont les param&egrave;tres utilis&eacute;s par les diff&eacute;rents programmes de la suite shadow password.
<P>

chfn
<DL COMPACT><DT id="44"><DD>
CHFN_RESTRICT
</DL>

<P>

chgpasswd
<DL COMPACT><DT id="45"><DD>
ENCRYPT_METHOD MAX_MEMBERS_PER_GROUP MD5_CRYPT_ENAB
SHA_CRYPT_MAX_ROUNDS SHA_CRYPT_MIN_ROUNDS
</DL>

<P>

chpasswd
<DL COMPACT><DT id="46"><DD>
SHA_CRYPT_MAX_ROUNDS SHA_CRYPT_MIN_ROUNDS
</DL>

<P>

gpasswd
<DL COMPACT><DT id="47"><DD>
ENCRYPT_METHOD MAX_MEMBERS_PER_GROUP MD5_CRYPT_ENAB
SHA_CRYPT_MAX_ROUNDS SHA_CRYPT_MIN_ROUNDS
</DL>

<P>

groupadd
<DL COMPACT><DT id="48"><DD>
GID_MAX GID_MIN MAX_MEMBERS_PER_GROUP SYS_GID_MAX SYS_GID_MIN
</DL>

<P>

groupdel
<DL COMPACT><DT id="49"><DD>
MAX_MEMBERS_PER_GROUP
</DL>

<P>

groupmems
<DL COMPACT><DT id="50"><DD>
MAX_MEMBERS_PER_GROUP
</DL>

<P>

groupmod
<DL COMPACT><DT id="51"><DD>
MAX_MEMBERS_PER_GROUP
</DL>

<P>

grpck
<DL COMPACT><DT id="52"><DD>
MAX_MEMBERS_PER_GROUP
</DL>

<P>

grpconv
<DL COMPACT><DT id="53"><DD>
MAX_MEMBERS_PER_GROUP
</DL>

<P>

grpunconv
<DL COMPACT><DT id="54"><DD>
MAX_MEMBERS_PER_GROUP
</DL>

<P>

lastlog
<DL COMPACT><DT id="55"><DD>
LASTLOG_UID_MAX
</DL>

<P>

login
<DL COMPACT><DT id="56"><DD>
CONSOLE_GROUPS DEFAULT_HOME ERASECHAR FAIL_DELAY FAKE_SHELL HUSHLOGIN_FILE KILLCHAR LOGIN_RETRIES LOGIN_TIMEOUT LOG_OK_LOGINS LOG_UNKFAIL_ENAB TTYGROUP TTYPERM TTYTYPE_FILE USERGROUPS_ENAB
</DL>

<P>

newgrp / sg
<DL COMPACT><DT id="57"><DD>
SYSLOG_SG_ENAB
</DL>

<P>

newusers
<DL COMPACT><DT id="58"><DD>
ENCRYPT_METHOD GID_MAX GID_MIN MAX_MEMBERS_PER_GROUP MD5_CRYPT_ENAB HOME_MODE PASS_MAX_DAYS PASS_MIN_DAYS PASS_WARN_AGE
SHA_CRYPT_MAX_ROUNDS SHA_CRYPT_MIN_ROUNDS
SUB_GID_COUNT SUB_GID_MAX SUB_GID_MIN SUB_UID_COUNT SUB_UID_MAX SUB_UID_MIN SYS_GID_MAX SYS_GID_MIN SYS_UID_MAX SYS_UID_MIN UID_MAX UID_MIN UMASK
</DL>

<P>

pwck
<DL COMPACT><DT id="59"><DD>
PASS_MAX_DAYS PASS_MIN_DAYS PASS_WARN_AGE
</DL>

<P>

pwconv
<DL COMPACT><DT id="60"><DD>
PASS_MAX_DAYS PASS_MIN_DAYS PASS_WARN_AGE
</DL>

<P>

su
<DL COMPACT><DT id="61"><DD>
CONSOLE_GROUPS DEFAULT_HOME ENV_PATH ENV_SUPATH SULOG_FILE SU_NAME SYSLOG_SU_ENAB
</DL>

<P>

sulogin
<DL COMPACT><DT id="62"><DD>
ENV_HZ
</DL>

<P>

useradd
<DL COMPACT><DT id="63"><DD>
CREATE_HOME GID_MAX GID_MIN HOME_MODE LASTLOG_UID_MAX MAIL_DIR MAX_MEMBERS_PER_GROUP PASS_MAX_DAYS PASS_MIN_DAYS PASS_WARN_AGE SUB_GID_COUNT SUB_GID_MAX SUB_GID_MIN SUB_UID_COUNT SUB_UID_MAX SUB_UID_MIN SYS_GID_MAX SYS_GID_MIN SYS_UID_MAX SYS_UID_MIN UID_MAX UID_MIN UMASK
</DL>

<P>

userdel
<DL COMPACT><DT id="64"><DD>
MAIL_DIR MAIL_FILE MAX_MEMBERS_PER_GROUP USERDEL_CMD USERGROUPS_ENAB
</DL>

<P>

usermod
<DL COMPACT><DT id="65"><DD>
LASTLOG_UID_MAX MAIL_DIR MAIL_FILE MAX_MEMBERS_PER_GROUP
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>BOGUES</H2>

<P>

Much of the functionality that used to be provided by the shadow password suite is now handled by PAM. Thus,
/etc/login.defs
is no longer used by
<B><A HREF="/cgi-bin/man/man2html?1+passwd">passwd</A></B>(1), or less used by
<B><A HREF="/cgi-bin/man/man2html?1+login">login</A></B>(1), and
<B><A HREF="/cgi-bin/man/man2html?1+su">su</A></B>(1). Please refer to the corresponding PAM configuration files instead.
<A NAME="lbAF">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?1+login">login</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+passwd">passwd</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+su">su</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+passwd">passwd</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+shadow">shadow</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+pam">pam</A></B>(8).
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="66"><A HREF="#lbAB">NOM</A><DD>
<DT id="67"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="68"><A HREF="#lbAD">R&Eacute;F&Eacute;RENCES CROIS&Eacute;ES</A><DD>
<DT id="69"><A HREF="#lbAE">BOGUES</A><DD>
<DT id="70"><A HREF="#lbAF">VOIR AUSSI</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
