
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of SOURCES.LIST</TITLE>
</HEAD><BODY>
<H1>SOURCES.LIST</H1>
Section: APT (5)<BR>Updated: 04&nbsp;avril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOM</H2>

sources.list - Liste des sources de donn&eacute;es APT configur&eacute;es
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPTION</H2>

<P>

Le fichier de liste de sources
/etc/apt/sources.list
et les fichiers contenus dans
/etc/apt/sources.list.d/
sont con&ccedil;us pour pouvoir g&eacute;rer un nombre quelconque de sources actives et de m&eacute;dias. Le fichier donne une source par ligne (One-Line style) ou fournit des paragraphes multilignes d&eacute;finissant une ou plusieurs sources par paragraphe (style deb822), avec les sources prioritaires en premier (dans le cas o&ugrave; il y a une seule version disponible &agrave; partir de plus d'une source). L'information relative aux sources configur&eacute;es est r&eacute;cup&eacute;r&eacute;e par la commande
<B>apt-get update</B>
(ou par une commande &eacute;quivalente avec une autre interface &agrave; APT).
<A NAME="lbAD">&nbsp;</A>
<H2>SOURCES.LIST.D</H2>

<P>

Le r&eacute;pertoire
/etc/apt/sources.list.d
permet de sp&eacute;cifier des sources de paquets dans des fichiers distincts. Deux formats de fichiers diff&eacute;rents sont permis comme cela est d&eacute;crit dans les deux sections suivantes. Les noms de fichier doivent se terminer par
.list
ou par
.sources
selon le format fourni. Ils ne peuvent contenir que des lettres (a-z et A-Z), des chiffres (0-9), des caract&egrave;res de soulignement (_), des tirets (-) et des points (.). Dans le cas contraire, APT affichera un avertissement indiquant qu'il a ignor&eacute; un fichier si celui-ci ne correspond par &agrave; un motif d&eacute;fini dans
Dir::Ignore-Files-Silently
(les fichiers correspondant &agrave; cette variable de configuration &eacute;tant, eux, ignor&eacute;s silencieusement).
<A NAME="lbAE">&nbsp;</A>
<H2>FORMAT ONE-LINE-STYLE</H2>

<P>

Les entr&eacute;es individuelles ne peuvent pas se poursuivre sur la ligne suivante. Les lignes vides sont ignor&eacute;es et un caract&egrave;re
#
n'importe o&ugrave; sur une ligne signale que le reste de la ligne est un commentaire. Par cons&eacute;quent, une entr&eacute;e peut &ecirc;tre d&eacute;sactiv&eacute;e en commentant la totalit&eacute; de la ligne. Si plusieurs options doivent &ecirc;tre fournies, elles sont s&eacute;par&eacute;es par des espaces et sont entour&eacute;es toutes ensembles par des crochets ([]) inclus sur la ligne apr&egrave;s le type s&eacute;par&eacute; par un espace. Si une option permet plusieurs valeurs, elles sont s&eacute;par&eacute;es les unes des autres par une virgule (,). Un nom d'option est s&eacute;par&eacute; de ses options par une signe &eacute;gal (=). Des options &agrave; plusieurs valeurs disposent aussi des s&eacute;parateurs
-=
et
+=, qui, au lieu de remplacer la valeur par d&eacute;faut par la ou les valeurs donn&eacute;es, modifient la ou les valeurs par d&eacute;faut pour supprimer ou inclure les valeurs donn&eacute;es.
<P>

Il s'agit du format traditionnel, g&eacute;r&eacute; par toute les version de APT. Veuillez noter que toutes les options d&eacute;crites plus bas ne sont pas prises en charge par toutes les versions d'APT. Notez aussi que certaine des plus anciennes applications qui analysent ce format elles-m&ecirc;mes ne s'attendent pas &agrave; rencontrer des options qui &eacute;taient rares avant l'introduction de la prise en charge multi-architecture.
<A NAME="lbAF">&nbsp;</A>
<H2>FORMAT DEB822-STYLE</H2>

<P>

Les fichiers dans ce format poss&egrave;dent l'extension
.sources. La syntaxe du format est similaire &agrave; celle des autres fichiers utilis&eacute;s par Debian et ses d&eacute;riv&eacute;s, comme les fichiers de m&eacute;tadonn&eacute;es qu'APT t&eacute;l&eacute;charge des sources configur&eacute;es ou le fichier
debian/control
d'un paquet source de Debian. Les entr&eacute;es individuelles sont s&eacute;par&eacute;es par une ligne vide&nbsp;; les lignes vides suppl&eacute;mentaires sont ignor&eacute;es et un caract&egrave;re
#
en d&eacute;but de ligne signale la ligne comme un commentaire. Une entr&eacute;e, par cons&eacute;quent, peut &ecirc;tre d&eacute;sactiv&eacute;e en commentant chaque ligne appartenant au paragraphe, mais il est habituellement plus facile d'ajouter le champ &laquo;&nbsp;Enabled: no&nbsp;&raquo; au paragraphe pour d&eacute;sactiver l'entr&eacute;e. Retirer ce champ ou le d&eacute;finir &agrave; &laquo;&nbsp;yes&nbsp;&raquo; le r&eacute;active. Les options ont la m&ecirc;me syntaxe que tous les autres champs&nbsp;: un nom de champ s&eacute;par&eacute; par le caract&egrave;re deux-points (:) et &eacute;ventuellement des valeurs s&eacute;par&eacute;es par des espaces. Veuillez noter particuli&egrave;rement que des valeurs multiples sont s&eacute;par&eacute;es par des espacements (espaces, tabulations ou nouvelles lignes) et non par des virgules comme dans le format &laquo;&nbsp;One-Line&nbsp;&raquo;. Les champs multivaleurs comme
Architectures
disposent aussi des options
Architectures-Add
et
Architectures-Remove
pour modifier la valeur par d&eacute;faut plut&ocirc;t que de la remplacer.
<P>

Il s'agit d'un nouveau format pris en charge par APT lui-m&ecirc;me depuis la version&nbsp;1.1. Les versions pr&eacute;c&eacute;dentes ignorent ce type de fichier avec un message d'avertissement tel que d&eacute;crit pr&eacute;c&eacute;demment. L'objectif est de faire de ce format le format par d&eacute;faut, et de rendre obsol&egrave;te le format &laquo;&nbsp;One-Line-Style&nbsp;&raquo; d&eacute;crit plus haut, parce qu'il est plus facile &agrave; cr&eacute;er, &agrave; &eacute;tendre et &agrave; modifier pour les humains comme pour les machines, surtout s'il inclut beaucoup de sources et/ou d'options. Les d&eacute;veloppeurs qui travaillent avec les sources apt ou les analysent sont fortement encourag&eacute;s &agrave; ajouter la prise en charge de ce format et &agrave; prendre contact avec l'&eacute;quipe APT pour coordonner et partager ce travail. Les utilisateurs sont libres d'adopter d&eacute;j&agrave; ce format, mais peuvent se confronter &agrave; des probl&egrave;mes avec les logiciels qui ne le g&egrave;rent pas encore.
<A NAME="lbAG">&nbsp;</A>
<H2>LES TYPES DEB ET DEB-SRC&nbsp;: FORMAT G&Eacute;N&Eacute;RAL</H2>

<P>

Le type
deb
d&eacute;crit une archive Debian classique &agrave; deux niveaux,
distribution/composant.
distribution
peut prendre l'une des valeurs suivantes&nbsp;: un nom de suite tel que
stable
ou
testing
ou bien un nom de code comme
buster
ou
bullseye, alors que composant prend les valeurs&nbsp;:
main,
contrib
ou
non-free. Le type
deb-src
d&eacute;crit une archive de distribution de code source pour une distribution Debian dans le m&ecirc;me format que le type
deb. Une ligne
deb-src
est n&eacute;cessaire pour r&eacute;cup&eacute;rer les index des sources.
<P>

Le format de deux entr&eacute;es du genre &laquo;&nbsp;One-Line-Style&nbsp;&raquo; utilisant les types
deb
et
deb-src
est&nbsp;:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
deb [ option1=value1 option2=value2 ] uri suite [component1] [component2] [...]
deb-src [ option1=value1 option2=value2 ] uri suite [component1] [component2] [...]
</PRE>

</DL>




<P>

Autrement, l'entr&eacute;e &eacute;quivalente de style deb822 ressemble &agrave; ceci&nbsp;:
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
     Types: deb deb-src
     URIs: uri
     Suites: suite
     Components: [component1] [component2] [...]
     option1: value1
     option2: value2
   
</PRE>

</DL>




<P>

L'URI de type
deb
doit indiquer la base de la distribution Debian dans laquelle APT trouvera les informations dont il a besoin.
suite
peut sp&eacute;cifier le chemin exact&nbsp;: dans ce cas, on doit omettre les composants et
suite
doit se terminer par une barre oblique (/). C'est utile quand seul un sous-r&eacute;pertoire particulier de l'archive d&eacute;crite par cet URI est int&eacute;ressant. Quand
suite
n'indique pas un chemin exact, un
composant
au moins doit &ecirc;tre pr&eacute;sent.
<P>

suite
peut aussi contenir une variable
$(ARCH), qui sera remplac&eacute;e par l'architecture Debian (comme
amd64
ou
armel) sur laquelle s'ex&eacute;cute le syst&egrave;me. On peut ainsi utiliser un fichier
sources.list
qui ne d&eacute;pend pas d'une architecture. En g&eacute;n&eacute;ral, ce n'est int&eacute;ressant que si l'on indique un chemin exact&nbsp;; sinon
APT
cr&eacute;e automatiquement un URI en fonction de l'architecture effective.
<P>

Particuli&egrave;rement lorsqu'on utilise le format &laquo;&nbsp;One-Line-Style&nbsp;&raquo;, puisqu'on ne peut indiquer qu'une seule distribution par ligne, il peut &ecirc;tre n&eacute;cessaire de disposer le m&ecirc;me URI sur plusieurs lignes quand on veut acc&eacute;der &agrave; un sous-ensemble des distributions ou composants disponibles &agrave; cette adresse. APT trie les URI apr&egrave;s avoir cr&eacute;e pour lui-m&ecirc;me la liste compl&egrave;te&nbsp;; il regroupe les r&eacute;f&eacute;rences multiples au m&ecirc;me h&ocirc;te Internet en vue d'une connexion unique et il &eacute;vite ainsi, par exemple, d'&eacute;tablir une connexion FTP, de la fermer, faire autre chose, puis d'&eacute;tablir encore cette connexion. Cette fonctionnalit&eacute; permet l'acc&egrave;s &agrave; des sites FTP surcharg&eacute;s qui limitent le nombre de connexions simultan&eacute;es pour les utilisateurs anonymes. APT parall&eacute;lise aussi les connexions &agrave; diff&eacute;rents h&ocirc;tes pour tirer plus efficacement parti des sites &agrave; faible bande passante.
<P>

Il est important d'indiquer les sources par ordre de pr&eacute;f&eacute;rence, la source principale apparaissant en premier. Un tri est fait, de la plus rapide &agrave; la plus lente&nbsp;; par exemple, un CD suivi par les h&ocirc;tes d'un r&eacute;seau local, puis les h&ocirc;tes distants.
<P>

&Agrave; titre d'exemple, les sources de votre distribution au format &laquo;&nbsp;One-Line-Style&nbsp;&raquo; pourraient ressembler &agrave; ceci&nbsp;:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
deb <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A> focal main restricted
deb <A HREF="http://security.ubuntu.com/ubuntu">http://security.ubuntu.com/ubuntu</A> focal-security main restricted
deb <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A> focal-updates main restricted
</PRE>

</DL>




<P>
ou &agrave; ceci au format de style deb822&nbsp;:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A>
Suites: focal focal-updates
Components: main restricted

Types: deb
URIs: <A HREF="http://security.ubuntu.com/ubuntu">http://security.ubuntu.com/ubuntu</A>
Suites: focal-security
Components: main restricted
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H2>LES TYPES DEB ET DEB-SRC&nbsp;: OPTIONS</H2>

<P>

Chaque entr&eacute;e de source peut avoir des options sp&eacute;cifi&eacute;es pour modifier la source &agrave; laquelle acc&eacute;der et comment les donn&eacute;es y sont r&eacute;cup&eacute;r&eacute;es. Le format, la syntaxe et les noms des options peuvent &ecirc;tre diff&eacute;rents entre le format &laquo;&nbsp;One-Line-Style&nbsp;&raquo; et le format de style deb822, mais les m&ecirc;mes options sont disponibles dans les deux formats. Pour simplifier, nous listons les noms de champ avec deb822 et fournissons le nom &laquo;&nbsp;One-Line&nbsp;&raquo; entre parenth&egrave;ses. Il faut se souvenir que en plus du r&eacute;glage explicite des options multi-valeurs, il y a aussi l'option de les modifier en se basant sur les valeurs par d&eacute;faut, mais nous ne listons pas ces noms explicitement ici. Les options non prises en charge sont ignor&eacute;es par toutes les version d'APT.
<P>
<DL COMPACT><DT id="5"><DD>
&bull;


<B>Architectures</B>
(<B>arch</B>) est une option multivaleur pour d&eacute;finir les architectures pour lesquelles l'information doit &ecirc;tre t&eacute;l&eacute;charg&eacute;e. Si cette option n'est pas utilis&eacute;e, l'option par d&eacute;faut est toutes les architectures d&eacute;finies par l'option de configuration
APT::Architectures.
</DL>

<P>
<DL COMPACT><DT id="6"><DD>
&bull;


<B>Languages</B>
(<B>lang</B>) est une option multivaleur pour d&eacute;finir les langues pour lesquelles les informations, telles que les descriptions de paquet traduites, doivent &ecirc;tre t&eacute;l&eacute;charg&eacute;es. Si cette option n'est pas utilis&eacute;e, l'option par d&eacute;faut est toutes les langues d&eacute;finies par l'option de configuration
<B>Acquire::Languages</B>.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


<B>Targets</B>
(<B>target</B>) est une option multivaleur pour d&eacute;finir les cibles qu'apt essaiera d'acqu&eacute;rir &agrave; partir de cette source. Si cette option n'est pas sp&eacute;cifi&eacute;e, la configuration par d&eacute;faut est d&eacute;finie par le champ d'action de configuration
<B>Acquire::IndexTargets</B>
(les cibles sont d&eacute;finies par leur nom dans le champ
Created-By). De plus, les cibles peuvent &ecirc;tre activ&eacute;es ou d&eacute;sactiv&eacute;es en utilisant le champ
Identifier
comme option avec une valeur bool&eacute;enne plut&ocirc;t que d'utiliser cette option multivaleur.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


<B>PDiffs</B>
(<B>pdiffs</B>) est une valeur yes/no qui contr&ocirc;le si APT doit essayer d'utiliser PDiffs pour mettre &agrave; jour des index anciens plut&ocirc;t que de t&eacute;l&eacute;charger les nouveaux index en totalit&eacute;. La valeur de cette option est ignor&eacute;e si le d&eacute;p&ocirc;t n'annonce pas la disponibilit&eacute; de PDiffs. Elle a, par d&eacute;faut, la valeur de l'option du m&ecirc;me nom pour un fichier particulier d&eacute;fini dans le champ d'action
<B>Acquire::IndexTargets</B>, qui prend lui-m&ecirc;me par d&eacute;faut la valeur de l'option de configuration
<B>Acquire::PDiffs</B>, dont la valeur par d&eacute;faut est
yes.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


<B>By-Hash</B>
(<B>by-hash</B>)peut avoir la valeur
yes,
no
ou
force
et contr&ocirc;le si APT doit essayer d'acqu&eacute;rir des index gr&acirc;ce &agrave; un URI construit &agrave; partir de la somme de hachage du fichier attendu plut&ocirc;t que d'utiliser le nom de fichier de stable bien connu de l'index. Son utilisation peut &eacute;viter des d&eacute;calages de somme de hachage, mais n&eacute;cessite un miroir de prise en charge. Une valeur
yes
ou
no
active ou d&eacute;sactive l'utilisation de cette fonctionnalit&eacute; si cette source indique sa prise en charge, tandis que
force
activera la fonctionnalit&eacute; quel que soit ce que la source indique. Elle a, par d&eacute;faut, la valeur de l'option du m&ecirc;me nom pour un fichier particulier d&eacute;fini dans le champ d'action
<B>Acquire::IndexTargets</B>, qui prend lui-m&ecirc;me par d&eacute;faut la valeur de l'option de configuration
<B>Acquire::By-Hash</B>, dont la valeur par d&eacute;faut est
yes.
</DL>

<P>
Par ailleurs, si certaines options sont d&eacute;finies, elles affectent
<I>toutes</I>
les sources avec les m&ecirc;mes URI et Suite, et donc doivent &ecirc;tre d&eacute;finies sur toutes ces entr&eacute;es et ne peuvent &ecirc;tre modifi&eacute;es entre les diff&eacute;rents composants. APT essaiera de d&eacute;tecter et provoquera une erreur avec de telles anomalies.
<P>
<DL COMPACT><DT id="10"><DD>
&bull;


<B>Allow-Insecure</B>
(<B>allow-insecure</B>),
<B>Allow-Weak</B>
(<B>allow-weak</B>) et
<B>Allow-Downgrade-To-Insecure</B>
(<B>allow-downgrade-to-insecure</B>) sont des valeurs bool&eacute;ennes dont la valeur par d&eacute;faut est
no. Si elles sont d&eacute;finies &agrave;
yes, elles contournent certains &eacute;l&eacute;ments d'<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
et par cons&eacute;quent ne devraient pas utilis&eacute;es &agrave; la l&eacute;g&egrave;re.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


<B>Trusted</B>
(<B>trusted</B>) comporte trois valeurs d'&eacute;tat qui d&eacute;finissent par d&eacute;faut si APT d&eacute;cide de consid&eacute;rer une source comme s&ucirc;re ou doit lancer un avertissement avant qu'un paquet soit, par exemple, install&eacute; &agrave; partir de cette source. Cette option peut &ecirc;tre utilis&eacute;e pour outrepasser cette d&eacute;cision. La valeur
yes
dit &agrave; APT de consid&eacute;rer cette source comme s&ucirc;re, m&ecirc;me si elle &eacute;choue au test d'authentification. Elle d&eacute;sactive des &eacute;l&eacute;ments d'<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
et elle ne devrait &ecirc;tre utilis&eacute;e que dans un contexte local et s&eacute;curis&eacute; si possible, parce qu'autrement elle ouvre une br&egrave;che dans la s&eacute;curit&eacute;. La valeur
no
fait le contraire et fait que la source est trait&eacute;e comme non s&ucirc;re, m&ecirc;me si les tests d'authentification sont r&eacute;ussis. La valeur par d&eacute;faut ne peut pas &ecirc;tre d&eacute;finie explicitement.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


<B>Signed-By</B>
(<B>signed-by</B>) est une option pour demander la v&eacute;rification d'un d&eacute;pot par
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
avec un certain jeu de cl&eacute;s plut&ocirc;t qu'avec la totalit&eacute; des cl&eacute;s de confiance configur&eacute;es par apt. Elle est d&eacute;finie comme une liste de chemins absolus vers des fichiers de trousseau de cl&eacute;s (qui doivent &ecirc;tre accessibles en lecture pour l'utilisateur
_apt, et donc, il faut s'assurer que tout le monde a le droit de lecture sur le fichier) et des empreintes de cl&eacute;s &agrave; s&eacute;lectionner dans ces trousseaux. Si aucun fichier de cl&eacute;s n'est d&eacute;fini, le trousseau
trusted.gpg
et tous les trousseaux du r&eacute;pertoire
trusted.gpg.d/
sont s&eacute;lectionn&eacute;s par d&eacute;faut (voir
<B>apt-key fingerprint</B>). Si aucune empreinte n'est d&eacute;finie, toutes les cl&eacute;s des trousseaux sont s&eacute;lectionn&eacute;es. Une empreinte acceptera aussi toutes les signatures de sous cl&eacute;s de cette cl&eacute;, et si ce n'est pas d&eacute;sir&eacute;, un point d'exclamation (!) peut &ecirc;tre ajout&eacute; &agrave; l'empreinte pour d&eacute;sactiver ce comportement. Elle poss&egrave;de la valeur par d&eacute;faut de l'option du m&ecirc;me nom si elle a &eacute;t&eacute; d&eacute;finie dans le fichier
Release
de ce d&eacute;p&ocirc;t r&eacute;cup&eacute;r&eacute; auparavant (seules des empreintes peuvent &ecirc;tre d&eacute;finies par ce biais). Autrement, toutes les cl&eacute;s des trousseaux de confiance sont consid&eacute;r&eacute;es comme des signatures valables pour ce d&eacute;p&ocirc;t.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


<B>Check-Valid-Until</B>
(<B>check-valid-until</B>) est une valeur yes/no qui d&eacute;termine si APT doit tenter de d&eacute;tecter les attaques par replay. Un cr&eacute;ateur de d&eacute;p&ocirc;t peut d&eacute;clarer une p&eacute;riode pendant laquelle les donn&eacute;es fournies par le d&eacute;p&ocirc;t peuvent &ecirc;tre consid&eacute;r&eacute;es comme valables, une fois ce d&eacute;lai &eacute;chu, et si les donn&eacute;es n'ont pas &eacute;t&eacute; fournies, elles sont consid&eacute;r&eacute;es comme expir&eacute;es, et un message d'erreur est envoy&eacute;. En plus d'accro&icirc;tre la s&eacute;curit&eacute;, puisqu'un attaquant malveillant ne peut plus envoyer des donn&eacute;es anciennes pour emp&ecirc;cher un utilisateur de mettre &agrave; niveau vers une nouvelle version, elle facilite l'identification de miroirs qui ne sont plus mis &agrave; jour. N&eacute;anmoins, certains d&eacute;p&ocirc;ts, comme les archives historiques ne sont plus mis &agrave; jour &agrave; dessein, aussi cette v&eacute;rification peut &ecirc;tre d&eacute;sactiv&eacute;e en r&eacute;glant cette option &agrave;
no. Elle poss&egrave;de la valeur par d&eacute;faut de l'option
<B>Acquire::Check-Valid-Until</B>
qui elle-m&ecirc;me poss&egrave;de la valeur
yes
par d&eacute;faut.
</DL>

<P>
<DL COMPACT><DT id="14"><DD>
&bull;


<B>Valid-Until-Min</B>
(<B>valid-until-min</B>) et
<B>Valid-Until-Max</B>
(<B>valid-until-max</B>) peuvent &ecirc;tre utilis&eacute;es pour augmenter ou diminuer la dur&eacute;e, en secondes pendant laquelle les donn&eacute;es de ce d&eacute;p&ocirc;t sont consid&eacute;r&eacute;es comme valables. -Max peut &ecirc;tre particuli&egrave;rement utile pour d&eacute;finir une valeur propre si le d&eacute;p&ocirc;t ne fournit pas de champ Valid-Until dans son fichier Release, tandis que -Min peut &ecirc;tre utilis&eacute; pour augmenter la dur&eacute;e de validit&eacute; sur des miroirs (locaux), rarement mis &agrave; jour, d'une archive plus fr&eacute;quemment mise &agrave; jour mais moins accessible (qui est aussi dans le sources.list), plut&ocirc;t que de d&eacute;sactiver totalement la v&eacute;rification. Elle poss&egrave;de la valeur par d&eacute;faut des options de configuration
<B>Acquire::Min-ValidTime</B>
et
<B>Acquire::Max-ValidTime</B>
qui toutes les deux ne sont pas d&eacute;finies par d&eacute;faut.
</DL>

<P>
<DL COMPACT><DT id="15"><DD>
&bull;


<B>Check-Date</B>
(<B>check-date</B>) est une valeur yes/no qui contr&ocirc;le si APT doit consid&eacute;rer que la date de la machine est correcte et donc effectuer les v&eacute;rifications li&eacute;es au temps, comme v&eacute;rifier si le fichier Release n'est pas dans le futur. Sa d&eacute;sactivation d&eacute;sactive l'option
<B>Check-Valid-Until</B>
mentionn&eacute;e ci-dessus.
</DL>

<P>
<DL COMPACT><DT id="16"><DD>
&bull;


<B>Date-Max-Future</B>
(<B>date-max-future</B>) contr&ocirc;le jusqu'o&ugrave; un d&eacute;p&ocirc;t peut &ecirc;tre dans le futur. Elle poss&egrave;de la valeur del'option de configuration
<B>Acquire::Max-FutureTime</B>
qui est par d&eacute;faut de 10&nbsp;secondes.
</DL>

<P>
<DL COMPACT><DT id="17"><DD>
&bull;


<B>InRelease-Path</B>
(<B>inrelease-path</B>) d&eacute;termine le chemin du fichier InRelease, relativement &agrave; la position normale d'un fichier
InRelease. Par d&eacute;faut, cette option n'est pas d&eacute;finie et APT cherchera &agrave; r&eacute;cup&eacute;rer un fichier
InRelease
ou, s'il &eacute;choue, un fichier
Release
et le fichier
Release.gpg
associ&eacute;. Si cette option est d&eacute;finie, le chemin sp&eacute;cifi&eacute; sera essay&eacute; &agrave; la place du fichier InRelease, et le repli vers les fichiers
Release
sera d&eacute;sactiv&eacute;.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H2>SP&Eacute;CIFICATION DES URI</H2>

<P>

Les types d'URI actuellement reconnus sont&nbsp;:
<P>

<B>http</B> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1))
<DL COMPACT><DT id="18"><DD>
Le proc&eacute;d&eacute; http pr&eacute;cise un serveur HTTP pour une archive et c'est la m&eacute;thode la plus couramment utilis&eacute;e. L'URI peut inclure directement les information de connexion si l'archive le requiert, mais l'utilisation de
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
devrait &ecirc;tre pr&eacute;f&eacute;r&eacute;e. La m&eacute;thode prend &eacute;galement en charge SOCKS5 et les mandataires HTTP(S) configur&eacute;s soit au moyen d'une configuration sp&eacute;cifique &agrave; apt ou sp&eacute;cifi&eacute;s par la variable d'environnement
<B>http_proxy</B>
au format
<I><A HREF="http://user:pass@server:port/">http://user:pass@server:port/</A></I>
(en supposant un mandataire HTTP n&eacute;cessitant une authentification). Les d&eacute;tails de l'authentification pour les mandataires peuvent aussi &ecirc;tre fournis avec
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5).
<P>
Veuillez noter que ces formes d'authentification ne sont pas s&ucirc;res puisque toutes les communications avec le serveur distant (ou le mandataire) ne sont pas chiffr&eacute;es, donc un attaquant suffisamment comp&eacute;tent peut observer et enregistrer la connexion ainsi que les autres interactions. L'attaquant ne peut
<I>pas</I>
modifier la communication dans la mesure o&ugrave; le mod&egrave;le de s&eacute;curit&eacute; des donn&eacute;es d'Apt est ind&eacute;pendant de la m&eacute;thode de transport choisie. Voir
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
pour plus de d&eacute;tails.
</DL>

<P>

<B>https</B> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-https">apt-transport-https</A></B>(1))
<DL COMPACT><DT id="19"><DD>
Le proc&eacute;d&eacute; https pr&eacute;cise un serveur HTTPS pour une archive et il est tr&egrave;s semblable au proc&eacute;d&eacute; http en termes d'utilisation et d'options disponibles. La principale diff&eacute;rence est que les communications entre apt et le serveur (ou le mandataire) sont chiffr&eacute;es. Veuillez noter que le chiffrage n'emp&ecirc;che pas un attaquant de savoir avec quel serveur (ou mandataire) apt est en communication et que des analyses approfondies peuvent encore potentiellement r&eacute;v&eacute;ler quelles donn&eacute;es sont t&eacute;l&eacute;charg&eacute;es. Si cela est une pr&eacute;occupation, des proc&eacute;d&eacute;s bas&eacute;s sur Tor, mentionn&eacute;s plus bas, pourraient &ecirc;tre une alternative appropri&eacute;e.
</DL>

<P>

<B>mirror</B>, <B>mirror+</B><B></B><I>proc&eacute;d&eacute;</I> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-mirror">apt-transport-mirror</A></B>(1))
<DL COMPACT><DT id="20"><DD>
Le proc&eacute;d&eacute; miroir d&eacute;finit la localisation d'une liste de miroirs. Par d&eacute;faut, le proc&eacute;d&eacute; utilis&eacute; par la localisation est
http, mais n'importe quel autre proc&eacute;d&eacute; peut &ecirc;tre utilis&eacute; avec la commande
<B>mirror+</B><B></B><I>scheme</I>. La liste de miroirs elle-m&ecirc;me peut contenir plusieurs URI de miroirs diff&eacute;rentes que le client APT peut, de fa&ccedil;on transparente, rep&eacute;rer, choisir et sur lesquelles se rabattre, afin d'aider &agrave; la fois &agrave; r&eacute;partir la charge sur les miroirs disponibles et &agrave; garantir que les clients puissent r&eacute;cup&eacute;rer les donn&eacute;es m&ecirc;me si certains des miroirs configur&eacute;s ne sont pas disponibles.
</DL>

<P>

<B>file</B>
<DL COMPACT><DT id="21"><DD>
Le proc&eacute;d&eacute;
file
permet qu'un r&eacute;pertoire arbitraire au sein du syst&egrave;me de fichiers soit consid&eacute;r&eacute; comme une archive. Cela est utilis&eacute; avec les montages NFS, les miroirs et les archives locaux.
</DL>

<P>

<B>cdrom</B>
<DL COMPACT><DT id="22"><DD>
Le proc&eacute;d&eacute;
cdrom
permet l'utilisation d'un lecteur de CD, de DVD ou USB, avec la possibilit&eacute; de changer de m&eacute;dia. Utilisez le programme
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8)
pour cr&eacute;er des entr&eacute;es
cdrom
dans la liste des sources.
</DL>

<P>

<B>ftp</B>
<DL COMPACT><DT id="23"><DD>
Le proc&eacute;d&eacute;
ftp
indique un serveur FTP comme archive. L'utilisation de FTP d&eacute;cline en faveur de
http
et
https
et plusieurs archives soit n'ont jamais offert d'acc&egrave;s FTP, soit le retirent. Si vous avez encore besoin de cette m&eacute;thode, plusieurs options de configuration sont disponibles dans le champ d'action
Acquire::ftp
et d&eacute;taill&eacute;es dans
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5).
<P>
Veuillez noter qu'on peut sp&eacute;cifier un mandataire FTP en utilisant la variable d'environnement
<B>ftp_proxy</B>. On peut aussi sp&eacute;cifier un mandataire HTTP (les serveurs mandataires HTTP comprennent souvent les URL FTP) en utilisant cette m&eacute;thode et
<I>seulement</I>
cette m&eacute;thode. Les mandataires qui utilisent HTTP et qui sont sp&eacute;cifi&eacute;s dans le fichier de configuration seront ignor&eacute;s.
</DL>

<P>

<B>copy</B>
<DL COMPACT><DT id="24"><DD>
Le proc&eacute;d&eacute;
copy
est identique au proc&eacute;d&eacute;
file
except&eacute; que les paquets sont copi&eacute;s dans le cache du r&eacute;pertoire au lieu d'&ecirc;tre utilis&eacute;s directement depuis leur emplacement. Ce r&eacute;glage peut servir aux utilisateurs qui se servent d'un support amovible pour recopier des fichiers avec APT.
</DL>

<P>

<B>rsh</B>, <B>ssh</B>
<DL COMPACT><DT id="25"><DD>
Le proc&eacute;d&eacute; rsh/ssh utilise rsh/ssh pour se connecter &agrave; une machine distante et pour acc&eacute;der aux fichiers en tant qu'un certain utilisateur. Il est recommand&eacute; de r&eacute;gler pr&eacute;alablement les h&ocirc;tes distants (rhosts) ou les cl&eacute;s RSA. Les commandes standard
<B>find</B>
et
<B>dd</B>
sont utilis&eacute;es pour l'acc&egrave;s aux fichiers de la machine distante.
</DL>

<P>

ajout de types d'URI suppl&eacute;mentaires reconnus
<DL COMPACT><DT id="26"><DD>
APT peut &ecirc;tre compl&eacute;t&eacute; avec des m&eacute;thodes suppl&eacute;mentaires fournies par des paquets optionnels dont le sch&eacute;ma de nommage est
apt-transport-<I>m&eacute;thode</I>. Ainsi, l'&eacute;quipe de maintenance d'APT g&egrave;re un paquet
apt-transport-tor
qui g&egrave;re les m&eacute;thodes d'acc&egrave;s par URI de type HTTP et HTTPS rout&eacute;es &agrave; travers le r&eacute;seau Tor.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>EXEMPLES</H2>

<P>

Utiliser l'archive stock&eacute;e localement (ou mont&eacute;e via NFS) dans /home/apt/debian pour stable/main, stable/contrib et stable/non-free.
<P>
<DL COMPACT><DT id="27"><DD>



<PRE>
deb file:/home/apt/debian stable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="28"><DD>



<PRE>
Types: deb
URIs: file:/home/apt/debian
Suites: stable
Components: main contrib non-free
</PRE>

</DL>




<P>

Comme ci-dessus, except&eacute; que cette ligne utilise la distribution &laquo;&nbsp;unstable&nbsp;&raquo; (d&eacute;veloppement).
<P>
<DL COMPACT><DT id="29"><DD>



<PRE>
deb file:/home/apt/debian unstable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Types: deb
URIs: file:/home/apt/debian
Suites: unstable
Components: main contrib non-free
</PRE>

</DL>




<P>

Indication des sources pour les lignes pr&eacute;c&eacute;dentes.
<P>
<DL COMPACT><DT id="31"><DD>



<PRE>
deb-src file:/home/apt/debian unstable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="32"><DD>



<PRE>
Types: deb-src
URIs: file:/home/apt/debian
Suites: unstable
Components: main contrib non-free
</PRE>

</DL>




<P>

La premi&egrave;re ligne r&eacute;cup&egrave;re l'information des paquets pour les architectures de
APT::Architectures
alors que la deuxi&egrave;me r&eacute;cup&egrave;re
amd64
et
armel.
<P>
<DL COMPACT><DT id="33"><DD>



<PRE>
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> buster main
deb [ arch=amd64,armel ] <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> buster main
</PRE>

</DL>




<P>
<DL COMPACT><DT id="34"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: buster
Components: main

Types: deb
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: buster
Components: main
Architectures: amd64 armel
</PRE>

</DL>




<P>

Utiliser HTTP pour acc&eacute;der &agrave; l'archive situ&eacute;e &agrave; archive.debian.org, et n'utiliser que la section hamm/main.
<P>
<DL COMPACT><DT id="35"><DD>



<PRE>
deb <A HREF="http://archive.debian.org/debian-archive">http://archive.debian.org/debian-archive</A> hamm main
</PRE>

</DL>




<P>
<DL COMPACT><DT id="36"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://archive.debian.org/debian-archive">http://archive.debian.org/debian-archive</A>
Suites: hamm
Components: main
</PRE>

</DL>




<P>

Utiliser FTP pour acc&eacute;der &agrave; l'archive situ&eacute;e &agrave; <A HREF="ftp://ftp.debian.org">ftp.debian.org</A>, dans le r&eacute;pertoire debian, et n'utiliser que la section buster/contrib.
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
deb <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A> buster contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="38"><DD>



<PRE>
Types: deb
URIs: <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A>
Suites: buster
Components: contrib
</PRE>

</DL>




<P>

Utiliser FTP pour acc&eacute;der &agrave; l'archive situ&eacute;e &agrave; <A HREF="ftp://ftp.debian.org">ftp.debian.org</A>, dans le r&eacute;pertoire debian, et n'utiliser que la section unstable/contrib. Si cette ligne et celle de l'exemple pr&eacute;c&eacute;dent dans
sources.list
apparaissent, une seule session FTP sera utilis&eacute;e pour les deux lignes.
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
deb <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A> unstable contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="40"><DD>



<PRE>
Types: deb
URIs: <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A>
Suites: unstable
Components: contrib
</PRE>

</DL>




<P>

Utiliser HTTP pour acc&eacute;der &agrave; l'archive situ&eacute;e &agrave; <A HREF="ftp://ftp.tlh.debian.org">ftp.tlh.debian.org</A>, dans le r&eacute;pertoire universe, et n'utiliser que les fichiers trouv&eacute;s dans
unstable/binary-i386
pour les machines i386, dans
unstable/binary-amd64
pour les machines amd64 et ainsi de suite pour les autres architectures reconnues. [Notez que cet exemple montre seulement la mani&egrave;re d'utiliser la variable &agrave; substituer, les archives Debian officielles n'&eacute;tant pas structur&eacute;es de cette mani&egrave;re.]
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
deb <A HREF="http://ftp.tlh.debian.org/universe">http://ftp.tlh.debian.org/universe</A> unstable/binary-$(ARCH)/
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://ftp.tlh.debian.org/universe">http://ftp.tlh.debian.org/universe</A>
Suites: unstable/binary-$(ARCH)/
</PRE>

</DL>




<P>

Utiliser HTTP pour pouvoir obtenir les paquets binaires ainsi que les sources des suites stable, testing et unstable et des composants main et contrib.
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> stable main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> stable main contrib
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> testing main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> testing main contrib
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> unstable main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> unstable main contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="44"><DD>



<PRE>
Types: deb deb-src
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: stable testing unstable
Components: main contrib
</PRE>

</DL>




<A NAME="lbAK">&nbsp;</A>
<H2>VOIR AUSSI</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
/usr/share/doc/apt-doc/acquire-additional-files.md.gz
<A NAME="lbAL">&nbsp;</A>
<H2>BOGUES</H2>

<P>

m[blue]<B>Page des bogues d'APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si vous souhaitez signaler un bogue &agrave; propos d'APT, veuillez lire
/usr/share/doc/debian/bug-reporting.txt
ou utiliser la commande
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAM">&nbsp;</A>
<H2>TRADUCTEURS</H2>

<P>

J&eacute;r&ocirc;me Marant, Philippe Batailler, Christian Perrier
&lt;<A HREF="mailto:bubulle@debian.org">bubulle@debian.org</A>&gt;
(2000, 2005, 2009, 2010), &Eacute;quipe de traduction francophone de Debian
&lt;<A HREF="mailto:debian-l10n-french@lists.debian.org">debian-l10n-french@lists.debian.org</A>&gt;
<P>

Veuillez noter que cette traduction peut contenir des parties non traduites. Cela est volontaire, pour &eacute;viter de perdre du contenu quand la traduction est l&eacute;g&egrave;rement en retard sur le contenu d'origine.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTEURS</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="45"><DD>
</DL>

<P>

<B>&Eacute;quipe de d&eacute;veloppement d'APT</B>
<DL COMPACT><DT id="46"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>NOTES</H2>

<DL COMPACT>
<DT id="47"> 1.<DD>
Page des bogues d'APT
<DL COMPACT><DT id="48"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="49"><A HREF="#lbAB">NOM</A><DD>
<DT id="50"><A HREF="#lbAC">DESCRIPTION</A><DD>
<DT id="51"><A HREF="#lbAD">SOURCES.LIST.D</A><DD>
<DT id="52"><A HREF="#lbAE">FORMAT ONE-LINE-STYLE</A><DD>
<DT id="53"><A HREF="#lbAF">FORMAT DEB822-STYLE</A><DD>
<DT id="54"><A HREF="#lbAG">LES TYPES DEB ET DEB-SRC&nbsp;: FORMAT G&Eacute;N&Eacute;RAL</A><DD>
<DT id="55"><A HREF="#lbAH">LES TYPES DEB ET DEB-SRC&nbsp;: OPTIONS</A><DD>
<DT id="56"><A HREF="#lbAI">SP&Eacute;CIFICATION DES URI</A><DD>
<DT id="57"><A HREF="#lbAJ">EXEMPLES</A><DD>
<DT id="58"><A HREF="#lbAK">VOIR AUSSI</A><DD>
<DT id="59"><A HREF="#lbAL">BOGUES</A><DD>
<DT id="60"><A HREF="#lbAM">TRADUCTEURS</A><DD>
<DT id="61"><A HREF="#lbAN">AUTEURS</A><DD>
<DT id="62"><A HREF="#lbAO">NOTES</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:05:02 GMT, March 31, 2021
</BODY>
</HTML>
