
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dpkg-split</TITLE>
</HEAD><BODY>
<H1>dpkg-split</H1>
Section: Herramientas de dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOMBRE</H2>

dpkg-split - Herramienta para separar y unir paquetes Debian
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSIS</H2>

<B>dpkg-split</B> [<I>opci&oacute;n</I>...] <I>orden</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPCI&Oacute;N</H2>

<B>dpkg-split</B> separa un paquete binario de Debian en varias partes m&aacute;s
peque&ntilde;as para luego volverlas a unir, posibilitando almacenar paquetes en
dispositivos de poca capacidad, como disquetes.
<P>
Se puede utilizar manualmente usando las opciones <B>--split</B>, <B>--join</B> y
<B>--info</B>.
<P>
Tambi&eacute;n ofrece un modo autom&aacute;tico mediante la opci&oacute;n <B>--auto</B>, que crea una
cola con las partes que ha analizado pero a&uacute;n separadas para despu&eacute;s crear
el paquete tras analizar todas las partes. Las opciones <B>--listq</B> y
<B>--discard</B> permiten administrar la cola.
<P>
Los procesos de separar, unir y posicionado en cola producen mensajes
informativos por la salida est&aacute;ndar, que se pueden ignorar sin ning&uacute;n
riesgo.
<A NAME="lbAE">&nbsp;</A>
<H2>&Oacute;RDENES</H2>

<DL COMPACT>
<DT id="1"><B>-s</B>, <B>--split</B> <I>paquete-completo</I> [<I>prefix</I>]<DD>
Divide un &uacute;nico paquete binario de Debian en varias partes.
<P>
Las partes reciben el nombre <I>prefijo</I><B>.</B><I>N</I><B>of</B><I>M</I><B>.deb</B>, siendo <I>N</I>
el n&uacute;mero de la parte, comenzando por 1, y <I>M</I> el n&uacute;mero total de partes
(ambos en decimal).
<P>
Si no se proporciona ning&uacute;n <I>prefijo</I>, se toma el nombre del
<I>fichero-completo</I>, incluyendo el directorio, y eliminando cualquier
terminaci&oacute;n <B>.deb</B>.
<DT id="2"><B>-j</B>, <B>--join</B> <I>parte</I>...<DD>
Une las partes de un paquete, dejando el paquete tal y como era
originalmente.
<P>
Las partes que se proporcionen como argumento deben ser todas parte del
mismo fichero original. Cada parte se debe proporcionar una sola vez, aunque
no necesariamente en orden.
<P>
Todas las partes se deben generar con el mismo tama&ntilde;o especificado en el
momento de la divisi&oacute;n, lo que significa que todas se deben generar con la
misma ejecuci&oacute;n de <B>dpkg-split --split</B>.
<P>
El nombre de las partes carece de importancia para el proceso de uni&oacute;n.
<P>
Por omisi&oacute;n el fichero resultante se llama
<I>paquete</I><B>_</B><I>versi&oacute;n</I><B>_</B><I>arch</I><B>.deb</B>.
<P>
<DT id="3"><B>-I</B>, <B>--info</B> <I>parte</I>...<DD>
Muestra informaci&oacute;n, en un formato legible por el usuario, acerca de la
parte o partes del fichero especificadas. Los argumentos que no son parte de
un paquete binario producen un mensaje avisando del problema (por la salida
est&aacute;ndar).
<DT id="4"><B>-a</B>, <B>--auto -o</B> <I>salida-completa parte</I><DD>
Posiciona las partes en la cola autom&aacute;ticamente, y une nuevamente el
paquete, si es posible.
<P>
La <I>parte</I> especificada se examina y compara junto con las otras partes del
mismo paquete (si hay alguna) en la cola de las partes de ficheros de
paquete.
<P>
Si est&aacute;n disponibles todas las partes del fichero al que pertenece la
<I>parte</I>, se une paquete y guarda en la <I>salida-completa</I> (que normalmente
no existe, aunque esto no es un error).
<P>
De no se as&iacute;, la <I>parte</I> se copia en la cola pero no se crea la
<I>salida-completa</I>.
<P>
Si la <I>parte</I> no es una parte del paquete binario, <B>dpkg-split</B> finalizar&aacute;
con un estado de salida igual a <B>1</B>, si ocurre alg&uacute;n otro tipo de error el
estado de salida ser&aacute; <B>2</B>.
<P>
Debe proporcionar la opci&oacute;n <B>--output</B> o <B>-o</B> cuando use <B>--auto</B>. (Si
este argumento no fuese obligatorio el programa que ejecute <B>dpkg-split</B> no
sabr&iacute;a que fichero esperar).
<DT id="5"><B>-l</B>, <B>--listq</B><DD>
Lista los contenidos de la cola de paquetes cuyas partes unir.
<P>
Por cada fichero de un paquete que contenga partes en la cola se muestra el
nombre del paquete, las partes en la cola y el n&uacute;mero total de bytes
guardados en &eacute;sta.
<DT id="6"><B>-d</B>, <B>--discard</B> [<I>paquete</I>...]<DD>
Descarta partes de la cola de aqu&eacute;llas que esperan las partes restantes del
paquete para su uni&oacute;n con otras.
<P>
Si no se especifica ning&uacute;n <I>paquete</I> se limpia la cola por completo, si se
especifica alguno s&oacute;lo se eliminan las partes de los paquetes relevantes.
<DT id="7"><B>-?</B>, <B>--help</B><DD>
Muestra el modo de uso y termina.
<DT id="8"><B>--version</B><DD>
Muestra la versi&oacute;n y termina.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>OPCIONES</H2>

<DL COMPACT>
<DT id="9"><B>--depotdir</B><I> directorio</I><DD>
Especifica un directorio alternativo para las partes que se encuentran en la
cola esperando para ser unidas. Por omisi&oacute;n es <B>/var/lib/dpkg</B>.
<DT id="10"><B>-S</B>, <B>--partsize</B> <I>kibibytes</I><DD>
Especifica el tama&ntilde;o m&aacute;ximo de cada parte en kilobytes (1024 bytes). Por
omisi&oacute;n es 450Kb.
<DT id="11"><B>-o</B>, <B>--output</B> <I>complete-output</I><DD>
Especifica el nombre del fichero generado por la uni&oacute;n de las partes.
<P>
&Eacute;sto sustituye al nombre por omisi&oacute;n en modo manual (<B>--join</B>),  y es
obligatorio con el modo autom&aacute;tico (<B>--auto</B>).
<DT id="12"><B>-Q</B>, <B>--npquiet</B><DD>
Cuando <B>dpkg-split</B> est&aacute; en modo autom&aacute;tico, normalmente muestra mensajes
si se le pasa una <I>parte</I> que no es parte del paquete binario. Esta opci&oacute;n
suprime estos mensajes, permitiendo que programas como <B>dpkg</B> puedan
separar y unir paquetes sin producir mensajes poco informativos.
<DT id="13"><B>--msdos</B><DD>
Fuerza que los nombres de los ficheros generados como salida de <B>--split</B>
sean compatibles con msdos.
<P>
Esta opci&oacute;n modifica el prefijo (tanto el prefijo por omisi&oacute;n como el
proporcionado por un argumento): los caracteres alfanum&eacute;ricos se pasan a
min&uacute;sculas, los signos de suma &laquo;+&raquo; se reemplazan con <B>x</B> y se descartan el
resto de caracteres.
<P>
El resultado se trunca hasta donde sea necesario de forma que se generan
ficheros con la forma <I>prefijoN</I><B>of</B><I>M</I><B>.deb</B>.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>ESTADOS DE SALIDA</H2>

<DL COMPACT>
<DT id="14"><B>0</B><DD>
La divisi&oacute;n, uni&oacute;n u otra orden ha finalizado con &eacute;xito. Las &oacute;rdenes
<B>--info</B> se dan c&oacute;mo satisfactorias incluso si los ficheros no son parte de
ning&uacute;n paquete binario.
<DT id="15"><B>1</B><DD>
Aparece solo al utilizar la opci&oacute;n <B>--auto</B>, e indica que la <I>parte</I> no
era parte de un paquete binario.
<DT id="16"><B>2</B><DD>
Fatal or unrecoverable error due to invalid command-line usage, a file that
looked like a package part file but was corrupted, or interactions with the
system, such as accesses to the database, memory allocations, etc.
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ENTORNO</H2>

<DL COMPACT>
<DT id="17"><B>DPKG_COLORS</B><DD>
Sets the color mode (since dpkg 1.18.5).  The currently accepted values are:
<B>auto</B> (default), <B>always</B> and <B>never</B>.
<DT id="18"><B>SOURCE_DATE_EPOCH</B><DD>
If set, it will be used as the timestamp (as seconds since the epoch) in the
<B><A HREF="/cgi-bin/man/man2html?5+deb-split">deb-split</A></B>(5)'s <B><A HREF="/cgi-bin/man/man2html?5+ar">ar</A></B>(5) container.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>FICHEROS</H2>

<DL COMPACT>
<DT id="19"><I>/var/lib/dpkg/parts</I><DD>
El directorio por omisi&oacute;n donde las partes esperan para la uni&oacute;n autom&aacute;tica.
<P>
Los nombre de los ficheros usados en este directorio se encuentran en un
formato interno de <B>dpkg-split</B>, y es improbable que sean &uacute;tiles para otros
programas. En cualquier caso, no se deber&iacute;a depender del formato del nombre
del fichero.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>FALLOS</H2>

Es imposible obtener todos los detalles de los paquetes que est&aacute;n en la cola
sin investigar directamente la cola.
<P>
No existe una manera sencilla de comprobar si el fichero que puede ser parte
de un paquete binario es realmente uno.
<A NAME="lbAK">&nbsp;</A>
<H2>V&Eacute;ASE TAMBI&Eacute;N</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
<A NAME="lbAL">&nbsp;</A>
<H2>TRADUCTOR</H2>

Rudy Godoy &lt;<A HREF="mailto:rudy@kernel-panik.org">rudy@kernel-panik.org</A>&gt;,
Rub&eacute;n Porras &lt;<A HREF="mailto:nahoo@inicia.es">nahoo@inicia.es</A>&gt;,
Bruno Barrera C. &lt;<A HREF="mailto:bruno.barrera@igloo.cl">bruno.barrera@igloo.cl</A>&gt;,
Carlos Izquierdo &lt;<A HREF="mailto:gheesh@ertis.net">gheesh@ertis.net</A>&gt;,
Esteban Manchado y
NOK.
Debian L10n Spanish &lt;<A HREF="mailto:debian-l10n-spanish@lists.debian.org">debian-l10n-spanish@lists.debian.org</A>&gt;.
<BR>

Revisiones por Santiago Vila &lt;<A HREF="mailto:sanvila@unex.es">sanvila@unex.es</A>&gt;,
Javier Fern&aacute;ndez-Sanguino, Rub&eacute;n Porras,
Luis Uribe y Omar Campagne.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="20"><A HREF="#lbAB">NOMBRE</A><DD>
<DT id="21"><A HREF="#lbAC">SINOPSIS</A><DD>
<DT id="22"><A HREF="#lbAD">DESCRIPCI&Oacute;N</A><DD>
<DT id="23"><A HREF="#lbAE">&Oacute;RDENES</A><DD>
<DT id="24"><A HREF="#lbAF">OPCIONES</A><DD>
<DT id="25"><A HREF="#lbAG">ESTADOS DE SALIDA</A><DD>
<DT id="26"><A HREF="#lbAH">ENTORNO</A><DD>
<DT id="27"><A HREF="#lbAI">FICHEROS</A><DD>
<DT id="28"><A HREF="#lbAJ">FALLOS</A><DD>
<DT id="29"><A HREF="#lbAK">V&Eacute;ASE TAMBI&Eacute;N</A><DD>
<DT id="30"><A HREF="#lbAL">TRADUCTOR</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:59 GMT, March 31, 2021
</BODY>
</HTML>
