
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of update-alternatives</TITLE>
</HEAD><BODY>
<H1>update-alternatives</H1>
Section: Herramientas de dpkg (1)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>NOMBRE</H2>

update-alternatives - Gesti&oacute;n de enlaces simb&oacute;licos que determinan &oacute;rdenes
predefinidas
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSIS</H2>

<B>update-alternatives</B> [<I>opci&oacute;n</I>...] <I>orden</I>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRIPCI&Oacute;N</H2>

<B>update-alternatives</B> crea, elimina, gestiona y muestra informaci&oacute;n sobre
los enlaces simb&oacute;licos que conforman el sistema de alternativas de Debian.
<P>

Es posible que tenga en el sistema varios programas instalados a la vez que
realizan la misma funci&oacute;n. Por ejemplo, muchos sistemas tienen varios
editores de texto instalados al mismo tiempo, lo que deja la elecci&oacute;n de qu&eacute;
editor de texto utilizar en manos del usuario, si &eacute;ste lo desea, pero hace
dif&iacute;cil que un programa elija la opci&oacute;n correcta si el usuario no ha
definido ninguna preferencia.
<P>

El objetivo del sistema de alternativas de Debian es resolver este
problema. Un nombre gen&eacute;rico en el sistema de ficheros se comparte entre
todos los ficheros que tienen una funcionalidad intercambiable. El sistema
de alternativas junto con el administrador del sistema determinan a qu&eacute;
fichero hace referencia este nombre gen&eacute;rico. Por ejemplo, si los editores
de texto <B><A HREF="/cgi-bin/man/man2html?1+ed">ed</A></B>(1) y <B><A HREF="/cgi-bin/man/man2html?1+nvi">nvi</A></B>(1) est&aacute;n instalados conjuntamente en el sistema,
el sistema de alternativas har&aacute; que el nombre gen&eacute;rico <I>/usr/bin/editor</I> se
refiera a <I>/usr/bin/nvi</I> por omisi&oacute;n. El administrador del sistema puede
modificar esto y hacer que se refiera a <I>/usr/bin/ed</I>, y el sistema de
alternativas no modificar&aacute; esto posteriormente hasta que se solicite
expl&iacute;citamente.
<P>

El nombre gen&eacute;rico no es un enlace simb&oacute;lico directo a la alternativa
seleccionada. En vez de esto, es un enlace simb&oacute;lico a un nombre en el
<I>directorio</I> de <I>alternativas</I> (&laquo;/etc/alternatives&raquo;), que a su vez es
un enlace simb&oacute;lico al fichero al que se hace referencia en realidad. El
objetivo es que los cambios del administrador se mantengan dentro del
directorio <I>/etc</I>: el FHS (q.v.) da razones de por qu&eacute; esto es bueno.
<P>

When each package providing a file with a particular functionality is
installed, changed or removed, <B>update-alternatives</B> is called to update
information about that file in the alternatives system.
<B>update-alternatives</B> is usually called from the <B>postinst</B> (configure) or
<B>prerm</B> (remove and deconfigure) scripts in Debian packages.
<P>

Habitualmente, es &uacute;til que un n&uacute;mero de alternativas se sincronicen de tal
modo que se puedan cambiar como un grupo. Por ejemplo, cuando varias
versiones del editor <B><A HREF="/cgi-bin/man/man2html?1+vi">vi</A></B>(1) est&aacute;n instaladas la p&aacute;gina del manual
preferida por <I>/usr/share/man/man1/vi.1</I> debe corresponder con el
ejecutable al que hace referencia <I>/usr/bin/vi</I>. <B>update-alternatives</B>
manipula esto en t&eacute;rminos de enlaces <I>maestro</I> y <I>esclavo</I>; cuando se
cambia el maestro, todos los esclavos relacionados con &eacute;l tambi&eacute;n
cambian. Un enlace maestro y sus esclavos relacionados forman un <I>grupo</I> de
<I>enlaces</I>.
<P>

Cada grupo de enlaces est&aacute; en todo momento en uno de los dos modos posibles:
autom&aacute;tico o manual. Cuando un grupo est&aacute; en modo autom&aacute;tico el sistema de
alternativas decide autom&aacute;ticamente el momento de actualizar los enlaces a
medida que se instalan o desinstalan paquetes. En modo manual el sistema de
alternativas deja todas estas decisiones en manos del administrador del
sistema.
<P>

Los grupos de enlaces se establecen en modo autom&aacute;tico la primera vez que
aparecen en el sistema. Si el administrador del sistema hace cambios en la
configuraci&oacute;n autom&aacute;tica del sistema, <B>update-alternatives</B> se dar&aacute; cuenta
la pr&oacute;xima vez que se ejecute sobre el grupo de enlaces cambiados y el grupo
pasar&aacute; autom&aacute;ticamente a modo manual.
<P>

Cada alternativa tiene una <I>prioridad</I> asociada. Cuando un grupo de enlaces
se encuentra en modo autom&aacute;tico, los miembros del grupo apuntar&aacute;n a la
alternativa con la prioridad m&aacute;s alta.
<P>

When using the <B>--config</B> option, <B>update-alternatives</B> will list all of
the choices for the link group of which given <I>name</I> is the master
alternative name.  The current choice is marked with a '*'.  You will then
be prompted for your choice regarding this link group.  Depending on the
choice made, the link group might no longer be in <I>auto</I> mode. You will
need to use the <B>--auto</B> option in order to return to the automatic mode
(or you can rerun <B>--config</B> and select the entry marked as automatic).
<P>

Si quiere realizar la configuraci&oacute;n de un modo no interactivo puede utilizar
la opci&oacute;n <B>--set</B> en su lugar (v&eacute;ase m&aacute;s abajo).
<P>

Los diferentes paquetes que proveen el mismo fichero tienen que hacerlo de
forma <B>cooperativa</B>. En otras palabras, el uso de <B>update-alternatives</B> es
<B>obligatorio</B> con todos los paquetes relacionados con esa situaci&oacute;n. No es
posible sobreescribir el fichero de un paquete que no usa el mecanismo de
<B>update-alternatives</B>.
<A NAME="lbAE">&nbsp;</A>
<H2>TERMINOLOG&Iacute;A</H2>

Debido a que las actividades que realiza <B>update-alternatives</B> est&aacute;n
fuertemente relacionadas entre s&iacute;, la definici&oacute;n de algunos t&eacute;rminos
espec&iacute;ficos ayudar&aacute; a entender su funcionamiento.
<DL COMPACT>
<DT id="1">nombre gen&eacute;rico (o enlace alternativo)<DD>
Un nombre, como <I>/usr/bin/editor</I>, que mediante el sistema de alternativas
hace referencia a uno de los posibles ficheros con una funci&oacute;n similar.
<DT id="2">nombre de la alternativa<DD>
El nombre de un enlace simb&oacute;lico en el directorio de alternativas.
<DT id="3">alternativa (o ruta alternativa)<DD>
El nombre de un fichero espec&iacute;fico en el sistema de ficheros al que se puede
acceder a trav&eacute;s de un nombre gen&eacute;rico usando el sistema de alternativas.
<DT id="4">directorio de alternativas<DD>
El directorio que contiene los enlaces, por omisi&oacute;n es
<I>/etc/alternatives</I>.
<DT id="5">directorio administrativo<DD>
El directorio que contiene la informaci&oacute;n de estado de
<B>update-alternatives</B>, por omisi&oacute;n es <I>/var/lib/dpkg/alternatives</I>.
<DT id="6">grupo de enlaces<DD>
Un conjunto de enlaces relacionados con el objetivo de que se actualicen
como grupo.
<DT id="7">enlace maestro<DD>
El enlace alternativo en un grupo de enlaces que determina c&oacute;mo se
configuran el resto de los enlaces del grupo.
<DT id="8">enlace esclavo<DD>
Un enlace alternativo en un grupo de enlaces definido por el enlace maestro.
<DT id="9">modo autom&aacute;tico<DD>
Cuando un grupo de enlaces se encuentra en modo autom&aacute;tico el sistema de
alternativas asegura que los enlaces del grupo apuntan a la alternativa con
la mayor prioridad en ese grupo.
<DT id="10">modo manual<DD>
Cuando un grupo de enlaces se encuentra en modo manual el sistema de
alternativas no har&aacute; ning&uacute;n cambio en la configuraci&oacute;n del administrador.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>&Oacute;RDENES</H2>

<DL COMPACT>
<DT id="11"><B>--install</B> <I>enlace nombre ruta prioridad</I> [<B>--slave</B> <I>enlace nombre ruta</I>] ...<DD>
A&ntilde;ade un grupo de alternativas al sistema. <I>enlace</I> es el nombre gen&eacute;rico
del enlace maestro, <I>nombre</I> es el nombre del enlace simb&oacute;lico en el
directorio de alternativas, y <I>ruta</I> es la alternativa que se va a
introducir para el enlace maestro. Los argumentos a continuaci&oacute;n de
<B>--slave</B> son el nombre gen&eacute;rico, el nombre del enlace simb&oacute;lico en el
directorio de alternativas, y la ruta alternativa para el enlace
esclavo. Puede definir cero o m&aacute;s opciones de <B>--slave</B>, cada uno seguido
de tres argumentos. Tenga en cuenta que la alternativa maestra debe existir
previamente o la ejecuci&oacute;n fallar&aacute;. Por otra parte, si la alternativa
esclava no existe, el enlace esclavo alternativo correspondiente no se
instalar&aacute;, mostrando un aviso. Un fichero real instalado en la ubicaci&oacute;n de
un enlace alternativo nunca se eliminar&aacute; a menos que se use <B>--force</B>.
<DT id="12"><DD>
Si el nombre de la alternativa definida ya existe en los registros del
sistema de alternativas la informaci&oacute;n suministrada se a&ntilde;adir&aacute; como un nuevo
conjunto de alternativas para el grupo. De otra forma se crear&aacute; un grupo
nuevo en modo autom&aacute;tico, al que se le a&ntilde;adir&aacute; la informaci&oacute;n
suministrada. Si el grupo est&aacute; en modo autom&aacute;tico, y la prioridad nueva
a&ntilde;adida es mayor que cualquier otra alternativa instalada para ese grupo,
los enlaces se actualizar&aacute;n para apuntar a las nuevas alternativas.
<DT id="13"><B>--set</B> <I>nombre ruta</I><DD>
Define la <I>ruta</I> del programa como alternativa para <I>nombre</I>. Equivale a
<B>--config</B> pero no es interactivo, de modo que permite su inclusi&oacute;n en
scripts.
<DT id="14"><B>--remove</B> <I>nombre ruta</I><DD>
Elimina una alternativa y todos sus enlaces esclavos asociados. <I>nombre</I> es
el nombre en el directorio de alternativas y <I>ruta</I> es el nombre absoluto
del fichero al que <I>nombre</I> se podr&iacute;a enlazar. Si <I>nombre</I> est&aacute; en
realidad enlazado a <I>ruta</I>, <I>nombre</I> se actualizar&aacute; para que apunte a otra
alternativa apropiada o se eliminar&aacute; si no queda ninguna alternativa
restante. Los enlaces esclavos asociados se actualizar&aacute;n o eliminar&aacute;n
correspondientemente. Si el enlace no apunta a <I>ruta</I>, no se cambia ning&uacute;n
enlace, s&oacute;lo se elimina la informaci&oacute;n acerca de la alternativa.
<DT id="15"><B>--remove-all</B> <I>nombre</I><DD>
Elimina todas las alternativas y todos sus enlaces esclavos
asociados. <I>nombre</I> es un nombre en el directorio de alternativas.
<DT id="16"><B>--all</B><DD>
Ejecuta <B>--config</B> sobre todas las alternativas. Puede ser &uacute;til en
combinaci&oacute;n con <B>--skip-auto</B> para revisar y configurar todas las
alternativas que no est&aacute;n configuradas en modo autom&aacute;tico. Tambi&eacute;n se
muestran las alternativas rotas. Una manera sencilla de arreglar todas las
alternativas rotas es ejecutar <B>yes '' | update-alternatives --force
--all</B>.
<DT id="17"><B>--auto</B> <I>nombre</I><DD>
Cambia el grupo de enlaces dependientes de la alternativa <I>nombre</I> a modo
autom&aacute;tico. En el proceso, el enlace simb&oacute;lico y sus esclavos se
actualizar&aacute;n para apuntar a la alternativa instalada con una prioridad
mayor.
<DT id="18"><B>--display</B> <I>nombre</I><DD>
Display information about the link group.  Information displayed includes
the group's mode (auto or manual), the master and slave links, which
alternative the master link currently points to, what other alternatives are
available (and their corresponding slave alternatives), and the highest
priority alternative currently installed.
<DT id="19"><B>--get-selections</B><DD>
List all master alternative names (those controlling a link group)  and
their status (since version 1.15.0).  Each line contains up to 3 fields
(separated by one or more spaces). The first field is the alternative name,
the second one is the status (either <B>auto</B> or <B>manual</B>), and the last one
contains the current choice in the alternative (beware: it's a filename and
thus might contain spaces).
<DT id="20"><B>--set-selections</B><DD>
Lee la configuraci&oacute;n de alternativas por la entrada est&aacute;ndar en el formato
generado por <B>--get-selections</B> y los reconfigura apropiadamente (desde la
versi&oacute;n 1.15.0).
<DT id="21"><B>--query</B> <I>nombre</I><DD>
Display information about the link group like <B>--display</B> does, but in a
machine parseable way (since version 1.15.0, see section <B>QUERY FORMAT</B>
below).
<DT id="22"><B>--list</B> <I>name</I><DD>
Muestra todos los objetivos del grupo de enlaces.
<DT id="23"><B>--config</B> <I>nombre</I><DD>
Muestra las alternativas disponibles para un grupo de enlaces y permite al
usuario seleccionar interactivamente cual usar. El grupo de enlaces se
actualizar&aacute;.
<DT id="24"><B>--help</B><DD>
Muestra el modo de uso y termina.
<DT id="25"><B>--version</B><DD>
Muestra la versi&oacute;n y termina.
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>OPCIONES</H2>

<DL COMPACT>
<DT id="26"><B>--altdir</B> <I>directorio</I><DD>
Define el directorio de alternativas, cuando es diferente del directorio por
omisi&oacute;n.
<DT id="27"><B>--admindir</B><I> directorio</I><DD>
Define el directorio administrativo, cuando es diferente del directorio por
omisi&oacute;n.
<DT id="28"><B>--log=</B><I>fichero</I><DD>
Specifies the log file (since version 1.15.0), when this is to be different
from the default (/var/log/alternatives.log).
<DT id="29"><B>--force</B><DD>
Allow replacing or dropping any real file that is installed where an
alternative link has to be installed or removed.
<DT id="30"><B>--skip-auto</B><DD>
Omite el dialogo de configuraci&oacute;n de alternativas para aquellas configuradas
adecuadamente en modo autom&aacute;tico. Esta opci&oacute;n solo tiene sentido con
<B>--config</B> o <B>--all</B>.
<DT id="31"><B>--quiet</B><DD>
Do not generate any comments unless errors occur.
<DT id="32"><B>--verbose</B><DD>
Generate more comments about what is being done.
<DT id="33"><B>--debug</B><DD>
Generate even more comments, helpful for debugging, about what is being done
(since version 1.19.3).
</DL>
<A NAME="lbAH">&nbsp;</A>
<H2>ESTADOS DE SALIDA</H2>

<DL COMPACT>
<DT id="34"><B>0</B><DD>
La acci&oacute;n requerida finaliz&oacute; con &eacute;xito.
<DT id="35"><B>2</B><DD>
Se encontraron problemas analizando la l&iacute;nea de &oacute;rdenes o realizando la
acci&oacute;n requerida.
</DL>
<A NAME="lbAI">&nbsp;</A>
<H2>ENTORNO</H2>

<DL COMPACT>
<DT id="36"><B>DPKG_ADMINDIR</B><DD>
Si se define, y no se define la opci&oacute;n <B>--admindir</B>, se utiliza como el
directorio base de gesti&oacute;n.
</DL>
<A NAME="lbAJ">&nbsp;</A>
<H2>FICHEROS</H2>

<DL COMPACT>
<DT id="37"><I>/etc/alternatives/</I><DD>
El directorio de alternativas por omisi&oacute;n. Se puede cambiar con la opci&oacute;n
<B>--altdir</B>.
<DT id="38"><I>/var/lib/dpkg/alternatives/</I><DD>
El directorio de administraci&oacute;n por omisi&oacute;n. Se puede modificar con la
opci&oacute;n <B>--admindir</B>.
</DL>
<A NAME="lbAK">&nbsp;</A>
<H2>FORMATO DE CONSULTA</H2>

The <B>--query</B> format is using an RFC822-like flat format. It's made of <I>n</I>
+ 1 blocks where <I>n</I> is the number of alternatives available in the queried
link group. The first block contains the following fields:
<DL COMPACT>
<DT id="39"><B>Name:</B><I> nombre</I><DD>
El nombre de la alternativa en el directorio de alternativas.
<DT id="40"><B>Link:</B><I> enlace</I><DD>
El nombre gen&eacute;rico de la alternativa.
<DT id="41"><B>Slaves:</B><I> lista de esclavos</I><DD>
Cuando este campo est&aacute; presente, las l&iacute;neas <B>siguientes</B> contienen todos
los enlances esclavos asociados al enlace maestro de la alternativa. Hay un
esclavo por l&iacute;nea. Cada l&iacute;nea contiene un espacio, el nombre gen&eacute;rico de la
alternativa esclava, otro espacio, y la ruta al enlace esclavo.
<DT id="42"><B>Status:</B><I> estado</I><DD>
El estado de la alternativa (<B>auto</B> o <B>manual</B>).
<DT id="43"><B>Best:</B><I> mejor-opci&oacute;n</I><DD>
La ruta de la mejor alternativa para este grupo de enlaces. No aparece si no
existen alternativas disponibles.
<DT id="44"><B>Value:</B><I> alternativa-seleccionada-actualmente</I><DD>
La ruta de la alternativa seleccionada en ese momento. Tambi&eacute;n puede tomar
el valor m&aacute;gico <B>none</B> (ninguno). Se usa si el enlace no existe.
</DL>
<P>

Los siguientes bloques describen las alternativas disponibles en el grupo de
enlaces consultado:
<DL COMPACT>
<DT id="45"><B>Alternative:</B><I> ruta-a-esta-alternativa</I><DD>
Ruta a la alternativa de este bloque.
<DT id="46"><B>Priority:</B><I> valor-de-prioridad</I><DD>
Valor de la prioridad de esta alternativa.
<DT id="47"><B>Slaves:</B><I> lista de esclavos</I><DD>
When this field is present, the <B>next</B> lines hold all slave alternatives
associated to the master link of the alternative. There is one slave per
line. Each line contains one space, the generic name of the slave
alternative, another space, and the path to the slave alternative.
</DL>
<A NAME="lbAL">&nbsp;</A>
<H3>Example</H3>

<PRE>
$ update-alternatives --query editor
Name: editor
Link: /usr/bin/editor
Slaves:
 editor.1.gz /usr/share/man/man1/editor.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/editor.1.gz
 editor.it.1.gz /usr/share/man/it/man1/editor.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/editor.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/editor.1.gz
Status: auto
Best: /usr/bin/vim.basic
Value: /usr/bin/vim.basic

Alternative: /bin/ed
Priority: -100
Slaves:
 editor.1.gz /usr/share/man/man1/ed.1.gz

Alternative: /usr/bin/vim.basic
Priority: 50
Slaves:
 editor.1.gz /usr/share/man/man1/vim.1.gz
 editor.fr.1.gz /usr/share/man/fr/man1/vim.1.gz
 editor.it.1.gz /usr/share/man/it/man1/vim.1.gz
 editor.pl.1.gz /usr/share/man/pl/man1/vim.1.gz
 editor.ru.1.gz /usr/share/man/ru/man1/vim.1.gz
</PRE>

<A NAME="lbAM">&nbsp;</A>
<H2>DIAGN&Oacute;STICOS</H2>

Con la opci&oacute;n <B>--verbose</B>, <B>update-alternatives</B> informa detalladamente
acerca de sus actividades por la salida est&aacute;ndar. Si ocurre alg&uacute;n problema,
<B>update-alternatives</B> env&iacute;a los mensajes de error por la salida de errores
est&aacute;ndar y cierra con el estado 2. Los diagn&oacute;sticos deber&iacute;an ser
auto-explicativos; si a usted no se lo parecen, le rogamos informe de esto
como un fallo.
<A NAME="lbAN">&nbsp;</A>
<H2>EJEMPLOS</H2>

Hay varios paquetes que proporcionan un editor de texto compatible con
<B>vi</B>, por ejemplo <B>nvi</B>y <B>vim</B>. El grupo de enlaces <B>vi</B> selecciona cual
se usa, incluyendo enlaces para el programa y la p&aacute;gina del manual asociada.
<P>

Utilice la opci&oacute;n <B>--display</B> para mostrar los paquetes disponibles que
proporcionan <B>vi</B> y su configuraci&oacute;n actual:
<P>

<DL COMPACT><DT id="48"><DD>
<B>update-alternatives --display vi</B>
</DL>

<P>

Para elegir una implementaci&oacute;n de <B>vi</B> en particular use la siguiente orden
como el usuario &laquo;root&raquo; y seleccione un n&uacute;mero de la lista:
<P>

<DL COMPACT><DT id="49"><DD>
<B>update-alternatives --config vi</B>
</DL>

<P>

Para que la implementaci&oacute;n de <B>vi</B> se vuelva a elegir de forma autom&aacute;tica,
haga como administrador:
<P>

<DL COMPACT><DT id="50"><DD>
<B>update-alternatives --auto vi</B>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>V&Eacute;ASE TAMBI&Eacute;N</H2>

<B><A HREF="/cgi-bin/man/man2html?1+ln">ln</A></B>(1), FHS, el est&aacute;ndar de la jerarqu&iacute;a del sistema de ficheros.
<A NAME="lbAP">&nbsp;</A>
<H2>TRADUCTOR</H2>

Rudy Godoy &lt;<A HREF="mailto:rudy@kernel-panik.org">rudy@kernel-panik.org</A>&gt;,
Rub&eacute;n Porras &lt;<A HREF="mailto:nahoo@inicia.es">nahoo@inicia.es</A>&gt;,
Bruno Barrera C. &lt;<A HREF="mailto:bruno.barrera@igloo.cl">bruno.barrera@igloo.cl</A>&gt;,
Carlos Izquierdo &lt;<A HREF="mailto:gheesh@ertis.net">gheesh@ertis.net</A>&gt;,
Esteban Manchado y
NOK.
Debian L10n Spanish &lt;<A HREF="mailto:debian-l10n-spanish@lists.debian.org">debian-l10n-spanish@lists.debian.org</A>&gt;.
<BR>

Revisiones por Santiago Vila &lt;<A HREF="mailto:sanvila@unex.es">sanvila@unex.es</A>&gt;,
Javier Fern&aacute;ndez-Sanguino, Rub&eacute;n Porras,
Luis Uribe y Omar Campagne.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="51"><A HREF="#lbAB">NOMBRE</A><DD>
<DT id="52"><A HREF="#lbAC">SINOPSIS</A><DD>
<DT id="53"><A HREF="#lbAD">DESCRIPCI&Oacute;N</A><DD>
<DT id="54"><A HREF="#lbAE">TERMINOLOG&Iacute;A</A><DD>
<DT id="55"><A HREF="#lbAF">&Oacute;RDENES</A><DD>
<DT id="56"><A HREF="#lbAG">OPCIONES</A><DD>
<DT id="57"><A HREF="#lbAH">ESTADOS DE SALIDA</A><DD>
<DT id="58"><A HREF="#lbAI">ENTORNO</A><DD>
<DT id="59"><A HREF="#lbAJ">FICHEROS</A><DD>
<DT id="60"><A HREF="#lbAK">FORMATO DE CONSULTA</A><DD>
<DL>
<DT id="61"><A HREF="#lbAL">Example</A><DD>
</DL>
<DT id="62"><A HREF="#lbAM">DIAGN&Oacute;STICOS</A><DD>
<DT id="63"><A HREF="#lbAN">EJEMPLOS</A><DD>
<DT id="64"><A HREF="#lbAO">V&Eacute;ASE TAMBI&Eacute;N</A><DD>
<DT id="65"><A HREF="#lbAP">TRADUCTOR</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:59 GMT, March 31, 2021
</BODY>
</HTML>
