
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT.CONF</TITLE>
</HEAD><BODY>
<H1>APT.CONF</H1>
Section: APT (5)<BR>Updated: 04&nbsp;April&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt.conf - Konfigurationsdatei f&uuml;r APT
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

/etc/apt/apt.conf
ist die Hauptkonfigurationsdatei, die alle Werkzeuge der APT-Programmsammlung gemeinsam nutzen, es ist jedoch beileibe nicht der einzige Ort, an dem Optionen gesetzt werden k&ouml;nnen. Die Programmsammlung benutzt au&szlig;erdem einen gemeinsamen Befehlszeilenauswerter, um eine einheitliche Umgebung bereitzustellen.
<P>

Wenn ein APT-Werkzeug startet, wird es die Konfigurationsdateien in der folgenden Reihenfolge lesen:
<P>
<DL COMPACT><DT id="1"><DD>
 1.


die Datei, die durch die Umgebungsvariable
<B>APT_CONFIG</B>
angegeben wird (falls gesetzt)
</DL>

<P>
<DL COMPACT><DT id="2"><DD>
 2.


alle Dateien in
Dir::Etc::Parts
in aufsteigender alphanumerischer Reihenfolge, die entweder keine oder &raquo;conf&laquo; als Dateinamenserweiterung haben und die nur alphanumerische Zeichen, Bindestriche (-), Unterstriche (_) und Punkte (.) enthalten. Andernfalls wird APT einen Hinweis ausgeben, dass es eine Datei ignoriert hat, falls die Datei nicht auf ein Muster in der Konfigurationsliste
Dir::Ignore-Files-Silently
passt - in diesem Fall wird sie stillschweigend ignoriert.
</DL>

<P>
<DL COMPACT><DT id="3"><DD>
 3.


die Hauptkonfigurationsdatei, die durch
Dir::Etc::main
angegeben wird
</DL>

<P>
<DL COMPACT><DT id="4"><DD>
 4.


Alle in der programmspezifischen Konfigurationsunterbaumstruktur gesetzten Optionen werden in die Wurzel der Baumstruktur verschoben.
</DL>

<P>
<DL COMPACT><DT id="5"><DD>
 5.


Die Befehlszeilenoptionen werden angewendet, um die Konfigurationsdirektiven au&szlig;er Kraft zu setzen oder um sogar weitere Konfigurationsdateien zu laden.
</DL>

<A NAME="lbAD">&nbsp;</A>
<H2>SYNTAX</H2>

<P>

Die Konfigurationsdatei ist in einem Baum mit Optionen organisiert, die in funktionellen Gruppen organisiert sind. Optionsspezifikation wird mit einer doppelten Doppelpunktschreibweise angegeben, zum Beispiel ist
APT::Get::Assume-Yes
eine Option innerhalb der APT-Werkzeuggruppe f&uuml;r das Werkzeug Get. Optionen werden nicht von ihren Elterngruppe geerbt.
<P>

Syntaktisch ist die Konfigurationssprache dem nachempfunden, was die ISC-Werkzeuge, wie bind und dhcp, benutzen. Zeilen, die mit
//
beginnen, werden als Kommentar betrachtet (und ignoriert), ebenso wie jeglicher Text zwischen
/*
und
*/, wie bei C/C++-Kommentaren. Jede Zeile hat die Form
APT::Get::Assume-Yes &quot;true&quot;;. Die Anf&uuml;hrungszeichen und abschlie&szlig;enden Strichpunkte werden ben&ouml;tigt. Der Wert muss in einer Zeile stehen und es gibt keine M&ouml;glichkeit, Zeichenketten aneinander zu h&auml;ngen. Werte d&uuml;rfen keine R&uuml;ckw&auml;rtsschr&auml;gstriche oder zus&auml;tzliche Anf&uuml;hrungszeichen enthalten. Optionsnamen werden aus alphanumerischen Zeichen und den Zeichen &raquo;/-:._+&laquo; gebildet. Ein neuer Geltungsbereich kann mit geschweiften Klammern ge&ouml;ffnet werden, wie:
<P>
<DL COMPACT><DT id="6"><DD>



<PRE>
   
APT {
  Get {
    Assume-Yes &quot;true&quot;;
    Fix-Broken &quot;true&quot;;
  };
};
</PRE>

</DL>




<P>

mit eingef&uuml;gten Zeilenumbr&uuml;chen, um es leserlicher zu gestalten. Listen k&ouml;nnen erstellt werden, indem ein Geltungsbereich ge&ouml;ffnet wird und eine einzelne, von Anf&uuml;hrungszeichen, denen ein Semikolon folgt, eingeschlossene Zeichenkette eingef&uuml;gt wird. Es k&ouml;nnen mehrere Eintr&auml;ge eingef&uuml;gt werden, jeweils getrennt durch ein Semikolon.
<P>
<DL COMPACT><DT id="7"><DD>



<PRE>
   
DPkg::Pre-Install-Pkgs {&quot;/usr/sbin/dpkg-preconfigure --apt&quot;;};
</PRE>

</DL>




<P>

Im Allgemeinen bietet die Beispielkonfigurationsdatei
/usr/share/doc/apt/examples/configure-index.gz
eine gute Anleitung, wie dies aussehen k&ouml;nnte.
<P>

Die Gro&szlig;- und Kleinschreibung ist in Namen der Konfigurationselemente nicht von Bedeutung, deshalb k&ouml;nnten Sie im vorherigen Beispiel auch
dpkg::pre-install-pkgs
benutzen.
<P>

Namen f&uuml;r die Konfigurationselemente sind optional, wenn eine Liste, wie sie im Beispiel
DPkg::Pre-Install-Pkgs
oberhalb gesehen werden kann, definiert ist. Wenn Sie keinen neuen Namen angeben, wird ein neuer Eintrag der Liste lediglich eine neue Option hinzuf&uuml;gen. Wenn Sie einen Namen eingeben, k&ouml;nnen Sie die Option, wie jede andere Option, au&szlig;er Kraft setzen, indem Sie der Option erneut einen neuen Wert zuweisen.
<P>

Es sind zwei Spezialbefehle definiert:
#include
(was missbilligt ist und von alternativen Implementierungen nicht unterst&uuml;tzt wird) und
#clear:
#include
wird die angegebene Datei einf&uuml;gen, au&szlig;er, wenn der Dateiname mit einem Schr&auml;gstrich endet, in diesem Fall wird das ganze Verzeichnis eingef&uuml;gt.
#clear
wird benutzt, um einen Teil des Konfigurationsbaums zu l&ouml;schen. Das angegebene Element und alle davon darunterliegenden Elemente werden gel&ouml;scht. (Beachten Sie, dass diese Zeilen auch mit einem Semikolon enden m&uuml;ssen.)
<P>

Der
#clear-Befehl ist die einzig Art, eine Liste oder einen kompletten Geltungsbereich zu l&ouml;schen. Erneutes &Ouml;ffnen eines Geltungsbereichs (oder die unten beschriebene Syntax mit angeh&auml;ngten
::) wird vorherige geschriebene Eintr&auml;ge
<I>nicht</I>
au&szlig;er Kraft setzen. Optionen k&ouml;nnen nur au&szlig;er Kraft gesetzt werden, indem ein neuer Wert an sie adressiert wird - Listen und Geltungsbereiche k&ouml;nnen nicht au&szlig;er Kraft gesetzt, sondern nur bereinigt werden.
<P>

Alle APT-Werkzeuge akzeptieren eine Option -o, die es erlaubt, eine beliebige Konfigurationsdirektive auf der Befehlszeile anzugeben. Die Syntax ist ein vollst&auml;ndiger Optionsname (APT::Get::Assume-Yes
zum Beispiel), gefolgt von einem Gleichheitszeichen und dann dem neuen Wert der Option. Um ein neues Element an eine Liste anzuh&auml;ngen, h&auml;ngen Sie ein
::
an den Namen der Liste an. (Wie Sie vielleicht erraten haben: Die Geltungsbereichssyntax kann nicht auf der Befehlszeile benutzt werden.)
<P>

Beachten Sie, dass das Anh&auml;ngen von Elementen an eine Liste mittels
::
nur f&uuml;r ein Element pro Zeile funktioniert, Sie sollten es nicht nicht in Verbindung mit einer Geltungsbereichssyntax benutzen (die &raquo;::&laquo; implizit hinzuf&uuml;gt). Die Benutzung der Syntax von beiden zusammen wird einen Fehler ausl&ouml;sen, auf den sich einige Benutzer ung&uuml;nstigerweise verlassen: eine Option mit dem un&uuml;blichen Namen &raquo;::&laquo;, die sich wie jede andere Option mit einem Namen verh&auml;lt. Dies leitet viele Probleme ein; zum einen werden Benutzer, die mehrere Zeilen in dieser
<I>falschen</I>
Syntax in der Hoffnung, etwas an die Liste anzuh&auml;ngen, schreiben, das Gegenteil erreichen, da nur die letzte Zuweisung zu dieser Option &raquo;::&laquo; benutzt wird. Zuk&uuml;nftige APT-Versionen werden Fehler ausgeben und die Arbeit stoppen, wenn sie auf diese falsche Verwendung sto&szlig;en. Korrigieren Sie deshalb nun solche Anweisungen, solange sich APT nicht explizit dar&uuml;ber beklagt.
<A NAME="lbAE">&nbsp;</A>
<H2>DIE APT-GRUPPE</H2>

<P>

Diese Gruppe von Optionen steuert das allgemeine Verhalten von APT, ebenso wie es die Optionen f&uuml;r alle Werkzeuge enth&auml;lt.
<P>

<B>Architecture</B>
<DL COMPACT><DT id="8"><DD>
Systemarchitektur; setzt die Architektur, die benutzt wird, wenn Dateien heruntergeladen und Paketlisten ausgewertet werden. Die interne Vorgabe ist die Architektur f&uuml;r die APT kompiliert wurde.
</DL>

<P>

<B>Architectures</B>
<DL COMPACT><DT id="9"><DD>
alle Architekturen, die das System unterst&uuml;tzt. Zum Beispiel sind CPUs, die den
amd64-Befehlssatz implementieren (auch
x86-64
genannt), ebenso in der Lage, Programme auszuf&uuml;hren, die f&uuml;r den
i386-Befehlssatz (x86) kompiliert wurden. Diese Liste wird benutzt, wenn Dateien abgerufen und Paketlisten ausgewertet werden. Die anf&auml;ngliche Vorgabe ist immer die native Architektur des Systems (APT::Architecture) und fremde Architekturen werden der vorgegebenen Liste hinzugef&uuml;gt, wenn sie per
<B>dpkg --print-architectures</B>
registriert werden.
</DL>

<P>

<B>Compressor</B>
<DL COMPACT><DT id="10"><DD>
Dieser G&uuml;ltigkeitsbereich definiert, welche Komprimierungsformate unterst&uuml;tzt werden, wie Komprimierung und Dekomprimierung durchgef&uuml;hrt werden k&ouml;nnen, falls die Unterst&uuml;tzung f&uuml;r dieses Format nicht direkt in APT eingebaut wurde und einen Kostenwert, der anzeigt, wie aufw&auml;ndig es ist, etwas in dieses Format zu komprimieren. Als Beispiel w&uuml;rde es der folgende Konfigurationsabschnitt APT erlauben, Dateien herunterzuladen und zu dekomprimieren sowie mit der kosteng&uuml;nstigen
.reversed
Dateiendung zu erzeugen und zu speichern. Dadurch werden sie ohne zus&auml;tzliche Befehlszeilenparameter zum Komprimieren und Dekomprimieren an den Befehl
<B>rev</B>
&uuml;bergeben:
<P>
<DL COMPACT><DT id="11"><DD>



<PRE>
APT::Compressor::rev {
        Name &quot;rev&quot;;
        Extension &quot;.reversed&quot;;
        Binary &quot;rev&quot;;
        CompressArg {};
        UncompressArg {};
        Cost &quot;10&quot;;
};
</PRE>

</DL>




</DL>

<P>

<B>Build-Profiles</B>
<DL COMPACT><DT id="12"><DD>
Liste aller Bauprofile ohne das Namensraum-Pr&auml;fix &raquo;profile.&laquo;, die f&uuml;r die Aufl&ouml;sung der Bauabh&auml;ngigkeiten aktiviert sind. Standardm&auml;&szlig;ig ist diese Liste leer.
<B>DEB_BUILD_PROFILES</B>
setzt so, wie es durch
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)
benutzt wird, die Listenschreibweise au&szlig;er Kraft.
</DL>

<P>

<B>Default-Release</B>
<DL COMPACT><DT id="13"><DD>
Standard-Release von dem Pakete installiert werden, wenn mehr als eine Version verf&uuml;gbar ist. Enth&auml;lt Release-Name, Codename oder Release-Version. Beispiele: &raquo;stable&laquo;, &raquo;testing, &raquo;unstable&laquo;, &raquo;buster&laquo;, &raquo;bullseye&laquo;, &raquo;4.0&laquo;, &raquo;5.0*&laquo;. Siehe auch
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
</DL>

<P>

<B>Ignore-Hold</B>
<DL COMPACT><DT id="14"><DD>
Halten von Paketen ignorieren. Diese globale Option veranlasst den Probleml&ouml;ser, gehaltene Pakete beim Treffen von Entscheidungen zu ignorieren.
</DL>

<P>

<B>Clean-Installed</B>
<DL COMPACT><DT id="15"><DD>
standardm&auml;&szlig;ig auf on (ein). Wenn es auf on gesetzt wird, wird die automatische Bereinigungsfunktion alle Pakete entfernen, die nicht l&auml;nger aus dem Zwischenspeicher heruntergeladen werden k&ouml;nnen. Wenn es auf off gesetzt wird, dann werden au&szlig;erden die Pakete, die lokal installiert sind, vom Bereinigen ausgeschlossen - beachten Sie jedoch, dass APT keine direkten M&ouml;glichkeiten bereitstellt, um sie erneut zu installieren.
</DL>

<P>

<B>Immediate-Configure</B>
<DL COMPACT><DT id="16"><DD>
ist standardm&auml;&szlig;ig aktiviert, was APT veranlassen wird, essenzielle und wichtige Pakete so bald wie m&ouml;glich in einer Installations-/Aktualisierungstransaktion zu installieren, um die Auswirkungen eines scheiternden
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)-Aufrufs zu begrenzen. Falls diese Option deaktiviert ist, betrachtet APT ein wichtiges Paket auf die gleiche Weise wie ein zus&auml;tzliches Paket: Zwischen dem Entpacken des Pakets A und seiner Konfiguration k&ouml;nnen viele andere Entpack- oder Konfigurationsaufrufe f&uuml;r andere, nicht zugeh&ouml;rige Pakete B, C usw. liegen. Falls dies zum Scheitern des
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)-Aufrufs f&uuml;hrt (z.B. weil Betreuerskripte des Pakets B einen Fehler erzeugen), f&uuml;hrt dies zu einem Systemstatus, in dem Paket A entpackt, aber nicht konfiguriert ist, daher ist nicht l&auml;nger gew&auml;hrleistet, dass irgendein Paket, das von A abh&auml;ngt, weiter funktioniert, da seine Abh&auml;ngigkeit von A nicht l&auml;nger erf&uuml;llt wird.
<P>
Au&szlig;erdem wird die unmittelbare Konfigurationsmarkierung im potenziell problematischen Fall zirkul&auml;rer Abh&auml;ngigkeiten angewendet, da eine Abh&auml;ngigkeit mit der Unmittelbarmarkierung einer Vorabh&auml;ngigkeit entspricht. Theoretisch erm&ouml;glicht dies APT, eine Situation zu erkennen, in der es keine unmittelbare Konfiguration durchf&uuml;hren kann, abzubrechen und dem Benutzer vorzuschlagen, dass er die Option zeitweise deaktivieren soll, um ein Fortsetzen der Transaktion zu erm&ouml;glichen. Beachten Sie hier das Wort &raquo;theoretisch&laquo;; im wahren Leben ist dieses Problem selten in instabilen Distributionsversionen aufgetreten und es wurde durch falsche Abh&auml;ngigkeiten des fraglichen Pakets verursacht oder durch ein System in einem bereits besch&auml;digten Zustand; daher sollten Sie diese Option nicht blind deaktivieren, da das zuvor erw&auml;hnte Szenario nicht das einzige Problem ist, das es &uuml;berhaupt erst verhindern kann.
<P>
Bevor eine umfangreiche Transaktion wie
dist-upgrade
mit dieser ausgeschalteten Option ausgef&uuml;hrt wird, sollten Sie versuchen, explizit
install
f&uuml;r das Paket auszuf&uuml;hren, das APT nicht unmittelbar konfigurieren kann. Stellen Sie aber bitte sicher, dass Sie Ihr Problem au&szlig;erdem an Ihre Distribution und an das APT-Team mit dem Verweis zur Fehlermeldung unten melden, so dass sie an der Verbesserung und Korrektur des Upgrade-Prozesses arbeiten k&ouml;nnen.
</DL>

<P>

<B>Force-LoopBreak</B>
<DL COMPACT><DT id="17"><DD>
Schalten Sie diese Option niemals ein, au&szlig;er wenn Sie
<I>wirklich</I>
wissen, was Sie tun. Es erlaubt APT, tempor&auml;r ein essenzielles Paket zu entfernen, um eine Conflicts/Conflicts- oder Conflicts/Pre-Depends-Schleife zwischen zwei essenziellen Paketen zu durchbrechen.
<I>Solch eine Schleife sollte niemals existieren und ist ein schwerwiegender Fehler</I>. Diese Option wird funktionieren, wenn die essenziellen Pakete nicht
<B>tar</B>,
<B>gzip</B>,
<B>libc</B>,
<B>dpkg</B>,
<B>dash</B>
oder etwas, was davon abh&auml;ngt, sind.
</DL>

<P>

<B>Cache-Start</B>, <B>Cache-Grow</B>, <B>Cache-Limit</B>
<DL COMPACT><DT id="18"><DD>
APT benutzt seit Version 0.7.26 eine gr&ouml;&szlig;enver&auml;nderbare, speicherbasierte Zwischenspeicherdatei, um verf&uuml;gbare Informationen zu speichern.
Cache-Start
dient als Hinweis, auf welche Gr&ouml;&szlig;e der Zwischenspeicher wachsen wird und enth&auml;lt daher den Betrag, welchen Speicher APT beim Start abruft. Die Vorgabe ist 20971520 Byte (~20 MB). Beachten Sie, dass diese Speichermenge f&uuml;r APT verf&uuml;gbar sein muss, da es sonst unsch&ouml;n scheitert. F&uuml;r Ger&auml;te mit eingeschr&auml;nktem Speicher sollten diese Werte vermindert werden, w&auml;hrend sie f&uuml;r Systeme mit vielen konfigurierten Quellen erh&ouml;ht werden sollte.
Cache-Grow
definiert in Byte mit einer Vorgabe von 1048576 (~1 MB) um wieviel die Gr&ouml;&szlig;e des Zwischenspeichers verg&ouml;&szlig;ert werden soll, falls der durch
Cache-Start
vorreservierte nicht ausreicht. Dieser Wert wird wieder und wieder verwandt bis entweder der Zwischenspeicher gro&szlig; genug ist, um alle Informationen zu speichern oder die Zwischenspeichergr&ouml;&szlig;e das
Cache-Limit
erreicht. Vorgabe f&uuml;r
Cache-Limit
ist 0, was bedeutet, dass es kein Limit gibt. Falls
Cache-Grow
auf 0 gesetzt ist, kann der Zwischenspeicher nicht automatisch wachsen.
</DL>

<P>

<B>Build-Essential</B>
<DL COMPACT><DT id="19"><DD>
definiert, welche Pakete als essenzielle Bauabh&auml;ngigkeiten betrachtet werden.
</DL>

<P>

<B>Get</B>
<DL COMPACT><DT id="20"><DD>
Der Get-Unterabschnitt steuert das
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)-Werkzeug. Lesen Sie bitte dessen Dokumentation, um weitere Informationen &uuml;ber die dortigen Optionen zu erhalten.
</DL>

<P>

<B>Cache</B>
<DL COMPACT><DT id="21"><DD>
Der Cache-Unterabschnitt steuert das
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)-Werkzeug. Lesen Sie bitte dessen Dokumentation, um weitere Informationen &uuml;ber die dortigen Optionen zu erhalten.
</DL>

<P>

<B>CDROM</B>
<DL COMPACT><DT id="22"><DD>
Der CDROM-Unterabschnitt steuert das
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8)-Werkzeug. Lesen Sie bitte dessen Dokumentation, um weitere Informationen &uuml;ber die dortigen Optionen zu erhalten.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>DIE BESCHAFFUNGSGRUPPE</H2>

<P>

Die
Acquire-Gruppe der Optionen steuert das Herunterladen von Paketen ebenso wie die verschiedenen &raquo;Beschaffungsmethoden&laquo;, die f&uuml;r das Herunterladen selbst zust&auml;ndig sind (siehe auch
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)).
<P>

<B>Check-Date</B>
<DL COMPACT><DT id="23"><DD>
Sicherheitsbezogene Optionen sind auf &raquo;true&laquo; voreingestellt, wodurch zeitbezogene Pr&uuml;fungen aktiviert sind. Deaktivieren bedeutet, dass der Zeit auf der Maschine nicht vertraut wird. Dann wird APT alle zeitbezogenen Pr&uuml;fungen wie
<B>Check-Valid-Until</B>
und die Pr&uuml;fung, ob das Datumsfeld einer Release-Datei in der Zukunft liegt, deaktivieren.
</DL>

<P>

<B>Max-FutureTime</B>
<DL COMPACT><DT id="24"><DD>
maximale Zeit (in Sekunden) vor ihrer Erzeugung (die in der Kopfzeile
Date
angegeben ist), die die Datei
Release
als g&uuml;ltig angesehen wird. Der voreingestellte Wert ist
10. Archivspezifische Einstellungen k&ouml;nnen durch Anh&auml;ngen der Archivbezeichnung an den Optionsnamen vorgenommen werden. Vorzugsweise kann dasselbe f&uuml;r bestimmte
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;ge erreicht werden, indem dort die Option
<B>Date-Max-Future</B>
benutzt wird.
</DL>

<P>

<B>Check-Valid-Until</B>
<DL COMPACT><DT id="25"><DD>
Die sicherheitsbezogene Option wird als &raquo;true&laquo; vorgegeben. Damit werden Wiederholungsangriffe &uuml;ber einen l&auml;ngeren Zeitraum hinweg verhindert, indem der &Uuml;berpr&uuml;fung der Datei Release ein Ablaufdatum gegeben wird. Beispielsweise wird Benutzern damit auch geholfen, l&auml;nger nicht aktualisierte Spiegel zu erkennen - diese Funktion h&auml;ngt jedoch von der Richtigkeit der Zeiteinstellung auf dem Benutzersystem ab. Archivbetreuer sind aufgefordert, Release-Dateien mit der Kopfzeile
Valid-Until
zu erstellen. Falls sie das nicht tun oder ein strengerer Wert gew&uuml;nscht wird, kann die Option
Max-ValidTime
benutzt werden (siehe unten). Der Option
<B>Check-Valid-Until</B>
von
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;gen zum wahlweisen Deaktivieren der Pr&uuml;fung sollte der Vorzug gegeben werden, anstatt dies global mit dieser Einstellung au&szlig;er Kraft zu setzen.
</DL>

<P>

<B>Max-ValidTime</B>
<DL COMPACT><DT id="26"><DD>
maximale Zeit (in Sekunden) nach ihrer Erzeugung (die in der Kopfzeile
Date
angegeben ist), die die Datei
Release
als g&uuml;ltig angesehen wird. Falls die Release-Datei selbst eine
Valid-Until-Kopfzeile enth&auml;lt, wird das fr&uuml;here der beiden Daten als Ablaufdatum verwandt. Vorgabe ist
0, was f&uuml;r &raquo;f&uuml;r immer g&uuml;ltig&laquo; steht. Archivspezifische Einstellungen k&ouml;nnen durch Anh&auml;ngen der Archivbezeichnung an den Optionsnamen vorgenommen werden. Vorzugsweise kann dasselbe f&uuml;r bestimmte
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;ge erreicht werden, indem dort die Option
<B>Valid-Until-Max</B>
benutzt wird.
</DL>

<P>

<B>Min-ValidTime</B>
<DL COMPACT><DT id="27"><DD>
minimale Zeit (in Sekunden), nach der Erzeugung (die in der Kopfzeile
Date
angegeben ist), die die Datei
Release
als g&uuml;ltig angesehen wird. Benutzen Sie dies, falls Sie einen selten aktualisierten (lokalen) Spiegel eines h&auml;ufiger aktualisierten Archivs mit einer
Valid-Until-Kopfzeile haben, anstatt die &Uuml;berpr&uuml;fung des Ablaufdatums komplett zu deaktivieren. Archivspezifische Einstellungen k&ouml;nnen und sollten durch Anh&auml;ngen der Archivbezeichnung an den Optionsnamen vorgenommen werden. Vorzugsweise kann dasselbe f&uuml;r bestimmte
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;ge erreicht werden, indem dort die Option
<B>Valid-Until-Min</B>
benutzt wird.
</DL>

<P>

<B>AllowTLS</B>
<DL COMPACT><DT id="28"><DD>
erm&ouml;glicht die Verwendung interner TLS-Unterst&uuml;tzung in der HTTP-Methode. Falls auf &raquo;false&laquo; gesetzt, deaktiviert dies vollst&auml;ndig die Unterst&uuml;tzung f&uuml;r TLS in den eigenen Methoden von APT (au&szlig;er bei den cURL-basierten HTTPS-Methoden). Es werden keine TLS-bezogenen Funktionen mehr aufgerufen.
</DL>

<P>

<B>PDiffs</B>
<DL COMPACT><DT id="29"><DD>
versucht Unterschiede, die
PDiffs
genannt werden, f&uuml;r Indexe (wie
Packages-Dateien) statt der kompletten Dateien herunterzuladen. Vorgabe ist &raquo;true&laquo;. Vorzugsweise kann dies f&uuml;r bestimmte
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;ge oder Index-Dateien gesetzt werden, indem dort die Option
<B>PDiffs</B>
benutzt wird.
<P>
Es sind au&szlig;erdem zwei Unteroptionen verf&uuml;gbar, um die Benutzung von PDiffs zu begrenzen:
FileLimit
kann verwandt werden, um die maximale Anzahl von PDiff-Dateien anzugeben, die zum Aktualisieren einer Datei heruntergeladen werden sollen. Andererseits gibt
SizeLimit
die maximale Prozentzahl der Gr&ouml;&szlig;e aller Patches im Vergleich zur Zieldatei an. Wenn eine dieser Begrenzungen &uuml;berschritten wird, wird die komplette Datei anstelle der Patche heruntergeladen.
</DL>

<P>

<B>By-Hash</B>
<DL COMPACT><DT id="30"><DD>
versucht Indexe &uuml;ber einen URI der aus der Hash-Summe der erwarteten Datei gebildet wurde, statt &uuml;ber einen gut bekannten stabilen Dateinamen herunterzuladen. Standardm&auml;&szlig;ig &raquo;true&laquo;, wird aber automatisch deaktiviert, falls die Quelle anzeigt, dass es nicht unterst&uuml;tzt wird. Der Gebrauch kann mit dem speziellen Wert &raquo;force&laquo; erzwungen werden. Vorzugsweise kann dies f&uuml;r bestimmte
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Eintr&auml;ge oder Index-Dateien gesetzt werden, indem dort die Option
<B>By-Hash</B>
benutzt wird.
</DL>

<P>

<B>Queue-Mode</B>
<DL COMPACT><DT id="31"><DD>
Warteschlangenmodus;
Queue-Mode
kann entweder
host
oder
access
sein, wodurch festgelegt wird, wie APT ausgehende Verbindungen parallelisiert.
host
bedeutet, dass eine Verbindung pro Zielrechner ge&ouml;ffnet wird,
access
bedeutet, dass eine Verbindung pro URI-Art ge&ouml;ffnet wird.
</DL>

<P>

<B>Retries</B>
<DL COMPACT><DT id="32"><DD>
Anzahl der auszuf&uuml;hrenden erneuten Versuche. Wenn dies nicht Null ist, wird APT fehlgeschlagene Dateien die angegebene Anzahl erneut versuchen.
</DL>

<P>

<B>Source-Symlinks</B>
<DL COMPACT><DT id="33"><DD>
benutzt symbolische Verweise f&uuml;r Quellarchive. Falls dies auf &raquo;true&laquo; gesetzt ist, werden Quellarchive, wenn m&ouml;glich, symbolisch verkn&uuml;pft, anstatt kopiert zu werden. Die Voreinstellung ist &raquo;true&laquo;.
</DL>

<P>

<B>http</B> <B>https</B>
<DL COMPACT><DT id="34"><DD>
Die Optionen in diesen Bereichen konfigurieren, wie APT Transporte &uuml;ber die Protokolle HTTP und HTTPS abwickelt. Sie sind in den Handbuchseiten
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
beziehungsweise
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-https">apt-transport-https</A></B>(1)
dokumentiert.
</DL>

<P>

<B>ftp</B>
<DL COMPACT><DT id="35"><DD>
ftp::Proxy
setzt den Standard-Proxy, der f&uuml;r FTP-URIs benutzt werden soll. Er wird in der Standardform
<A HREF="ftp://[[Benutzer][:Passwort]@]Rechner[:Port]/">ftp://[[Benutzer][:Passwort]@]Rechner[:Port]/</A>
angegeben. Proxys pro Rechner k&ouml;nnen au&szlig;erdem in der Form
ftp::Proxy::&lt;Rechner&gt;
angegeben werden. Hierbei bedeutet das spezielle Schl&uuml;sselwort
DIRECT, dass keine Proxys benutzt werden. Falls keine der obigen Einstellungen angegeben wurde, wird die Umgebungsvariable
<B>ftp_proxy</B>
benutzt. Um einen FTP-Proxy zu benutzen, m&uuml;ssen Sie in der Konfigurationsdatei das Skript
ftp::ProxyLogin
setzen. Dieser Eintrag gibt die Befehle an, die gesendet werden m&uuml;ssen, um dem Proxy-Server mitzuteilen, womit er sich verbinden soll. Ein Beispiel, wie das funktioniert, finden Sie unter
/usr/share/doc/apt/examples/configure-index.gz. Die Platzhaltervariablen, die f&uuml;r den zugeh&ouml;rigen URI-Bestandteil stehen, sind
$(PROXY_USER),
$(PROXY_PASS),
$(SITE_USER),
$(SITE_PASS),
$(SITE)
und
$(SITE_PORT).
<P>
Die Option
timeout
stellt den Zeitnehmer, der von der Methode benutzt wird. Dieser Wert wird auf die Verbindungs- sowie die Datenzeit&uuml;berschreitungen angewendet.
<P>
Mehrere Einstellungen werden zum Steuern des passiven Modus bereitgestellt. Generell ist es sicher, den passiven Modus eingeschaltet zu lassen, er funktioniert in nahezu jeder Umgebung. Jedoch erfordern einige Situationen, dass der passive Modus ausgeschaltet und stattdessen Port-Modus-FTP benutzt wird. Dies kann global eingestellt werden oder f&uuml;r Verbindungen, die durch einen Proxy oder zu einem bestimmten Rechner gehen (Beispiele finden Sie in der Musterkonfigurationsdatei).
<P>
Es ist m&ouml;glich, FTP &uuml;ber HTTP zu leiten, indem die Umgebungsvariable
<B>ftp_proxy</B>
auf eine HTTP-URL gesetzt wird - lesen Sie die Besprechung der HTTP-Methode oberhalb bez&uuml;glich der Syntax. Sie k&ouml;nnen dies nicht in der Konfigurationsdatei setzen und es wird wegen der geringen Effizienz nicht empfohlen, FTP &uuml;ber HTTP zu benutzen.
<P>
Die Einstellung
ForceExtended
steuert die Benutzung der RFC-2428-Befehle
EPSV
und
EPRT. Die Vorgabe ist &raquo;false&laquo;, was bedeutet, dass diese Befehle nur benutzt werden, wenn die Steuerverbindung IPv6 ist. Durch Stellen auf &raquo;true&laquo; wird die Benutzung selbst auf IPv4-Verbindungen erzwungen. Beachten Sie, dass die wenigsten FTP-Server RFC 2428 unterst&uuml;tzen.
</DL>

<P>

<B>cdrom</B>
<DL COMPACT><DT id="36"><DD>
F&uuml;r URIs, die die Methode
cdrom
verwenden, ist die einzige Option der Einh&auml;ngepunkt,
cdrom::Mount, der der Einh&auml;ngepunkt des CD-ROM-Laufwerks sein muss (oder der DVD oder was auch immer), wie er in
/etc/fstab
angegeben wurde. Es ist m&ouml;glich, alternative Ein- und Aush&auml;ngebefehle anzugeben, falls Ihr Einh&auml;ngepunkt nicht in der fstab aufgef&uuml;hrt werden kann. Die Syntax besteht darin,
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
/cdrom/::Mount &quot;foo&quot;;
</PRE>

</DL>




<P>
in den
cdrom-Block einzuf&uuml;gen. Der abschlie&szlig;ende Schr&auml;gstrich ist wichtig. Aush&auml;ngebefehle k&ouml;nnen per UMount angegeben werden.
</DL>

<P>

<B>gpgv</B>
<DL COMPACT><DT id="38"><DD>
Die einzige Konfigurationsoption f&uuml;r GPGV-URIs ist
gpgv::Options, um zus&auml;tzliche Parameter an Gpgv weiterzuleiten.
</DL>

<P>

<B>CompressionTypes</B>
<DL COMPACT><DT id="39"><DD>
Liste der Kompressionstypen, die von den &raquo;Beschaffungsmethoden verstanden werden. Dateien wie
Packages
k&ouml;nnen in verschiedenen Kompressionsformaten verf&uuml;gbar sein. Standardm&auml;&szlig;ig k&ouml;nnen die &raquo;Beschaffungsmethoden viele gebr&auml;uchliche Formate wie
<B>xz</B>- und
<B>gzip</B>-komprimierte Dateien dekomprimieren und erneut komprimieren. In diesem Bereich k&ouml;nnen die unterst&uuml;tzten Formate abgefragt, ver&auml;ndert sowie Unterst&uuml;tzung f&uuml;r weitere Formate hinzugef&uuml;gt werden (siehe auch
<B>APT::Compressor</B>). Die Syntax daf&uuml;r lautet:
<P>
<DL COMPACT><DT id="40"><DD>



<PRE>
Acquire::CompressionTypes::<I>Dateierweiterung</I> &quot;<I>Methodenname</I>&quot;;
</PRE>

</DL>




<P>
Au&szlig;erdem kann die Untergruppe
Order
benutzt werden, um zu definieren, in welcher Reihenfolge das &raquo;Beschaffungssystem&laquo; die komprimierten Dateien herunterzuladen versucht. Das &raquo;Acquire&laquo;-System wird die erste ausprobieren und bei einem Fehler mit dem n&auml;chsten Kompressionstyp in dieser Liste fortfahren. Um daher einen Typ einem anderen vorzuziehen, f&uuml;gen Sie einfach den bevorzugten Typ an erster Stelle in die Liste ein - Typen, die noch nicht hinzugef&uuml;gt wurden, werden vorbehaltlos an das Ende der Liste angeh&auml;ngt, so kann z.B.
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Acquire::CompressionTypes::Order:: &quot;gz&quot;;
</PRE>

</DL>




<P>
benutzt werden, um
<B>gzip</B>-komprimierten Dateien den Vorzug gegen&uuml;ber allen anderen Formaten zu geben. Falls
<B>xz</B>
gegen&uuml;ber
<B>gzip</B>
und
<B>bzip2</B>
den Vorzug erhalten soll, sollte die Konfigurationseinstellung so aussehen:
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
Acquire::CompressionTypes::Order { &quot;xz&quot;; &quot;gz&quot;; };
</PRE>

</DL>




<P>
. Es ist nicht n&ouml;tig,
bz2
explizit zur Liste hinzuzuf&uuml;gen, da es automatisch hinzuf&uuml;gt wird.
<P>
Beachten Sie, dass
Dir::Bin::<I>Methodenname</I>
zur Laufzeit gepr&uuml;ft wird. Falls diese Option gesetzt ist und die Unterst&uuml;tzung f&uuml;r dieses Format nicht direkt in APT eingebaut wurde, wird die Methode nur benutzt, wenn die Datei existiert, z.B. ist die (integrierte) Einstellung f&uuml;r die
bzip2-Methode:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Dir::Bin::bzip2 &quot;/bin/bzip2&quot;;
</PRE>

</DL>




<P>
. Beachten Sie auch, dass auf der Befehlszeile eingegebene Eintr&auml;ge an das Ende der Liste angeh&auml;ngt werden, die in den Konfigurationsdateien angegeben wurde, aber vor den Standardeintr&auml;gen. Um einen Typ in diesem Fall gegen&uuml;ber einem, der &uuml;ber die Konfigurationsdatei angegebenen wurde, zu bevorzugen, k&ouml;nnen Sie diese Option direkt setzen - nicht im Listenstil. Dies wird die definierte Liste nicht au&szlig;er Kraft setzen, es wird diesen Typ nur vor die Liste setzen.
<P>
Der besondere Typ
uncompressed
kann benutzt werden, um unkomprimierten Dateien einen Vorrang zu geben, beachten Sie jedoch, dass die meisten Archive keine unkomprimierten Dateien bereitstellen, so dass dies meist nur f&uuml;r lokale Spiegel benutzt werden kann.
</DL>

<P>

<B>GzipIndexes</B>
<DL COMPACT><DT id="44"><DD>
Wenn
gzip-komprimierte Indexe heruntergeladen werden (Packages, Sources oder Translations), speichere sie lokal mit gzip-Komprimierung. Dies spart eine Menge Festplattenplatz, aber ben&ouml;tigt mehr CPU-Ressourcen bei der Erstellung des lokalen Paketzwischenspeicher. Vorgabe ist &raquo;false&laquo;.
</DL>

<P>

<B>Languages</B>
<DL COMPACT><DT id="45"><DD>
Der Unterabschnitt Languages steuert, welche
Translation-Dateien heruntergeladen werden und in welcher Reihenfolge APT versucht, die Beschreibungs&uuml;bersetzungen anzuzeigen. APT wird versuchen, die erste verf&uuml;gbare Beschreibung f&uuml;r die zuerst aufgelistete Sprache anzuzeigen. Sprachen k&ouml;nnen durch ihre kurzen oder langen Sprachcodes definiert sein. Beachten Sie, dass nicht alle Archive
Translation-Dateien f&uuml;r jede Sprache bereitstellen - insbesondere sind die langen Sprachcodes selten.
<P>
Die Standardliste beinhaltet &raquo;environment&laquo; und &raquo;en&laquo;. &raquo;environment&laquo; hat hier eine besondere Bedeutung: Es wird zur Laufzeit durch die Sprachcodes ersetzt, die aus der Umgebungsvariable
LC_MESSAGES
extrahiert wurden. Es wird au&szlig;erdem sicherstellen, dass diese Codes nicht zweimal in der Liste enthalten sind. Falls
LC_MESSAGES
auf &raquo;C&laquo; gesetzt ist, wird nur die Datei
Translation-en
(falls verf&uuml;gbar) benutzt. Um APT zu zwingen, keine &Uuml;bersetzungsdatei zu verwenden, benutzen Sie die Einstellung
Acquire::Languages=none. &raquo;none&laquo; ist ein weiterer Code mit besonderer Bedeutung, der die Suche nach einer passenden
Translation-Datei stoppen wird. Dies weist APT an, diese &Uuml;bersetzungen auch herunterzuladen, ohne sie tats&auml;chlich zu verwenden, es sei denn, die Umgebungsvariable gibt diese Sprachen an. Daher wird die folgende Beispielkonfiguration in einer englischen Spracheinstellung zu der Reihenfolge &raquo;en,de&laquo; und in einer deutschen Spracheinstellung zu &raquo;de,en&laquo; f&uuml;hren. Beachten Sie, dass &raquo;fr&laquo; heruntergeladen, aber nur benutzt wird, falls APT in einer franz&ouml;sischen Spracheinstellung benutzt wird (wobei die Reihenfolge &raquo;fr, de, en&laquo; w&auml;re).
<P>
<DL COMPACT><DT id="46"><DD>



<PRE>
Acquire::Languages { &quot;environment&quot;; &quot;de&quot;; &quot;en&quot;; &quot;none&quot;; &quot;fr&quot;; };
</PRE>

</DL>




<P>
Hinweis: Um Problemen vorzubeugen, die daher kommen, dass APT in unterschiedlichen Umgebungen ausgef&uuml;hrt wird (z.B. durch verschiedene Benutzer oder durch andere Programme) werden alle Translation-Dateien, die in
/var/lib/apt/lists/
gefunden werden, an das Ende der Liste hinzugef&uuml;gt (nach einem impliziten &raquo;none&laquo;).
</DL>

<P>

<B>ForceIPv4</B>
<DL COMPACT><DT id="47"><DD>
Beim Herunterladen wird die Verwendung des IPv4-Protokolls erzwungen.
</DL>

<P>

<B>ForceIPv6</B>
<DL COMPACT><DT id="48"><DD>
Beim Herunterladen wird die Verwendung des IPv6-Protokolls erzwungen.
</DL>

<P>

<B>MaxReleaseFileSize</B>
<DL COMPACT><DT id="49"><DD>
die maximale Dateigr&ouml;&szlig;e von Release-/Release.gpg-/InRelease-Dateien. Die Voreinstellung ist 10 MB.
</DL>

<P>

<B>EnableSrvRecords</B>
<DL COMPACT><DT id="50"><DD>
Diese Option steuert, ob APT den in RFC 2782 spezifizierten DNS-SRV-Serverdatensatz benutzt, um einen alternativen Server zur Verbindung auszuw&auml;hlen. Die Voreinstellung ist &raquo;true&laquo;.
</DL>

<P>

<B>AllowInsecureRepositories</B>
<DL COMPACT><DT id="51"><DD>
Erm&ouml;glicht Aktualisierungsaktionen, Datendateien aus Depots ohne ausreichende Sicherheitsinformationen zu laden. Die Voreinstellung ist &raquo;false&laquo;. Konzept, Auswirkungen sowie Alternativen werden ausf&uuml;hrlich in
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
erkl&auml;rt.
</DL>

<P>

<B>AllowWeakRepositories</B>
<DL COMPACT><DT id="52"><DD>
Erm&ouml;glicht Aktualisierungsaktionen, um Datendateien aus Depots zu laden, die Sicherheitsinformationen bereitstellen, die jedoch nicht mehr als kryptografisch stark genug erachtet werden. Die Voreinstellung ist &raquo;false&laquo;. Konzept, Auswirkungen sowie Alternativen werden ausf&uuml;hrlich in
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
erkl&auml;rt.
</DL>

<P>

<B>AllowDowngradeToInsecureRepositories</B>
<DL COMPACT><DT id="53"><DD>
Erm&ouml;glicht, dass ein Depot, das vorher per GPG signiert war, w&auml;hrend einer Aktualisierungstransaktion seine Signatur verliert. Wenn ein vorher vertrauensw&uuml;rdiges Depot keine g&uuml;ltige Signatur mehr hat, wird APT die Aktualisierung verweigern. Diese Option kann verwendet werden, um diesen Schutz au&szlig;er Kraft zu setzen. Sie wollen dies wahrscheinlich nahezu nie aktivieren. Die Voreinstellung ist &raquo;false&laquo;. Konzept, Auswirkungen sowie Alternativen werden ausf&uuml;hrlich in
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
erkl&auml;rt.
</DL>

<P>

<B>Changelogs::URI</B> G&uuml;ltigkeitsbereich
<DL COMPACT><DT id="54"><DD>
Changelogs k&ouml;nnen nur beschafft werden, falls ein URI bekannt ist, von dem sie geholt werden k&ouml;nnen. Vorzugsweise gibt die Release-Datei ihn in einem &raquo;Changelogs&laquo;-Feld an. Falls dies nicht verf&uuml;gbar ist, werden die Felder &raquo;Label&laquo; und &raquo;Origin&laquo; der Release-Datei benutzt, um zu pr&uuml;fen, ob eine
Acquire::Changelogs::URI::Label::<I>BESCHRIFTUNG</I>- oder
Acquire::Changelogs::URI::Origin::<I>URSPRUNG</I>-Option existiert und, falls dies der Fall ist, wird dieser Wert genommen. Der Wert in der Release-Datei kann mit
Acquire::Changelogs::URI::Override::Label::<I>BESCHRIFTUNG</I>
oder
Acquire::Changelogs::URI::Override::Origin::<I>URSPRUNG</I>
au&szlig;er Kraft gesetzt werden. Der Wert sollte ein normaler URI auf eine Textdatei sein, au&szlig;er dass paketspezifische Daten durch den Platzhalter
@CHANGEPATH@
ersetzt werden. Der Wert daf&uuml;r ist: 1. Falls das Paket von einem Bestandteil stammt (z.B.
main), ist dies der erste Teil, ansonsten wird er weggelassen. 2. der erste Buchstabe des Quellpaketnamens, es sei denn, der Paketname beginnt mit &raquo;lib&laquo;. In diesem Fall werden es die vier ersten Buchstaben sein. 3. der komplette Quellpaketname. 4. wieder der vollst&auml;ndige Name und 5. die Quellversion. Der erste (falls vorhanden), zweite, dritte und vierte Teil werden durch einen Schr&auml;gstrich (&raquo;/&laquo;) voneinander getrennt und zwischen dem vierten und f&uuml;nften ist ein Unterstrich (&raquo;_&laquo;). Der Spezialwert &raquo;no&laquo;, der f&uuml;r diese Option verf&uuml;gbar ist, gibt an, dass diese Quelle nicht benutzt werden kann, um von dort Changelog-Dateien zu beschaffen. In diesem Fall wird, falls verf&uuml;gbar, eine andere Quelle ausprobiert.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>PROGRAMMSPEZIFISCHE KONFIGURATION</H2>

<P>

Insbesondere kann es mit der Einf&uuml;hrung des
<B>apt</B>-Programms n&uuml;tzlich sein, bestimmte Optionen nur f&uuml;r ein bestimmtes Programm zu setzen, da sogar Optionen, die aussehen, als ob sie nur ein bestimmtes Programm betr&auml;fen, wie
<B>APT::Get::Show-Versions</B>, sowohl
<B>apt-get</B>
als auch
<B>apt</B>
beeinflussen.
<P>

Eine Option alleine f&uuml;r ein bestimmtes Programm zu setzen kann erreicht werden, indem die Option innerhalb des G&uuml;ltigkeitsbereichs
<B>Binary::</B><B></B><I>bestimmtes_Programm</I>
gesetzt wird. Das Setzen der Option
<B>APT::Get::Show-Versions</B>
f&uuml;r ausschlie&szlig;lich
<B>apt</B>
kann z.B. stattdessen durch Setzen von
<B>Binary::apt::APT::Get::Show-Versions</B>
erledigt werden.
<P>

Beachten Sie, dass Sie, wie im Abschnitt BESCHREIBUNG weiter oben gesehen, die programmspezifischen Optionen weder auf der Befehlszeile selbst, noch in Konfigurationsdateien, die &uuml;ber die Befehlszeile geladen werden, setzen k&ouml;nnen.
<A NAME="lbAH">&nbsp;</A>
<H2>VERZEICHNISSE</H2>

<P>

Der
Dir::State-Abschnitt hat Verzeichnisse, die zu lokalen Statusinformationen geh&ouml;ren.
lists
ist das Verzeichnis, in das heruntergeladene Paketlisten abgelegt werden und
status
ist der Name der
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)-Statusdatei.
preferences
ist der Name der APT-preferences-Datei.
Dir::State
enth&auml;lt das Standardverzeichnis, das allen Unterelementen vorangestellt wird, falls sie nicht mit
/
oder
./
beginnen.
<P>

Dir::Cache
enth&auml;lt Orte, die zu lokalen Zwischenspeicherinformationen geh&ouml;ren, so wie die beiden Paketzwischenspeicher
srcpkgcache
und
pkgcache, sowie den Ort, an den heruntergeladene Archive abgelegt werden,
Dir::Cache::archives. Die Generierung von Zwischenspeichern kann ausgeschaltet werden, indem
pkgcache
oder
srcpkgcache
auf
&quot;&quot;
gesetzt wird. Dies wird den Start verlangsamen, aber Plattenplatz sparen. Es ist vermutlich vorzuziehen, statt des &raquo;srcpkgcache&laquo;s den &raquo;pkgcache&laquo; auszuschalten. Wie
Dir::State
ist das Standardverzeichnis in
Dir::Cache
enthalten.
<P>

Dir::Etc
enth&auml;lt den Ort der Konfigurationsdateien,
sourcelist
gibt den Ort der Quellliste und
main
ist die Standardkonfigurationsdatei (Einstellung hat keine Auswirkung, au&szlig;er wenn sie aus der in
<B>APT_CONFIG</B>
angegebenen Konfigurationsdatei erfolgt).
<P>

Die
Dir::Parts-Einstellung liest alle Konfigurationsteile in lexikalischer Reihenfolge vom angegebenen Verzeichnis ein. Nachdem dies geschehen ist, wird die Hauptkonfigurationsdatei geladen.
<P>

Auf Programme wird von
Dir::Bin
verwiesen.
Dir::Bin::Methods
gibt den Ort des Methodensteuerungsprogramms an und
gzip,
bzip2,
lzma,
dpkg,
apt-get,
dpkg-source,
dpkg-buildpackage
und
apt-cache
geben den Ort des jeweiligen Programms an.
<P>

Das Konfigurationselement
RootDir
hat eine besondere Bedeutung. Falls es gesetzt ist, sind alle Pfad relativ zu
RootDir,
<I>sogar Pfade, die absolut angegeben wurden</I>. So wird zum Beispiel, wenn
RootDir
auf
/tmp/staging
und
Dir::State::status
auf
/var/lib/dpkg/status
gesetzt ist, nach der Statusdatei in
/tmp/staging/var/lib/dpkg/status
nachgesehen. Falls Sie etwas nur relativen Pfaden voranstellen m&ouml;chten, setzen Sie stattdessen
Dir.
<P>

Die Liste
Ignore-Files-Silently
kann benutzt werden, um anzugeben, welche Dateien APT beim Auswerten der Dateien in den Fragment-Verzeichnissen stillschweigend ignorieren sollte. Standardm&auml;&szlig;ig werden Dateien, die auf
.disabled,
~,
.bak
oder
.dpkg-[a-z]+
enden stillschweigend ignoriert. Wie beim letzten Vorgabewert gesehen, kann die Syntax f&uuml;r regul&auml;re Ausdr&uuml;cke f&uuml;r diese Muster verwandt werden.
<A NAME="lbAI">&nbsp;</A>
<H2>APT IN DSELECT</H2>

<P>

Wenn APT als eine
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)-Methode benutzt wird, steuern mehrere Konfigurationsdirektiven das Standardverhalten. Diese stehen im Abschnitt
DSelect.
<P>

<B>Clean</B>
<DL COMPACT><DT id="55"><DD>
Zwischenspeicherbereinigungsmodus; dieser Wert kann entweder &raquo;always&laquo;, &raquo;prompt&laquo;, &raquo;auto&laquo;, &raquo;pre-auto&laquo; oder &raquo;never&laquo; sein. &raquo;always&laquo; und &raquo;prompt&laquo; werden, nachdem das Upgrade durchgef&uuml;hrt wurde, alle Pakete aus dem Zwischenspeicher entfernen, &raquo;prompt&laquo; (die Vorgabe) tut dies bedingt. &raquo;auto&laquo; entfernt nur jene Pakete, die nicht l&auml;nger heruntergeladen werden k&ouml;nnen (zum Beispiel, weil sie durch eine neue Version ersetzt wurden). &raquo;pre-auto&laquo; f&uuml;hrt diese Aktion vor dem Herunterladen neuer Pakete durch.
</DL>

<P>

<B>options</B>
<DL COMPACT><DT id="56"><DD>
Die Inhalte dieser Variablen werden als Befehlszeilenoptionen an
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
&uuml;bermittelt, wenn es f&uuml;r die Installationsphase durchlaufen wird.
</DL>

<P>

<B>Updateoptions</B>
<DL COMPACT><DT id="57"><DD>
Die Inhalte dieser Variable werden als Befehlszeilenoptionen an
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
&uuml;bermittelt, wenn es f&uuml;r die Aktualisierungsphase durchlaufen wird.
</DL>

<P>

<B>PromptAfterUpdate</B>
<DL COMPACT><DT id="58"><DD>
Falls &raquo;true&laquo;, wird die Aktualisierungsaktion [U] in
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
immer nachfragen, um fortzufahren. Vorgabe ist es, nur bei Fehlern nachzufragen.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>WIE APT <A HREF="/cgi-bin/man/man2html?1+DPKG">DPKG</A>(1) AUFRUFT</H2>

<P>

Mehrere Konfigurationsdirektiven steuern, wie APT
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
aufruft. Diese stehen im Abschnitt
DPkg.
<P>

<B>options</B>
<DL COMPACT><DT id="59"><DD>
Dies ist eine Liste von Optionen, die an
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
&uuml;bermittelt werden. Die Optionen m&uuml;ssen unter Benutzung der Listenschreibweise angegeben werden und jedes Listenelement wird als einzelnes Argument an
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
&uuml;bermittelt.
</DL>

<P>

<B>Path</B>
<DL COMPACT><DT id="60"><DD>
Dies ist eine Zeichenkette, die beim Ausf&uuml;hren von Dpkg die Umgebungsvariable
<B>PATH</B>
definiert. Sie kann auf jeden Wert dieser Umgebungsvariable oder eine leere Zeichenkette gesetzt werden, falls sich die Variable nicht ge&auml;ndert hat.
</DL>

<P>

<B>Pre-Invoke</B>, <B>Post-Invoke</B>
<DL COMPACT><DT id="61"><DD>
Dies ist eine Liste von Shell-Befehlen, die vor/nach dem Aufruf von
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
ausgef&uuml;hrt werden. Wie
options
muss dies in Listenschreibweise angegeben werden. Die Befehle werden der Reihenfolge nach mit
/bin/sh
aufgerufen, sollte einer fehlschlagen, wird APT abgebrochen.
</DL>

<P>

<B>Pre-Install-Pkgs</B>
<DL COMPACT><DT id="62"><DD>
Dies ist eine Liste von Shell-Befehlen, die vor dem Aufruf von
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
ausgef&uuml;hrt werden. Wie
options
muss dies in Listenschreibweise angegeben werden. Die Befehle werden der Reihenfolge nach mit
/bin/sh
aufgerufen, sollte einer fehlschlagen, wird APT abgebrochen. APT wird den Befehlen die Dateinamen aller .deb-Dateien, die es installieren wird, einen pro Zeile, an den angeforderten standardm&auml;&szlig;ig auf die Standardeingabe verweisenden Dateideskriptor, &uuml;bergeben.
<P>
Version 2 dieses Protokolls sendet mehr Informationen durch den angeforderten Dateideskriptor: eine Zeile mit dem Text
VERSION 2, den APT-Konfigurationsraum und eine Liste von Paketaktionen mit Dateinamen und Versionsinformationen.
<P>
Jede Zeile der Konfigurationsrichtlinien hat die Form
Schl&uuml;ssel=Wert. Sonderzeichen (Gleichheitszeichen, Zeilenumbr&uuml;che, nicht druckbare Zeichen, Anf&uuml;hrungszeichen und Prozentzeichen in
Schl&uuml;ssel
und Zeilenumbr&uuml;che, nicht druckbare Zeichen und Prozentzeichen in
Wert) werden %-kodiert. Listen werden durch mehrere
Schl&uuml;ssel=Wert-Zeilen mit demselben Schl&uuml;ssel dargestellt. Der Konfigurationsabschnitt endet mit einer leeren Zeile.
<P>
Paketaktionszeilen bestehen in Version 2 aus f&uuml;nf Feldern: Paketname (ohne Architektureignung, sogar wenn fremd), alte Version, Richtung der Versions&auml;nderung (&raquo;&lt;&laquo; f&uuml;r Upgrades, &raquo;&gt;&laquo; f&uuml;r Downgrades, &raquo;=&laquo; f&uuml;r keine &Auml;nderung), neue Version, Aktion. Die Versionsfelder sind &raquo;-&laquo; f&uuml;r gar keine Version (zum Beispiel, wenn ein Paket zum ersten Mal installiert wird; keine Version wird als &auml;lter als jede echte Version angesehen, daher wird ein Upgrade als
- &lt; 1.23.4
angezeigt). Das Aktionsfeld ist &raquo;**CONFIGURE**&laquo;, falls das Paket konfiguriert wird, &raquo;**REMOVE**&laquo;, falls es entfernt wird oder der Dateiname einer .deb-Datei, falls es entpackt wird.
<P>
In Version 3 folgt nach jedem Versionsfeld die Architektur dieser Version. Sie ist &raquo;-&laquo;, falls es dort keine Version gibt, und ein Feld, das die Multiarch-Typen &raquo;same&laquo;, &raquo;foreign&laquo;, &raquo;allowed&laquo; oder &raquo;none&laquo; anzeigt. Beachten Sie, dass &raquo;none&laquo; kein korrekter Typenname ist. Er wird nur beibehalten, um kompatibel zu bleiben. Er sollte als &raquo;no&laquo; gelesen werden und Benutzer werden ermutigt, beides zu unterst&uuml;tzen.
<P>
Die Protokollversion, die f&uuml;r den Befehl
<I>Befehl</I>
benutzt werden soll, kann durch entsprechendes Setzen von
DPkg::Tools::options::<I>Befehl</I>::Version
ausgew&auml;hlt werden, Voreinstellung ist Version 1. Falls APT die angefragte Version nicht unterst&uuml;tzt, wird es stattdessen die Informationen in der h&ouml;chsten Version senden, f&uuml;r die es Unterst&uuml;tzung bietet.
<P>
Der Dateideskriptor, der zum Senden der Informationen benutzt wird, kann mit
DPkg::Tools::options::<I>Befehl</I>::InfoFD
abgefragt werden. Er ist standardm&auml;&szlig;ig
0
f&uuml;r die Standardeingabe und seit Version 0.9.11 verf&uuml;gbar. Sie k&ouml;nnen durch Pr&uuml;fen der Umgebungsvariable
<B>APT_HOOK_INFO_FD</B>
ermitteln, ob die Option unters&uuml;tzt wird. Sie enth&auml;lt die Nummer des verwendeten Dateideskriptors als eine Best&auml;tigung.
</DL>

<P>

<B>Run-Directory</B>
<DL COMPACT><DT id="63"><DD>
APT wechselt mit chdir in dieses Verzeichnis, bevor
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
aufgerufen wird, die Vorgabe ist
/.
</DL>

<P>

<B>Build-options</B>
<DL COMPACT><DT id="64"><DD>
Diese Optionen werden an
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)
beim Kompilieren von Paketen &uuml;bermittelt. Standardm&auml;&szlig;ig wird das Signieren ausgeschaltet und alle Programme werden erstellt.
</DL>

<P>

<B>DPkg::ConfigurePending</B>
<DL COMPACT><DT id="65"><DD>
Wenn diese Option gesetzt ist, wird APT
<B>dpkg --configure --pending</B>
aufrufen, um
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
alle ben&ouml;tigten Konfigurationen und Trigger handhaben zu lassen. Diese Option ist als Vorgabe aktiviert, sie zu Deaktivieren k&ouml;nnte jedoch n&uuml;tzlich sein, wenn Sie APT mehrmals hintereinander ausf&uuml;hren m&ouml;chten - z.B. in einem Installationsprogramm. In diesem Szenario k&ouml;nnten Sie diese Option in allen au&szlig;er der letzten Ausf&uuml;hrung deaktivieren.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>PERIODISCHE- UND ARCHIVOPTIONEN</H2>

<P>

APT::Periodic- und
APT::Archives-Gruppen von Optionen konfigurieren das Verhalten periodischer APT-Aktualisierungen, die vom Skript
/usr/lib/apt/apt.systemd.daily
durchgef&uuml;hrt werden. Lesen Sie den Anfang dieses Skripts, um eine kurze Dokumentation dieser Optionen zu erhalten.
<A NAME="lbAL">&nbsp;</A>
<H2>FEHLERSUCHOPTIONEN</H2>

<P>

Einschalten von Optionen im Abschnitt
Debug::
wird veranlassen, dass Fehlersuchinformationen an die Standardfehlerausgabe des Programms gesendet werden, das die
apt-Bibliotheken benutzt oder besondere Programmmodi einschaltet, die in erster Linie f&uuml;r das Fehlersuchverhalten von
apt
n&uuml;tzlich sind. Die meisten dieser Optionen sind f&uuml;r den normalen Benutzer uninteressant, aber ein paar k&ouml;nnten es sein:
<P>
<DL COMPACT><DT id="66"><DD>
&bull;


Debug::pkgProblemResolver
schaltet die Ausgabe &uuml;ber die von
dist-upgrade, upgrade, install, remove, purge
getroffenen Entscheidungen ein.
</DL>

<P>
<DL COMPACT><DT id="67"><DD>
&bull;


Debug::NoLocking
schaltet jegliches Sperren von Dateien aus. Dies kann benutzt werden, um einige Aktionen (zum Beispiel
apt-get -s install) als nicht root-Benutzer auszuf&uuml;hren.
</DL>

<P>
<DL COMPACT><DT id="68"><DD>
&bull;


Debug::pkgDPkgPM
gibt die tats&auml;chliche Befehlszeile jedesmal aus, wenn
apt
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
aufruft.
</DL>

<P>
<DL COMPACT><DT id="69"><DD>
&bull;


<P>
Debug::IdentCdrom
schaltet das Einbeziehen von statfs-Daten in CD-ROM-IDs aus.
</DL>

<P>

Eine vollst&auml;ndige Liste der Fehlersuchoptionen von APT folgt.
<P>

<B>Debug::Acquire::cdrom</B>
<DL COMPACT><DT id="70"><DD>
gibt Informationen aus, die sich auf Zugriffe von
<A HREF="cdrom://-Quellen">cdrom://-Quellen</A> beziehen.
</DL>

<P>

<B>Debug::Acquire::ftp</B>
<DL COMPACT><DT id="71"><DD>
gibt Informationen aus, die sich auf das Herunterladen von Paketen per FTP beziehen.
</DL>

<P>

<B>Debug::Acquire::http</B>
<DL COMPACT><DT id="72"><DD>
gibt Informationen aus, die sich auf das Herunterladen von Paketen per HTTP beziehen.
</DL>

<P>

<B>Debug::Acquire::https</B>
<DL COMPACT><DT id="73"><DD>
gibt Informationen aus, die sich auf das Herunterladen von Paketen per HTTPS beziehen.
</DL>

<P>

<B>Debug::Acquire::gpgv</B>
<DL COMPACT><DT id="74"><DD>
gibt Informationen aus, die sich auf das Pr&uuml;fen kryptografischer Signaturen mittels
gpg
beziehen.
</DL>

<P>

<B>Debug::aptcdrom</B>
<DL COMPACT><DT id="75"><DD>
gibt Informationen &uuml;ber den Zugriffsprozess auf Paketsammlungen aus, die auf CD-ROMs gespeichert sind.
</DL>

<P>

<B>Debug::BuildDeps</B>
<DL COMPACT><DT id="76"><DD>
beschreibt den Prozess der Aufl&ouml;sung von Bauabh&auml;ngigkeiten in
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8).
</DL>

<P>

<B>Debug::Hashes</B>
<DL COMPACT><DT id="77"><DD>
gibt jeden kryptografischen Hash aus, der von den
apt-Bibliotheken generiert wurde.
</DL>

<P>

<B>Debug::IdentCDROM</B>
<DL COMPACT><DT id="78"><DD>
schlie&szlig;t keine Informationen von
statfs
ein, und zwar die Anzahl der benutzten und freien Bl&ouml;cke auf dem CD-ROM-Dateisystem, wenn eine ID f&uuml;r eine CD-ROM generiert wird.
</DL>

<P>

<B>Debug::NoLocking</B>
<DL COMPACT><DT id="79"><DD>
schaltet jegliches Sperren von Dateien aus. Dies wird zum Beispiel erlauben, dass zwei Instanzen von
Bqapt-get update"
zur gleichen Zeit laufen.
</DL>

<P>

<B>Debug::pkgAcquire</B>
<DL COMPACT><DT id="80"><DD>
protokolliert, wenn Elemente in die globalen Warteschlange zum Herunterladen hinzugef&uuml;gt oder aus ihr entfernt werden.
</DL>

<P>

<B>Debug::pkgAcquire::Auth</B>
<DL COMPACT><DT id="81"><DD>
gibt Statusmeldungen und Fehler aus, die sich auf das Pr&uuml;fen von Pr&uuml;fsummen und kryptografischen Signaturen von heruntergeladenen Dateien beziehen.
</DL>

<P>

<B>Debug::pkgAcquire::Diffs</B>
<DL COMPACT><DT id="82"><DD>
gibt Informationen &uuml;ber das Herunterladen und Anwenden von Paketindexlisten-Diffs und Fehler, die die Paketindexlisten-Diffs betreffen, aus.
</DL>

<P>

<B>Debug::pkgAcquire::RRed</B>
<DL COMPACT><DT id="83"><DD>
gibt Informationen aus, die sich auf das Patchen von Paketlisten von APT beziehen, wenn Index-Diffs anstelle vollst&auml;ndiger Indexe heruntergeladen werden.
</DL>

<P>

<B>Debug::pkgAcquire::Worker</B>
<DL COMPACT><DT id="84"><DD>
protokolliert alle Interaktionen mit Unterprozessen, die das eigentliche Herunterladen durchf&uuml;hren.
</DL>

<P>

<B>Debug::pkgAutoRemove</B>
<DL COMPACT><DT id="85"><DD>
protokolliert alle Ereignisse, die sich auf den automatisch-installiert-Status von Paketen und auf das Entfernen von nicht benutzten Paketen beziehen.
</DL>

<P>

<B>Debug::pkgDepCache::AutoInstall</B>
<DL COMPACT><DT id="86"><DD>
generiert Fehlersuchmeldungen, die beschreiben, welche Pakete automatisch installiert werden, um Abh&auml;ngigkeiten aufzul&ouml;sen. Dies entspricht dem anfangs durchgef&uuml;hrten auto-install-Durchlauf, z.B. in
apt-get install
und nicht dem vollst&auml;ndigen
apt-Abh&auml;ngigkeitsaufl&ouml;ser. Lesen Sie daf&uuml;r
Debug::pkgProblemResolver.
</DL>

<P>

<B>Debug::pkgDepCache::Marker</B>
<DL COMPACT><DT id="87"><DD>
generiert Fehlersuchmeldungen, die beschreiben, welches Paket als &raquo;keep&laquo;/&raquo;install&laquo;/&raquo;remove&laquo; markiert ist, w&auml;hrend der ProblemResolver seine Arbeit verrichtet. Jedes Hinzuf&uuml;gen oder L&ouml;schen kann zus&auml;tzliche Aktionen ausl&ouml;sen. Sie werden nach zwei einger&uuml;ckten Leerzeichen unter dem Originaleintrag angezeigt. Jede Zeile hat das Format
MarkKeep,
MarkDelete
oder
MarkInstall
gefolgt von
Paketname &lt;a.b.c -&gt; d.e.f | x.y.z&gt; (Abschnitt)
wobei
a.b.c
die aktuelle Version des Paketes,
d.e.f
die Version, die zur Installation vorgesehen und
x.y.z
eine neuere Version, die aber nicht zur Installation vorgesehen ist (aufgrund einer niedrigen Pinning-Bewertung). Die letzten beiden k&ouml;nnen weggelassen werden, wenn es keine gibt oder wenn sie die gleiche Version haben, wie die, die zur installierten Version identisch ist.
Abschnitt
ist der Name des Abschnitts, in dem das Paket erscheint.
</DL>

<P>

<B>Debug::pkgDPkgPM</B>
<DL COMPACT><DT id="88"><DD>
gibt, wenn
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
aufgerufen wird, die genauen Befehlszeile mit der es aufgerufen wurde, mit Argumenten, die durch einzelne Leerzeichen getrennt sind, aus.
</DL>

<P>

<B>Debug::pkgDPkgProgressReporting</B>
<DL COMPACT><DT id="89"><DD>
gibt alle von
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
&uuml;ber einen Status-Datei-Deskriptor empfangenen Daten und alle w&auml;hrend deren Auswertung gefundenen Fehler aus.
</DL>

<P>

<B>Debug::pkgOrderList</B>
<DL COMPACT><DT id="90"><DD>
generiert eine Aufzeichnung des Algorithmus, der &uuml;ber die Reihenfolge entscheidet, in der
apt
Pakete an
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
weiterleiten soll.
</DL>

<P>

<B>Debug::pkgPackageManager</B>
<DL COMPACT><DT id="91"><DD>
gibt Statusmeldungen aus, die die Schritte nachverfolgen, die beim Aufruf von
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
ausgef&uuml;hrt werden.
</DL>

<P>

<B>Debug::pkgPolicy</B>
<DL COMPACT><DT id="92"><DD>
gibt die Priorit&auml;t jeder Paketliste beim Start aus.
</DL>

<P>

<B>Debug::pkgProblemResolver</B>
<DL COMPACT><DT id="93"><DD>
verfolgt die Ausf&uuml;hrung des Abh&auml;ngigkeitsaufl&ouml;sers (dies wird nur auf das angewendet, was geschieht, wenn ein komplexes Abh&auml;ngigkeitsproblem aufgetreten ist).
</DL>

<P>

<B>Debug::pkgProblemResolver::ShowScores</B>
<DL COMPACT><DT id="94"><DD>
zeigt eine Liste aller installierten Pakete mit ihren berechneten Bewertungen, die vom pkgProblemResolver benutzt werden, an. Die Beschreibung des Pakets stimmt mit der in
Debug::pkgDepCache::Marker
&uuml;berein.
</DL>

<P>

<B>Debug::sourceList</B>
<DL COMPACT><DT id="95"><DD>
gibt die Informationen &uuml;ber die aus
/etc/apt/vendors.list
gelesenen Anbieter aus.
</DL>

<P>

<B>Debug::RunScripts</B>
<DL COMPACT><DT id="96"><DD>
zeigt die externen Befehle, die durch APT-Hooks aufgerufen werden. Dies schlie&szlig;t z.B. die Konfigurationsoptionen
DPkg::{Pre,Post}-Invoke
oder
APT::Update::{Pre,Post}-Invoke
mit ein.
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>BEISPIELE</H2>

<P>

/usr/share/doc/apt/examples/configure-index.gz
ist eine Konfigurationsdatei, die Beispielwerte f&uuml;r alle m&ouml;glichen Optionen zeigen.
<A NAME="lbAN">&nbsp;</A>
<H2>DATEIEN</H2>

<P>

/etc/apt/apt.conf
<DL COMPACT><DT id="97"><DD>
APT-Konfigurationsdatei. Konfigurationselement:
Dir::Etc::Main.
</DL>

<P>

/etc/apt/apt.conf.d/
<DL COMPACT><DT id="98"><DD>
APT-Konfigurationsdatei-Fragmente. Konfigurationselement:
Dir::Etc::Parts.
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<P>
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
<A NAME="lbAP">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAQ">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAR">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="99"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="100"><DD>
</DL>

<P>

<B>Daniel Burrows</B> &lt;<A HREF="mailto:dburrows@debian.org">dburrows@debian.org</A>&gt;
<DL COMPACT><DT id="101"><DD>
urspr&uuml;ngliche Dokumentation von Debug::*.
</DL>

<A NAME="lbAS">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="102"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="103"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="104"><A HREF="#lbAB">NAME</A><DD>
<DT id="105"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="106"><A HREF="#lbAD">SYNTAX</A><DD>
<DT id="107"><A HREF="#lbAE">DIE APT-GRUPPE</A><DD>
<DT id="108"><A HREF="#lbAF">DIE BESCHAFFUNGSGRUPPE</A><DD>
<DT id="109"><A HREF="#lbAG">PROGRAMMSPEZIFISCHE KONFIGURATION</A><DD>
<DT id="110"><A HREF="#lbAH">VERZEICHNISSE</A><DD>
<DT id="111"><A HREF="#lbAI">APT IN DSELECT</A><DD>
<DT id="112"><A HREF="#lbAJ">WIE APT DPKG(1) AUFRUFT</A><DD>
<DT id="113"><A HREF="#lbAK">PERIODISCHE- UND ARCHIVOPTIONEN</A><DD>
<DT id="114"><A HREF="#lbAL">FEHLERSUCHOPTIONEN</A><DD>
<DT id="115"><A HREF="#lbAM">BEISPIELE</A><DD>
<DT id="116"><A HREF="#lbAN">DATEIEN</A><DD>
<DT id="117"><A HREF="#lbAO">SIEHE AUCH</A><DD>
<DT id="118"><A HREF="#lbAP">FEHLER</A><DD>
<DT id="119"><A HREF="#lbAQ">&Uuml;BERSETZUNG</A><DD>
<DT id="120"><A HREF="#lbAR">AUTOREN</A><DD>
<DT id="121"><A HREF="#lbAS">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
