
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_PREFERENCES</TITLE>
</HEAD><BODY>
<H1>APT_PREFERENCES</H1>
Section: APT (5)<BR>Updated: 17&nbsp;Januar&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

apt_preferences - Voreinstellungssteuerdatei f&uuml;r APT
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

Die APT-Einstellungsdatei
/etc/apt/preferences
und Teildateien im Verzeichnis
/etc/apt/preferences.d/
k&ouml;nnen benutzt werden, um zu steuern, welche Versionen von Paketen zur Installation ausgew&auml;hlt werden.
<P>

Es k&ouml;nnten mehrere Versionen eines Pakets zur Installation verf&uuml;gbar sein, wenn die Datei
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
Bez&uuml;ge zu mehr als einer Distribution enth&auml;lt (zum Beispiel
stable
und
testing). APT weist jeder verf&uuml;gbaren Version eine Priorit&auml;t zu. Unter Ber&uuml;cksichtigung von Abh&auml;ngigkeitsbedingungen w&auml;hlt
<B>apt-get</B>
die Version mit der h&ouml;chsten Priorit&auml;t zur Installation aus. Die APT-Einstellungen setzen die Priorit&auml;ten au&szlig;er Kraft, die APT den Paketversionen standardm&auml;&szlig;ig zuweist, was dem Benutzer die Kontrolle dar&uuml;ber gibt, welche zur Installation ausgew&auml;hlt wird.
<P>

Es k&ouml;nnten mehrere Instanzen der gleichen Version eines Paketes verf&uuml;gbar sein, wenn die Datei
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
Bez&uuml;ge zu mehr als einer Quelle enth&auml;lt. In diesem Fall l&auml;dt
<B>apt-get</B>
die Instanz herunter, die in der Datei
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
als erstes aufgelistet ist. Die APT-Einstellungsdatei beeinflusst die Wahl der Instanz nicht, nur die Wahl der Version.
<P>

Eigenschaften sind in der Hand eines Systemadministrator ein gro&szlig;e St&auml;rke, k&ouml;nnen aber auch sein gr&ouml;&szlig;ter Albtraum werden, wenn sie unvorsichtig benutzt werden. APT wird die Eigenschaften nicht in Frage stellen, so dass deshalb falsche Einstellungen zu nicht installierbaren Paketen oder falschen Entscheidungen w&auml;hrend des Upgrades f&uuml;hren k&ouml;nnen. Sogar noch mehr Probleme treten auf, wenn mehrere Distributions-Releases ohne gutes Verst&auml;ndnis der folgenden Abs&auml;tze gemischt werden. Pakete, die in einem speziellen Release enthalten sind, sind nicht in &auml;lteren und neueren Releases oder zusammen mit Paketen unterschiedlicher Releases getestet und funktionieren daher nicht immer wie erwartet. Sind wurden gewarnt.
<P>

Beachten Sie, dass die Dateien im Verzeichnis
/etc/apt/preferences.d
in alphanumerisch aufsteigender Reihenfolge ausgewertet werden und der folgenden Namenskonvention unterliegen: Die Dateien haben entweder keine oder
&raquo;pref&laquo;
als Dateierweiterung und sie enthalten nur alphanumerische Zeichen, Bindestriche (-), Unterstriche (_) oder Punkte (.). Andernfalls wird APT einen Hinweis ausgeben, dass es eine Datei ignoriert hat, falls die Datei nicht auf ein Muster in der Konfigurationsliste
Dir::Ignore-Files-Silently
passt - in diesem Fall wird sie stillschweigend ignoriert.
<A NAME="lbAD">&nbsp;</A>
<H3>APTs Standardpriorit&auml;tszuweisungen</H3>

<P>

Wenn es keine Einstellungsdatei gibt oder es in der Datei keinen Eintrag gibt, der sich auf eine bestimmte Version bezieht, dann ist die dieser Version zugewiesene Priorit&auml;t, die Priorit&auml;t der Distribution zu der die Version geh&ouml;rt. Es ist m&ouml;glich, eine Distribution auszuzeichnen, &raquo;das Ziel-Release&laquo;, die eine h&ouml;here Priorit&auml;t erh&auml;lt, als dies bei anderen Distributionen standardm&auml;&szlig;ig der Fall ist. Das Ziel-Release kann auf der
<B>apt-get</B>-Befehlszeile oder in der APT-Konfigurationsdatei
/etc/apt/apt.conf
gesetzt werden. Beachten Sie, dass dies Vorrang vor einer allgemeinen Priorit&auml;t hat, die Sie, wie sp&auml;ter beschrieben, in der Datei
/etc/apt/preferences
setzen, aber nicht vor bestimmten mit Pinning festgehaltenen Paketen. Beispielsweise
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<B>apt-get install -t testing </B><B></B><I>irgendein_Paket</I>
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
APT::Default-Release &quot;stable&quot;;
</PRE>

</DL>




<P>

Wenn das Ziel-Release angegeben wurde, dann benutzt APT den folgenden Algorithmus, um die Priorit&auml;ten der Versionen eines Paketes zu setzen. Zuweisung:
<P>

Priorit&auml;t 1
<DL COMPACT><DT id="3"><DD>
zu den Versionen, die von Archiven kommen, die in deren
Release-Dateien als &raquo;NotAutomatic: yes&laquo; markiert sind, aber
<I>nicht</I>
als &raquo;ButAutomaticUpgrades: yes&laquo; wie das Archiv
experimental
von Debian.
</DL>

<P>

Priorit&auml;t 100
<DL COMPACT><DT id="4"><DD>
zu der Version, die bereits installiert ist (wenn dies der Fall ist) und zu Versionen, die von Archiven kommen, die in deren
Release-Dateien als &raquo;NotAutomatic: yes&laquo; und &raquo;ButAutomaticUpgrades: yes&laquo; markiert sind, wie das Debian-Backports-Archiv seit
squeeze-backports.
</DL>

<P>

Priorit&auml;t 500
<DL COMPACT><DT id="5"><DD>
zu den Versionen, die nicht zum Ziel-Release geh&ouml;ren.
</DL>

<P>

Priorit&auml;t 990
<DL COMPACT><DT id="6"><DD>
zu den Versionen, die zum Ziel-Release geh&ouml;ren.
</DL>

Die h&ouml;chste dieser Priorit&auml;ten, deren Beschreibung zu der Version passt, wird der Version zugewiesen.
<P>

Wenn das Ziel-Release nicht angegeben wurde, dann weist APT einfach allen installierten Paketversionen eine Priorit&auml;t von 100 und allen nicht installierten Paketversionen eine Priorit&auml;t von 500 zu, au&szlig;er wenn Versionen aus Archiven kommen, die in deren
Release-Dateien mit &raquo;NotAutomatic: yes&laquo; markiert sind - diese Versionen erhalten die Priorit&auml;t 1 oder die Priorit&auml;t 100, falls sie zus&auml;tzlich als &raquo;ButAutomaticUpgrades: yes&laquo; markiert sind.
<P>

APT wendet dann die folgenden Regeln an, aufgelistet in der Reihenfolge ihres Vorrangs, um zu bestimmen, in welcher Version das Paket zu installieren ist.
<P>
<DL COMPACT><DT id="7"><DD>
&bull;


F&uuml;hren Sie niemals ein Downgrade durch, au&szlig;er wenn die Priorit&auml;t verf&uuml;gbarer Pakete 1000 &uuml;bersteigt. (&raquo;Downgrading&laquo; ist das Installieren einer weniger aktuellen Version, an Stelle einer aktuelleren Version. Beachten Sie, dass keine Standardpriorit&auml;t von APT 1000 &uuml;bersteigt. So hohe Priorit&auml;ten k&ouml;nnen nur durch die Einstellungsdatei gesetzt werden. Beachten Sie au&szlig;erdem, dass Downgrading eines Paketes riskant sein kann.)
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


installiert die Version mit der h&ouml;chsten Priorit&auml;t.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Wenn zwei oder mehr Versionen die gleiche Priorit&auml;t haben, wird die aktuellste installiert (das ist die mit der h&ouml;heren Versionsnummer).
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Wenn zwei oder mehr Versionen die gleiche Priorit&auml;t und Versionsnummer haben, die Pakete sich aber entweder in ihren Metadaten unterscheiden oder die Option
--reinstall
angegeben wurde, wird die nicht installierte installiert.
</DL>

<P>

In einer typischen Situation ist die Version eines Paketes (Priorit&auml;t 100) nicht so aktuell, wie eine der verf&uuml;gbaren Versionen, die in den Quellen in der Datei
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
aufgef&uuml;hrt sind (Priorit&auml;t 500 oder 990). Dann wird ein Upgrade des Pakets durchgef&uuml;hrt, wenn
<B>apt-get install </B><B></B><I>irgendein_Paket</I>
oder
<B>apt-get upgrade</B>
ausgef&uuml;hrt wird.
<P>

Seltener ist die installierte Version eines Pakets
<I>neuer</I>
als jede andere der verf&uuml;gbaren Versionen. F&uuml;r das Paket wird kein Downgrade durchgef&uuml;hrt, wenn
<B>apt-get install </B><B></B><I>irgendein_Paket</I>
oder
<B>apt-get upgrade</B>
ausgef&uuml;hrt wird.
<P>

Manchmal ist die installierte Version eines Pakets aktueller, als die Version, die zum Ziel-Release geh&ouml;rt, aber nicht so aktuell, wie eine Version, die zu einer anderen Distribution geh&ouml;rt. F&uuml;r ein derartiges Paket wird tats&auml;chlich ein Upgrade durchgef&uuml;hrt, wenn
<B>apt-get install </B><B></B><I>irgendein_Paket</I>
oder
<B>apt-get upgrade</B>
ausgef&uuml;hrt wird, weil mindestens
<I>eine</I>
der verf&uuml;gbaren Versionen eine h&ouml;here Priorit&auml;t als die installierte Version hat.
<A NAME="lbAE">&nbsp;</A>
<H3>Die Auswirkungen von APT-Einstellungen</H3>

<P>

Die APT-Einstellungsdatei erlaubt dem Systemverwalter die Zuweisung von Priorit&auml;ten zu steuern. Die Datei besteht aus einem oder mehreren mehrzeiligen Datens&auml;tzen, die durch leere Zeilen getrennt sind. Datens&auml;tze k&ouml;nnen eine von zwei Gestalten haben, eine spezielle Gestalt oder eine allgemeine Gestalt.
<P>
<DL COMPACT><DT id="11"><DD>
&bull;


Die spezielle Gestalt weist die Priorit&auml;t (eine &raquo;Pin-Priorit&auml;t&laquo;) einem oder mehreren angegebenen Paketen mit einer bestimmten Version oder einem bestimmten Versionsbereich zu. Der folgende Datensatz weist zum Beispiel allen Versionen des
perl-Pakets eine hohe Priorit&auml;t zu, deren Versionsnummer mit &raquo;5.20&laquo; beginnt. Mehrere Pakete k&ouml;nnen durch Leerzeichen getrennt werden.
<P>
<DL COMPACT><DT id="12"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001
</PRE>

</DL>




</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


Die allgemeine Gestalt weist allen Paketversionen in einer gegebenen Distribution (d.h. allen Versionen von Paketen, die in einer bestimmten
Release-Datei gelistet sind) oder allen Paketversionen, die von einer speziellen Internet-Site kommen, die durch ihren vollst&auml;ndig dargestellten Domain-Namen identifiziert wird, eine Priorit&auml;t zu.
<P>
Dieser Eintrag in allgemeiner Form in der APT-Einstellungsdatei gilt nur f&uuml;r Gruppen von Paketen. Der folgende Eintrag weist zum Beispiel allen Paketversionen mit lokalem Ursprung eine hohe Priorit&auml;t zu.
<P>
<DL COMPACT><DT id="14"><DD>



<PRE>
Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Eine Mahnung zur Vorsicht: Das hier benutzte Schl&uuml;sselwort ist &raquo;origin&laquo;, was zum Abgleich mit einem Rechnernamen benutzt werden kann. Der folgende Eintrag wird allen Versionen eine hohe Priorit&auml;t zuweisen, die auf dem Server verf&uuml;gbar sind, der durch den Rechnernamen &raquo;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&laquo; identifiziert wird.
<P>
<DL COMPACT><DT id="15"><DD>



<PRE>
Package: *
Pin: origin &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Dies sollte nicht mit der Herkunft einer Distribution verwechselt werden, wie sie in einer
Release-Datei angegeben wurde. Was dem &raquo;Origin:&laquo;-Kennzeichen in einer
Release-Datei folgt, ist keine Internet-Adresse, sondern ein Autoren- oder Anbietername, wie &raquo;Debian&laquo; oder &raquo;Ximian&laquo;.
<P>
Der folgende Datensatz weist allen Paketversionen, die zu Distributionen geh&ouml;ren, deren Archivname &raquo;unstable&laquo; ist, eine niedrige Priorit&auml;t zu.
<P>
<DL COMPACT><DT id="16"><DD>



<PRE>
Package: *
Pin: release a=unstable
Pin-Priority: 50
</PRE>

</DL>




<P>
Der folgende Datensatz weist allen Paketversionen, die zu einer Distribution geh&ouml;ren, deren Codename &raquo;bullseye&laquo; ist, eine hohe Priorit&auml;t zu.
<P>
<DL COMPACT><DT id="17"><DD>



<PRE>
Package: *
Pin: release n=bullseye
Pin-Priority: 900
</PRE>

</DL>




<P>
Der folgende Datensatz weist allen Paketversionen, die zu einer Distribution geh&ouml;ren, deren Archivname &raquo;stable&laquo; und deren Release-Nummer &raquo;10&laquo; ist, eine hohe Priorit&auml;t zu.
<P>
<DL COMPACT><DT id="18"><DD>



<PRE>
Package: *
Pin: release a=stable, v=10
Pin-Priority: 500
</PRE>

</DL>




</DL>

<P>
Die Auswirkungen des trennenden Kommas ist einem &raquo;und&laquo; in der Logik &auml;hnlich: Alle Bedingungen m&uuml;ssen erf&uuml;llt werden, dass die Pin passt. Es gibt jedoch eine Ausnahme: Bei jedem Bedingungstyp (wie zwei &raquo;a&laquo;-Bedingungen) wird nur die letzte Bedingungen gepr&uuml;ft.
<A NAME="lbAF">&nbsp;</A>
<H3>Regul&auml;re Ausdr&uuml;cke und <A HREF="/cgi-bin/man/man2html?7+glob">glob</A>(7)-Syntax</H3>

<P>

APT unterst&uuml;tzt au&szlig;erdem Pinning mittels
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)-Ausdr&uuml;cken und regul&auml;ren Ausdr&uuml;cken, die von &raquo;/&laquo; umschlossen sind. Das folgende Beispiel weist beispielsweise allen Paketen aus Experimental die Priorit&auml;t 500 zu, bei denen der Name mit &raquo;gnome&laquo; beginnt (wie ein
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)-artiger Ausdruck) oder das Wort &raquo;kde&laquo; enth&auml;lt (wie ein erweiterter regul&auml;rer POSIX-Ausdruck, der von Schr&auml;gstrichen umschlossen wird).
<P>
<DL COMPACT><DT id="19"><DD>



<PRE>
Package: gnome* /kde/
Pin: release a=experimental
Pin-Priority: 500
</PRE>

</DL>




<P>

Die Regel f&uuml;r diese Ausdr&uuml;cke ist, dass sie &uuml;berall dort auftreten k&ouml;nnen, wo eine Zeichenkette auftreten kann. Somit weist die folgende Pin allen Paketen von einem Release seit focal die Priorit&auml;t 900 zu.
<P>
<DL COMPACT><DT id="20"><DD>



<PRE>
Package: *
Pin: release n=focal*
Pin-Priority: 990
</PRE>

</DL>




<P>

Falls ein regul&auml;rer Ausdruck in einem
Package-Feld vorkommt, ist das Verhalten dasselbe, als wenn der regul&auml;re Ausdruck durch eine Liste aller Paketnamen ersetzt w&uuml;rde, auf die er passt. Es ist noch nicht entschieden, wie sich dies in Zukunft &auml;ndern wird, daher sollten Sie immer zuerst Platzhalter-Pins auflisten, so dass sie sp&auml;ter spezielle Pins au&szlig;er Kraft setzen k&ouml;nnen. Das Muster &raquo;*&laquo; in einem &raquo;Package&laquo;-Feld wird selbst nicht als ein
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)-Ausdruck angesehen.
<A NAME="lbAG">&nbsp;</A>
<H3>Pinning nach Quellpaket</H3>

<P>

APT unterst&uuml;tzt Pinning nach Quellpaketen. Um Pinning nach Quellpaket durchzuf&uuml;hren, stellen Sie dem Paketnamen &raquo;src:&laquo; voran.
<P>

Um zum Beispiel ein Pinning f&uuml;r alle von einem Apt-Quellpaket dieser APT-Version erzeugten Programme auf 990 durchzuf&uuml;hren, k&ouml;nnen Sie Folgendes tun:
<P>
<DL COMPACT><DT id="21"><DD>



<PRE>
Package: src:apt
Pin: version 2.0.4
Pin-Priority: 990
</PRE>

</DL>




<P>

Quellpaket-Pinning kann mit regul&auml;ren Ausdr&uuml;cken und Glob-Mustern (expandierbare Platzhalter) kombiniert werden und obendrein eine bin&auml;re Architektur annehmen.
<P>

Lassen Sie uns zum Beispiel ein Pinning aller Programme f&uuml;r alle Architekturen, die durch ein Quellpaket erzeugt wurden, das &raquo;apt&laquo; in seinem Namen enth&auml;lt, auf 990 durchf&uuml;hren:
<P>
<DL COMPACT><DT id="22"><DD>



<PRE>
Package: src:*apt*:any
Pin: version *
Pin-Priority: 990
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H3>Wie APT Priorit&auml;ten interpretiert</H3>

<P>

Die in der APT-Einstellungsdatei zugewiesenen Priorit&auml;ten (P) m&uuml;ssen positive oder negative Ganzzahlen sein. Sie werden wie folgt interpretiert (grob gesagt):
<P>

P &gt;= 1000
<DL COMPACT><DT id="23"><DD>
veranlasst, dass eine Version installiert wird, selbst wenn dies ein Downgrade des Pakets durchf&uuml;hrt
</DL>

<P>

990 &lt;= P &lt; 1000
<DL COMPACT><DT id="24"><DD>
veranlasst, dass eine Version installiert wird, auch wenn diese nicht vom Ziel-Release kommt, au&szlig;er wenn die installierte Version aktueller ist
</DL>

<P>

500 &lt;= P &lt; 990
<DL COMPACT><DT id="25"><DD>
veranlasst, dass eine Version installiert wird, au&szlig;er wenn eine Version verf&uuml;gbar ist, die zum Ziel-Release geh&ouml;rt oder die installierte Version neuer ist
</DL>

<P>

100 &lt;= P &lt; 500
<DL COMPACT><DT id="26"><DD>
veranlasst, dass eine Version installiert wird, au&szlig;er wenn eine Version verf&uuml;gbar ist, die zu einer anderen Distribution geh&ouml;rt oder die installierte Version neuer ist
</DL>

<P>

0 &lt; P &lt; 100
<DL COMPACT><DT id="27"><DD>
veranlasst, dass eine Version nur dann installiert wird, wenn es keine installierte Version des Pakets gibt
</DL>

<P>

P &lt; 0
<DL COMPACT><DT id="28"><DD>
verhindert das Installieren der Version
</DL>

<P>

P = 0
<DL COMPACT><DT id="29"><DD>
hat kein definiertes Verhalten, verwenden Sie es nicht.
</DL>

<P>

Der erste Datensatz mit speziellem Format der zu einer verf&uuml;gbaren Paketversion passt, legt die Priorit&auml;t der Paketversion fest. Schl&auml;gt dies fehl, wird die Priorit&auml;t als Maximum aller Priorit&auml;ten der Datens&auml;tze mit generischem Format definiert, die zu einer verf&uuml;gbaren Version passen. Datens&auml;tze, die so definiert sind, dass sie andere Muster als &raquo;*&laquo; im Feld Pin verwenden, werden wie Datens&auml;tze mit speziellem Format betrachtet.
<P>

Nehmen wir zum Beispiel an, die APT-Einstellungsdatei enth&auml;lt die drei bereits gezeigten Datens&auml;tze:
<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001

Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999

Package: *
Pin: release unstable
Pin-Priority: 50
</PRE>

</DL>




<P>

Dann:
<P>
<DL COMPACT><DT id="31"><DD>
&bull;


Es wird die aktuellste verf&uuml;gbare Version des Pakets
perl
installiert, so lange die Versionsnummer mit &raquo;5.20&laquo; anf&auml;ngt. Wenn
<I>irgendeine</I>
5.20*-Version von
perl
verf&uuml;gbar ist und die installierte Version 5.24* ist, dann wird von
perl
ein Downgrade durchgef&uuml;hrt.
</DL>

<P>
<DL COMPACT><DT id="32"><DD>
&bull;


Eine Version irgendeines anderen Pakets als
perl, die vom lokalen System verf&uuml;gbar ist, hat Priorit&auml;t &uuml;ber andere Versionen, sogar wenn diese Versionen zum Ziel-Release geh&ouml;ren.
</DL>

<P>
<DL COMPACT><DT id="33"><DD>
&bull;


Eine Version eines Pakets, dessen Ursprung nicht das lokale System ist, aber ein anderer in
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
aufgelisteter Ort und der zu einer
unstable-Distribution geh&ouml;rt, wird nur installiert, falls es zur Installation ausgew&auml;hlt wurde und nicht bereits eine Version des Pakets installiert ist.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H3>Festlegung von Paketversion und Distributions-Eigenschaften</H3>

<P>

Die in der
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Datei aufgelisteten Orte sollten
Packages- und
Release-Dateien bereitstellen, um die an diesem Ort verf&uuml;gbaren Pakete zu beschreiben.
<P>

Die
Packages-Datei wird normalerweise im Verzeichnis
.../dists/<I>Distributions-Name</I>/<I>Bestandteil</I>/<I>Architektur</I>
gefunden, zum Beispiel
.../dists/stable/main/binary-i386/Packages. Sie besteht aus einer Serie mehrzeiliger Datens&auml;tze, einem f&uuml;r jedes verf&uuml;gbare Paket in diesem Verzeichnis. In jedem Datensatz sind nur zwei Zeilen zum Setzen der APT-Priorit&auml;ten relevant:
<P>

die Package:-Zeile
<DL COMPACT><DT id="34"><DD>
gibt den Paketnamen an
</DL>

<P>

die Version:-Zeile
<DL COMPACT><DT id="35"><DD>
gibt die Versionsnummer f&uuml;r das genannte Paket an
</DL>

<P>

Die
Release-Datei ist normalerweise im Verzeichnis
.../dists/<I>Distributionsname</I>
zu finden, zum Beispiel
.../dists/stable/Release
oder
.../dists/buster/Release. Sie besteht aus einem einzelnen mehrzeiligen Datensatz, der auf
<I>alle</I>
Pakete im Verzeichnisbaum unterhalb des &uuml;bergeordneten Verzeichnisses zutrifft. Anders als die
Packages-Datei sind nahezu alle Zeilen in einer
Release-Datei f&uuml;r das Setzen von APT-Priorit&auml;ten relevant:
<P>

die Archive:- oder Suite:-Zeile
<DL COMPACT><DT id="36"><DD>
benennt das Archiv, zu dem alle Pakete im Verzeichnisbaum geh&ouml;ren. Die Zeile &raquo;Archive: stable&laquo; oder &raquo;Suite: stable&laquo; gibt zum Beispiel an, dass alle Pakete im Verzeichnisbaum unterhalb des der
Release-Datei &uuml;bergeordneten Verzeichnisses sich in einem
stable-Archiv befinden. Diesen Wert in der APT-Einstellungsdatei anzugeben w&uuml;rde die folgende Zeile ben&ouml;tigen:
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
Pin: release a=stable
</PRE>

</DL>




</DL>

<P>

die Codename:-Zeile
<DL COMPACT><DT id="38"><DD>
benennt den Codenamen, zu dem alle Pakete im Verzeichnisbaum geh&ouml;ren. Die Zeile &raquo;Codename: bullseye&laquo; gibt zum Beispiel an, dass alle Pakete im Verzeichnisbaum unterhalb des der
Release-Datei &uuml;bergeordneten Verzeichnisses zu einer Version mit Namen
bullseye
geh&ouml;ren. Diesen Wert in der APT-Einstellungsdatei anzugeben w&uuml;rde die folgende Zeile ben&ouml;tigen:
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
Pin: release n=bullseye
</PRE>

</DL>




</DL>

<P>

die Version:-Zeile
<DL COMPACT><DT id="40"><DD>
benennt die Release-Version. Die Pakete im Baum k&ouml;nnten zum Beispiel zur Debian-Release-Version 10 geh&ouml;ren. Beachten Sie, dass es normalerweise keine Versionsnummer f&uuml;r
testing- und
unstable-Distributionen gibt, weil sie noch nicht ver&ouml;ffentlicht wurden. Diese in der APT-Einstellungsdatei anzugeben w&uuml;rde eine der folgenden Zeilen ben&ouml;tigen:
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Pin: release v=10
Pin: release a=stable, v=10
Pin: release 10
</PRE>

</DL>




</DL>

<P>

die Component:-Zeile
<DL COMPACT><DT id="42"><DD>
benennt den Lizenzierungsbestandteil, die den Paketen im Verzeichnisbaum der
Release-Datei zugeordnet ist. Die Zeile &raquo;Component: main&laquo; gibt zum Beispiel an, dass alle Pakete im Verzeichnisbaum von der
main-Komponente stammen, was zur Folge hat, dass sie unter den Bedingungen der Debian-Richtlinien f&uuml;r Freie Software stehen. Diese Komponente in der APT-Einstellungsdatei anzugeben w&uuml;rde die folgende Zeilen ben&ouml;tigen:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Pin: release c=main
</PRE>

</DL>




</DL>

<P>

die Origin:-Zeile
<DL COMPACT><DT id="44"><DD>
benennt den Urheber des Pakets im Verzeichnisbaum der
Release-Datei. Zumeist ist dies
Debian. Um diesen Ursprung in der APT-Einstellungsdatei anzugeben, w&uuml;rde die folgende Zeile ben&ouml;tigt:
<P>
<DL COMPACT><DT id="45"><DD>



<PRE>
Pin: release o=Debian
</PRE>

</DL>




</DL>

<P>

die Label:-Zeile
<DL COMPACT><DT id="46"><DD>
benennt die Beschriftung des Pakets im Verzeichnisbaum der
Release-Datei. Zumeist ist dies
Debian. Diese Beschriftung in der APT-Einstellungsdatei anzugeben w&uuml;rde die folgende Zeile ben&ouml;tigen:
<P>
<DL COMPACT><DT id="47"><DD>



<PRE>
Pin: release l=Debian
</PRE>

</DL>




</DL>

<P>

Alle
Packages- und
Release-Dateien, die von Orten heruntergeladen werden, die in der Datei
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
aufgelistet sind, werden im Verzeichnis
/var/lib/apt/lists
oder in der von der Variablen
Dir::State::Lists
in der Datei
apt.conf
benannten Datei gespeichert. Die Datei
debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release
enth&auml;lt zum Beispiel die
Release-Datei, die von der Site
debian.lcs.mit.edu
f&uuml;r die
binary-i386-Architekturdateien von der
contrib-Bestandteil der
unstable-Distribution heruntergeladen wurde.
<A NAME="lbAJ">&nbsp;</A>
<H3>Optionale Zeilen in einem APT-Einstellungsdatensatz</H3>

<P>

Optional kann jeder Datensatz in der APT-Einstellungsdatei mit einer oder mehreren Zeilen beginnen, die mit dem Wort
Explanation:
anfangen. Dieses stellt einen Platz f&uuml;r Kommentare bereit.
<A NAME="lbAK">&nbsp;</A>
<H2>BEISPIELE</H2>

<A NAME="lbAL">&nbsp;</A>
<H3>Stable verfolgen</H3>

<P>

Die folgende APT-Einstellungsdatei wird APT veranlassen, allen Paketversionen eine h&ouml;here Priorit&auml;t als die Vorgabe (500) zu geben, die zu einer
stable-Distribution geh&ouml;ren und eine ungeheuer niedrige Priorit&auml;t zu Paketversionen, die zu anderen
Debian-Distributionen geh&ouml;ren.
<P>
<DL COMPACT><DT id="48"><DD>



<PRE>
Explanation: Deinstallieren oder nicht installieren von anderen von Debian
Explanation: stammenden Paketversionen als denen der Stable-Distribution
Package: *
Pin: release a=stable
Pin-Priority: 900

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Mit einer geeigneten
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Datei und der obigen Einstellungsdatei wird jeder der folgenden Befehle APT veranlassen, ein Upgrade auf die <A HREF="/cgi-bin/man/man2html?n+neuste">neuste</A>(n)
stable-Version(en) durchzuf&uuml;hren.
<P>
<DL COMPACT><DT id="49"><DD>



<PRE>
apt-get install <I>Paketname</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Der folgende Befehl wird APT veranlassen, ein Upgrade des angegebenen Pakets auf die neuste Version der
testing-Distribution durchzuf&uuml;hren. Von dem Paket wird kein weiteres Upgrade durchgef&uuml;hrt, au&szlig;er wenn dieser Befehl wieder angegeben wird.
<P>
<DL COMPACT><DT id="50"><DD>



<PRE>
apt-get install <I>Paket</I>/testing
</PRE>

</DL>




<P>
<A NAME="lbAM">&nbsp;</A>
<H3>Testing oder Unstable verfolgen</H3>

<P>

Die folgende APT-Einstellungsdatei wird APT veranlassen, Paketversionen der
testing-Distribution eine hohe Priorit&auml;t, Paketversionen der
unstable-Distribution eine niedrigere Priorit&auml;t und eine ungeheuer niedrige Priorit&auml;t zu Paketversionen von anderen
Debian-Distributionen zuzuweisen.
<P>
<DL COMPACT><DT id="51"><DD>



<PRE>
Package: *
Pin: release a=testing
Pin-Priority: 900

Package: *
Pin: release a=unstable
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Mit einer geeigneten
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Datei und der obigen Einstellungsdatei wird jeder der folgenden Befehle APT veranlassen, ein Upgrade auf die <A HREF="/cgi-bin/man/man2html?n+neuste">neuste</A>(n)
testing-Version(en) durchzuf&uuml;hren.
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
apt-get install <I>Paketname</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Der folgende Befehl wird APT veranlassen, ein Upgrade des angegebenen Pakets auf die neuste Version der
unstable-Distribution durchzuf&uuml;hren. Danach wird
<B>apt-get upgrade</B>
ein Upgrade des Pakets auf die aktuellste
testing-Version durchf&uuml;hren, falls diese aktueller als die installierte Version ist, andernfalls auf die aktuellste
unstable-Version, wenn diese aktueller als die installierte Version ist.
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
apt-get install <I>Paket</I>/unstable
</PRE>

</DL>




<P>
<A NAME="lbAN">&nbsp;</A>
<H3>Die Entwicklung eines Codename-Releases verfolgen</H3>

<P>

Die folgende APT-Einstellungsdatei wird APT veranlassen, allen Paketen, die zu einem bestimmten Codenamen einer Distribution geh&ouml;ren, eine h&ouml;here Priorit&auml;t als die Vorgabe (500) zu geben und Paketversionen, die zu anderen
Debian-Distributionen, Codenamen und Archiven geh&ouml;ren, eine ungeheuer niedrige Priorit&auml;t zu geben. Beachten Sie, dass APT mit diesen APT-Einstellungen der Migration eines Releases vom Archiv
testing
zu
stable
und sp&auml;ter zu
oldstable
folgen wird. Wenn Sie zum Beispiel dem Fortschritt in
testing
folgen m&ouml;chten, obwohl der Codename sich &auml;ndert, sollten Sie die Beispielkonfigurationen oberhalb benutzen.
<P>
<DL COMPACT><DT id="54"><DD>



<PRE>
Explanation: Deinstallieren oder nicht installieren von anderen von Debian
Explanation: stammenden Paketversionen als denen der bullseye-
Explanation: oder Sid-Distribution
Package: *
Pin: release n=bullseye
Pin-Priority: 900

Explanation: Debian-Unstable hat immer den Codenamen sid
Package: *
Pin: release a=sid
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Mit einer geeigneten
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)-Datei und der obigen Einstellungsdatei wird jeder der folgenden Befehle APT veranlassen, ein Upgrade auf die <A HREF="/cgi-bin/man/man2html?n+letzte">letzte</A>(n) Version(en) im Release mit Codenamen
bullseye
durchzuf&uuml;hren.
<P>
<DL COMPACT><DT id="55"><DD>



<PRE>
apt-get install <I>Paketname</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

Der folgende Befehl wird APT veranlassen, ein Upgrade des angegebenen Pakets auf die neuste Version der
sid-Distribution durchzuf&uuml;hren. Danach wird
<B>apt-get upgrade</B>
ein Upgrade des Pakets auf die aktuellste
bullseye-Version durchf&uuml;hren, wenn diese aktueller als die installierte Version ist, andernfalls auf die aktuellste
sid-Version, wenn diese aktueller als die installierte Version ist.
<P>
<DL COMPACT><DT id="56"><DD>



<PRE>
apt-get install <I>Paket</I>/sid
</PRE>

</DL>




<P>
<A NAME="lbAO">&nbsp;</A>
<H2>DATEIEN</H2>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="57"><DD>
Version-Einstellungsdatei. Hier k&ouml;nnen Sie &quot;pinning&quot; festlegen, d.h. eine Einstellung, um bestimmte Pakete aus einer separaten Quelle oder von einer anderen Version einer Distribution zu erhalten. Konfigurationselement:
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="58"><DD>
Dateifragmente f&uuml;r die Versionseinstellungen. Konfigurationselement:
Dir::Etc::PreferencesParts.
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAR">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAS">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="59"><DD>
</DL>

<A NAME="lbAT">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="60"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="61"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="62"><A HREF="#lbAB">NAME</A><DD>
<DT id="63"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DL>
<DT id="64"><A HREF="#lbAD">APTs Standardpriorit&auml;tszuweisungen</A><DD>
<DT id="65"><A HREF="#lbAE">Die Auswirkungen von APT-Einstellungen</A><DD>
<DT id="66"><A HREF="#lbAF">Regul&auml;re Ausdr&uuml;cke und glob(7)-Syntax</A><DD>
<DT id="67"><A HREF="#lbAG">Pinning nach Quellpaket</A><DD>
<DT id="68"><A HREF="#lbAH">Wie APT Priorit&auml;ten interpretiert</A><DD>
<DT id="69"><A HREF="#lbAI">Festlegung von Paketversion und Distributions-Eigenschaften</A><DD>
<DT id="70"><A HREF="#lbAJ">Optionale Zeilen in einem APT-Einstellungsdatensatz</A><DD>
</DL>
<DT id="71"><A HREF="#lbAK">BEISPIELE</A><DD>
<DL>
<DT id="72"><A HREF="#lbAL">Stable verfolgen</A><DD>
<DT id="73"><A HREF="#lbAM">Testing oder Unstable verfolgen</A><DD>
<DT id="74"><A HREF="#lbAN">Die Entwicklung eines Codename-Releases verfolgen</A><DD>
</DL>
<DT id="75"><A HREF="#lbAO">DATEIEN</A><DD>
<DT id="76"><A HREF="#lbAP">SIEHE AUCH</A><DD>
<DT id="77"><A HREF="#lbAQ">FEHLER</A><DD>
<DT id="78"><A HREF="#lbAR">&Uuml;BERSETZUNG</A><DD>
<DT id="79"><A HREF="#lbAS">AUTOR</A><DD>
<DT id="80"><A HREF="#lbAT">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
