
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-substvars</TITLE>
</HEAD><BODY>
<H1>deb-substvars</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb-substvars - Substitutionsvariablen in Debian-Quellen
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

substvars
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Bevor <B>dpkg-source</B>, <B>dpkg-gencontrol</B> und <B>dpkg-genchanges</B> ihre
Steuerinformationen (zu der Quell-control-Datei <B>.dsc</B> f&uuml;r <B>dpkg-source</B>
und zu der Standardausgabe f&uuml;r <B>dpkg-gencontrol</B> und <B>dpkg-genchanges</B>)
schreiben, f&uuml;hren sie einige Variablensubstitutionen in der Ausgabedatei
durch.
<P>
Eine Variablensubstitution hat die Form
<B>${</B><I>Variablenname</I><B>}</B>. Variablennamen bestehen aus alphanumerischen
Zeichen (a-zA-Z0-9, womit sie auch beginnen), Gedankenstrichen (-) und
Doppelpunkten (:). Bei Variablennamen ist die Klein-/Gro&szlig;schreibung
relevant, auch wenn sie sich auf Gebilde beziehen, die die
Klein-/Gro&szlig;schreibung erhalten. Variablensubstitutionen werden wiederholt
durchgef&uuml;hrt, bis keine &uuml;brig geblieben sind; der komplette Text des Feldes
nach der Substitution wird erneut auf weitere Substitutionen gepr&uuml;ft.
<P>
Nachdem alle Substitutionen erfolgt sind, wird jedes Auftreten der
Zeichenkette <B>${}</B> (die keine erlaubte Substitution ist) durch das
<B>$</B>-Zeichen ersetzt.
<P>
Obwohl die Variablensubstitution bei allen Feldern der control-Datei
vorgenommen wird, werden einige dieser Felder w&auml;hrend des Bauens ben&ouml;tigt
und verwendet, wenn die Substitution noch nicht erfolgt ist. Daher k&ouml;nnen
Sie Variablen nicht in den Feldern <B>Package</B>, <B>Source</B> und <B>Architecture</B>
verwenden.
<P>
Variablenersetzung erfolgt am Inhalt der Felder, nachdem sie geparst
(ausgewertet) wurden. Falls Sie eine Variable &uuml;ber mehrere Zeilen
expandieren m&ouml;chten, m&uuml;ssen Sie nach dem Zeilenumbruch daher kein
Leerzeichen einf&uuml;gen. Dies passiert bei der Ausgabe des Feldes implizit. Ist
beispielsweise die Variable <B>${Description}</B> auf &raquo;foo ist bar.${Newline}foo
ist super.&laquo; gesetzt und Sie haben das folgende Feld:
<P>
<BR>&nbsp;Description:&nbsp;foo&nbsp;application
<BR>&nbsp;&nbsp;${Description}
<BR>&nbsp;&nbsp;.
<BR>&nbsp;&nbsp;Weiterer&nbsp;Text.
<P>
Dann wird dies zu Folgenden f&uuml;hren:
<P>
<BR>&nbsp;Description:&nbsp;foo&nbsp;application
<BR>&nbsp;&nbsp;foo&nbsp;ist&nbsp;bar.
<BR>&nbsp;&nbsp;foo&nbsp;ist&nbsp;super.
<BR>&nbsp;&nbsp;.
<BR>&nbsp;&nbsp;Weiterer&nbsp;Text.
<P>
Variablen k&ouml;nnen &uuml;ber die allgemeine <B>-V</B>-Option gesetzt werden. Sie k&ouml;nnen
auch in der <B>debian/substvars</B> (bzw. in der &uuml;ber die Option <B>-T</B> gesetzten
Datei) angegeben werden. Diese Datei besteht auch Zeilen der Form
<I>Name</I><B>=</B><I>Wert</I>. Leerraumzeichen am Zeilenende, leere Zeilen und Zeilen,
die mit dem <B>#</B>-Symbol starten (Kommentare) werden ignoriert.
<P>
Zus&auml;tzlich sind die folgenden Standardvariablen verf&uuml;gbar:
<DL COMPACT>
<DT id="1"><B>Arch</B><DD>
Die aktuelle Host-Architektur (d.h. die Architektur, f&uuml;r die das Paket
gebaut wird, das &Auml;quivalent zu <B>DEB_HOST_ARCH</B>).
<DT id="2"><B>source:Version</B><DD>
Die Quellpaketversion (seit Dpkg 1.13.19).
<DT id="3"><B>source:Upstream-Version</B><DD>
Die Paketversion der Originalautoren, einschlie&szlig;lich der Epoche der
Debian-Version, falls vorhanden (seit Dpkg 1.13.19).
<DT id="4"><B>binary:Version</B><DD>
Die Bin&auml;rpaketversion (die z.B. in einem binNMU von <B>source:Version</B>
abweichen kann; seit Dpkg 1.13.19).
<DT id="5"><B>Source-Version</B><DD>
Die Quellpaketversion (aus der changelog-Datei). Diese Variable ist jetzt
<B>veraltet</B> und gibt bei der Benutzung einen Fehler aus, da ihre Bedeutung
von ihrer Funktion abweicht, bitte verwenden Sie <B>source:Version</B> oder
<B>binary:Version</B> wo zutreffend.
<DT id="6"><B>source:Synopsis</B><DD>
Die Quellpaketzusammenfassung, aus dem Feld <B>Description</B> der Quellabsatzes
entnommen, falls dieses existiert (seit Dpkg 1.19.0).
<DT id="7"><B>source:Extended-Description</B><DD>
Die erweiterte Quellpaketbeschreibung, aus dem Feld <B>Description</B> des
Quellabsatzes entnommen, falls dieses existiert (seit Dpkg 1.19.0).
<DT id="8"><B>Installed-Size</B><DD>
Die ungef&auml;hre Gesamtgr&ouml;&szlig;e der vom Paket installierten Dateien. Dieser Wert
wird in das entsprechende Feld der &raquo;control&laquo;-Datei kopiert; wird es gesetzt,
ver&auml;ndert es den Wert dieses Feldes. Falls diese Variable nicht gesetzt ist,
wird <B>dpkg-gencontrol</B> den Vorgabewert berechnen, indem es die Gr&ouml;&szlig;en jeder
regul&auml;ren Datei und jedes Symlinks (gerundet auf 1 KiB) aufsammelt und einen
Grundwert von 1 KiB f&uuml;r aller anderen Dateisystemobjekttypen verwendet.
<P>
<B>Hinweis</B>: Beachten Sie, dass dies stets nur ein Sch&auml;tzwert sein kann, da
die tats&auml;chliche Gr&ouml;&szlig;e im installierten System stark vom verwandten
Dateisystem und seinen Parametern abh&auml;ngt. Daher kann es am Ende mehr oder
weniger als in diesem Feld angegebenen Platz belegen.
<DT id="9"><B>Extra-Size</B><DD>
Zus&auml;tzlicher Plattenplatz, der verwendet wird, wenn das Paket installiert
ist. Falls diese Variable gesetzt ist, wird dieser Wert zu der
<B>Installed-Size</B>-Variablen hinzuaddiert (egal ob sie explizit gesetzt oder
der Standardwert verwendet wird), bevor sie in das Feld <B>Installed-Size</B>
der &raquo;control&laquo;-Datei kopiert wird.
<DT id="10"><B>S:</B><I>Feldname</I><DD>
Der Wert des Quellpaket-Absatzfeldes <I>Feldname</I> (der in der kanonischen
Gro&szlig;-/Kleinschreibung angegeben werden muss; seit Dpkg 1.18.11). Das Setzen
dieser Variablen hat nur an den Stellen einen Effekt, wo diese explizit
expandiert werden. Diese Variablen sind nur bei der Erstellung der bin&auml;ren
Steuerdatei verf&uuml;gbar.
<DT id="11"><B>F:</B><I>Feldname</I><DD>
Der Wert des Ausgabefeldes <I>Feldname</I> (der in der kanonischen
Gro&szlig;-/Kleinschreibung angegeben werden muss). Das Setzen dieser Variablen
hat nur einen Effekt an den Stellen, wo diese explizit expandiert werden.
<DT id="12"><B>Format</B><DD>
Die Formatversion der <B>.changes</B>-Datei, die von dieser Version der
Quellpaketierskripte erstellt wird. Falls Sie diese Variable setzen, werden
die Inhalte des <B>Format</B>-Feldes in der <B>.changes</B>-Datei auch ge&auml;ndert.
<DT id="13"><B>Newline</B>, <B>Space</B>, <B>Tab</B><DD>
Diese Variablen enthalten das jeweils korrespondieren Zeichen
(<B>Zeilenumbruch</B>, <B>Leerzeichen</B> und <B>Tabulator</B> in dieser Reihenfolge).
<DT id="14"><B>shlibs:</B><I>dependencyfield</I><DD>
Variableneinstellungen mit Namen dieser Form werden von <B>dpkg-shlibdeps</B>
erstellt.
<DT id="15"><B>dpkg:Upstream-Version</B><DD>
Die Original- (Upstream-)Version von Dpkg (seit Dpkg 1.13.19).
<DT id="16"><B>dpkg:Version</B><DD>
Die komplette Version von Dpkg (seit Dpkg 1.13.19).
</DL>
<P>

Falls auf eine Variable Bezug genommen wird, diese aber nicht definiert ist,
wird es eine Warnung erstellen und ein leerer Wert wird angenommen.
<A NAME="lbAE">&nbsp;</A>
<H2>DATEIEN</H2>

<DL COMPACT>
<DT id="17"><B>debian/substvars</B><DD>
Liste von Substitutionsvariablen und -werten.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>SIEHE AUCH</H2>


<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-genchanges">dpkg-genchanges</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-gencontrol">dpkg-gencontrol</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-shlibdeps">dpkg-shlibdeps</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1).
<A NAME="lbAG">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="18"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="19"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="20"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="21"><A HREF="#lbAE">DATEIEN</A><DD>
<DT id="22"><A HREF="#lbAF">SIEHE AUCH</A><DD>
<DT id="23"><A HREF="#lbAG">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
