
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-changelog</TITLE>
</HEAD><BODY>
<H1>deb-changelog</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb-src-control - Format der Quellpaket-Changelog-Datei von Debian
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

changelog
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

&Auml;nderungen in der paketierten Version eines Projekts werden in der
Changelog-Datei <I>debian/changelog</I> erl&auml;utert. Darunter fallen &Auml;nderungen,
die am Quellpaket beim Paketieren vorgenommen wurden sowie andere &Auml;nderungen
und Aktualisierungen am Paket.
<P>

Das Format von <I>debian/changelog</I> erlaubt den Paketbauwerkzeugen, die zu
bauende Version des Pakets und andere, ver&ouml;ffentlichungsspezifische
Information, zu ermitteln.
<P>

Das Format besteht aus einer Serie von Eintr&auml;gen der folgenden Art:
<P>
<PRE>
<I>Paket</I> (<I>Version</I>) <I>Distributionen</I>; <I>Metadaten</I>
          [optionale leere <A HREF="/cgi-bin/man/man2html?n+Zeile">Zeile</A>(n), entfernt]
  * <I>&Auml;nderungsdetails</I>
    <I>weitere_&Auml;nderungsdetails</I>
          [leere <A HREF="/cgi-bin/man/man2html?n+Zeile">Zeile</A>(n), in der Ausgabe von <B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1) enthalten]
  * <I>noch_weitere_&Auml;nderungsdetails</I>
          [optionale leere <A HREF="/cgi-bin/man/man2html?n+Zeile">Zeile</A>(n), entfernt]
 -- <I>Betreuername</I> &lt;<I>E-Mail-Adresse</I>&gt;  <I>Datum</I>
</PRE>

<P>
<P>

<I>Paket</I> und <I>Version</I> sind der Quellpaketname und die Versionsnummer.
<P>

<I>Distributionen</I> listet eine oder mehrere durch Leerzeichen getrennte
Distributionen auf, in die diese Version nach dem Upload installiert werden
soll. Es wird in das Feld <B>Distribution</B> in der <I>.changes</I>-Datei kopiert.
<P>

<I>Metadaten</I> ist eine durch Kommata getrennte Liste von
<I>Schl&uuml;ssel</I>=<I>Wert</I>-Objekten. Die einzigen von <B>dpkg</B> derzeit verstandenen
<I>Schl&uuml;sselw&ouml;rter</I> sind <B>urgency</B> und <B>binary-only</B>. Der Wert von
<B>urgency</B> wird f&uuml;r das Feld <B>Urgency</B> in der Datei <I>.changes</I> f&uuml;r den
Upload verwandt. <B>binary-only</B> mit einem Wert von <B>yes</B> wird verwandt, um
anzuzeigen, dass dieser Changelog-Eintrag f&uuml;r einen rein-bin&auml;ren
nicht-Betreuer-Upload (ein automatischer bin&auml;rer Neubau, wo die einzige
&Auml;nderung der Changelog-Eintrag darstellt) ist.
<P>

Die &Auml;nderungsdetails k&ouml;nnen tats&auml;chlich eine Reihe von Zeilen, die
mindestens mit zwei Leerzeichen beginnen, sein, aber &uuml;blicherweise beginnt
jede &Auml;nderung mit einem Stern und einem trennenden Leerzeichen und
Folgezeilen werden so einger&uuml;ckt, dass sie b&uuml;ndig mit dem obigen Text
formatiert sind. Leerzeilen k&ouml;nnen hier verwandt weden, um Gruppen von
&Auml;nderungen, falls gew&uuml;nscht, zu trennen.
<P>

Falls dieser Upload Fehler aus der Fehlerdatenbank behebt, k&ouml;nnen diese
automatisch geschlossen werden, falls der Changlog bei der Aufnahme in das
Distributionsarchiv die folgende Zeichenkette enth&auml;lt:
<PRE>
  <B>Closes: Bug#</B><I>nnnnn</I>
</PRE>

in den &Auml;nderungsdetails auftaucht. Der genaue regul&auml;re Perl-Ausdruck lautet
<B>/closes:\s*(?:bug)?\#?\s?\d+(?:,\s*(?:bug)?\#?\s?\d+)*/i</B>). Diese
Information wird &uuml;ber das Feld <B>Closes</B> in der <I>.changes</I>-Datei
vermittelt.
<P>

Der im Changelog-Eintrag verwandte Name des Betreuers und die E-Mail-Adresse
sollten die Details der Person sein, die diese Ver&ouml;ffentlichung des Pakets
erstellt hat. Sie stimmen <B>nicht</B> notwendigerweise mit denen des
Hochladenden oder des normalen Paketbetreuers &uuml;berein. Die Informationen
werden von hier in das Feld <B>Changed-By</B> in der <I>.changes</I>-Datei kopiert
und k&ouml;nnten dann sp&auml;ter zum Versand der Best&auml;tigung verwandt werden, wenn
der Upload im Archiv der Distribution aufgenommen wurde.
<P>

Das <I>Datum</I> hat das folgende Format (kompatibel zu und mit der gleichen
Semantik von RFC2822 und RFC5322 bzw. der Ausgabe von Bqdate -R"):
<DL COMPACT>
<DT id="1"><DD>
<I>Wochentag</I><B>,</B> <I>tt</I> <I>Monat</I> <I>jjjj</I> <I>hh</I><B>:</B><I>mm</I><B>:</B><I>ss</I> <B>+</B><I>zzzz</I>
</DL>
<P>

Hierbei sind:
<DL COMPACT>
<DT id="2"><I>Wochentag</I><DD>
Dieser ist einer aus: <B>Mon</B>, <B>Tue</B>, <B>Wed</B>, <B>Thu</B>, <B>Fri</B>, <B>Sat</B>,
<B>Sun</B>.
<DT id="3"><I>tt</I><DD>
Dies ist der Tag des Monats (<B>01</B>-<B>31</B>) aus einer oder zwei Ziffern.
<DT id="4"><I>Monat</I><DD>
Dies ist einer aus: <B>Jan</B>, <B>Feb</B>, <B>Mar</B>, <B>Apr</B>, <B>May</B>, <B>Jun</B>, <B>Jul</B>,
<B>Aug</B>, <B>Sep</B>, <B>Oct</B>, <B>Nov</B>, <B>Dec</B>.
<DT id="5"><I>jjjj</I><DD>
ist das vierstellige Jahr (z.B. 2010).
<DT id="6"><I>hh</I><DD>
ist die zweistellige Stunde (<B>00</B>-<B>23</B>).
<DT id="7"><I>mm</I><DD>
ist die zweistellige Minute (<B>00</B>-<B>59</B>).
<DT id="8"><I>ss</I><DD>
ist die zweistellige Sekunde (<B>00</B>-<B>60</B>).
<DT id="9">[<B>+-</B>]<I>zzzz</I><DD>
ist der Zeitzonenversatz der koordinierten Weltzeit (UTC). bq<B>+</B>' gibt an,
dass die Zeit voraus (d.h. &ouml;stlich von UTC) ist und bq<B>-</B>', dass die Zeit
zur&uuml;ck (d.h. westliche von UTC) ist. Die ersten zwei Ziffern geben den
Unterschied in Stunden von UTC und die letzten zwei Ziffern die Anzahl von
zus&auml;tzlichen Minuten zu UTC an. Die letzten zwei Ziffern m&uuml;ssen im Bereich
<B>00</B>-<B>59</B> liegen.
</DL>
<P>

Die erste BqTitel"-Zeile muss am linken Rand anfangen. Die BqSchluss"-Zeile
mit den Betreuer- und Datumsdetails m&uuml;ssen durch genau ein Leerzeichen
eingeleitet werden. Die Details zum Betreuer und das Datum m&uuml;ssen durch
genau zwei Leerzeichen getrennt sein.
<P>

Jede Zeile, die komplett (d.h. ohne einf&uuml;hrende Leerzeichen) aus Kommentaren
im Stil <B>#</B> oder <B>/* */</B> oder RCS-Schl&uuml;sselw&ouml;rtern besteht, sollte
ignoriert werden.
<P>

Modelines von Vim oder lokale Emacs-Variablen sowie uralte
Changelog-Eintr&auml;ge in anderen Formaten am Ende der Datei sollten akzeptiert
und in der Ausgabe erhalten werden. Ihr Inhalt darf ansonsten aber ignoriert
und die Auswertung an diesem Punkt beendet werden.
<P>

Der gesamte Changelog muss in UTF-8 kodiert sein.
<A NAME="lbAE">&nbsp;</A>
<H2>DATEIEN</H2>

<DL COMPACT>
<DT id="10"><I>debian/changelog</I><DD>
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>BEISPIELE</H2>

<PRE>
dpkg (1.17.18) unstable; urgency=low

  [ Guillem Jover ]
  * Handle empty minimum versions when initializing dependency versions,
    as the code is mapping the minimum version 0 to '' to avoid outputting
    useless versions. Regression introduced in dpkg 1.17.17. Closes: #764929

  [ Updated programs translations ]
  * Catalan (Guillem Jover).

  [ Updated dselect translations ]
  * Catalan (Guillem Jover).
  * German (Sven Joachim).

 -- Guillem Jover &lt;<A HREF="mailto:guillem@debian.org">guillem@debian.org</A>&gt;  Sun, 12 Oct 2014 15:47:44 +0200
</PRE>

<A NAME="lbAG">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?5+deb-changes">deb-changes</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-parsechangelog">dpkg-parsechangelog</A></B>(1).
<A NAME="lbAH">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="11"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="12"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="13"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="14"><A HREF="#lbAE">DATEIEN</A><DD>
<DT id="15"><A HREF="#lbAF">BEISPIELE</A><DD>
<DT id="16"><A HREF="#lbAG">SIEHE AUCH</A><DD>
<DT id="17"><A HREF="#lbAH">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
