
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-changes</TITLE>
</HEAD><BODY>
<H1>deb-changes</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

dpkg-genchanges - Format der Debian-Changes-Datei
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<I>Dateiname</I><B>.changes</B>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Jeder Debian-Upload besteht aus einer .changes-Steuerdatei, die eine Reihe
von Feldern enth&auml;lt. Jedes Feld beginnt mit einer Markierung wie <B>Source</B>
oder <B>Binary</B> (Gro&szlig;-/Kleinschreibung ist egal), gefolgt von einem
Doppelpunkt und dem Inhalt des Feldes. Felder werden nur durch
Feldmarkierungen abgegrenzt. Mit anderen Worten: Der Feldtext kann &uuml;ber
mehrere Zeilen gehen, wobei die Installationswerkzeuge die Zeilen bei der
Verarbeitung des Feldinhaltes zusammenf&uuml;gen werden (Ausnahmen sind die
mehrzeiligen Felder <B>Description</B>, <B>Changes</B>, <B>Files</B>, <B>Checksums-Sha1</B>
und <B>Checksums-Sha256</B>, siehe unten).
<P>

Die Steuerdaten k&ouml;nnen in eine Signatur mit einer wie in RFC4880
spezifizierten OpenPGP-ASCII-H&uuml;lle eingeschlossen sein.
<A NAME="lbAE">&nbsp;</A>
<H2>FELDER</H2>

<DL COMPACT>
<DT id="1"><B>Format:</B> <I>Formatversion</I> (verpflichtend)<DD>
Das Wert dieses Feldes legt die Formatversion der Datei fest. Die Syntax des
Feldwertes ist eine Versionsnummer mit einer Haupt- und einer
Nebenkomponente. R&uuml;ckw&auml;rtsinkompatible &Auml;nderungen im Format f&uuml;hren zu einer
Erh&ouml;hung der Hauptversion und r&uuml;ckw&auml;rtskompatible &Auml;nderungen (wie die
Aufnahme neuer Felder) f&uuml;hren zu einer Erh&ouml;hung der Nebenversion. Die
aktuelle Formatversion ist <B>1.8</B>.
<DT id="2"><B>Date:</B> <I>Ver&ouml;ffentlichungsdatum</I> (verpflichtend)<DD>
Das Datum, an dem das Paket letztmalig gebaut oder bearbeitet wurde. Es muss
im gleichen Format wie in einem Eintrag bei <B><A HREF="/cgi-bin/man/man2html?5+deb-changelog">deb-changelog</A></B>(5) sein.
<P>
Der Wert dieses Feldes wird normalerweise aus der Datei <I>debian/changelog</I>
entnommen.
<DT id="3"><B>Source:</B> <I>Quellname</I> [<B>(</B><I>Quellversion</I><B>)</B>] (verpflichtend)<DD>
Der Name des Quellpakets. Falls sich die Quellversion von der Bin&auml;rversion
unterscheidet folgt dem <I>Quellname</I>n in Klammern eine <I>Quellversion</I>. Dies
kann passieren, falls dies ein rein-bin&auml;rer-nicht-Betreuer-Upload ist.
<DT id="4"><B>Binary:</B> <I>Bin&auml;rpaketliste</I> (verpflichtend im Kontext)<DD>
Dieses gefaltete Feld ist eine durch Leerzeichen getrennte Liste von
hochzuladenen bin&auml;ren Paketen. Falls es sich um einen reinen Quell-Upload
handelt, wird dieses Feld ausgelassen (seit Dpkg 1.19.3).
<DT id="5"><B>Architecture:</B> <I>Architekturliste</I><DD>
Listet die Architekturen der derzeit hochgeladenen Dateien auf. Gel&auml;ufige
Architekturen sind <B>amd64</B>, <B>armel</B>, <B>i386</B>, usw. Beachten Sie, dass der
Wert <B>all</B> f&uuml;r Pakete gedacht ist, die Architektur-unabh&auml;ngig sind. Falls
die Quellen f&uuml;r das Paket auch hochgeladen werden, ist der besondere Eintrag
<B>source</B> auch vorhanden. Architektur-Platzhalter d&uuml;rfen in der Liste
niemals auftauchen.
<DT id="6"><B>Version:</B> <I>Versionszeichenkette</I> (verpflichtend)<DD>
Typischerweise ist das die Original-Paketversionsnummer, in der Form, die
der Programmautor verwendet. Es kann auch eine Debian-Revisionsnummer
enthalten (f&uuml;r nicht aus Debian stammende Pakete). Das genaue Format und der
Sortieralgorithmus sind in <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7) beschrieben.
<DT id="7"><B>Distribution:</B> <I>Distribution</I>en (verpflichtend)<DD>
Listet eine oder mehrere durch Leerzeichen getrennte Distributiionen auf,
bei denen diese Version installiert werden sollte, wenn es in das Archiv
hochgeladen wird.
<DT id="8"><B>Urgency:</B> <I>Dringlichkeit</I> (empfohlen)<DD>
Die Dringlichkeit des Uploads. Die derzeit bekannten Werte, in aufsteigender
Reihenfolge der Dringlichkeit, sind: <B>low</B>, <B>medium</B>, <B>high</B>, <B>critical</B>
und <B>emergency</B>.
<DT id="9"><B>Maintainer:</B> <I>Vollst&auml;ndiger-Name-und-E-Mail</I> (verpflichtend)<DD>
Sollte in dem Format BqJoe Bloggs &lt;<A HREF="mailto:jbloggs@example.org">jbloggs@example.org</A>&gt;" sein und ist
typischerweise die Person, die das Paket erstellt hat, im Gegensatz zum
Autor der Software, die paketiert wurde.
<DT id="10"><B>Changed-By:</B><I> Vollst&auml;ndiger-Name-und-E-Mail</I><DD>
Sollte in dem Format BqJoe Bloggs &lt;<A HREF="mailto:jbloggs@example.org">jbloggs@example.org</A>&gt;" sein und ist
typischerweise die Person, die die &Auml;nderungen f&uuml;r die Ver&ouml;ffentlichung am
Paket vorgenommen hat.
<DT id="11"><B>Description:</B> (empfohlen)<DD>

<BR>&nbsp;<I>Bin&auml;rpaketname</I>&nbsp;<B>-</B>&nbsp;<I>Bin&auml;rpaketzusammenfassung</I>
Dieses mehrzeilige Feld enth&auml;lt eine Liste von Bin&auml;rpaketnamen, gefolgt von
einem Leerzeichen, einem Gedankenstrich (bq<B>-</B>') und ihren, m&ouml;glicherweise
abgeschnittenen, Kurzbeschreibungen. Falls es sich um einen reinen
Quell-Upload handelt, wird dieses Feld ausgelassen (seit Dpkg 1.19.3).
<DT id="12"><B>Closes:</B><I> Fehlernummernliste</I><DD>
Eine durch Leerzeichen getrennte Liste von Fehlerberichtsnummern, die mit
diesem Upload behoben wurden. Die Software des Distributionsarchivs k&ouml;nnte
dieses Feld benutzen, um automatisch die referenzierten Fehlernummern in der
Fehlerdatenbank der Distribution zu schlie&szlig;en.
<DT id="13"><B>Binary-Only: yes</B><DD>
Das Feld kennzeichnet, dass der Upload ein rein bin&auml;rer,
nicht-Betreuer-Upload ist. Er stammt aus dem Schl&uuml;ssel/Werte-Paar
<B>binary-only=yes</B> aus dem Metadateneintrag des Changelogs.
<DT id="14"><B>Built-For-Profiles:</B><I> Profilliste</I><DD>
Das Feld gibt eine durch Leerraum getrennte Liste von Bauprofilen an, unter
denen dieser Upload gebaut wurde.
<DT id="15"><B>Changes:</B> (verpflichtend)<DD>

<I>Changelog-Eintr&auml;ge</I>
Das mehrzeilige Feld enth&auml;lt den aneinandergeh&auml;ngten Text aller
Changelog-Eintr&auml;ge, die Teil dieses Uploads sind. Um ein g&uuml;ltiges
mehrzeiliges Feld zu erhalten, werden leere Zeilen durch ein einzelnen
Satzpunkt (bq.') ersetzt und alle Zeilen mit einem Leerzeichen
einger&uuml;ckt. Der genaue Inhalt h&auml;ngt vom Changelog-Format ab.
<DT id="16"><B>Files:</B> (verpflichtend)<DD>

<BR>&nbsp;<I>Md5sum</I>&nbsp;<I>Gr&ouml;&szlig;e</I>&nbsp;<I>Sektion</I>&nbsp;<I>Priorit&auml;t</I>&nbsp;<I>Dateiname</I>
Das mehrzeilige Feld enth&auml;lt eine Liste der Dateien mit Md5sum, Gr&ouml;&szlig;e,
Sektion und Priorit&auml;t f&uuml;r jede.
<P>
Die erste Zeile des Feldwertes (dem Teil auf der gleichen Zeile wie der von
einem Doppelpunkt gefolgte Feldname) ist immer leer. Der Inhalt des Feldes
wird durch Fortsetzungszeilen ausgedr&uuml;ckt, eine Zeile pro Datei. Jede Zeile
besteht aus durch Leerzeichen getrennten Eintr&auml;gen, die die Datei
beschreiben: die Md5sum, die Dateigr&ouml;&szlig;e, die Datei-Sektion, die
Datei-Priorit&auml;t und der Dateiname.
<P>
Dieses Feld f&uuml;hrt alle Dateien, die den Upload bilden, auf. Die Liste der
Dateien in diesem Feld muss auf die Liste der Dateien in den anderen
zugeh&ouml;rigen <B>Checksums</B>-Feldern passen.
<DT id="17"><B>Checksums-Sha1:</B> (verpflichtend)<DD>

<B>Checksums-Sha256:</B> (verpflichtend)

<BR>&nbsp;<I>Pr&uuml;fsumme</I>&nbsp;<I>Gr&ouml;&szlig;e</I>&nbsp;<I>Dateiname</I>
Diese mehrzeiligen Felder enthalten eine Liste von Dateien mit einer
Pr&uuml;fsumme und Gr&ouml;&szlig;e f&uuml;r jede. Diese Felder haben die gleiche Syntax und
unterscheiden sich nur im verwandten Pr&uuml;fsummenalgorithmus: SHA-1 f&uuml;r
<B>Checksums-Sha1</B> und SHA-256 f&uuml;r <B>Checksums-Sha256</B>.
<P>
Die erste Zeile des Feldwertes (der Teil auf dem durch ein Doppelpunkt
gefolgten Namen) ist immer leer. Der Inhalt des Feldes wird durch
Fortsetzungszeilen ausgedr&uuml;ckt, eine Zeile pro Datei. Jede Zeile besteht aus
durch Leerzeichen getrennten Eintr&auml;gen, die die Datei beschreiben: der
Pr&uuml;fsumme, der Dateigr&ouml;&szlig;e und dem Dateinamen.
<P>
Diese Felder f&uuml;hren alle Dateien auf, aus denen der Upload besteht. Die
Liste der Dateien in diesen Feldern muss zu der Liste in dem Feld <B>Files</B>
und den anderen zugeh&ouml;rigen <B>Checksums</B>-Feldern passen.






</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>FEHLER</H2>

Das Feld <B>Files</B> ist inkonsistent gegen&uuml;ber den anderen
<B>Checksums</B>-Feldern. Die Felder <B>Changed-By</B> und <B>Maintainer</B> haben
verwirrende Namen. Das Feld <B>Distribution</B> enth&auml;lt Informationen dar&uuml;ber,
was normalerweise als Suite bezeichnet wird.
<A NAME="lbAG">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7).
<A NAME="lbAH">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="18"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="19"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="20"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="21"><A HREF="#lbAE">FELDER</A><DD>
<DT id="22"><A HREF="#lbAF">FEHLER</A><DD>
<DT id="23"><A HREF="#lbAG">SIEHE AUCH</A><DD>
<DT id="24"><A HREF="#lbAH">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
