
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-triggers</TITLE>
</HEAD><BODY>
<H1>deb-triggers</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb-triggers - Paket-Trigger
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

triggers
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Ein Paket erkl&auml;rt seine Beziehung zu einigen <A HREF="/cgi-bin/man/man2html?n+Trigger">Trigger</A>(n) (deutsch: Ausl&ouml;sern)
indem es eine Datei <I>triggers</I> in seinem Steuerarchiv
(d.h. <I>DEBIAN/triggers</I> w&auml;hrend der Paketerstellung) hinzunimmt.
<P>

Diese Datei enth&auml;lt Direktiven, eine pro Zeile. Leerraumzeichen am Anfang
und Ende sowie alles nach dem ersten <B>#</B> werden in jeder Zeile entfernt und
leere Zeilen werden ignoriert.
<P>

Die derzeit unterst&uuml;tzten Steuerdirektiven f&uuml;r Trigger sind:
<DL COMPACT>
<DT id="1"><B>interest</B> <I>Trigger-Name</I><DD>

<B>interest-await</B> <I>Trigger-Name</I>

<B>interest-noawait</B> <I>Trigger-Name</I>
<DT id="2"><DD>
Gibt an, dass das Paket an dem benannten Trigger interessiert ist. Alle
Trigger, an denen ein Paket interessiert ist, m&uuml;ssen mit dieser Direktive in
der Trigger-Steuerdatei aufgef&uuml;hrt werden.
<DT id="3"><DD>
Die Variante Bqawait" setzt die triggernden Pakete in den Zustand
Bqtriggers-awaited". Die Variante Bqnoawait" setzt die triggernden Pakete
nicht in den Zustand Bqtriggers-awaited", selbst falls das triggernde Paket
eine Bqawait"-Aktivierung deklariert hat (entweder mit den Direktiven
<B>activate-await</B> oder <B>activate</B> oder durch Verwendung der
Befehlszeilenoption <B>dpkg-trigger</B> <B>--no-await</B>). Die Variante Bqnoawait"
sollte verwandt werden, wenn die von den Triggern bereitgestellte
Funktionalit&auml;t nicht &auml;u&szlig;erst wichtig ist.
<DT id="4"><B>activate</B> <I>Trigger-Name</I><DD>

<B>activate-await</B> <I>Trigger-Name</I>

<B>activate-noawait</B> <I>Trigger-Name</I>
<DT id="5"><DD>
Sorgt daf&uuml;r, dass &Auml;nderungen an dem Zustand dieses Pakets einen
spezifizierten Trigger aktiviert. Der Trigger wird am Beginn folgender
Operationen aktiviert: unpack, configure, remove (hinzugef&uuml;gt zum Nutzen von
Paketen, die im Konflikt zueinander stehen), purge und deconfigure.
<DT id="6"><DD>
Die Bqawait"-Varianten setzen das Trigger-ausl&ouml;sende Paket in den Zustand
Bqtriggers-awaited", falls die Direktive Bqinterest" auch Bqawait" ist. Die
Variante Bqnoawait" setzt die triggernden Pakete nicht in den Zustand
Bqtriggers-awaited". Die Variante Bqnoawait" sollte verwandt werden, wenn die
von den Triggern bereitgestellte Funktionalit&auml;t nicht &auml;u&szlig;erst wichtig ist.
<DT id="7"><DD>
Falls dieses Paket w&auml;hrend des Entpackens eines anderen Pakets verschwindet,
wird der Trigger aktiviert, wenn das Verschwinden w&auml;hrend des Endes der
unpack-Operation bemerkt wird. Triggerverarbeitung und &Uuml;berg&auml;nge von
Trigger-erwartend auf installiert f&uuml;hren nicht zu Aktivierungen. Im Falle
von unpack werden sowohl die in der alten als auch die in der neuen Version
des Pakets angegebenen Trigger aktiviert.
</DL>
<P>

Unbekannte Direktiven sind ein Fehler, der die Installation eines Pakets
verhindert.
<P>

Die Variante Bq-noawait" sollte stets wenn m&ouml;glich bevorzugt werden, da die
Trigger-ausl&ouml;senden Pakete nicht in den Zustand &raquo;triggers-awaited&laquo; &uuml;berf&uuml;hrt
werden und daher sofort konfiguriert werden k&ouml;nnen, ohne die Verarbeitung
des Triggers zu verlangen. Falls die Trigger-ausl&ouml;senden Pakete
Abh&auml;ngigkeiten von anderen, im Upgrade befindlichen Paketen sind, wird dies
einen fr&uuml;hzeitigen Lauf der Trigger-Verarbeitung vermeiden und es
erm&ouml;glichen, den Trigger nur einmal als einen der letzten Schrittes des
Upgrades auszuf&uuml;hren.
<P>

Die Varianten Bq-noawait" werden seit Dpkg 1.16.1 unterst&uuml;tzt und bei &auml;lteren
Dpkg zu Fehlern f&uuml;hren.
<P>

Die Alias-Varianten Bq-await" werden seit Dpkg 1.17.21 unterst&uuml;tzt und bei
&auml;lteren Dpkg zu Fehlern f&uuml;hren.
<P>

Wenn ein Paket eine Direktive <B>interest-noawait</B> bereitstellt, wird jede
Aktivierung das triggernde Paket in den Modus Bqnoawait" setzen, unabh&auml;ngig
von dem durch die Aktivierung erbetenen Awaiting-Modus (entweder Bqawait"
oder Bqnoawait"). Wenn ein Paket eine Direktive <B>interest</B> oder
<B>interest-await</B> bereitstellt, werden alle Aktivierungen des triggernden
Paketes in Bqawait" oder Bqnoawait" gebracht, abh&auml;ngig von der Art der
Aktivierung.
<A NAME="lbAE">&nbsp;</A>
<H2>SIEHE AUCH</H2>


<B><A HREF="/cgi-bin/man/man2html?1+dpkg-trigger">dpkg-trigger</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B>/usr/share/doc/dpkg-dev/triggers.txt.gz</B>.
<A NAME="lbAF">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="8"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="9"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="10"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="11"><A HREF="#lbAE">SIEHE AUCH</A><DD>
<DT id="12"><A HREF="#lbAF">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
