
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-control</TITLE>
</HEAD><BODY>
<H1>deb-control</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb-control - Dateiformat der Hauptsteuerdatei von bin&auml;ren Debian-Paketen
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

control
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Jedes bin&auml;re Debian-Paket enth&auml;lt die Hauptsteuerdatei <I>control</I>, die eine
Reihe von Feldern enth&auml;lt. Jedes Feld beginnt mit einer Markierung, wie
<B>Package</B> oder <B>Version</B> (Gro&szlig;-/Kleinschreibung egal), gefolgt von einem
Doppelpunkt und dem K&ouml;rper des Feldes. Felder werden nur durch die
Feldmarkierungen abgegrenzt. Mit anderen Worten, Feldtexte k&ouml;nnen mehrere
Zeilen &uuml;berspannen, aber die Installationswerkzeuge werden im Allgemeinen
die Zeilen bei der Verarbeitung des Feldk&ouml;rpers zusammenfassen (mit Ausnahme
des <B>Description</B>-Feldes, sehen Sie dazu unten).
<A NAME="lbAE">&nbsp;</A>
<H2>FELDER</H2>

<DL COMPACT>
<DT id="1"><B>Package:</B> <I>Paketname</I> (verpflichtend)<DD>
Der Wert dieses Feldes bestimmt den Paketnamen und wird von den meisten
Installationswerkzeugen verwendet, um Dateinamen zu erstellen.
<DT id="2"><B>Package-Type:</B> <B>deb</B>|<B>udeb</B>|<I>type</I><DD>
Dieses Feld definiert die Art des Pakets. <B>udeb</B> ist f&uuml;r gr&ouml;&szlig;enbegrenzte
Pakete, wie sie vom Debian-Installer verwandt werden. <B>deb</B> ist der
Standardwert, er wird angenommen, falls das Feld fehlt. Weitere Typen
k&ouml;nnten in der Zukunft hinzugef&uuml;gt werden.
<DT id="3"><B>Version:</B> <I>Versionszeichenkette</I> (verpflichtend)<DD>
Typischerweise ist das die Original-Paketversionsnummer, in der Form, die
der Programmautor verwendet. Es kann auch eine Debian-Revisionsnummer
enthalten (f&uuml;r nicht aus Debian stammende Pakete). Das genaue Format und der
Sortieralgorithmus sind in <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7) beschrieben.
<DT id="4"><B>Maintainer:</B> <I>Vollst&auml;ndiger-Name-und-E-Mail</I> (empfohlen)<DD>
Sollte in dem Format BqJoe Bloggs &lt;<A HREF="mailto:jbloggs@foo.com">jbloggs@foo.com</A>&gt;" sein und ist
typischerweise die Person, die das Paket erstellt hat, im Gegensatz zum
Autor der Software, die paketiert wurde.
<DT id="5"><B>Description:</B> <I>Kurzbeschreibung</I> (empfohlen)<DD>

<B> </B><I>Langbeschreibung</I>
<BR>

Das Format der Paketbeschreibung ist eine kurze knappe Zusammenfassung auf
der ersten Zeile (nach dem Feld <B>Description</B>). Die folgenden Zeilen
sollten als l&auml;ngere, detailliertere Beschreibung verwendet werden. Jede
Zeile der Langbeschreibung muss von einem Leerzeichen begonnen werden, und
Leerzeilen in der Langbeschreibung m&uuml;ssen einen einzelnen bq<B>.</B>' hinter dem
einleitenden Leerzeichen enthalten.
<DT id="6"><B>Section:</B><I> Sektion</I><DD>
Dies ist ein allgemeines Feld, das dem Paket eine Kategorie gibt, basierend
auf der Software, die es installiert. Einige &uuml;bliche Sektionen sind
<B>utils</B>, <B>net</B>, <B>mail</B>, <B>text</B>, <B>x11</B> usw.
<DT id="7"><B>Priority:</B><I> Priorit&auml;t</I><DD>
Setzt die Bedeutung dieses Pakets in Bezug zu dem Gesamtsystem. &Uuml;bliche
Priorit&auml;ten sind <B>required</B>, <B>standard</B>, <B>optional</B>, <B>extra</B> usw.
</DL>
<P>

Die Felder <B>Section</B> und <B>Priority</B> haben eine definierte Menge an Werten,
abh&auml;ngig von den jeweiligen Distributionsrichtlinien.
<DL COMPACT>
<DT id="8"><B>Installed-Size:</B> Gr&ouml;&szlig;e<DD>
Die ungef&auml;hre Gesamtgr&ouml;&szlig;e der vom Paket installierten Dateien, in Einheiten
von KiB.
<DT id="9"><B>Essential:</B> <B>yes</B>|<B>no</B><DD>
Dieses Feld wird normalerweise nur ben&ouml;tigt, wenn die Antwort <B>yes</B>
lautet. Es bezeichnet ein Paket, das f&uuml;r den ordnungsgem&auml;&szlig;en Betrieb des
Systems ben&ouml;tigt wird. Dpkg oder jedes andere Installationswerkzeug wird es
nicht erlauben, ein <B>Essential</B>-Paket zu entfernen (zumindestens nicht ohne
die Verwendung einer der &raquo;force&laquo;-Optionen).
<DT id="10"><B>Build-Essential:</B> <B>yes</B>|<B>no</B><DD>
Dieses Feld wird normalerweise nur ben&ouml;tigt, wenn die Antwort <B>yes</B> lautet
und es wird typischerweise durch die Archivsoftware eingef&uuml;gt. Es vermerkt
ein Paket, das zum Bau anderer Pakete ben&ouml;tigt wird.
<DT id="11"><B>Architecture:</B> <I>arch</I>|<B>all</B> (empfohlen)<DD>
Die Architektur spezifiziert den Hardwaretyp f&uuml;r den dieses Paket kompiliert
wurde. Gel&auml;ufige Architekturen sind <B>amd64</B>, <B>armel</B>, <B>i386</B>, <B>powerpc</B>
usw. Beachten Sie, dass der Wert <B>all</B> f&uuml;r Pakete gedacht ist, die
Architektur-unabh&auml;ngig sind. Einige Beispiele hierf&uuml;r sind Shell- und
Perl-Skripte und Dokumentation.
<DT id="12"><B>Origin:</B><I> Name</I><DD>
Der Name der Distribution, aus der dieses Paket urspr&uuml;nglich stammt.
<DT id="13"><B>Bugs:</B><I> URL</I><DD>
Die <I>URL</I> der Fehlerdatenbank f&uuml;r dieses Paket. Das derzeit verwendete
Format ist <I>BTS-Art</I><B>://</B><I>BTS-Adresse</I> wie in
<B>debbugs://bugs.debian.org</B>.
<DT id="14"><B>Homepage:</B><I> URL</I><DD>
Die <I>URL</I> des Original- (Upstream-)Projekts.
<DT id="15"><B>Tag:</B> <I> Liste-von-Markierungen</I><DD>
Liste der unterst&uuml;tzten Markierungen (&raquo;Tags&laquo;), die die Eigenschaften des
Pakets beschreiben. Die Beschreibung und die Liste der unterst&uuml;tzten
Markierungen kann in dem Paket <B>debtags</B> gefunden werden.
<DT id="16"><B>Multi-Arch:</B> <B>no</B>|<B>same</B>|<B>foreign</B>|<B>allowed</B><DD>
Dieses Feld wird zum Anzeigen verwandt, wie sich das Paket auf einer
Multi-Arch-Installation verhalten soll.
<DL COMPACT><DT id="17"><DD>
<DL COMPACT>
<DT id="18"><B>no</B><DD>
Dieser Wert ist die Vorgabe, falls das Feld nicht angegeben ist. In diesem
Fall ist das Hinzuf&uuml;gen des Feldes mit dem expliziten Wert <B>no</B> im
allgemeinen nicht notwendig.
<DT id="19"><B>same</B><DD>
Das Paket ist mit sich selbst koinstallierbar, darf aber nicht dazu verwandt
werden, die Abh&auml;ngigkeit irgendeines Pakets von einer anderen Architektur
auf sich zu erf&uuml;llen.
<DT id="20"><B>foreign</B><DD>
Das Paket ist nicht mit sich selbst koinstallierbar, aber es sollte erlaubt
sein, die nichtarchitekturabh&auml;ngige Abh&auml;ngigkeit eines Pakets von einer
anderen Architektur auf sich zu erf&uuml;llen (falls eine Abh&auml;ngigkeit explizit
architekturqualifiziert wurde, dann wird der Wert <B>foreign</B> ignoriert).
<DT id="21"><B>allowed</B><DD>
Dies erlaubt es inversen Abh&auml;ngigkeiten, in ihrem Feld <B>Depends</B>
anzuzeigen, dass sie Pakete von einer fremden Architektur akzeptieren, indem
sie den Paketnamen mit <B>:any</B> qualifizieren. Hat weiter keinen Effekt.
</DL>
</DL>

<DT id="22"><B>Source:</B> <I>Quellname</I> [<B>(</B><I>Quellversion</I><B>)</B>]<DD>
Der Name des Quellpakets, aus dem dieses Bin&auml;rpaket stammt, falls es sich
vom Namen des Pakets selbst unterscheidet. Falls die Quellversion sich von
der Bin&auml;rversion unterscheidet, folgt dem <I>Quellnamen</I> in Klammern eine
<I>Quellversion</I>. Dies kann zum Beispiel bei einem rein-bin&auml;ren, nicht
Betreuer-Upload passieren, oder wenn mittels Bq<B>dpkg-gencontrol -v</B>" eine
andere Bin&auml;rversion gesetzt wird.
<DT id="23"><B>Subarchitecture:</B> <I> Wert</I><DD>

<B>Kernel-Version:</B> <I> Wert</I>

<B>Installer-Menu-Item:</B> <I> Wert</I>
Diese Felder werden im Debian-Installer verwandt und werden normalerweise
nicht ben&ouml;tigt. Lesen Sie /usr/share/doc/debian-installer/devel/modules.txt
aus dem Paket <B>debian-installer</B> f&uuml;r weitere Informationen &uuml;ber sie.
<P>
<DT id="24"><B>Depends:</B> <I> Paketliste</I><DD>
Liste von Paketen, die ben&ouml;tigt werden, damit dieses Paket eine
nicht-triviale Menge an Funktionen anbieten kann. Die
Paketverwaltungssoftware wird es nicht erlauben, dass ein Paket installiert
wird, falls die in seinem <B>Depends</B>-Feld aufgef&uuml;hrten Pakete nicht
installiert sind (zumindestens nicht ohne Verwendung der
&raquo;Force&laquo;-Optionen). Bei einer Installation werden Postinst-Skripte von
Paketen, die im Feld <B>Depends</B> aufgef&uuml;hrt sind, vor den Postinst-Skripten
der eigentlichen Pakete ausgef&uuml;hrt. Bei der gegenteiligen Operation, der
Paket-Entfernung, wird das Prerm-Skript eines Paketes vor den Prerm-Skripten
der Pakete ausgef&uuml;hrt, die im Feld <B>Depends</B> aufgef&uuml;hrt sind.
<DT id="25"><B>Pre-Depends:</B> <I> Paketliste</I><DD>
Liste an Paketen die installiert <B>und</B> konfiguriert sein m&uuml;ssen, bevor
dieses Paket installiert werden kann. Dies wird normalerweise in dem Fall
verwendet, wo dieses Paket ein anderes Paket zum Ausf&uuml;hren seines
preinst-Skriptes ben&ouml;tigt.
<DT id="26"><B>Recommends:</B> <I> Paketliste</I><DD>
Liste an Paketen, die in allen, abgesehen von ungew&ouml;hnlichen, Installationen
zusammen angefunden w&uuml;rden. Die Paketverwaltungssoftware wird den Benutzer
warnen, falls er ein Paket ohne die im <B>Recommends</B>-Feld aufgef&uuml;hrten
Pakete installiert.
<DT id="27"><B>Suggests:</B> <I> Paketliste</I><DD>
Liste an Paketen die einen Bezug zu diesem haben und vielleicht seine
N&uuml;tzlichkeit erweitern k&ouml;nnten, aber ohne die das zu installierende Paket
perfekt sinnvoll ist.
</DL>
<P>

Die Syntax der <B>Depends</B>, <B>Pre-Depends</B>, <B>Recommends</B> und
<B>Suggests</B>-Felder ist eine Liste von Gruppen von alternativen Paketen. Jede
Gruppe ist eine Liste von durch vertikale Striche (oder BqPipe"-Symbole)
bq<B>|</B>' getrennte Pakete. Die Gruppen werden durch Kommata getrennt. Kommata
m&uuml;ssen als BqUND", vertikale Striche als BqODER" gelesen werden, wobei die
vertikalen Striche st&auml;rker binden. Jeder Paketname wird optional gefolgt von
einer Architektur-Spezifikation, die nach einem Doppelpunkt &raquo;:&laquo; angeh&auml;ngt
wird, optional gefolgt von einer Versionsnummer-Spezifikation in Klammern.
<P>

Eine Architektur-Spezifikation kann eine echte Debian-Architektur sein (seit
Dpkg 1.16.5) oder <B>any</B> (seit Dpkg 1.16.2). Falls sie fehlt, ist die
Vorgabe die aktuelle Programmpaketarchitektur. Ein echter
Debian-Architekturname wird genau auf diese Architektur f&uuml;r diesen
Paketnamen passen, <B>any</B> wird auf jede Architektur f&uuml;r diesen Paketnamen
passen, falls das Paket als <B>Multi-Arch: allowed</B> markiert wurde.
<P>

Eine Versionsnummer kann mit bq<B>&gt;&gt;</B>' beginnen, in diesem Falle
passen alle neueren Versionen, und kann die Debian-Paketrevision (getrennt
durch einen Bindestrich) enthalten oder auch nicht. Akzeptierte
Versionsbeziehungen sind bq<B>&gt;&gt;</B>' f&uuml;r gr&ouml;&szlig;er als, bq<B>&lt;&lt;</B>' f&uuml;r
kleiner als, bq<B>&gt;=</B>' f&uuml;r gr&ouml;&szlig;er als oder identisch zu, bq<B>&lt;=</B>' f&uuml;r
kleiner als oder identisch zu und bq<B>=</B>' f&uuml;r identisch zu.
<DL COMPACT>
<DT id="28"><B>Breaks:</B> <I> Paketliste</I><DD>
Liste Paketen auf, die von diesem Paket besch&auml;digt werden, zum Beispiel in
dem sie Fehler zug&auml;nglich machen, wenn sich das andere Paket auf dieses
Paket verl&auml;sst. Die Paketverwaltungssoftware wird es besch&auml;digten Paketen
nicht erlauben, sich zu konfigurieren; im Allgemeinen wird das Problem
behoben, indem ein Upgrade des im <B>Breaks</B>-Feld aufgef&uuml;hrten Pakets
durchgef&uuml;hrt wird.
<DT id="29"><B>Conflicts:</B> <I> Paketliste</I><DD>
Liste an Paketen, die mit diesem in Konflikt stehen, beispielsweise indem
beide Dateien den gleichen Namen enthalten. Die Paketverwaltungssoftware
wird es nicht erlauben, Pakete, die in Konflikt stehen, gleichzeitig zu
installieren. Zwei in Konflikt stehende Pakete sollten jeweils eine
<B>Conflicts</B>-Zeile enthalten, die das andere Paket erw&auml;hnen.
<DT id="30"><B>Replaces:</B> <I>Paketliste</I><DD>
Liste an Paketen, von denen dieses Dateien ersetzt. Dies wird dazu
verwendet, um diesem Paket zu erlauben, Dateien von einem anderen Paket zu
ersetzen und wird gew&ouml;hnlich mit dem <B>Conflicts</B>-Feld verwendet, um die
Entfernung des anderen Paketes zu erlauben, falls dieses auch die gleichen
Dateien wie das im Konflikt stehende Paket hat.
</DL>
<P>

Die Syntax von <B>Breaks</B>, <B>Conflicts</B> und <B>Replaces</B> ist eine Liste von
Paketnamen, getrennt durch Kommata (und optionalen Leerraumzeichen). Im
<B>Breaks</B>- und <B>Conflicts</B>-Feld sollte das Komma als BqODER" gelesen
werden. Eine optionale Architektur-Spezifikation kann mit der gleichen
Syntax wie oben an den Paketnamen angeh&auml;ngt werden; der Vorgabewert ist
allerdings <B>any</B> statt der Architektur des Programms. Eine optionale
Version kann auch mit der gleichen Syntax wie oben f&uuml;r die <B>Breaks</B>-,
<B>Conflicts</B>- und <B>Replaces</B>-Felder angegeben werden.
<DL COMPACT>
<DT id="31"><B>Enhances:</B> <I> Paketliste</I><DD>
Dies ist eine Liste von Paketen, die dieses Paket erweitert. Es ist &auml;hnlich
<B>Suggests</B>, aber in der umgekehrten Richtung.
<DT id="32"><B>Provides:</B> <I> Paketliste</I><DD>
Dies ist eine Liste von virtuellen Paketen, die dieses Paket
bereitstellt. Gew&ouml;hnlich wird dies verwendet, wenn mehrere Pakete alle den
gleichen Dienst bereitstellen. Beispielsweise k&ouml;nnen Sendmail und Exim als
Mailserver dienen, daher stellen sie ein gemeinsames Paket
(Bqmail-transport-agent") bereit, von dem andere Pakete abh&auml;ngen k&ouml;nnen. Dies
erlaubt es Sendmail oder Exim als g&uuml;ltige Optionen zur Erf&uuml;llung der
Abh&auml;ngigkeit zu dienen. Dies verhindert, dass Pakete, die von einem
E-Mail-Server abh&auml;ngen, alle Paketnamen f&uuml;r alle E-Mail-Server wissen und
bq<B>|</B>' zur Unterteilung der Liste verwenden m&uuml;ssen.
</DL>
<P>

Die Syntax von <B>Provides</B> ist eine Liste von Paketnamen, getrennt durch
Kommata (und optionalen Leerraumzeichen). Eine optionale
Architektur-Spezifikation kann mit der gleichen Syntax wie oben an den
Paketnamen angeh&auml;ngt werden. Falls diese fehlt, ist die Vorgabe die bin&auml;re
Paketarchitektur. Eine optionale genaue (identisch mit) Version kann auch
mit der gleichen Syntax wie oben angegeben werden (seit Dpkg 1.17.11
ber&uuml;cksichtigt).
<DL COMPACT>
<DT id="33"><B>Built-Using:</B> <I> Paketliste</I><DD>
Dieses Feld f&uuml;hrt zus&auml;tzliche Quellpakete auf, die w&auml;hrend des Baus des
Bin&auml;rpakets verwandt wurden. Dies dient als Hinweis f&uuml;r die
Archivverwaltungssoftware, dass zus&auml;tzliche Quellpakete vorhanden bleiben
m&uuml;ssen, w&auml;hrend dieses Bin&auml;rpaket betreut wird. Dieses Feld muss eine Liste
von Quellpaketnamen enthalten, bei denen eine strenge Versionsbeziehung
bq<B>=</B>' angegeben ist. Beachten Sie, dass die Archivverwaltungssoftware
wahrscheinlich einen Upload ablehnen wird, bei dem eine
<B>Built-Using</B>-Beziehung angegeben wurde, die innerhalb des Archivs nicht
erf&uuml;llt werden kann.
<DT id="34"><B>Built-For-Profiles:</B><I> Profilliste (veraltet)</I><DD>
Dieses Feld legte eine durch Leerraumzeichen getrennte Liste von Bauprofilen
fest, unter denen dieses Programmpaket gebaut wurde (von Dpkg 1.17.2 bis
1.18.18). Die bisher in diesem Feld gefundenen Informationen k&ouml;nnen jetzt in
der Datei <B>.buildinfo</B> gefunden werden, die es ersetzt.
<DT id="35"><B>Auto-Built-Package:</B><I> Begr&uuml;ndungsliste</I><DD>
Dieses Feld legt eine durch Leerraumzeichen getrennte Liste von Begr&uuml;ndungen
fest, warum dieses Paket automatisch erstellt wurde. Bin&auml;rpakete, die mit
diesem Feld markiert wurden, werden nicht in der Hauptquellsteuerdatei
<I>debian/control</I> auftauchen. Die einzige derzeit verwandte Begr&uuml;ndung ist
<B>debug-symbols</B>.
<DT id="36"><B>Build-Ids:</B><I> ELF-Baukennungsliste </I><DD>
Das Feld gibt eine durch Leerraum getrennte Liste von ELF-Baukennugen
an. Dies sind eindeutige Kennzeichner f&uuml;r semantisch identische ELF-Objekte,
f&uuml;r jedes von diesen innerhalb des Pakets.
Das Format oder die Art, jede Baukennung zu berechnen, ist designbedingt
nicht festgelegt.
</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>BEISPIEL</H2>


<PRE>
Package: grep
Essential: yes
Priority: required
Section: base
Maintainer: Wichert Akkerman &lt;<A HREF="mailto:wakkerma@debian.org">wakkerma@debian.org</A>&gt;
Architecture: sparc
Version: 2.4-1
Pre-Depends: libc6 (&gt;= 2.0.105)
Provides: rgrep
Conflicts: rgrep
Description: GNU grep, egrep und fgrep.
 Die GNU-Familie der Grep-Werkzeuge k&ouml;nnte die &raquo;schnellste im Westen&laquo; sein.
 GNU Grep basiert auf einem schellen &raquo;lazy-state deterministic matcher&laquo;
 (rund zweimal so schnell wie der standardm&auml;&szlig;ige Unix-Egrep) hybridisiert
 mit einer Boyer-Moore-Gosper-Suche f&uuml;r eine feste Zeichenkette, die
 unm&ouml;glichen Text von der Betrachtung durch den vollen &raquo;Matcher&laquo; verhindert
 ohne notwendigerweise jedes Zeichen anzuschauen. Das Ergebnis ist
 typischerweise um ein mehrfaches Schneller als Unix Grep oder Egrep.
 (Regul&auml;re Ausdr&uuml;cke, die R&uuml;ckreferenzierungen enthalten, werden allerdings
 langsamer laufen.)
</PRE>


<A NAME="lbAG">&nbsp;</A>
<H2>FEHLER</H2>

Das Feld <B>Build-Ids</B> verwendet einen eher generischen Namen aus seinem
urspr&uuml;nglichen Zusammenhang innerhalb eines ELF-Objektes, das einem sehr
speziellen Zweck und ausf&uuml;hrbaren Format dient.
<A NAME="lbAH">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb">deb</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+debtags">debtags</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1).
<A NAME="lbAI">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="37"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="38"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="39"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="40"><A HREF="#lbAE">FELDER</A><DD>
<DT id="41"><A HREF="#lbAF">BEISPIEL</A><DD>
<DT id="42"><A HREF="#lbAG">FEHLER</A><DD>
<DT id="43"><A HREF="#lbAH">SIEHE AUCH</A><DD>
<DT id="44"><A HREF="#lbAI">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
