
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-buildinfo</TITLE>
</HEAD><BODY>
<H1>deb-buildinfo</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb-buildinfo - Format der Bauinformationsdateien von Debian
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<I>Dateiname</I><B>.buildinfo</B>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Jeder Bau eines Debian-Quellpakets kann die Bauinformationen in einer
<B>.buildinfo</B>-Steuerdatei aufzeichnen. Diese enth&auml;lt eine Reihe von
Feldern. Jedes Feld beginnt mit einer Markierung, wie <B>Source</B> oder
<B>Binary</B> (Gro&szlig;-/Kleinschreibung ist egal), gefolgt von einem Doppelpunkt
und dem Inhalt des Feldes. Felders werden nur durch Feldmarkierungen
begrenzt. Mit anderen Worten, Felder k&ouml;nnen mehrere Zeilen umfasssen, aber
die Installationswerkzeuge werden im Allgemeinen die Zeilen bei der
Verarbeitung des Feldinhaltes zusammenfassen (au&szlig;er im Falle der
mehrzeiligen Felder <B>Binary-Only-Changes</B>, <B>Installed-Build-Depends</B>,
<B>Environment</B>, <B>Checksums-Md5</B>, <B>Checksums-Sha1</B> und <B>Checksums-Sha256</B>,
siehe unten).
<P>

Die Steuerdaten k&ouml;nnen in eine Signatur mit einer wie in RFC4880
spezifizierten OpenPGP-ASCII-H&uuml;lle eingeschlossen sein.
<P>

Der Name der <B>.buildinfo</B>-Datei wird von der Art des Baus abh&auml;ngen und wird
so spezifisch wie notwendig sein, aber nicht mehr; f&uuml;r einen Bau, der <B>any</B>
enth&auml;lt, wird der Name
<I>Quellname</I><B>_</B><I>Bin&auml;rversion</I><B>_</B><I>Arch</I><B>.buildinfo</B> oder andernfalls f&uuml;r
einen Bau, der <B>all</B> enth&auml;lt, wird der Name
<I>Quellname</I><B>_</B><I>Quellversion</I><B>_</B><B>all.buildinfo</B> oder andernfalls f&uuml;r
einen Bau, der <B>source</B> enth&auml;lt, wird der Name
<I>Quellname</I><B>_</B><I>Bin&auml;rversion</I><B>_</B><B>source.buildinfo</B> lauten.
<A NAME="lbAE">&nbsp;</A>
<H2>FELDER</H2>

<DL COMPACT>
<DT id="1"><B>Format:</B> <I>Formatversion</I> (verpflichtend)<DD>
Das Wert dieses Feldes legt die Formatversion der Datei fest. Die Syntax des
Feldwertes ist eine Versionsnummer mit einer Haupt- und einer
Nebenkomponente. R&uuml;ckw&auml;rtsinkompatible &Auml;nderungen im Format f&uuml;hren zu einer
Erh&ouml;hung der Hauptversion und r&uuml;ckw&auml;rtskompatible &Auml;nderungen (wie die
Aufnahme neuer Felder) f&uuml;hren zu einer Erh&ouml;hung der Nebenversion. Die
aktuelle Formatversion ist <B>1.0</B>.
<DT id="2"><B>Source:</B> <I>Quellname</I> [<B>(</B><I>Quellversion</I><B>)</B>] (verpflichtend)<DD>
Der Name des Quellpakets. Falls sich die Quellversion von der Bin&auml;rversion
unterscheidet folgt dem <I>Quellname</I>n in Klammern eine <I>Quellversion</I>. Dies
kann passieren, falls der Bau f&uuml;r einen rein-bin&auml;rern, nicht-Betreuer-Upload
ist.
<DT id="3"><B>Binary:</B> <I>Bin&auml;rpaketliste</I> (verpflichtend)<DD>
Dieses gefaltete Feld ist eine durch Leerzeichen getrennte Liste von
gebauten bin&auml;ren Paketen.
<DT id="4"><B>Architecture:</B> <I>Architekturliste</I> (verpflichtend)<DD>
Dieses, durch Leerzeichen getrennte Feld f&uuml;hrt die Architekturen der derzeit
gebauten Dateien auf. Typische Architekturen sind <B>amd64</B>, <B>armel</B>,
<B>i386</B> usw. Beachten Sie, dass der Wert <B>all</B> f&uuml;r architekturunabh&auml;ngige
Pakete gedacht ist. Falls die Quelle f&uuml;r das Paket auch gebaut wird, ist der
besondere Eintrag <B>source</B> auch vorhanden. Architektur-Platzhalter d&uuml;rfen
in der Liste niemals auftauchen.
<DT id="5"><B>Version:</B> <I>Versionszeichenkette</I> (verpflichtend)<DD>
Typischerweise ist das die Original-Paketversionsnummer, in der Form, die
der Programmautor verwendet. Es kann auch eine Debian-Revisionsnummer
enthalten (f&uuml;r nicht aus Debian stammende Pakete). Das genaue Format und der
Sortieralgorithmus sind in <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7) beschrieben.
<DT id="6"><B>Binary-Only-Changes:</B><DD>

<I>Changelog-Eintrag</I>
Das mehrzeilige Feld enth&auml;lt den aneinandergeh&auml;ngten Text des
Changelog-Eintrages eines rein bin&auml;ren, nicht-Betreuer-Uploads (binNMU),
falls dies der Fall ist. Um ein g&uuml;ltiges mehrzeiliges Feld zu erhalten,
werden leere Zeilen durch ein einzelnen Satzpunkt (bq.') ersetzt und alle
Zeilen mit einem Leerzeichen einger&uuml;ckt. Der genaue Inhalt h&auml;ngt vom
Changelog-Format ab.
<DT id="7"><B>Checksums-Md5:</B> (verpflichtend)<DD>

<B>Checksums-Sha1:</B> (verpflichtend)

<B>Checksums-Sha256:</B> (verpflichtend)

<BR>&nbsp;<I>Pr&uuml;fsumme</I>&nbsp;<I>Gr&ouml;&szlig;e</I>&nbsp;<I>Dateiname</I>
Diese mehrzeiligen Felder enthalten eine Liste von Dateien mit einer
Pr&uuml;fsumme und Gr&ouml;&szlig;e f&uuml;r jede. Diese Felder haben die gleiche Syntax und
unterscheiden sich nur im verwandten Pr&uuml;fsummenalgorithmus: MD5 f&uuml;r
<B>Checksums-Md5</B>, SHA-1 f&uuml;r <B>Checksums-Sha1</B> und SHA-256 f&uuml;r
<B>Checksums-Sha256</B>.
<P>
Die erste Zeile des Feldwertes (der Teil auf dem durch ein Doppelpunkt
gefolgten Namen) ist immer leer. Der Inhalt des Feldes wird durch
Fortsetzungszeilen ausgedr&uuml;ckt, eine Zeile pro Datei. Jede Zeile besteht aus
durch Leerzeichen getrennten Eintr&auml;gen, die die Datei beschreiben: der
Pr&uuml;fsumme, der Dateigr&ouml;&szlig;e und dem Dateinamen.
<P>
Diese Datei f&uuml;hrt alle Dateien auf, aus denen der Bau besteht.
<DT id="8"><B>Build-Origin:</B> <I>Name</I><DD>
Der Name der Distribution, aus der dieses Paket urspr&uuml;nglich stammt.
<DT id="9"><B>Build-Architecture:</B> <I>Arch</I> (verpflichtend)<DD>
Die Debian-Architektur f&uuml;r die Installation, unter der das Paket gebaut
wurde. Typische Architekturen sind <B>amd64</B>, <B>armel</B>, <B>i386</B>, usw.
<DT id="10"><B>Build-Date:</B> <I>Baudatum</I><DD>
Das Datum, an dem das Paket letztmalig gebaut wurde. Es muss im gleichen
Format wie in einem Eintrag bei <B><A HREF="/cgi-bin/man/man2html?5+deb-changelog">deb-changelog</A></B>(5) sein.
<DT id="11"><B>Build-Kernel-Version:</B> <I>Bau-Kernel-Version</I><DD>
Die Ver&ouml;ffentlichung und die Version (in einem nicht festgelegten Format)
des auf dem Bausystem laufenden Kernels. Dieses Feld ist nur vorhanden,
falls der Bauende es explizit angefordert hat, um zu verhindern, dass
vertrauliche Informationen versehentlich ver&ouml;ffentlicht werden.
<DT id="12"><B>Build-Path:</B> <I>Baupfad</I><DD>
Der absolute Baupfad, der dem entpackten Quellbaum entspricht. Dieses Feld
ist nur vorhanden, falls der Lieferant das Feld &uuml;ber ein Muster
freigeschaltet hat, um zu verhindern, dass vertrauliche Informationen
versehentlich ver&ouml;ffentlicht werden.
<P>
Unter Debian und abgeleiteten Distributionen werden nur Baupfade, die mit
<I>/build/</I> beginnen, dieses Feld ausgeben.
<DT id="13"><B>Build-Tainted-By:</B><DD>

<I>taint-reason-list</I>
Dieses gefaltete Feld enth&auml;lt eine durch Leerzeichen getrennte, nicht
abschlie&szlig;ende Liste von Markierungen (die durch alphanumerische und
Bindestrichzeichen aufgebaut werden), die identifizieren, warum der aktuelle
Bau unsauber (tainted) wurde (seit Dpkg 1.19.5).
<DT id="14"><DD>
Unter Debian und abgeleiteten Distributionen k&ouml;nnen die folgenden
Begr&uuml;ndungsmarkierungen ausgeben werden.
<DL COMPACT><DT id="15"><DD>
<DL COMPACT>
<DT id="16"><B>merged-usr-via-symlinks</B><DD>
Das System hat ein mittels Symlinks zusammengef&uuml;hrtes <I>/usr</I>. Dies wird
<B>dpkg-query</B>, <B>dpkg-statoverride</B>, <B>dpkg-trigger</B>, <B>update-alternatives</B>
und weitere Werkzeuge, die Pfadnamen als Schl&uuml;ssel in ihren Datenbanken
verwenden, durcheinanderbringen, da es Dateisystem-Alias-Probleme erzeugt
und bringt das Verst&auml;ndnis, das <B>dpkg</B> in seiner Datenbank aufnotiert hat,
durcheinander. F&uuml;r Bausysteme, die Pfadnamen auf bestimmte Programme oder
Bibliotheken auf den enstandenen Artefakten hartkodieren, kann dies auch zu
Paketen f&uuml;hren, die mit nichtzusammengef&uuml;hrten usr-Dateisystemen
inkompatibel sind.
<DT id="17"><B>usr-local-has-configs</B><DD>
Das System hat Konfigurationsdateien unter <I>/usr/local/etc</I>.
<DT id="18"><B>usr-local-has-includes</B><DD>
Das System hat Header-Dateien unter <I>/usr/local/include</I>.
<DT id="19"><B>usr-local-has-programs</B><DD>
Das System hat Programme unter <I>/usr/local/bin</I> oder <I>/usr/local/sbin</I>.
<DT id="20"><B>usr-local-has-libraries</B><DD>
Das System hat Bibliotheken, entweder statische oder Laufzeit-, unter
<I>/usr/local/lib</I>.
</DL>
</DL>

<DT id="21"><B>Installed-Build-Depends:</B> (verpflichtend)<DD>

<I>Paketliste</I>
Die Liste der installierten und konfigurierten Pakete, die den Bauprozess
des Pakets beeinflussen k&ouml;nnten.
<P>
Die Liste besteht aus jedem Paketnamen, optional architekturqualifiziert f&uuml;r
fremde Architekturen, mit einer genauen Versionseinschr&auml;nkung, getrennt
durch Kommata.
<P>
Die Liste enth&auml;lt alle essenziellen Pakete, die in Quell-Steuerfeldern
<B>Build-Depends</B>, <B>Build-Depends-Arch</B>, <B>Build-Depends-Indep</B> aufgef&uuml;hrten
Pakete, alle Lieferanten-spezifischen eingebauten Abh&auml;ngigkeiten und alle
ihre rekursiven Abh&auml;ngigkeiten. Unter Debian und abgeleiteten Distributionen
ist die eingebaute Abh&auml;ngigkeit <B>build-essential</B>.
<P>
F&uuml;r Abh&auml;ngigkeiten aus den Quellsteuerfeldern werden alle
Abh&auml;ngigkeitsalternativen und alle Anbieter abh&auml;ngiger virtueller Pakete mit
aufgenommen.
<DT id="22"><B>Umgebung</B><DD>

<I>Variablenliste</I>
Die Liste der Umgebungsvariablen, die bekannterma&szlig;en den Paketbauprozess
beeinflussen, wobei jede Umgebungsvariable von einem Gleichheitszeichen
(,=') und dem mit R&uuml;ckw&auml;rtsschr&auml;gstrichen (,\\') maskierte Wert in
doppelten Anf&uuml;hrungszeichen (,=') gefolgt wird.






</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-changes">deb-changes</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-genbuildinfo">dpkg-genbuildinfo</A></B>(1).
<A NAME="lbAG">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="23"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="24"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="25"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="26"><A HREF="#lbAE">FELDER</A><DD>
<DT id="27"><A HREF="#lbAF">SIEHE AUCH</A><DD>
<DT id="28"><A HREF="#lbAG">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
