
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb-src-control</TITLE>
</HEAD><BODY>
<H1>deb-src-control</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb-src-control - Dateiformat der Hauptsteuerdatei von Debian-Quellpaketen
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

debian/control
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Jedes Debian-Quellpaket enh&auml;lt die Hauptsteuerdatei Bqcontrol", die
mindestens zwei Abs&auml;tze enth&auml;lt, die durch eine Leerzeile getrennt
werden. Der erste Absatz f&uuml;hrt alle allgemeinen Informationen &uuml;ber das
Quellpaket auf, w&auml;hrend jeder folgende Absatz genau ein Bin&auml;rpaket
beschreibt. Jeder Absatz besteht aus mindestens einem Feld. Ein Feld beginnt
mit einem Feldnamen, wie <B>Package</B> oder <B>Section</B> (Gro&szlig;-/Kleinschreibung
egal), gefolgt von einem Doppelpunkt, dem Inhalt des Feldes und einem
Zeilenumbruch. Mehrzeilige Felder sind auch erlaubt, aber jede erg&auml;nzende
Zeile ohne Feldnamen sollte mit mindestens einem Leerzeichen beginnen. Der
Inhalt des mehrzeiligen Feldes wird durch die Werkzeuge im Allgemeinen zu
einer Zeile zusammengef&uuml;hrt (das Feld <B>Description</B> ist eine Ausnahme,
siehe unten). Um Leerzeilen in ein mehrzeiliges Feld einzuf&uuml;gen, verwenden
Sie einen Satzpunkt nach dem Leerzeichen. Zeilen, die mit bq<B>#</B>' beginnen,
werden als Kommentare betrachtet.
<A NAME="lbAE">&nbsp;</A>
<H2>QUELLPAKET-FELDER</H2>

<DL COMPACT>
<DT id="1"><B>Source:</B> <I>Quellpaketname</I> (verpflichtend)<DD>
Der Wert dieses Feldes ist der Name des Quellpakets und sollte mit dem Namen
des Quellpakets in der Datei debian/changelog &uuml;bereinstimmen. Ein Paketname
darf nur aus Kleinbuchstaben (a-z), Ziffern (0-9), Plus- (+) und
Minuszeichen (-) und Satzpunkten (.) bestehen. Paketnamen m&uuml;ssen mindestens
zwei Zeichen lang sein und mit einem klein geschriebenen alphanumerischen
Zeichen (a-z0-9) beginnen.
<P>
<DT id="2"><B>Maintainer:</B> <I>Vollst&auml;ndiger-Name-und-E-Mail</I> (empfohlen)<DD>
Sollte in dem Format BqJoe Bloggs &lt;<A HREF="mailto:jbloggs@foo.com">jbloggs@foo.com</A>&gt;" sein und
verweist auf die Person, die derzeit das Paket betreut, im Gegensatz zum
Autor der Software, die paketiert wurde, oder dem urspr&uuml;nglichen Paketierer.
<P>
<DT id="3"><B>Uploaders:</B><I> Vollst&auml;ndiger-Name-und-E-Mail</I><DD>
Listet die Namen und E-Mail-Adressen der Ko-Betreuer des Pakets auf, im
gleichen Format wie das Feld <B>Maintainer</B>. Mehrere Ko-Betreuer sollten
durch Kommata getrennt werden.
<P>
<DT id="4"><B>Standards-Version:</B> <I> Versionszeichenkette</I><DD>
Dies dokumentiert die neuste Version der Standards der Distribution, an den
sich das Paket h&auml;lt.
<P>
<DT id="5"><B>Description</B><I> Kurzbeschreibung</I><DD>

<B> </B><I>Langbeschreibung</I>
Das Format der Quellpaketbeschreibung ist eine kurze knappe Zusammenfassung
auf der ersten Zeile (nach dem Feld <B>Description</B>). Die folgenden Zeilen
sollten als l&auml;ngere, detailliertere Beschreibung verwendet werden. Jede
Zeile der Langbeschreibung muss von einem Leerzeichen begonnen werden, und
Leerzeilen in der Langbeschreibung m&uuml;ssen einen einzelnen bq<B>.</B>' hinter dem
einleitenden Leerzeichen enthalten.
<P>
<DT id="6"><B>Homepage:</B><I> URL</I><DD>
Die URL des Original- (Upstream-)Projekts.
<P>
<DT id="7"><B>Bugs:</B><I> URL</I><DD>
Die <I>URL</I> der Fehlerdatenbank f&uuml;r dieses Paket. Das derzeit verwendete
Format ist <I>BTS-Art</I><B>://</B><I>BTS-Adresse</I> wie in
<B>debbugs://bugs.debian.org</B>. Dieses Feld wird normalerweise nicht ben&ouml;tigt.
<P>
<DT id="8"><B>Rules-Requires-Root:</B> <B>no</B>|<B>binary-targets</B>|<I>impl-keywords</I><DD>
Dieses Feld wird verwandt, um anzuzeigen, ob die Datei <B>debian/rules</B>
(fake)root-Priviliegien ben&ouml;tigt, um einige ihrer Ziele auszuf&uuml;hren, und
falls ja, wann.
<DL COMPACT><DT id="9"><DD>
<DL COMPACT>
<DT id="10"><B>no</B><DD>
Die Bin&auml;rziele werden &uuml;berhaupt kein (fake)root ben&ouml;tigen.
<DT id="11"><B>binary-targets</B><DD>
Die Bin&auml;rziele m&uuml;ssen immer unter (fake)root ausgef&uuml;hrt werden. Dieser Wert
ist die Vorgabe, wenn die Datei fehlt. Die Aufnahme dieses Feld mit einem
expliziten <B>binary-targets</B> ist zwar streng genommen nicht notwendig,
markiert aber, dass es darauf untersucht wurde.
<DT id="12"><I>Impl-Schl&uuml;sselw&ouml;rter</I><DD>
Dies ist eine durch Leerzeichen getrennte Liste von Schl&uuml;sselw&ouml;rtern, die
festlegen, wann (fake)root ben&ouml;tigt wird.
<P>
Schl&uuml;sselw&ouml;rter bestehen aus <I>Namensraum</I>/<I>F&auml;lle</I>. Der Teil <I>Namensraum</I>
kann kein &raquo;/&laquo; oder Leerraum enthalten. Der Teil <I>F&auml;lle</I> kann kein Leerraum
enthalten. Desweiteren m&uuml;ssen beide Teile ausschlie&szlig;lich aus druckbaren
ASCII-Zeichen bestehen.
<P>
Jedes Werkzeug/Paket wird einen Namensraum nach sich selbst definieren und
eine Reihe von F&auml;llen bereitstellen, in denen (fake)root ben&ouml;tigt wird
(siehe &raquo;Implementation provided keywords&laquo; in <I>rootless-builds.txt</I>).
<P>
Wenn das Feld auf eines der <I>Impl-Schl&uuml;sselw&ouml;rter</I> gesetzt wird, wird das
Bauprogramm eine Schnittstelle bereitstellen, die zur Ausf&uuml;hrung unter
(fake)root verwandt wird (siehe &raquo;Gain Root API&laquo; in <I>rootless-builds.txt</I>).
</DL>
</DL>

<P>
<DT id="13"><B>Testsuite:</B><I> Namenliste</I><DD>

<B>Testsuite-Triggers:</B><I> Paketliste</I>
Diese Felder sind in der Handbuchseite <B><A HREF="/cgi-bin/man/man2html?5+dsc">dsc</A></B>(5) beschrieben, da sie aus
Informationen, die aus <B>debian/tests/control</B> abgeleitet sind, erstellt
oder w&ouml;rtlich in die control-Datei der Quellen kopiert werden.
<P>
<DT id="14"><B>Vcs-Arch*:</B><I> URL</I><DD>

<B>Vcs-Bzr:</B><I> URL</I>

<B>Vcs-Cvs:</B><I> URL</I>

<B>Vcs-Darcs:</B><I> URL</I>

<B>Vcs-Git:</B><I> URL</I>

<B>Vcs-Hg:</B><I> URL</I>

<B>Vcs-Mtn:</B><I> URL</I>

<B>Vcs-Svn:</B><I> URL</I>
Die <I>URL</I> des Versionskontrollsystem-Depots, das f&uuml;r die Betreuung des
Pakets verwandt wird. Derzeit werden <B>Arch</B>, <B>Bzr</B> (Bazaar), <B>Cvs</B>,
<B>Darcs</B>, <B>Git</B>, <B>Hg</B> (Mercurial), <B>Mtn</B> (Monotone) und <B>Svn</B>
(Subversion) unterst&uuml;tzt. Normalerweise zeigt dieses Feld auf die neuste
Version des Pakets, wie den Hauptzweig oder den Trunk.
<P>
<DT id="15"><B>Vcs-Browser:</B><I> URL</I><DD>
Die <I>URL</I> der Webschnittstelle, um das Versionskontrollsystem-Depot
anzuschauen.
<P>
<DT id="16"><B>Origin:</B><I> Name</I><DD>
Der Name der Distribution, aus der dieses Paket urspr&uuml;nglich stammt. Dieses
Feld wird normalerweise nicht ben&ouml;tigt.
<P>
<DT id="17"><B>Section:</B><I> Sektion</I><DD>
Dies ist ein allgemeines Feld, das dem Paket eine Kategorie gibt, basierend
auf der Software, die es installiert. Einige &uuml;bliche Sektionen sind
<B>utils</B>, <B>net</B>, <B>mail</B>, <B>text</B>, <B>x11</B> usw.
<P>
<DT id="18"><B>Priority:</B><I> Priorit&auml;t</I><DD>
Setzt die Bedeutung dieses Pakets in Bezug zu dem Gesamtsystem. &Uuml;bliche
Priorit&auml;ten sind <B>required</B>, <B>standard</B>, <B>optional</B>, <B>extra</B> usw.
<P>
Die Felder <B>Section</B> und <B>Priority</B> haben eine definierte Menge an Werten,
abh&auml;ngig von den jeweiligen Distributionsrichtlinien.
<P>
<DT id="19"><B>Build-Depends:</B><I> Paketliste</I><DD>
Eine Liste der Pakete, die installiert und konfiguriert sein m&uuml;ssen, um das
Paket aus den Quellen zu bauen. Diese Abh&auml;ngigkeiten m&uuml;ssen erf&uuml;llt wein,
wenn bin&auml;re architekturabh&auml;ngige und unabh&auml;ngige und Quellpakete gebaut
werden. Die Aufnahme einer Abh&auml;ngigkeit in diese Liste hat nicht den
gleichen Effekt wie die Aufnahme in <B>Build-Depends-Arch</B> und
<B>Build-Depends-Indep</B>, da die Abh&auml;ngigkeit auch beim Bau des Quellpaketes
erf&uuml;llt sein muss.
<DT id="20"><B>Build-Depends-Arch:</B><I> Paketliste</I><DD>
Identisch zu <B>Build-Depends</B>, wird aber nur zum Bau der
architekturabh&auml;ngigen Pakete ben&ouml;tigt. In diesem Fall sind die
<B>Build-Depends</B> auch installiert. Dieses Feld wurde seit Dpkg 1.16.4
unterst&uuml;tzt; um mit &auml;lteren Dpkg-Versionen zu bauen, sollte stattdessen
<B>Build-Depends</B> verwandt werden.
<P>
<DT id="21"><B>Build-Depends-Indep:</B><I> Paketliste</I><DD>
Identisch zu <B>Build-Depends</B>, wird aber nur zum Bau der
architekturunabh&auml;ngigen Pakete ben&ouml;tigt. In diesem Fall sind die
<B>Build-Depends</B> auch installiert.
<P>
<DT id="22"><B>Build-Conflicts:</B><I> Paketliste</I><DD>
Eine Liste von Paketen, die beim Bau des Pakets nicht installiert sein
sollten, beispielsweise da sie mit dem verwandten Bausystem in Konflikt
geraten. Die Aufnahme einer Abh&auml;ngigkeit in diese Liste hat den gleichen
Effekt wie die Aufnahme in <B>Build-Conflicts-Arch</B> und
<B>Build-Conflicts-Indep</B> mit dem zus&auml;tzlichen Effekt, dass es f&uuml;r reine
Quellen-Bauten verwandt wird.
<P>
<DT id="23"><B>Build-Conflicts-Arch:</B><I> Paketliste</I><DD>
Identisch zu <B>Build-Conflicts</B>, aber nur beim Bau der architekturabh&auml;ngigen
Pakete. Dieses Feld wird seit Dpkg 1.16.4 unterst&uuml;tzt; um mit &auml;lteren
Dpkg-Versionen zu bauen, sollte stattdessen <B>Build-Conflicts</B> verwandt
werden.
<P>
<DT id="24"><B>Build-Conflicts-Indep:</B><I> Paketliste</I><DD>
Identisch zu <B>Build-Conflicts</B>, wird aber nur zum Bau der
architekturunabh&auml;ngigen Pakete ben&ouml;tigt.
<P>
</DL>
<P>

Die Syntax der Felder <B>Build-Depends</B>, <B>Build-Depends-Arch</B> und
<B>Build-Depends-Indep</B> ist eine Liste von Gruppen von alternativen
Paketen. Jede Gruppe ist eine Liste von durch vertikale Striche (oder
BqPipe"-Symbole) bq<B>|</B>' getrennten Paketen. Die Gruppen werden durch Kommata
bq<B>,</B>' getrennt. Sie k&ouml;nnen mit einem abschlie&szlig;enden Komma enden, das beim
Erstellen der Felder f&uuml;r <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) entfernt wird (seit Dpkg
1.10.14). Kommata m&uuml;ssen als BqUND", vertikale Striche als BqODER" gelesen
werden, wobei die vertikalen Striche st&auml;rker binden. Jeder Paketname wird
optional von einer Architektur-Spezifikation gefolgt, die nach einem
Doppelpunkt bq<B>:</B>' angeh&auml;ngt wird, optional gefolgt von einer
Versionsnummer-Spezifikation in Klammern bq<B>(</B>' und bq<B>)</B>', einer
Architekturspezifikation in eckigen Klammern bq<B>[</B>' und bq<B>]</B>' und einer
Einschr&auml;nkungsformel, die aus einer oder mehr Listen von Profilnamen in
spitzen Klammern bq<B>&lt;</B>' und bq<B>&gt;</B>' besteht.
<P>
Syntaxtisch werden die Felder <B>Build-Conflicts</B>, <B>Build-Conflicts-Arch</B>
und <B>Build-Conflicts-Indep</B> durch eine Komma-separierte Liste von
Paketnamen dargestellt, wobei das Komma als BqUND" verstanden wird. Die Liste
kann mit einem abschlie&szlig;enden Komma enden, das beim Erstellen der Felder f&uuml;r
<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) entfernt wird (seit Dpkg 1.10.14). Die Angabe alternativer
Pakete mit dem BqPipe"-Symbol wird nicht unterst&uuml;tzt. Jedem Paketnamen folgt
optional eine Versionnummerangabe in Klammern, eine Architekturspezifikation
in eckigen Klammern und einer Einschr&auml;nkungsformel, die aus einer oder mehr
Listen von Profilnamen in spitzen Klammern besteht.
<P>
Eine Architektur-Spezifikation kann ein echter Debian-Architekturname sein
(seit Dpkg 1.16.5), <B>any</B> (seit Dpkg 1.16.2) oder <B>native</B> (seit Dpkg
1.16.5). Falls er fehlt, ist die Vorgabe f&uuml;r das Feld <B>Build-Depends</B> die
aktuelle Host-Architektur, die Vorgabe f&uuml;r das Feld <B>Build-Conflicts</B> ist
<B>any</B>. Jeder echte Debian-Architekturname passt genau auf diese Architektur
f&uuml;r diesen Paketnamen, <B>any</B> passt auf jede Architektur f&uuml;r diesen
Paketnamen, falls das Paket mit <B>Multi-Arch: allowed</B> markiert ist, und
<B>native</B> passt auf die aktuelle Bau-Architektur, falls das Paket nicht mit
<B>Multi-Arch: foreign</B> markiert ist.
<P>
Eine Versionsnummer kann mit bq<B>&gt;&gt;</B>' beginnen, in diesem Falle
passen alle neueren Versionen, und kann die Debian-Paketrevision (getrennt
durch einen Bindestrich) enthalten oder auch nicht. Akzeptierte
Versionsbeziehungen sind bq<B>&gt;&gt;</B>' f&uuml;r gr&ouml;&szlig;er als, bq<B>&lt;&lt;</B>' f&uuml;r
kleiner als, bq<B>&gt;=</B>' f&uuml;r gr&ouml;&szlig;er als oder identisch zu, bq<B>&lt;=</B>' f&uuml;r
kleiner als oder identisch zu und bq<B>=</B>' f&uuml;r identisch zu.
<P>
Eine Architekturspezifikation besteht aus einer oder mehreren durch
Leerraumzeichen getrennten Architekturnamen. Jedem Namen darf ein
Ausrufezeichen vorangestellt werden, das BqNICHT" bedeutet.
<P>
Eine Einschr&auml;nkungsformel besteht aus einer oder mehrerer durch Leerraum
getrennten Einschr&auml;nkungslisten. Jede Einschr&auml;nkungsliste wird in spitze
Klammern eingeschlossen. Eintr&auml;ge in den Einschr&auml;nkungslisten sind
Bauprofilnamen, getrennt durch Leerraum. Diesen Listen kann ein
Ausrufezeichen vorangestellt werden, das BqNICHT" bedeutet. Eine
Einschr&auml;nkungsformel stellt einen Ausdruck in einer disjunkte Normalform
dar.
<P>
Beachten Sie, dass die Abh&auml;ngigkeiten von Paketen aus der Menge der
<B>build-essential</B> entfallen kann und die Angabe von Baukonflikten gegen sie
nicht m&ouml;glich ist. Eine Liste dieser Pakete befindet sich im Paket
build-essential.
<P>
<P>
<A NAME="lbAF">&nbsp;</A>
<H2>BIN&Auml;RPAKET-FELDER</H2>

<P>
<P>

Beachten Sie, dass die Felder <B>Priority</B>, <B>Section</B> und <B>Homepage</B> sich
auch im Bin&auml;rprogrammabsatz befinden k&ouml;nnen, um die globalen Werte des
Quellpakets zu &uuml;berschreiben.
<P>
<DL COMPACT>
<DT id="25"><B>Package:</B> <I>Bin&auml;rpaketname</I> (verpflichtend)<DD>
Dieses Feld wird zur Angabe des Bin&auml;rpaketnamens verwandt. Es gelten die
gleichen Einschr&auml;nkungen wie beim Quellpaketnamen.
<P>
<DT id="26"><B>Package-Type:</B> <B>deb</B>|<B>udeb</B>|<I>type</I><DD>
Dieses Feld definiert die Art des Pakets. <B>udeb</B> ist f&uuml;r gr&ouml;&szlig;enbegrenzte
Pakete, wie sie vom Debian-Installer verwandt werden. <B>deb</B> ist der
Standardwert, er wird angenommen, falls das Feld fehlt. Weitere Typen
k&ouml;nnten in der Zukunft hinzugef&uuml;gt werden.
<P>
<DT id="27"><B>Architecture:</B> <I>arch</I>|<B>all</B>|<B>any</B> (verpflichtend)<DD>
Die Architektur gibt an, auf welcher Art von Hardware dieses Paket
l&auml;uft. Bei Paketen, die auf allen Architekturen laufen, verwenden Sie den
Wert <B>any</B>. F&uuml;r Pakete, die architekturunabh&auml;ngig sind, wie Shell- und
Perl-Skripte oder Dokumentation, verwenden Sie den Wert <B>all</B>. Um das Paket
f&uuml;r einen bestimmten Satz von Architekturen zu begrenzen, geben Sie die
durch Leerzeichen getrennten Namen der Architekturen an. Es ist auch
m&ouml;glich, Platzhalter f&uuml;r Architekturen in dieser Liste anzugeben (lesen Sie
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-architecture">dpkg-architecture</A></B>(1) f&uuml;r weitere Informationen dazu).
<P>
<DT id="28"><B>Build-Profiles:</B> <I>Einschr&auml;nkungsformel</I><DD>
Dieses Feld legt die Bedingungen fest, zu denen dieses Bin&auml;rpaket (nicht)
baut. Um diese Bedingung auszudr&uuml;cken, wird die Einschr&auml;nkungsformelsyntax
aus dem Feld <B>Build-Depends</B> verwandt.
<P>
Falls der Absatz eines bin&auml;ren Pakets dieses Feld nicht enth&auml;lt, dann
bedeutet dies implizit, dass es mit allen Bauprofilen (darunter auch keinem)
baut.
<P>
Mit anderen Worten: Falls der Absatz eines Bin&auml;rpaketes mit einem nicht
leeren Feld <B>Build-Profiles</B> kommentiert wird, dann wird dieses Bin&auml;rpaket
erstellt, falls und nur falls der Ausdruck in konjunktiver Normalform sich
auf &raquo;wahr&laquo; berechnet.
<P>
<DT id="29"><B>Essential:</B> <B>yes</B>|<B>no</B><DD>

<B>Build-Essential:</B> <B>yes</B>|<B>no</B>

<B>Multi-Arch:</B> <B>same</B>|<B>foreign</B>|<B>allowed</B>|<B>no</B>

<B>Tag:</B> <I> Liste-von-Markierungen</I>

<B>Description:</B> <I>Kurzbeschreibung</I> (empfohlen)
Diese Felder sind in der Handbuchseite <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) beschrieben, da sie
w&ouml;rtlich in die control-Datei des Bin&auml;rpakets kopiert werden.
<P>
<DT id="30"><B>Depends:</B> <I> Paketliste</I><DD>

<B>Pre-Depends:</B> <I> Paketliste</I>

<B>Recommends:</B> <I> Paketliste</I>

<B>Suggests:</B> <I> Paketliste</I>

<B>Breaks:</B> <I> Paketliste</I>

<B>Enhances:</B> <I> Paketliste</I>

<B>Replaces:</B> <I>Paketliste</I>

<B>Conflicts:</B> <I> Paketliste</I>

<B>Provides:</B> <I> Paketliste</I>

<B>Built-Using:</B> <I> Paketliste</I>
Diese Felder geben Beziehungen zwischen Paketen an. Sie werden in der
Handbuchseite <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) erl&auml;utert. In <I>debian/control</I> k&ouml;nnen diese
Felder auch mit einem abschlie&szlig;enden Komma enden (seit Dpkg 1.10.14),
Architekturspezifikations- und -einschr&auml;nkungsformeln enthalten, die alle
beim Erstellen von <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5) reduziert werden.
<P>
<DT id="31"><B>Subarchitecture:</B> <I> Wert</I><DD>

<B>Kernel-Version:</B> <I> Wert</I>

<B>Installer-Menu-Item:</B> <I> Wert</I>
Diese Felder werden im Debian-Installer in <B>udeb</B>s verwandt und werden
normalerweise nicht ben&ouml;tigt. Lesen Sie
/usr/share/doc/debian-installer/devel/modules.txt aus dem Paket
<B>debian-installer</B> f&uuml;r weitere Informationen &uuml;ber sie.
<P>
</DL>
<A NAME="lbAG">&nbsp;</A>
<H2>BENUTZERDEFINIERTE FELDER</H2>

Es ist erlaubt, zus&auml;tzliche benutzerdefinierte Felder zu der Steuerdatei
hinzuzuf&uuml;gen. Die Werkzeuge werden diese Felder ignorieren. Falls Sie
m&ouml;chten, dass diese Felder in die Ausgabedateien, wie das Bin&auml;rpaket,
r&uuml;berkopiert werden sollen, m&uuml;ssen Sie ein angepasstes Namensschema
verwenden: Die Felder sollten mit einem <B>X</B>, gefolgt von Null oder mehreren
Buchstaben aus <B>SBC</B> und einem Gedankenstrich, beginnen.
<P>
<DL COMPACT>
<DT id="32"><B>S</B><DD>
Das Feld wird in der Steuerdatei des Quellpakets auftauchen, siehe
<B><A HREF="/cgi-bin/man/man2html?5+dsc">dsc</A></B>(5).
<DT id="33"><B>B</B><DD>
Das Feld wird in der Steuerdatei des Bin&auml;rpakets auftauchen, siehe
<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5).
<DT id="34"><B>C</B><DD>
Das Feld wird in der Steuerdatei des Uploads (.changes) auftauchen, siehe
<B><A HREF="/cgi-bin/man/man2html?5+deb-changes">deb-changes</A></B>(5).
<P>
</DL>
<P>

Beachten Sie, dass die Pr&auml;fixe <B>X</B>[<B>SBC</B>]<B>-</B> abgeschnitten werden, wenn
die Felder in die Ausgabedateien r&uuml;berkopiert werden. Ein Feld
<B>XC-Approved-By</B> wird als <B>Approved-By</B> in der .changes-Datei und nicht in
der Steuerdatei des Bin&auml;r- und Quellpakets auftauchen.
<P>
Beachten Sie, dass diese Benutzer-definierten Felder den globalen Namensraum
nutzen werden und somit in der Zukunft mit offiziell erkannten Feldern
kollidieren k&ouml;nnten. Um solche m&ouml;glichen Situationen zu vermeiden, k&ouml;nnen
Sie den Feldern <B>Private-</B>, wie in <B>XB-Private-Neues-Feld</B>, voranstellen.
<P>
<A NAME="lbAH">&nbsp;</A>
<H2>BEISPIEL</H2>


<PRE>
# Kommentar
Source: dpkg
Section: admin
Priority: required
Maintainer: Dpkg Developers &lt;<A HREF="mailto:debian-dpkg@lists.debian.org">debian-dpkg@lists.debian.org</A>&gt;
# dieses Feld wird in das Bin&auml;r- und Quellpaket kopiert
XBS-Upstream-Release-Status: stable
Homepage: <A HREF="https://wiki.debian.org/Teams/Dpkg">https://wiki.debian.org/Teams/Dpkg</A>
Vcs-Browser: <A HREF="https://git.dpkg.org/cgit/dpkg/dpkg.git">https://git.dpkg.org/cgit/dpkg/dpkg.git</A>
Vcs-Git: <A HREF="https://git.dpkg.org/git/dpkg/dpkg.git">https://git.dpkg.org/git/dpkg/dpkg.git</A>
Standards-Version: 3.7.3
Build-Depends: pkg-config, debhelper (&gt;= 4.1.81),
 libselinux1-dev (&gt;= 1.28-4) [!linux-any]

Package: dpkg-dev
Section: utils
Priority: optional
Architecture: all
# dies ist ein spezielles Feld im Bin&auml;rpaket
XB-Mentoring-Contact: Raphael Hertzog &lt;<A HREF="mailto:hertzog@debian.org">hertzog@debian.org</A>&gt;
Depends: dpkg (&gt;= 1.14.6), perl5, perl-modules, cpio (&gt;= 2.4.2-2),
 bzip2, lzma, patch (&gt;= 2.2-1), make, binutils, libtimedate-perl
Recommends: gcc | c-compiler, build-essential
Suggests: gnupg, debian-keyring
Conflicts: dpkg-cross (&lt;&lt; 2.0.0), devscripts (&lt;&lt; 2.10.26)
Replaces: manpages-pl (&lt;= 20051117-1)
Description: Debian package development tools
 This package provides the development tools (including dpkg-source)
 required to unpack, build and upload Debian source packages.
 .
 Most Debian source packages will require additional tools to build;
 for example, most packages need make and the C compiler gcc.
</PRE>

<P>
<P>

<A NAME="lbAI">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1)
<A NAME="lbAJ">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="35"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="36"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="37"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="38"><A HREF="#lbAE">QUELLPAKET-FELDER</A><DD>
<DT id="39"><A HREF="#lbAF">BIN&Auml;RPAKET-FELDER</A><DD>
<DT id="40"><A HREF="#lbAG">BENUTZERDEFINIERTE FELDER</A><DD>
<DT id="41"><A HREF="#lbAH">BEISPIEL</A><DD>
<DT id="42"><A HREF="#lbAI">SIEHE AUCH</A><DD>
<DT id="43"><A HREF="#lbAJ">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
