
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb</TITLE>
</HEAD><BODY>
<H1>deb</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb - Debian-Bin&auml;rpaketformat
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<I>Dateiname</I><B>.deb</B>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Das <B>.deb</B>-Format ist das Debian-Bin&auml;rpaketdateiformat. Es wird seit Dpkg
0.93.76 verstanden, und wird standardm&auml;&szlig;ig seit Dpkg1.2.0 und 1.1.1elf
(i386/ELF-Versionen) erzeugt.
<P>

Das hier beschriebene Format wird seit Debian 0.93 verwendet; Details &uuml;ber
das alte Format sind in <B><A HREF="/cgi-bin/man/man2html?5+deb-old">deb-old</A></B>(5) beschrieben.
<A NAME="lbAE">&nbsp;</A>
<H2>FORMAT</H2>

Die Datei ist ein <B>ar</B>-Archiv mit dem magischen Wert
<B>!&lt;arch&gt;</B>. Nur das allgemeine <B>ar</B>-Archivformat wird unterst&uuml;tzt,
ohne Unterst&uuml;tzung von Dateinamenerweiterungen, aber mit Dateinamen, die
einen optionalen abschlie&szlig;enden Schr&auml;gstrich enthalten d&uuml;rfen, deren L&auml;nge
damit auf 15 Zeichen (von den erlaubten 16) begrenzt ist. Dateigr&ouml;&szlig;en sind
auf 10 dezimale ASCII-Ziffern begrenzt, wodurch bis zu ungef&auml;hr 9536,74
MiB-Mitgliedsdateien erlaubt sind.
<P>

Derzeit werden die folgenden <B>tar</B>-Archive erlaubt: alter Stil (V7-)Format,
pre-POSIX-ustar-Format, eine Teilmenge des GNU-Formats (der neue Stil mit
langen Pfadnamen und langen Linknamen, unterst&uuml;tzt seit Dpkg 1.4.1.17; gro&szlig;e
Datei-Metadaten seit Dpkg 1.18.24) und das POSIX-ustar-Format (lange Namen
seit Dpkg 1.15.0 unterst&uuml;tzt). Unbekannte Tar-Typeinstellungen werden als
Fehler betrachtet. Jede Tar-Eintraggr&ouml;&szlig;e innerhalb eines Tar-Archivs ist auf
11 ASCII-Oktalziffern begrenzt; damit sind bis zu 8 GiB-Tar-Eintr&auml;ge
m&ouml;glich. Die Unterst&uuml;tzung der gro&szlig;en Dateimetadaten im GNU-Format
erm&ouml;glicht 95-Bit-Tar-Eintragsgr&ouml;&szlig;en und negative Zeitstempel und
63-Bit-UID, -GID und -Ger&auml;tenummern.
<P>

Das erste Mitglied hei&szlig;t <B>debian-binary</B> und enth&auml;lt eine Reihe von Zeilen,
die durch Zeilenumbr&uuml;che getrennt sind. Derzeit ist nur eine Zeile
vorhanden, die Versionsnummer, <B>2.0</B> zum Zeitpunkt zu dem diese
Handbuchseite geschrieben wurde. Programme, die Archive im neuen Format
lesen, sollten darauf vorbereitet sein, dass sich die Nachkommazahl erh&ouml;ht
und neue Zeilen vorhanden sein k&ouml;nnen, und sollten diese ignorieren, falls
dies der Fall ist.
<P>

Falls sich die Vorkommazahl ge&auml;ndert hat, wurde eine inkompatible &Auml;nderung
durchgef&uuml;hrt und das Programm sollte sich beenden. Falls dies nicht der Fall
ist, dann sollte das Programm sicher fortfahren k&ouml;nnen, es sei denn, ein
unerwartetes Mitglied ist im Archiv (abgesehen vom Ende) gefunden worden,
wie unten beschrieben.
<P>

Das zweite erforderliche Mitglied hei&szlig;t <B>control.tar</B>. Es ist ein
Tar-Archiv (entweder nicht komprimiert (wird seit Dpkg 1.17.6 unterst&uuml;tzt)
oder mit Gzip (mit der Endung <B>.gz</B>) bzw. Xz (mit der Endung <B>.xz</B>, seit
Dpkg 1.17.6 unterst&uuml;tzt) komprimiert), das die Steuerinformationen als eine
Reihe von normalen Dateien enth&auml;lt, von denen die Datei <B>control</B> zwingend
erforderlich ist und die Kern-Steuerinformationen enth&auml;lt. Die Dateien
<B>conffiles</B>, <B>triggers</B>, <B>shlibs</B> und <B>symbols</B> enthalten bestimmte
optionale Steuerinformationen und die Dateien <B>preinst</B>, <B>postinst</B>,
<B>prerm</B> und <B>postrm</B> sind optionale Betreuerskripte. Der Steuer-Tarball
kann optional einen Eintrag f&uuml;r bq<B>.</B>', das aktuelle Verzeichnis, enthalten.
<P>

Das dritte, letzte zwingend ben&ouml;tigte Mitglied hei&szlig;t <B>data.tar</B>. Es enth&auml;lt
das Dateisystem als Tar-Archiv, entweder unkomprimiert (seit Dpkg 1.10.24
unterst&uuml;tzt) oder mit gzip (Dateiendung <B>.gz</B>), xz (Dateiendung <B>.xz</B> seit
Dpkg 1.15.6 unterst&uuml;tzt),bzip2 (Dateiendung <B>.bz2</B>, seit Dpkg 1.10.24
unterst&uuml;tzt) oder lzma (Dateiendung <B>.lzma</B>, seit Dpkg 1.13.25 unterst&uuml;tzt)
komprimiert.
<P>

Diese Mitglieder m&uuml;ssen in genau dieser Reihenfolge auftauchen. Aktuelle
Implementationen sollten zus&auml;tzliche Mitglieder nach <B>data.tar</B>
ignorieren. Weitere Mitglieder k&ouml;nnten in der Zukunft definiert werden und
werden (falls m&ouml;glich) nach diesen drei platziert. Alle zus&auml;tzlichen
Mitglieder, die nach <B>debian-binary</B> und vor <B>control.tar</B> oder
<B>data.tar</B> eingef&uuml;gt werden k&ouml;nnten und die problemlos von &auml;lteren
Programmen ignoriert werden sollten, werden Namen haben, die mit einem
Unterstrich bq<B>_</B>' anfangen.
<P>

Solche neuen Mitglieder, die nicht problemlos ignoriert werden k&ouml;nnen,
werden vor <B>data.tar</B> mit Namen, die nicht mit einem Unterstrich anfangen,
eingef&uuml;gt oder werden (wahrscheinlicher) dazu f&uuml;hren, dass die
Hauptversionsnummer erh&ouml;ht wird.
<A NAME="lbAF">&nbsp;</A>
<H2>MEDIENTYP</H2>

<A NAME="lbAG">&nbsp;</A>
<H3>Aktuell</H3>

application/vnd.debian.binary-package
<A NAME="lbAH">&nbsp;</A>
<H3>Veraltet</H3>

application/x-debian-package
<BR>

application/x-deb
<A NAME="lbAI">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-old">deb-old</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-deb">dpkg-deb</A></B>(1), <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-conffiles">deb-conffiles</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+deb-triggers">deb-triggers</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-shlibs">deb-shlibs</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-symbols">deb-symbols</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-preinst">deb-preinst</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?5+deb-postinst">deb-postinst</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-prerm">deb-prerm</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?5+deb-postrm">deb-postrm</A></B>(5).
<A NAME="lbAJ">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="1"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="2"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="3"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="4"><A HREF="#lbAE">FORMAT</A><DD>
<DT id="5"><A HREF="#lbAF">MEDIENTYP</A><DD>
<DL>
<DT id="6"><A HREF="#lbAG">Aktuell</A><DD>
<DT id="7"><A HREF="#lbAH">Veraltet</A><DD>
</DL>
<DT id="8"><A HREF="#lbAI">SIEHE AUCH</A><DD>
<DT id="9"><A HREF="#lbAJ">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
