
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of deb822</TITLE>
</HEAD><BODY>
<H1>deb822</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

deb - Debian-RFC822-Steuerdatenformat
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Die in einem gemeinsamen Format dargestellten Daten des
Paketverwaltungssystems, gespeichert in <I>Steuerdateien</I>. Steuerdateien
werden f&uuml;r Quellpakete, Bin&auml;rpakete und die <B>.changes</B>-Dateien, die die
Installation von hochgeladenen Dateien steuern, verwandt (die internen
Datenbanken von <B>dpkg</B> sind in einem &auml;hnlichen Format).
<A NAME="lbAD">&nbsp;</A>
<H2>SYNTAX</H2>

Eine Steuerdatei besteht aus einem oder mehreren Abs&auml;tzen mit Feldern. Die
Abs&auml;tze werden durch Leerzeilen getrennt. Auswertprogramme k&ouml;nnen Zeilen,
die nur aus U+0020 <B>Leerzeichen</B> und U+0009 <B>Tabulatoren</B> als
Absatztrennern bestehen, akzeptieren, allerdings sollten Steuerdateien nur
Leerzeilen verwenden. Einige Steuerdateien erlauben nur einen Absatz, andere
erlauben mehrere. In letzterem Fall bezieht sich jeder Absatz normalerweise
auf ein anderes Paket. (Beispielsweise bezieht sich der erste Absatz in
Quellpaketen auf das Quellpaket und sp&auml;tere Abs&auml;tze beziehen sich auf die
Bin&auml;rpakete, die aus dieser Quelle erstellt werden.) Die Reihenfolge der
Abs&auml;tze in Steuerdateien ist relevant.
<P>
Jeder Absatz besteht aus einer Reihe von Datenfeldern. Jedes Feld besteht
aus dem Feldnamen, gefolgt von einem Doppelpunkt (U+003A bq<B>:</B>') und den
Daten/Werten, die dem Feld zugeordnet sind. Der Feldname besteht aus
US-ASCII-Zeichen, au&szlig;er den Steuerzeichen, dem Leerzeichen und dem
Doppelpunkt (d.h. Zeichen in den Bereichen U+0021 bq<B>!</B>' bis U+0039 bq<B>9</B>'
und U+003B bq<B>;</B>' bis U+007E bq<B>~</B>' einschlie&szlig;lich). Feldnamen d&uuml;rfen nicht
mit dem Kommentarzeichen (U+0023 bq<B>#</B>') oder dem Gedankenstrich (U+002D
bq<B>-</B>') beginnen.
<P>
Das Feld endet am Zeilenende oder am Ende der letzten Fortsetzungszeile
(siehe unten). Horizontaler Leerraum (U+0020 <B>LEERZEICHEN</B> und U+0009
<B>TABULATOR</B>) k&ouml;nnen sofort nach oder vor dem Wert vorkommen und werden dort
ignoriert; als Konvention wird ein einzelnes Leerzeichen nach dem
Doppelpunkt gesetzt. Ein Feld k&ouml;nnte beispielsweise sein:
<DL COMPACT><DT id="1"><DD>
<PRE>
Package: dpkg
</PRE>

</DL>

Der Feldname lautet <B>Package</B> und der Feldwert <B>dpkg</B>.
<P>
Leere Feldwerte sind nur in Quellpaket-Steuerdateien (<I>debian/control</I>)
erlaubt. Solche Felder werden ignoriert.
<P>
Ein Absatz darf nicht mehr als ein Vorkommen eines bestimmten Feldnamens
enthalten.
<P>
Es gibt drei Arten von Feldern:
<P>
<DL COMPACT><DT id="2"><DD>
<DL COMPACT>
<DT id="3"><B>simple</B><DD>
Ein Feld, einschlie&szlig;lich des Wertes, muss eine einzelne Zeile sein. Falten
(Umbrechen) des Feldes ist nicht erlaubt. Dies ist der Standardtyp, falls
die Definition des Feldes nicht einen anderen Typ spezifiziert.
<DT id="4"><B>folded</B><DD>
Der Wert des gefalteten Feldes ist eine logische Zeile, die sich &uuml;ber
mehrere Zeilen erstrecken kann. Die Zeilen nach der ersten werden
Fortsetzungszeilen genannt und m&uuml;ssen mit einem U+0020 <B>LEERZEICHEN</B> oder
U+0009 <B>TABULATOR</B> beginnen. Leerraum, darunter Zeilenumbr&uuml;che, ist f&uuml;r die
Feldwerte gefalteter Zeilen nicht signifikant.
<P>
Diese Faltmethode ist &auml;hnlich RFC5322 und erlaubt Steuerdateien, die nur
einen Absatz und keine mehrzeiligen Abs&auml;tze, die von f&uuml;r RFC5322
geschriebenen Auswertprogrammen eingelesen werden m&uuml;ssen, enthalten.
<DT id="5"><B>multiline</B><DD>
Der Wert eines mehrzeiligen Feldes darf mehrere Fortsetzungszeilen
enthalten. Die erstes des Wertes, der Teil der auf der gleichen Zeile wie
der Feldname ist, hat oft eine spezielle Bedeutung oder k&ouml;nnte leer sein
m&uuml;ssen. Weitere Zeilen werden hinzugef&uuml;gt und folgen der gleichen Syntax wie
die Fortsetzungszeilen von anderen gefalteten Feldern. Leerraum, inklusive
Zeilenumbr&uuml;chen, ist im Wert von mehrzeiligen Feldern signifikant.
</DL>
</DL>

<P>
Leerraum darf nicht innerhalb von Namen (von Paketen, Architekturen, Dateien
oder sonstigem) oder Versionsnummern oder zwischen den Zeichen einer
Mehrzeichenversionsbeziehung auftauchen.
<P>
Die Existenz und der Zweck eines Feldes und die Syntax seines Wertes k&ouml;nnen
zwischen den Arten der Steuerdateien variieren.
<P>
Die Gro&szlig;-/Kleinschreibung ist bei Feldnamen nicht relevant, aber
normalerweise wird die Gro&szlig;schreibung eines Feldes in der unten gezeigten
gemischten Weise vorgenommen. Bei den Feldwerten ist die
Gro&szlig;-/Kleinschreibung relevant, au&szlig;er die Beschreibung sagt etwas anderes.
<P>
Absatztrenner (leere Zeilen) und Zeilen, die nur aus U+0020 <B>LEERZEICHEN</B>
und U+0009 <B>TABULAOREN</B> bestehen sind in Feldwerten oder zwischen Feldern
nicht erlaubt. Leere Zeilen und Feldwerte werden normalerweise maskiert,
indem sie durch ein U+0020 <B>LEERZEICHEN</B> gefolgt von einem Satzpunkt
(U+002E bq<B>.</B>') dargestellt werden.
<P>
Zeilen, die mit U+0023 bq<B>#</B>' ohne ein vorangestellten Leerraum beginnen,
sind Kommentarzeilen, die nur in Quellpaketsteuerdateien (<I>debian/control</I>)
und in <B><A HREF="/cgi-bin/man/man2html?5+deb-origin">deb-origin</A></B>(5)-Dateien erlaubt sind. Diese Kommentarzeilen werden
ignoriert, selbst zwischen zwei Fortsetzungszeilen. Sie beenden keine
logischen Zeilen.
<P>
Alle Steuerdateien m&uuml;ssen in UTF-8 kodiert sein.





<A NAME="lbAE">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B>RFC822</B>, <B>RFC5322</B>.
<A NAME="lbAF">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="6"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="7"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="8"><A HREF="#lbAD">SYNTAX</A><DD>
<DT id="9"><A HREF="#lbAE">SIEHE AUCH</A><DD>
<DT id="10"><A HREF="#lbAF">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
