
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of dsc</TITLE>
</HEAD><BODY>
<H1>dsc</H1>
Section: dpkg-Programmsammlung (5)<BR>Updated: 2020-03-23<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>


<A NAME="lbAB">&nbsp;</A>
<H2>BEZEICHNUNG</H2>

dsc - Format der Quellpaketsteuerdatei von Debian
<A NAME="lbAC">&nbsp;</A>
<H2>&Uuml;BERSICHT</H2>

<I>Dateiname</I><B>.dsc</B>
<A NAME="lbAD">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

Jedes Debian-Quellpaket besteht aus einer .dsc-Steuerdatei, die eine Reihe
von Feldern enth&auml;lt.Jedes Feld beginnt mit einer Markierung, wie <B>Source</B>
oder <B>Binary</B> (Gro&szlig;-/Kleinschreibung egal), gefolgt von einem Doppelpunkt
und dem K&ouml;rper des Feldes. Felder werden nur durch die Feldmarkierungen
abgegrenzt. Mit anderen Worten, Feldtexte k&ouml;nnen mehrere Zeilen &uuml;berspannen,
aber die Installationswerkzeuge werden im Allgemeinen die Zeilen bei der
Verarbeitung des Feldk&ouml;rpers zusammenfassen (mit Ausnahme der mehrzeiligen
Felder <B>Package-List</B>, <B>Files</B>, <B>Checksums-Sha1</B> und <B>Checksums-Sha256</B>,
sehen Sie dazu unten).
<P>

Die Steuerdaten k&ouml;nnen in eine Signatur mit einer wie in RFC4880
spezifizierten OpenPGP-ASCII-H&uuml;lle eingeschlossen sein.
<A NAME="lbAE">&nbsp;</A>
<H2>FELDER</H2>

<DL COMPACT>
<DT id="1"><B>Format:</B> <I>Formatversion</I> (verpflichtend)<DD>
Der Wert des Feldes gibt die Formatversion des Quellpaketes an. Der Feldwert
wird von Programmen, die mit Quellpaketen arbeiten, verwandt, um die Liste
der Dateien in dem Quellpaket zu interpretieren und zu bestimmen, wie es
entpackt wird. Die Syntax des Feldwertes ist eine numerische Hauptrevision
(Bq0-9"), ein Satzpunkt (Bq."), eine numerische Unterrevision (Bq0-9") und dann
ein optionaler Untertyp nach Leerraum (&raquo;&nbsp;\t&laquo;). Falls dieser spezifiziert
wird, ist er ein klein geschriebenes alphanumerisches (Bqa-z0-9") Wort in
Klammern (Bq()"). Der Untertyp ist in der Syntax optional, kann aber f&uuml;r eine
bestimmte Quellformatrevision verpflichtend sein.
<P>
Die von <B>dpkg</B> derzeit unterst&uuml;tzten Quellformate sind <B>1.0</B>, <B>2.0</B>,
<B>3.0 (native)</B>, <B>3.0 (quilt)</B>, <B>3.0 (git)</B>, <B>3.0 (bzr)</B> und <B>3.0
(custom)</B>. Siehe <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1) f&uuml;r ihre Beschreibung.
<DT id="2"><B>Source:</B> <I>Quellname</I> (verpflichtend)<DD>
Der Wert dieses Feldes bestimmt den Paketnamen und wird von den meisten
Installationswerkzeugen verwendet, um Dateinamen zu erstellen.
<DT id="3"><B>Binary:</B><I> Bin&auml;r-Paketliste</I><DD>
Dieses gefaltete Feld f&uuml;hrt durch Kommata getrennte Bin&auml;rpakete auf, die
dieses Quellpaket erstellen kann.
<P>
Dieses Feld wurde jetzt durch das Feld <B>Package-List</B> ersetzt, das genug
Informationen dar&uuml;ber, welche bin&auml;ren Pakete auf welcher Architektur
erstellt werden sowie Bauprofile und andere zugeh&ouml;rige Einschr&auml;nkungen,
gibt.
<DT id="4"><B>Architecture:</B> <I>Architekturliste</I> (empfohlen)<DD>
Eine durch Leerzeichen getrennte Liste von Architekturen und
Architekturplatzhaltern, die den Typ der Hardware festlegen, f&uuml;r die das
Paket &uuml;bersetzt werden kann. Typische Architekturnamen und
Architekturplatzhalter sind <B>amd64</B>, <B>armel</B>, <B>i386</B>, <B>linux-any</B>,
<B>any-amd64</B> usw.
<P>
Beachten Sie, dass der Wert <B>all</B> f&uuml;r Pakete gedacht ist, die unabh&auml;ngig
von der Achitektur sind und <B>any</B> f&uuml;r Pakete, die architekturabh&auml;ngig
sind. Die Liste kann den Wert <B>all</B> enthalten oder aus ihm alleine
bestehen. Wenn die Liste den Architekturplatzhalter <B>any</B> enth&auml;lt, ist der
einzig andere in der Liste erlaubte Wert <B>all</B>.
<P>
Der Feldwert wird im Allgemeinen aus den <B>Architecture</B>-Feldern aus der
<I>debian/control</I> des Quellpaketes erstellt.
<DT id="5"><B>Version:</B> <I>Versionszeichenkette</I> (verpflichtend)<DD>
Typischerweise ist das die Original-Paketversionsnummer, in der Form, die
der Programmautor verwendet. Es kann auch eine Debian-Revisionsnummer
enthalten (f&uuml;r nicht aus Debian stammende Pakete). Das genaue Format und der
Sortieralgorithmus sind in <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7) beschrieben.
<DT id="6"><B>Origin:</B><I> Name</I><DD>
Der Name der Distribution, aus der dieses Paket urspr&uuml;nglich stammt.
<DT id="7"><B>Maintainer:</B> <I>Vollst&auml;ndiger-Name-und-E-Mail</I> (empfohlen)<DD>
Sollte in dem Format BqJoe Bloggs &lt;<A HREF="mailto:jbloggs@foo.com">jbloggs@foo.com</A>&gt;" sein und ist
typischerweise die Person, die das Paket erstellt hat, im Gegensatz zum
Autor der Software, die paketiert wurde.
<DT id="8"><B>Uploaders:</B><I> Vollst&auml;ndiger-Name-und-E-Mail-Liste</I><DD>
Listet die Namen und E-Mail-Adressen der Ko-Betreuer des Pakets auf, im
gleichen Format wie das Feld <B>Maintainer</B>. Mehrere Ko-Betreuer sollten
durch Kommata getrennt werden.
<DT id="9"><B>Description</B><I> Kurzbeschreibung</I><DD>

<B> </B><I>Langbeschreibung</I>
Das Format der Quellpaketbeschreibung ist eine kurze knappe Zusammenfassung
auf der ersten Zeile (nach dem Feld <B>Description</B>). Die folgenden Zeilen
sollten als l&auml;ngere, detailliertere Beschreibung verwendet werden. Jede
Zeile der Langbeschreibung muss von einem Leerzeichen begonnen werden, und
Leerzeilen in der Langbeschreibung m&uuml;ssen einen einzelnen bq<B>.</B>' hinter dem
einleitenden Leerzeichen enthalten.
<DT id="10"><B>Homepage:</B><I> URL</I><DD>
Die <I>URL</I> des Original- (Upstream-)Projekts.
<DT id="11"><B>Standards-Version:</B> <I> Versionszeichenkette</I> (empfohlen)<DD>
Dies dokumentiert die neuste Version der Standards der Distribution, an den
sich das Paket h&auml;lt.
<DT id="12"><B>Vcs-Browser:</B><I> URL</I><DD>
Die <I>URL</I> der Webschnittstelle, um das Versionskontrollsystem-Depot
anzuschauen.
<DT id="13"><B>Vcs-Arch*:</B><I> URL</I><DD>

<B>Vcs-Bzr:</B><I> URL</I>

<B>Vcs-Cvs:</B><I> URL</I>

<B>Vcs-Darcs:</B><I> URL</I>

<B>Vcs-Git:</B><I> URL</I>

<B>Vcs-Hg:</B><I> URL</I>

<B>Vcs-Mtn:</B><I> URL</I>

<B>Vcs-Svn:</B><I> URL</I>
Diese Felder verk&uuml;nden die <I>URL</I> des Versionskontrollsystem-Depots, das f&uuml;r
die Betreuung des Pakets verwandt wird. Siehe <B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5) f&uuml;r
weitere Details.
<DT id="14"><B>Testsuite:</B><I> Namenliste</I><DD>
Dieses Feld verk&uuml;ndigt, dass das Quellpaket die angegebene Testsammlung
enth&auml;lt. Der Wert ist eine durch Kommata getrennte Liste von
Testsammlungen. Falls der Wert <B>autopkgtest</B> vorkommt, wird erwartet, dass
<I>debian/tests/control</I> vorhanden ist. Falls nur die Datei aber nicht der
Wert vorhanden ist, wird <B>dpkg-source</B> den Wert automatisch (unter
Beibehaltung der vorherigen Werte) hinzuf&uuml;gen.
<DT id="15"><B>Testsuite-Triggers:</B><I> Paketliste</I><DD>
This field declares the comma-separated union of all test dependencies
(<B>Depends</B> fields in <I>debian/tests/control</I> file), with all restrictions
removed, and OR dependencies flattened (that is, converted to separate AND
relationships), except for binaries generated by this source package and its
meta-dependency equivalent <B>@</B>.
<P>
Hintergrund: Dieses Feld wird ben&ouml;tigt, da andernfalls jedes Quellpaket
entpackt werden m&uuml;sste, um die Testabh&auml;ngigkeiten zu ermitteln.
<DT id="16"><B>Build-Depends:</B><I> Paketliste</I><DD>

<B>Build-Depends-Arch:</B><I> Paketliste</I>

<B>Build-Depends-Indep:</B><I> Paketliste</I>

<B>Build-Conflicts:</B><I> Paketliste</I>

<B>Build-Conflicts-Arch:</B><I> Paketliste</I>

<B>Build-Conflicts-Indep:</B><I> Paketliste</I>
Diese Felder verk&uuml;nden die Beziehungen zwischen dem Quellpaket und Paketen,
die daraus gebaut werden. Sie werden in der Handbuchseite <B><A HREF="/cgi-bin/man/man2html?5+deb-control">deb-control</A></B>(5)
beschrieben.
<DT id="17"><B>Package-List:</B><DD>

<BR>&nbsp;<I>Paket</I>&nbsp;<I>Pakettyp</I>&nbsp;<I>Sektion</I>&nbsp;<I>Priorit&auml;t</I>&nbsp;<I>Schl&uuml;ssel-Wert-Liste</I>
Dieses mehrzeilige Feld enth&auml;lt eine Liste von Bin&auml;rpaketen, die von diesem
Quellpaket erstellt werden.
<P>
Das <I>Paket</I> ist der Name des Bin&auml;rpakets.
<P>
Der <I>Pakettyp</I> ist der bin&auml;re Pakettyp, normalerweise <B>deb</B>, <B>udeb</B> ist
ein anderer h&auml;ufiger Wert.
<P>
<I>Sektion</I> und <I>Priorit&auml;t</I> entsprechen den Feldern <I>section</I> und
<I>priority</I> des Bin&auml;rpakets.
<P>
Die <I>Schl&uuml;ssel-Wert-Liste</I> ist eine durch Leerzeichen getrennte
<I>Schl&uuml;ssel</I><B>=</B><I>Wert</I>-Liste und die derzeit erkannten optionalen Schl&uuml;ssel
sind:
<P>
<DL COMPACT><DT id="18"><DD>
<DL COMPACT>
<DT id="19"><B>arch</B><DD>
Die Architektureinschr&auml;nkungen aus dem Feld <B>Architecture</B> des Bin&auml;rpakets,
wobei Leerzeichen zu bq,' konvertiert wurden.
<DT id="20"><B>profile</B><DD>
Die normalisierte Bauprofileinschr&auml;nkungsformel aus dem Feld
<B>Build-Profile</B> des Bin&auml;rpakets, wobei &raquo;OR&laquo; in bq+' und &raquo;AND&laquo; in bq,'
umgewandelt wurden.
<DT id="21"><B>essential</B><DD>
Falls das Bin&auml;rpaket &raquo;essential&laquo; ist, wird der Schl&uuml;ssel den Wert des Feldes
<B>Essential</B> enthalten, der <B>yes</B> lautet.
</DL>
</DL>

<DT id="22"><B>Files:</B> (verpflichtend)<DD>

<B>Checksums-Sha1:</B> (verpflichtend)

<B>Checksums-Sha256:</B> (verpflichtend)

<BR>&nbsp;<I>Pr&uuml;fsumme</I>&nbsp;<I>Gr&ouml;&szlig;e</I>&nbsp;<I>Dateiname</I>
Diese mehrzeiligen Felder enthalten eine Liste von Dateien mit einer
Pr&uuml;fsumme und Gr&ouml;&szlig;e f&uuml;r jede. Diese Felder haben die gleiche Syntax und
unterscheiden sich nur im verwandten Pr&uuml;fsummenalgorithmus: MD5 f&uuml;r
<B>Files</B>, SHA-1 f&uuml;r <B>Checksums-Sha1</B> und SHA-256 f&uuml;r <B>Checksums-Sha256</B>.
<P>
Die erste Zeile des Feldwertes (der Teil auf dem durch ein Doppelpunkt
gefolgten Feldnamen) ist immer leer. Der Inhalt des Feldes wird durch
Fortsetzungszeilen ausgedr&uuml;ckt, eine Zeile pro Datei. Jede Zeile besteht aus
der Pr&uuml;fsumme, einem Leerzeichen, der Dateigr&ouml;&szlig;e, einem Leerzeichen und dem
Dateinamen.
<P>
Diese Felder f&uuml;hren alle Dateien auf, die das Quellpaket darstellen. Die
Liste der Dateien in diesen Feldern muss auf die Liste der Dateien in den
anderen dazugeh&ouml;rigen Feldern passen.





</DL>
<A NAME="lbAF">&nbsp;</A>
<H2>FEHLER</H2>

Das Feld <B>Format</B> f&uuml;gt das Format f&uuml;r die Datei <B>.dsc</B> und das Format des
entpackten Quellpakets zusammen.
<A NAME="lbAG">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<B><A HREF="/cgi-bin/man/man2html?5+deb-src-control">deb-src-control</A></B>(5), <B><A HREF="/cgi-bin/man/man2html?7+deb-version">deb-version</A></B>(7), <B><A HREF="/cgi-bin/man/man2html?1+dpkg-source">dpkg-source</A></B>(1).
<A NAME="lbAH">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

Die deutsche &Uuml;bersetzung wurde 2004, 2006-2019 von Helge Kreutzmann
&lt;<A HREF="mailto:debian@helgefjell.de">debian@helgefjell.de</A>&gt;, 2007 von Florian Rehnisch &lt;<A HREF="mailto:eixman@gmx.de">eixman@gmx.de</A>&gt; und
2008 von Sven Joachim &lt;<A HREF="mailto:svenjoac@gmx.de">svenjoac@gmx.de</A>&gt;
angefertigt. Diese &Uuml;bersetzung ist Freie Dokumentation; lesen Sie die
GNU General Public License Version 2 oder neuer f&uuml;r die Kopierbedingungen.
Es gibt KEINE HAFTUNG.
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="23"><A HREF="#lbAB">BEZEICHNUNG</A><DD>
<DT id="24"><A HREF="#lbAC">&Uuml;BERSICHT</A><DD>
<DT id="25"><A HREF="#lbAD">BESCHREIBUNG</A><DD>
<DT id="26"><A HREF="#lbAE">FELDER</A><DD>
<DT id="27"><A HREF="#lbAF">FEHLER</A><DD>
<DT id="28"><A HREF="#lbAG">SIEHE AUCH</A><DD>
<DT id="29"><A HREF="#lbAH">&Uuml;BERSETZUNG</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
