
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of SHADOW</TITLE>
</HEAD><BODY>
<H1>SHADOW</H1>
Section: Dateiformate und konvertierung (5)<BR>Updated: 28.05.2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

shadow - Shadow-Passwortdatei
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

shadow
is a file which contains the password information for the system's accounts and optional aging information.
<P>

Um die Sicherheit der Passw&ouml;rter zu gew&auml;hrleisten, darf diese Datei nicht f&uuml;r normale Benutzer lesbar sein.
<P>

Each line of this file contains 9 fields, separated by colons (Bq:"), in the following order:
<P>

<B>Anmeldename</B>
<DL COMPACT><DT id="1"><DD>
Dabei muss es sich um eine g&uuml;ltigen Kontonamen handeln, der auf dem System existiert.
</DL>

<P>

<B>verschl&uuml;sseltes Passwort</B>
<DL COMPACT><DT id="2"><DD>
This field may be empty, in which case no passwords are required to authenticate as the specified login name. However, some applications which read the
/etc/shadow
file may decide not to permit any access at all if the password field is empty.
<P>
A password field which starts with an exclamation mark means that the password is locked. The remaining characters on the line represent the password field before the password was locked.
<P>
Refer to
<B><A HREF="/cgi-bin/man/man2html?3+crypt">crypt</A></B>(3)
for details on how this string is interpreted.
<P>
If the password field contains some string that is not a valid result of
<B><A HREF="/cgi-bin/man/man2html?3+crypt">crypt</A></B>(3), for instance ! or *, the user will not be able to use a unix password to log in (but the user may log in the system by other means).
</DL>

<P>

<B>Datum, an dem das Passwort das letzte Mal ge&auml;ndert wurde</B>
<DL COMPACT><DT id="3"><DD>
Das Datum, als das Passwort das letzte Mal ge&auml;ndert wurde, wird als Anzahl der Tage seit dem 1. Januar 1970 ausgedr&uuml;ckt.
<P>
The value 0 has a special meaning, which is that the user should change her password the next time she will log in the system.
<P>
Ein leeres Feld bedeutet, dass das Altern des Passworts abgeschaltet ist.
</DL>

<P>

<B>Mindestalter des Passworts</B>
<DL COMPACT><DT id="4"><DD>
Das Mindestalter des Passworts ist die Anzahl von Tagen, die ein Benutzer warten muss, bevor er sein Passwort wieder &auml;ndern darf.
<P>
Eine leeres Feld oder der Wert 0 bedeuten, dass es kein Mindestalter eines Passworts gibt.
</DL>

<P>

<B>H&ouml;chstalter des Passworts</B>
<DL COMPACT><DT id="5"><DD>
Das H&ouml;chstalter des Passworts ist die Anzahl von Tagen, nach welcher der Benutzer sein Passwort &auml;ndern muss.
<P>
Auch nach Ablauf dieser Anzahl von Tagen bleibt das Passwort g&uuml;ltig. Der Benutzer wird bei der n&auml;chsten Anmeldung aufgefordert, sein Passwort zu &auml;ndern.
<P>
Ein leeres Feld bedeutet, dass es kein H&ouml;chstalter f&uuml;r das Passwort, keine Vorwarnung und keine Dauer der Unt&auml;tigkeit (siehe unten) gibt.
<P>
Wenn das H&ouml;chstalter niedriger als das Mindestalter eines Passworts ist, kann ein Benutzer sein Passwort nicht &auml;ndern.
</DL>

<P>

<B>Passwortvorwarndauer</B>
<DL COMPACT><DT id="6"><DD>
Die Anzahl von Tagen, w&auml;hrend welcher der Benutzer vorgewarnt wird, bevor sein Passwort abl&auml;uft (siehe das H&ouml;chstalter des Passworts).
<P>
Ein leeres Feld oder der Wert 0 bedeutet, dass es keine Vorwarnung gibt.
</DL>

<P>

<B>Dauer der fehlenden Verwendung des Passworts</B>
<DL COMPACT><DT id="7"><DD>
Die Anzahl von Tagen, f&uuml;r die ein Benutzer sein Passwort, nachdem es abgelaufen ist (vergleiche oben das H&ouml;chstalter des Passworts), noch verwenden kann (und w&auml;hrend des n&auml;chsten Logins &auml;ndern muss).
<P>
Nachdem das Passwort abgelaufen ist und auch die Dauer der Unt&auml;tigkeit verstrichen ist, kann sich der Benutzer mit seinem Passwort nicht mehr anmelden. Er muss sich dann an den Administrator wenden.
<P>
Ein leeres Feld bedeutet, dass es keine H&ouml;chstdauer zwischen Ablauf des Passworts und erneuter Anmeldung des Benutzers gibt.
</DL>

<P>

<B>Datum des Verfalls des Kontos</B>
<DL COMPACT><DT id="8"><DD>
Das Datum, an dem das Konto verf&auml;llt, wird als Anzahl der Tage seit dem 1. Januar 1970 ausgedr&uuml;ckt.
<P>
Note that an account expiration differs from a password expiration. In case of an account expiration, the user shall not be allowed to login. In case of a password expiration, the user is not allowed to login using her password.
<P>
Ein leeres Feld bedeutet, dass das Konto nicht verfallen wird.
<P>
Der Wert 0 sollte nicht verwendet werden, weil er sowohl bedeuten kann, dass das Konto nicht verf&auml;llt als auch, dass das Konto bereits am 1. Januar 1970 verfallen ist.
</DL>

<P>

<B>reserviertes Feld</B>
<DL COMPACT><DT id="9"><DD>
Dieses Feld ist f&uuml;r zuk&uuml;nftigen Gebrauch reserviert.
</DL>

<A NAME="lbAD">&nbsp;</A>
<H2>DATEIEN</H2>

<P>

/etc/passwd
<DL COMPACT><DT id="10"><DD>
Informationen zu den Benutzerkonten
</DL>

<P>

/etc/shadow
<DL COMPACT><DT id="11"><DD>
verschl&uuml;sselte Informationen zu den Benutzerkonten
</DL>

<P>

/etc/shadow-
<DL COMPACT><DT id="12"><DD>
Sicherungskopie von /etc/shadow
<P>
Beachten Sie, dass diese Datei von Werkzeugen der Shadow-Werkzeugsammlung verwendet wird, aber nicht von allen sonstigen Programmen zur Benutzer- und Passwortverwaltung.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?1+chage">chage</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+login">login</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?1+passwd">passwd</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?5+passwd">passwd</A></B>(5),
<B><A HREF="/cgi-bin/man/man2html?8+pwck">pwck</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+pwconv">pwconv</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+pwunconv">pwunconv</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?1+su">su</A></B>(1),
<B><A HREF="/cgi-bin/man/man2html?8+sulogin">sulogin</A></B>(8).
<P>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="13"><A HREF="#lbAB">NAME</A><DD>
<DT id="14"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="15"><A HREF="#lbAD">DATEIEN</A><DD>
<DT id="16"><A HREF="#lbAE">SIEHE AUCH</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
