
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of SOURCES.LIST</TITLE>
</HEAD><BODY>
<H1>SOURCES.LIST</H1>
Section: APT (5)<BR>Updated: 04&nbsp;April&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NAME</H2>

sources.list - Liste konfigurierter APT-Datenquellen
<A NAME="lbAC">&nbsp;</A>
<H2>BESCHREIBUNG</H2>

<P>

Die Quellenliste
/etc/apt/sources.list
und die in
/etc/apt/sources.list.d/
enthaltenen Dateien wurden entworfen, um eine beliebige Anzahl aktiver Quellen und unterschiedlicher Quellmedien zu unterst&uuml;tzen. Die Dateien f&uuml;hren eine Quelle je Zeile auf (einzeiliger Stil) oder enthalten mehrzeilige Abs&auml;tze, die eine oder mehrere Quellen pro Absatz definieren (Deb822-Stil), bei der die bevorzugte Quelle zuerst aufgef&uuml;hrt wird (im Fall, dass eine einzelne Version von mehr als einer Quelle verf&uuml;gbar ist). Die Informationen &uuml;ber die konfigurierten Quellen werden durch
<B>apt-get update</B>
(oder einem vergleichbaren Befehl einer anderen APT-Oberfl&auml;che) beschafft.
<A NAME="lbAD">&nbsp;</A>
<H2>SOURCES.LIST.D</H2>

<P>

Das Verzeichnis
/etc/apt/sources.list.d
stellt eine M&ouml;glichkeit bereit, sources.list-Eintr&auml;ge in separaten Dateien hinzuzuf&uuml;gen. Zwei verschiedene Formate sind, wie in den beiden n&auml;chsten Abschnitten erkl&auml;rt, erlaubt. Dateinamen m&uuml;ssen abh&auml;ngig vom enthaltenen Format entweder eine
.list- oder
.sources-Endung haben. Die Dateinamen d&uuml;rfen nur Buchstaben (a-z und A-Z), Ziffern (0-9), Unterstrich (_), Bindestrich (-) und Punkt (.) enthalten. Andernfalls wird APT einen Hinweis ausgeben, dass es eine Datei ignoriert hat, falls die Datei nicht auf ein Muster in der Konfigurationsliste
Dir::Ignore-Files-Silently
passt - in diesem Fall wird sie stillschweigend ignoriert.
<A NAME="lbAE">&nbsp;</A>
<H2>FORMAT MIT EINZEILIGEM STIL</H2>

<P>

Dateien in diesem Format haben die Endung
.list. Jede Zeile, die eine Quelle angibt, beginnt mit einem Typ (z.B.
deb-src), gefolgt von Optionen und Argumenten f&uuml;r diesen Typ. Individuelle Eintr&auml;ge k&ouml;nnen nicht auf einer Folgezeile fortgesetzt werden. Leere Zeilen werden ignoriert und ein
#-Zeichen irgendwo in einer Zeile kennzeichnet den Rest der Zeile als Kommentar. Ein Eintrag kann folglich durch Auskommentieren der ganzen Zeile deaktiviert werden. Falls Optionen bereitgestellt werden sollen, werden sie durch Leerr&auml;ume getrennt und alle zusammen in quadratische Klammern ([]) eingeschlossen. Sie sind in der Zeile nach dem Typ enthalten und mit einem Leerraum von ihm getrennt. Falls eine Option mehrere Werte erlaubt, werden diese voneinander per Komma (,) getrennt. Ein Optionsname wird von seinem (seinen) Wert(en) durch ein Gleichheitszeichen (=) getrennt. Optionen mit mehreren Werten haben au&szlig;erdem
-=
und
+=
als Trenner, die statt den vorgegebenen Wert durch den (die) angegebenen Wert(e) zu ersetzen, den vorgegebenen Wert &auml;ndern und den (die) &uuml;bergebenen Wert(e) entfernen oder einschlie&szlig;en.
<P>

Dies ist das traditionelle, von allen APT-Versionen unterst&uuml;tzte Format. Beachten Sie, dass nicht alle unten beschriebenen Optionen von allen Versionen von APT unterst&uuml;tzt werden. Beachten Sie au&szlig;erdem, dass einige &auml;ltere Anwendungen, die dieses Format selbst auswerten, m&ouml;glicherweise nicht erwarten, dass Optionen auftauchen, da diese vor der Einf&uuml;hrung der Unterst&uuml;tzung mehrerer Architekturen nicht &uuml;blich waren.
<A NAME="lbAF">&nbsp;</A>
<H2>FORMAT IM DEB822-STIL</H2>

<P>

Dateien in diesem Format haben die Endung
.sources. Dieses Format hat eine &auml;hnliche Syntax wie andere von Debian und seinen Derivaten benutzte Dateien, wie Metadatendateien, die APT von den konfigurierten Quellen herunterl&auml;dt oder der Datei
debian/control
in einem Debian-Quellpaket. Individuelle Eintr&auml;ge werden durch eine leere Zeile getrennt; zus&auml;tzliche leere Zeilen werden ignoriert und
#-Zeichen am Anfang einer Zeile kennzeichnen die ganze Zeile als Kommentar. Ein Eintrag kann daher deaktiviert werden, indem jede Zeile, die zum Absatz geh&ouml;rt, auskommentiert wird. Es ist &uuml;blicherweise jedoch einfacher, dem Absatz das Feld &raquo;Enabled: no&laquo; hinzuzuf&uuml;gen, um den Eintrag zu deaktivieren. Durch Entfernen des Feldes oder indem es auf &raquo;yes&laquo; gesetzt wird, wird es wieder aktiviert. Optionen haben dieselbe Syntax wie jedes andere Feld: ein Feldname, durch einen Doppelpunkt (:) und optionale Leerr&auml;ume von ihren (ihrem) Wert(en) getrennt. Beachten Sie insbesondere, dass mehrere Werte durch Leerr&auml;ume (wie Leerzeichen, Tabulatoren und Zeilenumbr&uuml;che) getrennt werden, nicht durch Kommas, wie im einzeiligen Format. Felder mit mehreren Werten wie
Architectures
haben obendrein
Architectures-Add
und
Architectures-Remove, um den Vorgabewert zu &auml;ndern, statt ihn zu ersetzen.
<P>

Dies ist ein neues Format, das von APT selbst seit Version 1.1. unterst&uuml;tzt wird. &Auml;ltere Versionen ignorieren solche Dateien, wie vorher beschrieben, mit einer Benachrichtigung. Es ist vorgesehen, dieses Format schrittweise zum Standardformat zu machen und das vorher beschriebene Format mit dem einzeiligen Stil zu missbilligen, da das neue f&uuml;r Menschen und Maschinen gleicherma&szlig;en einfacher zu erstellen, zu erweitern und zu &auml;ndern ist, insbesondere dann, wenn viele Quellen und/oder Optionen beteiligt sind. Entwickler, die mit APT-Quellen arbeiten und/oder sie auswerten, sind dringend ermutigt, dieses Format zu unterst&uuml;tzen und das APT-Team zu kontaktieren, um diese Arbeit zu koordinieren und weiterzugeben. Benutzer k&ouml;nnen dieses Format bereits &uuml;bernehmen, es k&ouml;nnten jedoch Probleme mit Software auftreten, die dieses Format noch nicht unterst&uuml;tzen.
<A NAME="lbAG">&nbsp;</A>
<H2>DIE TYPEN &raquo;DEB&laquo; UND &raquo;DEB-SRC&laquo;: ALLGEMEINES FORMAT</H2>

<P>

Der
deb-Typ beschreibt ein typisches zweistufiges Debian-Archiv,
Distribution/Bestandteil.
Distribution
ist typischerweise eine Programmsammlung wie
stable
oder
testing
oder ein Codename wie
buster
oder
bullseye
w&auml;hrend Bestandteil entweder
main,
contrib
oder
non-free
ist. Der
deb-src-Typ beschreibt den Quellcode einer Debian-Distribution in der gleichen Form wie den
deb-Typ. Eine
deb-src-Zeile wird ben&ouml;tigt, um Quellindizes herunterzuladen.
<P>

Das Format f&uuml;r zwei Eintr&auml;ge im einzeiligen Stil, die die
deb- und
deb-src-Typen benutzen, ist:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
deb [ Option1=Wert1 Option2=Wert2 ] URI Suite [Bestandteil1] [Bestandteil2] [...]
deb-src [ Option1=Wert1 Option2=Wert2 ] URI Suite [Bestandteil1] [Bestandteil2] [...]
</PRE>

</DL>




<P>

Der alternative Eintrag sieht im Format des Deb822-Stils etwa so aus:
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
     Types: deb deb-src
     URIs: URI
     Suites: Suite
     Components: [Bestandteil1] [Bestandteil2] [...]
     Option1: Wert1
     Option2: Wert2
   
</PRE>

</DL>




<P>

Der URI f&uuml;r den
deb-Typ muss die Basis der Debian-Distribution angeben, wo APT die Informationen findet, die es ben&ouml;tigt.
Suite
kann einen genauen Pfad angeben. In diesem Fall m&uuml;ssen die Bestandteile weggelassen werden und
Suite
muss mit einem Schr&auml;gstrich (/) enden. Dies ist n&uuml;tzlich, wenn nur ein bestimmtes Unterverzeichnis des vom URI angegebenen Archivs von Interesse ist. Wenn
Suite
keinen genauen Pfad angibt, muss mindestens ein
Bestandteil
angegeben sein.
<P>

Suite
darf au&szlig;erdem eine Variable,
$(ARCH), enthalten, die zur Debian-Architektur (wie
amd64
oder
armel) expandiert wird, die auf dem System benutzt wird. Dies erlaubt es, architekturunabh&auml;ngige
sources.list-Dateien zu benutzen. Im Allgemeinen ist dies nur von Interesse, wenn ein genauer Pfad angegeben wird, andernfalls wird
APT
automatisch einen URI mit der aktuellen Architektur erstellen.
<P>

Insbesondere im Format im einzeiligen Stil k&ouml;nnte es n&ouml;tig sein, da pro Zeile nur eine Distribution angegeben werden kann, mehrere Zeilen f&uuml;r den gleichen URI zu haben, falls eine Untermenge aller verf&uuml;gbarer Distributionen oder Bestandteile von diesem Ort gew&uuml;nscht wird. APT wird die URI-Liste sortieren, nachdem es intern eine komplette Zusammenstellung erstellt hat und es wird beispielsweise mehrere Bez&uuml;ge zum gleichen Internet-Rechner zu einer einzigen Verbindung zusammenfassen, so dass es nicht ineffizient eine Verbindung herstellt, sie schlie&szlig;t, sonst etwas tut und dann erneut eine Verbindung zum gleichen Rechner herstellt. APT parallelisiert au&szlig;erdem Verbindungen zu verschiedenen Rechnern, um effektiver mit Sites mit niedriger Bandbreite umzugehen.
<P>

Es ist wichtig, die Quellen in der Reihenfolge ihrer Bevorzugung aufzulisten, die bevorzugte Quelle zuerst. Typischerweise resultiert dies in einer Sortierung nach Geschwindigkeit, vom schnellsten zum langsamsten (CD-ROM, gefolgt von Rechnern im lokalen Netzwerk, gefolgt von Internet-Rechnern, zum Beispiel).
<P>

Die Quellen f&uuml;r Ihre Distribution k&ouml;nnten zum Beispiel im Format mit einzeiligem Stil so aussehen:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
deb <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A> focal main restricted
deb <A HREF="http://security.ubuntu.com/ubuntu">http://security.ubuntu.com/ubuntu</A> focal-security main restricted
deb <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A> focal-updates main restricted
</PRE>

</DL>




<P>
oder im Format mit Deb822-Stil so:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A>
Suites: focal focal-updates
Components: main restricted

Types: deb
URIs: <A HREF="http://security.ubuntu.com/ubuntu">http://security.ubuntu.com/ubuntu</A>
Suites: focal-security
Components: main restricted
</PRE>

</DL>




<P>
.
<A NAME="lbAH">&nbsp;</A>
<H2>DIE TYPEN DEB UND DEB-SRC: OPTIONEN</H2>

<P>

Jeder Quelleneintrag kann Optionen haben, die angegeben wurden, um zu &auml;ndern, auf welche Quelle zugegriffen wird und wie Daten von ihr beschafft werden. Format, Syntax und Namen der Optionen weichen, wie beschrieben, zwischen dem Format mit einzeiligem Stil und dem Format mit Deb822-Stil voneinander ab, f&uuml;r beide sind jedoch dieselben Optionen verf&uuml;gbar. Der Einfachheit halber wird der Deb822-Feldname aufgef&uuml;hrt und der einzeilige Name in Klammern bereitgestellt. Denken Sie daran, dass Sie erg&auml;nzend zum expliziten Setzen von Optionen mit mehreren Werten auch die M&ouml;glichkeit haben, sie basierend auf dem Vorgabewert zu &auml;ndern, aber diese Namen werden hier nicht explizit aufgef&uuml;hrt. Nicht unterst&uuml;tzte Optionen werden stillschweigend von allen APT-Versionen ignoriert.
<P>
<DL COMPACT><DT id="5"><DD>
&bull;


<B>Architectures</B>
(<B>arch</B>) ist eine Option mit mehreren Werten, die definiert, f&uuml;r welche Architekturen Informationen heruntergeladen werden sollen. Falls diese Option nicht gesetzt ist, ist die Voreinstellung alle durch die Konfigurationsoption
<B>APT::Architectures</B>
definierten Architekturen.
</DL>

<P>
<DL COMPACT><DT id="6"><DD>
&bull;


<B>Languages</B>
(<B>lang</B>) ist eine Option mit mehreren Werten, die definiert, f&uuml;r welche Sprachen Informationen, wie etwa &uuml;bersetzte Paketbeschreibungen, heruntergeladen werden sollen. Falls diese Option nicht gesetzt ist, werden sie f&uuml;r alle durch die Konfigurationsoption
<B>Acquire::Languages</B>
definierten Sprachen heruntergeladen.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


<B>Targets</B>
(<B>target</B>) ist eine Option mit mehreren Werten, die definiert, welche Herunterladeziele APT aus dieser Quelle versucht zu beschaffen. Ist sie nicht angegeben, wird die Voreinstellung durch den Konfigurationsbereich
<B>Acquire::IndexTargets</B>
spezifiziert (Ziele werden im Feld
Created-By
durch ihren Namen angegeben). Au&szlig;erdem k&ouml;nnen Ziele mittels des Felds
Identifier
als Option mit einem Wahrheitswert aktiviert oder deaktiviert werden, anstatt diese Option mit mehreren Werten zu benutzen.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


<B>PDiffs</B>
(<B>pdiffs</B>) ist ein yes-/no- (Ja-/Nein-)Wert, der steuert, ob APT versuchen soll, PDiffs zum Aktualisieren alter Indexe zu benutzen, statt die ganzen neuen Indexe herunterzuladen. Der Wert dieser Option wird ignoriert, falls das Depot die Verf&uuml;gbarkeit von PDiffs nicht ank&uuml;ndigt. Sie ist auf den Wert der Option mit demselben Namen f&uuml;r eine bestimmte Indexdatei voreingestellt, die im G&uuml;ltigkeitsbereich
<B>Acquire::IndexTargets</B>
definiert ist und die ihrerseits wiederum auf den Wert der Konfigurationsoption
<B>Acquire::PDiffs</B>
voreingestellt ist, deren Vorgabe
yes
ist.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


<B>By-Hash</B>
(<B>by-hash</B>) kann die Werte
yes,
no
oder
force
haben und steuert, ob APT versuchen soll, Indexe &uuml;ber einen URI zu beschaffen, der aus einer Hash-Summe der erwarteten Datei konstruiert wird, statt &uuml;ber einen gut bekannten stabilen Dateinamen. Damit k&ouml;nnen unpassende Hash-Summen vermieden werden, dies erfordert jedoch einen Spiegelserver, der dies unterst&uuml;tzt. Ein
yes- oder
no-Wert aktiviert/deaktiviert die Verwendung dieser Funktionalit&auml;t, falls diese Quelle ihre Unterst&uuml;tzung anzeigt, w&auml;hrend
force
die Funktionalit&auml;t ungeachtet der Angabe der Quelle aktiviert. Sie ist auf den Wert der Option mit demselben Namen f&uuml;r eine bestimmte Indexdatei voreingestellt, die im G&uuml;ltigkeitsbereich
<B>Acquire::IndexTargets</B>
definiert ist und die ihrerseits wiederum auf den Wert der Konfigurationsoption
<B>Acquire::By-Hash</B>
voreingestellt ist, deren Vorgabe
yes
ist.
</DL>

<P>
&Uuml;berdies gibt es Optionen, die, falls sie gesetzt sind,
<I>alle</I>
Quellen mit demselben URI und derselben Suite beeinflussen, daher m&uuml;ssen sie auf alle solchen Eintr&auml;gen gesetzt werden und k&ouml;nnen nicht zwischen verschiedenen Bestandteilen unterschieden werden. APT wird versuchen, solche Anomalien aufzusp&uuml;ren und Fehler auszugeben.
<P>
<DL COMPACT><DT id="10"><DD>
&bull;


<B>Allow-Insecure</B>
(<B>allow-insecure</B>),
<B>Allow-Weak</B>
(<B>allow-weak</B>) und
<B>Allow-Downgrade-To-Insecure</B>
(<B>allow-downgrade-to-insecure</B>) sind Wahrheitswerte, deren Voreinstellung
no
ist. Falls sie auf
yes
gesetzt sind, umgehen sie Teile von
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
und sollten daher nicht leichtfertig benutzt werden.
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


<B>Trusted</B>
(<B>trusted</B>) ist ein Wert, der drei Status annehmen kann. APT entscheidet standardm&auml;&szlig;ig, ob ein Paket als vertrauensw&uuml;rdig angesehen wird oder ob eine Warnung erscheinen soll, bevor z.B. Pakete aus dieser Quelle installiert werden. Diese Option kann benutzt werden, um diese Entscheidung au&szlig;er Kraft zu setzen. Der Wert
yes
sagt APT, dass es diese Quelle immer als vertrauensw&uuml;rdig ansehen soll, sogar dann, wenn sie die Authentifizierungspr&uuml;fungen nicht erfolgreich durchl&auml;uft. Sie deaktiviert Teile von
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
und sollte daher nur in einem lokalen und vertrauensw&uuml;rdigen Umfeld (falls &uuml;berhaupt) verwendet werden, da die Sicherheit andernfalls verletzt wird. Der Wert
no
tut das Gegenteil. Er sorgt daf&uuml;r, dass die Quelle als nicht vertrauensw&uuml;rdig behandelt wird, sogar dann, wenn sie die Authentifizierungspr&uuml;fungen erfolgreich durchl&auml;uft. Der Vorgabewert kann nicht explizit gesetzt werden.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


<B>Signed-By</B>
(<B>signed-by</B>) ist eine Option, die erfordert, dass ein Depot die
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)-Pr&uuml;fung mit einem bestimmten Satz von Schl&uuml;sseln, statt mit allen vertrauensw&uuml;rdigen Schl&uuml;sseln, durchl&auml;uft, die f&uuml;r APT konfiguriert sind. Sie wird als eine Liste absoluter Pfade zu Schl&uuml;sselbunddateien angegeben (m&uuml;ssen f&uuml;r den Systembenutzer
_apt
zugreif- und lesbar sein, stellen Sie also sicher, dass jedermann Leserechte f&uuml;r die Datei hat) sowie Fingerabdr&uuml;cke von Schl&uuml;sseln, um diese aus Schl&uuml;sselbunden auszuw&auml;hlen. Falls keine Schl&uuml;sselbunddateien angegeben wurden, sind der Schl&uuml;sselbund
trusted.gpg
und alle Schl&uuml;sselbunde im Verzeichnis
trusted.gpg.d/
voreingestellt (siehe
<B>apt-key fingerprint</B>). Falls kein Fingerabdruck angegeben wurde, werden alle Schl&uuml;ssel in den Schl&uuml;sselbunden ausgew&auml;hlt. Ein Fingerabdruck wird au&szlig;erdem alle Signaturen eines Unterschl&uuml;ssels dieses Schl&uuml;ssels akzeptieren, falls dies nicht gew&uuml;nscht wird, kann ein Ausrufezeichen (!) an den Fingerabdruck angeh&auml;ngt werden, um dieses Verhalten zu deaktivieren. Die Option ist auf den Wert der Option mit demselben Namen voreingestellt, falls sie in der vorher beschafften
Release-Datei dieses Depots gesetzt ist (allerdings k&ouml;nnen dadurch nur Fingerabdr&uuml;cke angegeben werden). Andernfalls werden alle Schl&uuml;ssel in den vertrauensw&uuml;rdigen Schl&uuml;sselbunden als g&uuml;ltige Unterzeichner f&uuml;r dieses Depot angesehen.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


<B>Check-Valid-Until</B>
(<B>check-valid-until</B>) ist ein yes-/no- (Ja-/Nein-)Wert, der steuert, ob APT versuchen soll, Wiederholungsangriffe zu erkennen. Ein Depotersteller kann eine Zeit festlegen, bis zu der die im Depot bereitgestellten Daten als g&uuml;ltig angesehen werden und, falls dieser Zeitpunkt erreicht ist, aber keine neuen Daten bereitgestellt wurden, die Daten als ung&uuml;ltig angesehen werden und ein Fehler ausgel&ouml;st wird. Neben einer Steigerung der Sicherheit, da ein b&ouml;swilliger Angreifer nicht fortlaufend alte Daten senden kann, um einen Benutzer vom Upgrade auf eine neue Version abzuhalten, hilft dies Benutzern auch, Spiegelserver zu erkennen, die nicht l&auml;nger aktualisiert werden. Einige Depots, wie die historischen Archive, werden jedoch absichtlich nicht mehr aktualisiert, daher kann diese Pr&uuml;fung durch Setzen dieser Option auf
no
deaktiviert werden. Voreingestellt ist der Wert der Konfigurationsoption
<B>Acquire::Check-Valid-Until</B>, die ihrerseits die Voreinstellung
yes
hat.
</DL>

<P>
<DL COMPACT><DT id="14"><DD>
&bull;


<B>Valid-Until-Min</B>
(<B>valid-until-min</B>) und
<B>Valid-Until-Max</B>
(<B>valid-until-max</B>) k&ouml;nnen benutzt werden, um die Dauer in Sekunden zu verl&auml;ngern oder zu verk&uuml;rzen, in der die Daten des Depots als g&uuml;ltig angesehen werden. -Max kann insbesondere dann n&uuml;tzlich sein, wenn das Depot kein Valid-Until-Feld in seiner Release-Datei bereitstellt, indem Sie Ihren eigenen Wert setzen k&ouml;nnen, w&auml;hrend -Min benutzt werden kann, um die G&uuml;ltigkeitsdauer auf selten aktualisierten (lokalen) Spiegelservern f&uuml;r ein h&auml;ufig aktualisiertes aber weniger oft erreichbares Archiv (das auch in der sources.list steht) zu erh&ouml;hen anstatt die Pr&uuml;fung ganz zu deaktivieren. Voreingestellt sind die Werte der Konfigurationsoptionen
<B>Acquire::Min-ValidTime</B>
und
<B>Acquire::Max-ValidTime</B>, die standardm&auml;&szlig;ig jeweils nicht gesetzt sind.
</DL>

<P>
<DL COMPACT><DT id="15"><DD>
&bull;


<B>Check-Date</B>
(<B>check-date</B>) ist ein Ja-/Nein-Wert, der steuert, ob APT ber&uuml;cksichtigen soll, ob die Zeit auf der Maschine korrekt ist und deshalb zeitbezogene Pr&uuml;fungen durchf&uuml;hren soll, wie die Pr&uuml;fung, ob eine Release-Datei nicht aus der Zukunft stammt. Sie zu deaktivieren deaktiviert auch die oben erw&auml;hnte Option
<B>Check-Valid-Until</B>.
</DL>

<P>
<DL COMPACT><DT id="16"><DD>
&bull;


<B>Date-Max-Future</B>
(<B>date-max-future</B>) steuert, wie weit aus der Zukunft ein Depot liegen darf. Voreingestellt ist der Wert der Konfigurationsoption
<B>Acquire::Max-FutureTime</B>, die standardm&auml;&szlig;ig zehn Sekunden betr&auml;gt.
</DL>

<P>
<DL COMPACT><DT id="17"><DD>
&bull;


<B>InRelease-Path</B>
(<B>inrelease-path</B>) legt den Pfad zur InRelease-Datei relativ zur normalen Position einer
InRelease-Datei fest. Standardm&auml;&szlig;ig ist diese Option nicht gesetzt und APT wird versuchen, eine
InRelease-Datei zu holen oder, falls dies fehlschl&auml;gt, eine
Release-Datei und die zugeh&ouml;rige
Release.gpg-Datei. Durch das Setzen dieser Option wird der angegebene Pfad anstelle der InRelease-Datei probiert und der R&uuml;ckgriff auf
Release-Dateien wird deaktiviert.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H2>URI-BESCHREIBUNG</H2>

<P>

Die derzeit erkannten URI-Typen sind:
<P>

<B>http</B> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1))
<DL COMPACT><DT id="18"><DD>
Das Schema &raquo;http&laquo; gibt einen HTTP-Server f&uuml;r ein Archiv an und ist die am h&auml;ufigsten verwendete Methode. Der URI kann Anmeldeinformationen direkt enthalten, falls das Archiv dies erfordert, vorzugsweise sollte jedoch
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
benutzt werden. Die Methode unterst&uuml;tzt auch SOCKS5- und HTTP(S)-Proxys, die entweder &uuml;ber APT-spezifische Konfiguration eingerichtet werden oder durch die Umgebungsvariable
<B>http_proxy</B>, die (unter der Annahme, dass ein HTTP-Proxy Authentifizierung verlangt) das Format
<I><A HREF="http://Benutzer:Passwort@Server:Port/">http://Benutzer:Passwort@Server:Port/</A></I>
hat. Die Einzelheiten der Authentifizierung f&uuml;r Proxys k&ouml;nnen auch &uuml;ber
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
bereitgestellt werden.
<P>
Beachten Sie, dass diese Formen der Authentifizierung unsicher sind, da die ganze Kommunikation mit dem fernen Server (oder Proxy) unverschl&uuml;sselt ist, so dass ein Angreifer mit ausreichenden F&auml;higkeiten die Anmeldung sowie alle anderen Interaktionen beobachten und aufzeichnen kann. Der Angreifer kann die Kommunikation
<I>nicht</I>
ver&auml;ndern, da das Datensicherheitsmodell von APT unabh&auml;ngig von der gew&auml;hlten Transportmethode ist. Einzelheiten finden Sie unter
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>https</B> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-https">apt-transport-https</A></B>(1))
<DL COMPACT><DT id="19"><DD>
Das Schema &raquo;https&laquo; gibt einen HTTPS-Server f&uuml;r ein Archiv an und ist bez&uuml;glich Benutzung und verf&uuml;gbaren Optionen dem HTTP-Schema sehr &auml;hnlich. Der Hauptunterschied besteht darin, dass die Kommunikation zwischen APT und Server (oder Proxy) verschl&uuml;sselt abl&auml;uft. Beachten Sie, dass die Verschl&uuml;sselung nicht davor sch&uuml;tzt, dass ein Angreifer erf&auml;hrt, welcher Server (oder Proxy) mit APT kommuniziert. Eine tiefere Analyse kann m&ouml;glicherweise noch offenbaren, welche Daten heruntergeladen wurden. Falls dies Sorge bereitet, k&ouml;nnten die nachfolgend genannten TOR-basierten Schemata eine geeignete Alternative sein.
</DL>

<P>

<B>mirror</B>, <B>mirror+</B><B></B><I>Schema</I> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-mirror">apt-transport-mirror</A></B>(1))
<DL COMPACT><DT id="20"><DD>
Das Schema &raquo;mirror&laquo; gibt den Speicherort der Spiegelserverliste an. Standardm&auml;&szlig;ig wird f&uuml;r den Speicherort das Schema
http
benutzt, aber jedes andere Schema kann per
<B>mirror+</B><B></B><I>Schema</I>
verwendet werden. Die Spiegelserverliste selbst kann mehrere verschiedenen URIs f&uuml;r Spiegel enthalten, die der APT-Client transparent ausw&auml;hlt oder auf die er zur&uuml;ckgreift. Dies ist als Hilfe bei der Lastverteilung zwischen verf&uuml;gbaren Spiegelservern gedacht und stellt zudem sicher, dass Clients sogar dann Daten beziehen k&ouml;nnen, wenn einige konfigurierte Spiegelserver nicht verf&uuml;gbar sind.
</DL>

<P>

<B>file</B>
<DL COMPACT><DT id="21"><DD>
Das file-Schema erlaubt es einem beliebigen Verzeichnis im Dateisystem, als Archiv betrachtet zu werden. Dies ist n&uuml;tzlich f&uuml;r eingeh&auml;ngtes NFS und lokale Spiegel oder Archive.
</DL>

<P>

<B>cdrom</B>
<DL COMPACT><DT id="22"><DD>
Das Schema &raquo;cdrom&laquo; erlaubt APT ein lokales CD-ROM-, DVD- oder USB-Laufwerk mit Medienwechsel zu benutzen. Benutzen Sie das Programm
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8), um &raquo;cdrom&laquo;-Eintr&auml;ge in der Quellenliste zu erstellen.
</DL>

<P>

<B>ftp</B>
<DL COMPACT><DT id="23"><DD>
Das Schema &raquo;ftp&laquo; gibt einen FTP-Server f&uuml;r ein Archiv an. Die Verwendung von FTP geht zu Gunsten von
http
und
https
zur&uuml;ck und viele Archive haben entweder nie FTP-Zugriff geboten oder ziehen diesen zur&uuml;ck. Falls Sie diese Methode immer noch ben&ouml;tigen, sind daf&uuml;r viele Konfigurationsoptionen im Bereich
Acquire::ftp
verf&uuml;gbar und ausf&uuml;hrlich in
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
erkl&auml;rt.
<P>
Bitte beachten Sie, dass ein FTP-Proxy durch Benutzung der
<B>ftp_proxy</B>-Umgebungsvariablen angegeben werden kann. Es ist mittels dieser Umgebungsvariable und
<I>nur</I>
dieser Umgebungsvariable m&ouml;glich, einen HTTP-Proxy anzugeben (HTTP-Proxy-Server verstehen oft auch FTP-URLs). Proxys, die HTTP benutzen und in der Konfigurationsdatei festgelegt sind, werden ignoriert.
</DL>

<P>

<B>copy</B>
<DL COMPACT><DT id="24"><DD>
Das Schema &raquo;copy&laquo; ist identisch mit dem file-Schema, au&szlig;er dass Pakete in das Zwischenspeicherverzeichnis kopiert werden, anstatt direkt von ihrem Herkunftsort benutzt zu werden. Dies ist f&uuml;r Leute n&uuml;tzlich, die Wechseldatentr&auml;ger benutzen, um Dateien mit APT umherzukopieren.
</DL>

<P>

<B>rsh</B>, <B>ssh</B>
<DL COMPACT><DT id="25"><DD>
Die Methode &raquo;rsh/ssh&laquo; ruft RSH/SSH auf, um sich mit einem Rechner in der Ferne zu verbinden und als angegebener Benutzer auf die Dateien zuzugreifen. Es wird empfohlen, vorher Rhosts oder RSA-Schl&uuml;ssel zu konfigurieren. F&uuml;r die &Uuml;bertragung von Dateien aus der Ferne werden die Standardbefehle
<B>find</B>
und
<B>dd</B>
verwandt.
</DL>

<P>

weitere zul&auml;ssige URI-Typen hinzuf&uuml;gen
<DL COMPACT><DT id="26"><DD>
APT kann mit weiteren Methoden erweitert werden, die in anderen optionalen Paketen geliefert werden, die dem Namensschema
apt-transport-<I>Methode</I>
folgen sollten. Das APT-Team betreut zum Beispiel au&szlig;erdem das Paket
apt-transport-tor, das Zugriffsmethoden f&uuml;r HTTP- und HTTPS-URIs bereitstellt, die &uuml;ber das TOR-Netzwerk geleitet werden.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>BEISPIELE</H2>

<P>

benutzt die lokal gespeicherten (oder per NFS eingeh&auml;ngten) Archive in /home/apt/debian f&uuml;r stable/main, stable/contrib und stable/non-free.
<P>
<DL COMPACT><DT id="27"><DD>



<PRE>
deb file:/home/apt/debian stable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="28"><DD>



<PRE>
Types: deb
URIs: file:/home/apt/debian
Suites: stable
Components: main contrib non-free
</PRE>

</DL>




<P>

wie oben, au&szlig;er das dies die instabile (Entwicklungs-) Distribution benutzt.
<P>
<DL COMPACT><DT id="29"><DD>



<PRE>
deb file:/home/apt/debian unstable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Types: deb
URIs: file:/home/apt/debian
Suites: unstable
Components: main contrib non-free
</PRE>

</DL>




<P>

Quellenangabe f&uuml;r Obiges
<P>
<DL COMPACT><DT id="31"><DD>



<PRE>
deb-src file:/home/apt/debian unstable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="32"><DD>



<PRE>
Types: deb-src
URIs: file:/home/apt/debian
Suites: unstable
Components: main contrib non-free
</PRE>

</DL>




<P>

Die erste Zeile bekommt Paketinformationen f&uuml;r die Architekturen in
APT::Architectures, w&auml;hrend die zweite immer
amd64
und
armel
holt.
<P>
<DL COMPACT><DT id="33"><DD>



<PRE>
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> buster main
deb [ arch=amd64,armel ] <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> buster main
</PRE>

</DL>




<P>
<DL COMPACT><DT id="34"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: buster
Components: main

Types: deb
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: buster
Components: main
Architectures: amd64 armel
</PRE>

</DL>




<P>

benutzt HTTP, um auf das Archiv auf archive.debian.org zuzugreifen und nur den hamm/main-Bereich zu benutzen.
<P>
<DL COMPACT><DT id="35"><DD>



<PRE>
deb <A HREF="http://archive.debian.org/debian-archive">http://archive.debian.org/debian-archive</A> hamm main
</PRE>

</DL>




<P>
<DL COMPACT><DT id="36"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://archive.debian.org/debian-archive">http://archive.debian.org/debian-archive</A>
Suites: hamm
Components: main
</PRE>

</DL>




<P>

benutzt FTP, um auf das Archiv auf archive.debian.org unter dem debian-Verzeichnis zuzugreifen und nur den buster/contrib-Bereich zu benutzen.
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
deb <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A> buster contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="38"><DD>



<PRE>
Types: deb
URIs: <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A>
Suites: buster
Components: contrib
</PRE>

</DL>




<P>

benutzt FTP, um auf das Archiv auf <A HREF="ftp://ftp.debian.org">ftp.debian.org</A> unter dem debian-Verzeichnis zuzugreifen und nur den unstable/contrib-Bereich zu benutzen. Falls diese Zeile zusammen mit der aus dem vorherigen Beispiel in der Datei
sources.list
auftaucht, wird eine einzelne FTP-Sitzung f&uuml;r beide Quellzeilen benutzt.
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
deb <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A> unstable contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="40"><DD>



<PRE>
Types: deb
URIs: <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A>
Suites: unstable
Components: contrib
</PRE>

</DL>




<P>

benutzt HTTP, um auf das Archiv auf <A HREF="ftp://ftp.tlh.debian.org">ftp.tlh.debian.org</A> unter dem universe-Verzeichnis zuzugreifen und benutzt nur Dateien, die unter
unstable/binary-i386
auf i386-Maschinen,
unstable/binary-amd64
auf amd64 und so weiter f&uuml;r andere unterst&uuml;tzte Architekturen, gefunden werden. [Beachten Sie, dass dieses Beispiel nur anschaulich macht, wie die Platzhaltervariable benutzt wird. Offizielle Debian-Archive sind nicht so strukturiert.]
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
deb <A HREF="http://ftp.tlh.debian.org/universe">http://ftp.tlh.debian.org/universe</A> unstable/binary-$(ARCH)/
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://ftp.tlh.debian.org/universe">http://ftp.tlh.debian.org/universe</A>
Suites: unstable/binary-$(ARCH)/
</PRE>

</DL>




<P>

benutzt HTTP, um sowohl Bin&auml;rpakete als auch Quellen von den Programmsammlungen Stable, Testing, Unstable und den Bestandteilen Main und Contrib zu holen.
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> stable main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> stable main contrib
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> testing main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> testing main contrib
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> unstable main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> unstable main contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="44"><DD>



<PRE>
Types: deb deb-src
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: stable testing unstable
Components: main contrib
</PRE>

</DL>




<A NAME="lbAK">&nbsp;</A>
<H2>SIEHE AUCH</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
/usr/share/doc/apt-doc/acquire-additional-files.md.gz
<A NAME="lbAL">&nbsp;</A>
<H2>FEHLER</H2>

<P>

m[blue]<B>APT-Fehlerseite</B>m[]<FONT SIZE="-2">[1]</FONT>. Wenn Sie einen Fehler in APT berichten m&ouml;chten, lesen Sie bitte
/usr/share/doc/debian/bug-reporting.txt
oder den
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1)-Befehl. Verfassen Sie Fehlerberichte bitte auf Englisch.
<A NAME="lbAM">&nbsp;</A>
<H2>&Uuml;BERSETZUNG</H2>

<P>

Die deutsche &Uuml;bersetzung wurde 2009 von Chris Leick
&lt;<A HREF="mailto:c.leick@vollbio.de">c.leick@vollbio.de</A>&gt;
in Zusammenarbeit mit dem deutschen l10n-Team von Debian
&lt;<A HREF="mailto:debian-l10n-german@lists.debian.org">debian-l10n-german@lists.debian.org</A>&gt;
angefertigt.
<P>

Beachten Sie, dass diese &Uuml;bersetzung Teile enthalten kann, die nicht &uuml;bersetzt wurden. Dies ist so, damit kein Inhalt verloren geht, wenn die &Uuml;bersetzung hinter dem Originalinhalt hinterherh&auml;ngt.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTOREN</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="45"><DD>
</DL>

<P>

<B>APT-Team</B>
<DL COMPACT><DT id="46"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>FU&szlig;NOTEN</H2>

<DL COMPACT>
<DT id="47"> 1.<DD>
APT-Fehlerseite
<DL COMPACT><DT id="48"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="49"><A HREF="#lbAB">NAME</A><DD>
<DT id="50"><A HREF="#lbAC">BESCHREIBUNG</A><DD>
<DT id="51"><A HREF="#lbAD">SOURCES.LIST.D</A><DD>
<DT id="52"><A HREF="#lbAE">FORMAT MIT EINZEILIGEM STIL</A><DD>
<DT id="53"><A HREF="#lbAF">FORMAT IM DEB822-STIL</A><DD>
<DT id="54"><A HREF="#lbAG">DIE TYPEN &raquo;DEB&laquo; UND &raquo;DEB-SRC&laquo;: ALLGEMEINES FORMAT</A><DD>
<DT id="55"><A HREF="#lbAH">DIE TYPEN DEB UND DEB-SRC: OPTIONEN</A><DD>
<DT id="56"><A HREF="#lbAI">URI-BESCHREIBUNG</A><DD>
<DT id="57"><A HREF="#lbAJ">BEISPIELE</A><DD>
<DT id="58"><A HREF="#lbAK">SIEHE AUCH</A><DD>
<DT id="59"><A HREF="#lbAL">FEHLER</A><DD>
<DT id="60"><A HREF="#lbAM">&Uuml;BERSETZUNG</A><DD>
<DT id="61"><A HREF="#lbAN">AUTOREN</A><DD>
<DT id="62"><A HREF="#lbAO">FU&szlig;NOTEN</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:57 GMT, March 31, 2021
</BODY>
</HTML>
