
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_PREFERENCES</TITLE>
</HEAD><BODY>
<H1>APT_PREFERENCES</H1>
Section: APT (5)<BR>Updated: 17&nbsp;Enero&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOMBRE</H2>

apt_preferences - Fichero de preferencias de APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRIPCI&Oacute;N</H2>

<P>

El fichero de preferencias de APT
/etc/apt/preferences
y los segmentos de fichero dentro del directorio
/etc/apt/preferences.d/
se pueden usar para controlar las versiones de los paquetes seleccionados para su instalaci&oacute;n.
<P>

Puede disponer de varias versiones de un mismo paquete cuando el fichero
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
contiene referencias a m&aacute;s de una distribuci&oacute;n (por ejemplo, &laquo;stable&raquo; (estable) y &laquo;testing&raquo; (en pruebas)). APT asigna una prioridad a cada versi&oacute;n disponible, y limitado por las dependencias,
<B>apt-get</B>
selecciona la versi&oacute;n con mayor prioridad. Las preferencias de APT modifican las prioridades que APT asigna de forma predeterminada a las versiones de paquetes, dando control al usuario sobre qu&eacute; versi&oacute;n se seleccionar&aacute; para su instalaci&oacute;n.
<P>

Puede que est&eacute;n disponibles varios ejemplares de la misma versi&oacute;n de un paquete cuando el fichero &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; contenga referencias a m&aacute;s de una fuente. En este caso
<B>apt-get</B>
descarga el ejemplar que aparezca listado primero en el fichero &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo;. Las preferencias de APT no modifican la elecci&oacute;n del ejemplar, s&oacute;lo la elecci&oacute;n de la versi&oacute;n.
<P>

Las preferencias (&laquo;preferences&raquo;) son un gran poder en las manos de un administrador de sistemas, pero tambi&eacute;n se pueden convertir en su mayor pesadilla si se utilizan sin cuidado. APT no se cuestionar&aacute; si las preferencias contienen opciones err&oacute;neas, lo que puede generar casos de paquetes no instalables o una toma de decisiones err&oacute;nea al actualizar paquetes. Pueden surgir m&aacute;s problemas si se mezclan varias publicaciones de distribuci&oacute;n sin un correcto entendimiento de los siguientes p&aacute;rrafos. Los paquetes incluidos en una distribuci&oacute;n espec&iacute;fica no se comprueban en combinaci&oacute;n con otras distribuciones m&aacute;s antiguas o m&aacute;s recientes, y puede que no funcionen como se espera. Queda avisado.
<P>

Tenga en cuenta que los ficheros bajo el directorio
/etc/apt/preferences.d
se analizan en orden ascendente alfanum&eacute;rico, y sus nombres deben cumplir la siguiente convenci&oacute;n: el fichero no tiene extensi&oacute;n, o tiene la extensi&oacute;n
pref, y solo contiene caracteres alfanum&eacute;ricos, gui&oacute;n (-), gui&oacute;n bajo (_) y punto (.). En caso contrario APT informa que ha omitido un fichero, a menos que este fichero coincida con un patr&oacute;n en la lista de configuraci&oacute;n
Dir::Ignore-Files-Silently. Si coincide, el fichero se ignora silenciosamente.
<A NAME="lbAD">&nbsp;</A>
<H3>Asignaci&oacute;n de prioridades predeterminadas de APT</H3>

<P>

De no existir el fichero de preferencias, o si no hay ninguna entrada en &eacute;ste que se pueda aplicar a una determinada versi&oacute;n, se asigna a la versi&oacute;n la prioridad de la distribuci&oacute;n a la que pertenece. Es posible seleccionar una distribuci&oacute;n, la &gt;&gt;distribuci&oacute;n objetivo&lt;&lt; (n. t. del ingl&eacute;s
<I>target release</I>), que recibe una prioridad predefinida mayor que el resto. La distribuci&oacute;n objetivo se puede definir en la l&iacute;nea de &oacute;rdenes al ejecutar
<B>apt-get</B>
o en el fichero de configuraci&oacute;n de APT
/etc/apt/apt.conf. Tenga en cuenta que esto tiene preferencia sobre cualquier otra prioridad definida en
/etc/apt/preferencias, pero que no afecta al anclaje de paquetes espec&iacute;ficos. Por ejemplo,
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<B>apt-get install -t testing </B><B></B><I>paquete</I>
</PRE>

</DL>




<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
APT::Default-Release &quot;stable&quot;;
</PRE>

</DL>




<P>

Si se ha especificado una distribuci&oacute;n objetivo, APT usa el siguiente algoritmo para establecer las prioridades de cada versi&oacute;n de un paquete. Asignar:
<P>

priority 1
<DL COMPACT><DT id="3"><DD>
A las versiones provenientes de archivos con la opci&oacute;n &laquo;NotAutomatic: yes&raquo; en su fichero
Release, pero
<I>no</I>
como &laquo;ButAutomaticUpgrades: yes&raquo;, como el archivo
experimental
de Debian.
</DL>

<P>

prioridad 100
<DL COMPACT><DT id="4"><DD>
A la versi&oacute;n ya instalada (si existe) y a las versiones provenientes de archivos con las opciones &laquo;NotAutomatic: yes&raquo; y &laquo;ButAutomaticUpgrades: yes&raquo; en su fichero
Release, como el archivo Debian de paquetes adaptados a una versi&oacute;n anterior (&laquo;backports&raquo;) a partir de
squeeze-backports.
</DL>

<P>

prioridad 500
<DL COMPACT><DT id="5"><DD>
to the versions that do not belong to the target release.
</DL>

<P>

prioridad 990
<DL COMPACT><DT id="6"><DD>
to the versions that belong to the target release.
</DL>

The highest of those priorities whose description matches the version is assigned to the version.
<P>

Si no se define la versi&oacute;n objetivo, APT asigna una prioridad 100 a la versi&oacute;n de todos los paquetes instalados, y una prioridad 500 a todas las versiones no instaladas de paquete, a excepci&oacute;n de las provenientes de archivos con la opci&oacute;n &laquo;NotAutomatic: yes&raquo; en su fichero
Release. Estas versiones reciben la prioridad 1 o 100 si tambi&eacute;n se define la opci&oacute;n &laquo;ButAutomaticUpgrades: yes&raquo;.
<P>

APT aplica las siguientes normas, expuestas por orden de precedencia, para determinar qu&eacute; versi&oacute;n del paquete debe instalar.
<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Nunca instala una versi&oacute;n anterior de un paquete en lugar de la instalada a menos que la prioridad de la versi&oacute;n disponible supere 1000 (&laquo;Desactualizar&raquo; significa instalar una versi&oacute;n menos reciente de un paquete. Tenga en cuenta que ninguna de las prioridades que asigna APT por omisi&oacute;n superan 1000; &eacute;stas prioridades s&oacute;lo se pueden establecer mediante el fichero de preferencias. Observe que instalar una versi&oacute;n anterior del paquete puede ser peligroso).
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Instala la versi&oacute;n de mayor prioridad.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Si dos o m&aacute;s versiones tienen la misma prioridad, instala la m&aacute;s reciente (esto es, la que tiene un n&uacute;mero de versi&oacute;n mayor).
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Si dos o m&aacute;s versiones tienen la misma prioridad y n&uacute;mero de versi&oacute;n, pero o bien difieren en su meta-informaci&oacute;n o se ha introducido la opci&oacute;n
--reinstall, se instalar&aacute; la que no est&aacute; instalada.
</DL>

<P>

Generalmente, la versi&oacute;n instalada del paquete (prioridad 100) no es tan reciente como la disponible a trav&eacute;s de las fuentes en &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; (prioridad 500 o 990). En este caso, el paquete se actualizar&aacute; al ejecutar
<B>apt-get install </B><B></B><I>paquete</I>
o
<B>apt-get upgrade</B>.
<P>

Rara vez la versi&oacute;n instalada de un paquete es
<I>m&aacute;s</I>
reciente que cualquiera de las versiones disponibles. En &eacute;ste caso no se instalar&aacute; la versi&oacute;n anterior del paquete al ejecutar
<B>apt-get install </B><B></B><I>paquete</I>
o
<B>apt-get upgrade</B>.
<P>

A veces, la versi&oacute;n instalada de un paquete es m&aacute;s reciente que la versi&oacute;n perteneciente a la distribuci&oacute;n objetivo, pero no tan reciente como la versi&oacute;n de otra distribuci&oacute;n. Este tipo de paquetes se actualizar&aacute;n al ejecutar
<B>apt-get install </B><B></B><I>paquete</I>
o
<B>apt-get upgrade</B>
porque al menos
<I>uno</I>
de los ejemplares disponibles tiene una prioridad mayor que la versi&oacute;n instalada.
<A NAME="lbAE">&nbsp;</A>
<H3>El efecto de las preferencias sobre APT</H3>

<P>

El fichero de preferencias de APT permite al administrador del sistema controlar la asignaci&oacute;n de prioridades. El fichero consiste en uno o m&aacute;s registros de varias l&iacute;neas separados entre s&iacute; por espacios en blanco. Los registros pueden tener una de estos dos formatos: el espec&iacute;fico o el general.
<P>
<DL COMPACT><DT id="11"><DD>
&bull;


El formato &laquo;espec&iacute;fico&raquo; asigna una prioridad (&laquo;Pin-Priority&raquo;) a uno m&aacute;s paquetes definidos con una versi&oacute;n o un rango de versiones especificados. Por ejemplo, el siguiente registro asigna una prioridad alta a todas las versiones del paquete
perl
cuyo n&uacute;mero de versi&oacute;n empiece con &laquo;5.20&raquo;. Puede especificar varios paquetes separados por espacios.
<P>
<DL COMPACT><DT id="12"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001
</PRE>

</DL>




</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


El formato habitual asigna una prioridad a todas las versiones de los paquetes en una distribuci&oacute;n (esto es, a todas las versiones de paquetes listados en un fichero
Release
particular), o a todas las versiones de un paquete provenientes de un sitio concreto en Internet, identificado por su nombre de dominio.
<P>
Esta entrada con formato general en el fichero de preferencias de APT s&oacute;lo afecta a grupos de paquetes. Por ejemplo, el siguiente registro asigna una prioridad alta a todas las versiones disponibles desde un sitio local.
<P>
<DL COMPACT><DT id="14"><DD>



<PRE>
Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Una nota de aviso: la palabra clave usada aqu&iacute; es &laquo;origin&raquo;, el cual se puede usar para coincidir con un nombre de sistema. El siguiente registro asignar&aacute; una prioridad alta a todas las versiones disponibles desde el servidor identificado con el nombre de sistema &laquo;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&raquo;.
<P>
<DL COMPACT><DT id="15"><DD>



<PRE>
Package: *
Pin: origin &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
<I>No</I>
se debe confundir con el origen (&laquo;Origin&raquo;) de una distribuci&oacute;n tal y como se especifica un fichero
Release. Lo que sigue a la etiqueta &laquo;Origin:&raquo; en un fichero
Release
no es la direcci&oacute;n de un sitio de Internet, sino el autor o el nombre del proveedor, tales como &laquo;Debian&raquo; o &laquo;Ximian&raquo;.
<P>
El siguiente registro asigna una prioridad baja a todas las versiones de los paquetes pertenecientes a cualquier distribuci&oacute;n que tenga como nombre de archivo de paquetes &laquo;unstable&raquo; (inestable).
<P>
<DL COMPACT><DT id="16"><DD>



<PRE>
Package: *
Pin: release a=unstable
Pin-Priority: 50
</PRE>

</DL>




<P>
El siguiente registro asigna una prioridad alta a todas las versiones de los paquetes pertenecientes a cualquier distribuci&oacute;n que tenga como nombre clave &laquo;bullseye&raquo;.
<P>
<DL COMPACT><DT id="17"><DD>



<PRE>
Package: *
Pin: release n=bullseye
Pin-Priority: 900
</PRE>

</DL>




<P>
El siguiente registro asigna una prioridad alta a todas las versiones de los paquetes pertenecientes a cualquier publicaci&oacute;n que tenga como nombre de archivo de paquetes &laquo;stable&raquo; y como n&uacute;mero de versi&oacute;n &laquo;10&raquo;.
<P>
<DL COMPACT><DT id="18"><DD>



<PRE>
Package: *
Pin: release a=stable, v=10
Pin-Priority: 500
</PRE>

</DL>




</DL>

<P>
The effect of the comma operator is similar to an &quot;and&quot; in logic: All conditions must be satisfied for the pin to match. There is one exception: For any type of condition (such as two &quot;a&quot; conditions), only the last such condition is checked.
<A NAME="lbAF">&nbsp;</A>
<H3>Expresiones regulares y sintaxis <A HREF="/cgi-bin/man/man2html?7+glob">glob</A>(7)</H3>

<P>

APT tambi&eacute;n permite el anclaje mediante expresiones
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7), y expresiones regulares delimitadas con barras. Por ejemplo, la siguiente opci&oacute;n asigna una prioridad 500 a todos los paquetes del archivo experimental si el nombre comienza con &laquo;gnome&raquo; (como expresi&oacute;n de tipo
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)) o contiene la palabra &laquo;kde&raquo; (como expresi&oacute;n regular extendida POSIX delimitada por barras).
<P>
<DL COMPACT><DT id="19"><DD>



<PRE>
Package: gnome* /kde/
Pin: release a=experimental
Pin-Priority: 500
</PRE>

</DL>




<P>

La regla para estas expresiones es que pueden aparecer donde lo hace una cadena. Por ello, el siguiente anclaje asigna la prioridad 990 a todos los paquetes provenientes de una publicaci&oacute;n a partir de focal.
<P>
<DL COMPACT><DT id="20"><DD>



<PRE>
Package: *
Pin: release n=focal*
Pin-Priority: 990
</PRE>

</DL>




<P>

Si se detecta una expresi&oacute;n regular en un campo &laquo;Package&raquo;, el comportamiento sera igual que sustituir esta expresi&oacute;n regular con una lista de todos los nombres de paquetes con los que coincide. No se ha decidido si esto se modificar&aacute; en el futuro. Por ello, siempre debe enumerar los comodines de anclaje en primer lugar, para que los anclajes espec&iacute;ficos los anulen en caso de ser necesario. El patr&oacute;n &laquo;*&raquo; en un campo &laquo;Package&raquo; no se considera una expresi&oacute;n
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7).
<A NAME="lbAG">&nbsp;</A>
<H3>Pinning by source package</H3>

<P>

APT supports pinning by source packages. To pin by a source package, prepend &quot;src:&quot; to the package name.
<P>

For example, to pin all binaries produced by the apt source package of this APT's version to 990, you can do:
<P>
<DL COMPACT><DT id="21"><DD>



<PRE>
Package: src:apt
Pin: version 2.0.4
Pin-Priority: 990
</PRE>

</DL>




<P>

Source package pinning can be combined with regular expressions and glob patterns, and can also take a binary architecture.
<P>

For example, let's pin all binaries for all architectures produced by any source package containing apt in its name to 990:
<P>
<DL COMPACT><DT id="22"><DD>



<PRE>
Package: src:*apt*:any
Pin: version *
Pin-Priority: 990
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H3>Interpretaci&oacute;n de APT de las prioridades</H3>

<P>

Las prioridades (P) asignadas en el fichero de preferencias de APT deben ser n&uacute;meros enteros positivos o negativos. Se interpretan (en general) del siguiente modo:
<P>

P &gt;= 1000
<DL COMPACT><DT id="23"><DD>
La versi&oacute;n se instala incluso si es una versi&oacute;n anterior a la instalada en el sistema.
</DL>

<P>

990 &lt;= P &lt; 1000
<DL COMPACT><DT id="24"><DD>
La versi&oacute;n se instala aunque no venga de la distribuci&oacute;n objetivo, a menos que la versi&oacute;n instalada sea m&aacute;s reciente.
</DL>

<P>

500 &lt;= P &lt; 990
<DL COMPACT><DT id="25"><DD>
La versi&oacute;n se instala a menos que exista otro ejemplar disponible perteneciente a la distribuci&oacute;n objetivo, o bien si la versi&oacute;n instalada es m&aacute;s reciente.
</DL>

<P>

100 &lt;= P &lt; 500
<DL COMPACT><DT id="26"><DD>
La versi&oacute;n se instala a menos que exista una versi&oacute;n disponible perteneciente a otra distribuci&oacute;n, o si la versi&oacute;n instalada es m&aacute;s reciente.
</DL>

<P>

0 &lt; P &lt; 100
<DL COMPACT><DT id="27"><DD>
La versi&oacute;n s&oacute;lo se instala si no hay ninguna versi&oacute;n del paquete instalada.
</DL>

<P>

P &lt; 0
<DL COMPACT><DT id="28"><DD>
Evita la instalaci&oacute;n de la versi&oacute;n.
</DL>

<P>

P = 0
<DL COMPACT><DT id="29"><DD>
has undefined behaviour, do not use it.
</DL>

<P>

The first specific-form record matching an available package version determines the priority of the package version. Failing that, the priority of the package is defined as the maximum of all priorities defined by generic-form records matching the version. Records defined using patterns in the Pin field other than &quot;*&quot; are treated like specific-form records.
<P>

Por ejemplo, suponga que el fichero de preferencias de APT contiene los tres registros antes mencionados:
<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001

Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999

Package: *
Pin: release unstable
Pin-Priority: 50
</PRE>

</DL>




<P>

Por ello:
<P>
<DL COMPACT><DT id="31"><DD>
&bull;


La versi&oacute;n m&aacute;s reciente disponible del paquete
perl
se instalar&aacute; siempre que el n&uacute;mero de versi&oacute;n empiece con &laquo;5.20&raquo;. De existir
<I>cualquier</I>
versi&oacute;n 5.20* disponible de
perl, y si la versi&oacute;n instalada es 5.24*, se instalar&aacute; una versi&oacute;n anterior de
perl.
</DL>

<P>
<DL COMPACT><DT id="32"><DD>
&bull;


Cualquier otra versi&oacute;n de un paquete distinto de
perl
disponible desde el sistema local tiene prioridad sobre el resto de las versiones, incluso sobre los pertenecientes a la distribuci&oacute;n objetivo.
</DL>

<P>
<DL COMPACT><DT id="33"><DD>
&bull;


Otras versiones que tengan un origen distinto al sistema local listadas en &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; y que pertenezcan a la distribuci&oacute;n
unstable
s&oacute;lo se instalar&aacute;n si se seleccionan para su instalaci&oacute;n y si no hay ninguna versi&oacute;n del paquete ya instalado.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H3>Determinar la versi&oacute;n del paquete y las propiedades de la distribuci&oacute;n</H3>

<P>

Los recursos listados en el fichero &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; deben proporcionar los ficheros
Packages
y
Release. &Eacute;stos describen los paquetes disponibles en cada uno de los sitios.
<P>

El fichero
Packages
se suele encontrar en el directorio
.../dists/<I>nombre-dist</I>/<I>componente</I>/<I>arquitectura</I>, por ejemplo,
.../dists/stable/main/binary-i386/Packages. Este fichero consiste en una serie de registros de varias l&iacute;neas, uno por cada paquete disponible en ese directorio. S&oacute;lo dos l&iacute;neas en cada registro son relevantes a la hora de definir las prioridades de APT:
<P>

La l&iacute;nea Package:
<DL COMPACT><DT id="34"><DD>
indica el nombre del paquete.
</DL>

<P>

La l&iacute;nea Version:
<DL COMPACT><DT id="35"><DD>
indica el n&uacute;mero de versi&oacute;n del paquete.
</DL>

<P>

El fichero
Release
se suele encontrar en el directorio
.../dists/<I>nombre-dist</I>, por ejemplo
.../dists/stable/Release
o
.../dists/buster/Release. El fichero consiste en registros de una sola l&iacute;nea que se aplican a
<I>todos</I>
los paquetes por debajo del directorio padre. Al contrario que el fichero
Packages, casi todas las l&iacute;neas del fichero
Release
son relevantes para las prioridades de APT:
<P>

Las l&iacute;neas Archive: o Suite:
<DL COMPACT><DT id="36"><DD>
indican el nombre del archivo al que pertenecen todos los paquetes del &aacute;rbol de directorios. Por ejemplo, la l&iacute;nea &laquo;Archive: stable&raquo; o &laquo;Suite: stable&raquo; especifica que todos los paquetes en el &aacute;rbol de directorios por debajo del directorio ra&iacute;z marcado en el fichero
Release
est&aacute;n en un archivo &laquo;stable&raquo; (estable). Para especificar una preferencia de acuerdo con este par&aacute;metro tendr&aacute; que insertar la siguiente l&iacute;nea en el fichero de preferencias de APT:
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
Pin: release a=stable
</PRE>

</DL>




</DL>

<P>

La l&iacute;nea Codename:
<DL COMPACT><DT id="38"><DD>
indica el nombre de la distribuci&oacute;n a la que pertenecen todos los paquetes del &aacute;rbol de directorios. Por ejemplo, la l&iacute;nea &laquo;Codename: bullseye&raquo; especifica que todos los paquetes en el &aacute;rbol de directorios por debajo del directorio padre marcado en el fichero
Release
pertenecen a la versi&oacute;n llamada
bullseye. Para especificar una preferencia de acuerdo con este par&aacute;metro tendr&aacute; que poner una de las siguientes l&iacute;neas en el fichero de preferencias de APT:
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
Pin: release n=bullseye
</PRE>

</DL>




</DL>

<P>

La l&iacute;nea Version:
<DL COMPACT><DT id="40"><DD>
nombra la versi&oacute;n de la publicaci&oacute;n. Por ejemplo, los paquetes en el &aacute;rbol pueden pertenecer a la versi&oacute;n 10 de Debian. Observe que, generalmente,
testing
y
unstable
no tienen una versi&oacute;n asignada porque no se han publicado. Para especificar una preferencia de acuerdo con este par&aacute;metro tendr&aacute; que poner una de las siguientes l&iacute;nea en el fichero de preferencias de APT:
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Pin: release v=10
Pin: release a=stable, v=10
Pin: release 10
</PRE>

</DL>




</DL>

<P>

La l&iacute;nea Component:
<DL COMPACT><DT id="42"><DD>
indica la licencia asociada a los paquetes en el &aacute;rbol de directorios correspondiente al fichero
Release. Por ejemplo, la l&iacute;nea
Component: main
especifica que todos los paquetes en el &aacute;rbol de directorios pertenecen a la secci&oacute;n
main, lo cual asegura que su licencia se ajusta a las Directrices sobre software libre de Debian (DFSG). Para especificar una preferencia de acuerdo con este par&aacute;metro tendr&aacute; que poner la siguiente l&iacute;nea en el fichero de preferencias de APT:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Pin: release c=main
</PRE>

</DL>




</DL>

<P>

La l&iacute;nea Origin:
<DL COMPACT><DT id="44"><DD>
indica la procedencia de los paquetes en el &aacute;rbol de directorios del fichero
Release. La fuente m&aacute;s com&uacute;n es
Debian. Puede definir esta fuente en el fichero de preferencias de APT mediante la siguiente l&iacute;nea:
<P>
<DL COMPACT><DT id="45"><DD>



<PRE>
Pin: release o=Debian
</PRE>

</DL>




</DL>

<P>

La l&iacute;nea Label:
<DL COMPACT><DT id="46"><DD>
nombra la etiqueta de los paquetes en los &aacute;rboles de directorios del fichero
Release. Generalmente, es
Debian. Puede definir esta etiqueta en el fichero de preferencias de APT mediante la siguiente l&iacute;nea:
<P>
<DL COMPACT><DT id="47"><DD>



<PRE>
Pin: release l=Debian
</PRE>

</DL>




</DL>

<P>

Todos los ficheros
Packages
y
Release
obtenidos de los recursos en &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; se guardan en el directorio
/var/lib/apt/lists, o en el directorio definido por la variable
Dir::State::Lists, que se puede definir en el fichero
apt.conf. Por ejemplo, el fichero
debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release
contiene los ficheros
Release
obtenidos de
debian.lcs.mit.edu
para la arquitectura
binary-i386
de la secci&oacute;n
contrib
de la distribuci&oacute;n &laquo;unstable&raquo; (inestable).
<A NAME="lbAJ">&nbsp;</A>
<H3>L&iacute;neas opcionales en el registro de preferencias de APT</H3>

<P>

Cada registro en el fichero de preferencias de APT puede comenzar con una o m&aacute;s l&iacute;neas que tengan como primera palabra
Explanation:. &Uacute;til para comentarios.
<A NAME="lbAK">&nbsp;</A>
<H2>EJEMPLOS</H2>

<A NAME="lbAL">&nbsp;</A>
<H3>Seguir la distribuci&oacute;n &laquo;stable&raquo; (estable)</H3>

<P>

El siguiente fichero de preferencias de APT provoca que APT asigne una prioridad mayor de la que asigna por omisi&oacute;n (500) a todas las versiones de paquete de la distribuci&oacute;n
stable
y una prioridad m&aacute;s baja al resto de versiones de paquetes de otras distribuciones
Debian.
<P>
<DL COMPACT><DT id="48"><DD>



<PRE>
Explanation: Desinstalar o no instalar los ejemplares que no
Explanation: pertenecen a la distribuci&oacute;n estable
Package: *
Pin: release a=stable
Pin-Priority: 900

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Con un fichero &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; adecuado y el fichero de preferencias mostrado anteriormente, cualquiera de las siguientes &oacute;rdenes de APT hace que o bien todo el sistema o bien s&oacute;lo algunos paquetes se actualicen a la &uacute;ltima versi&oacute;n en
stable.
<P>
<DL COMPACT><DT id="49"><DD>



<PRE>
apt-get install <I>paquete</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

La siguiente orden hace que APT actualice un paquete a la &uacute;ltima versi&oacute;n de la distribuci&oacute;n
testing, el paquete no se actualizar&aacute; de nuevo a menos que se ejecute la orden otra vez.
<P>
<DL COMPACT><DT id="50"><DD>



<PRE>
apt-get install <I>paquete</I>/testing
</PRE>

</DL>




<P>
<A NAME="lbAM">&nbsp;</A>
<H3>Seguir la distribuci&oacute;n &laquo;testing&raquo; (en pruebas) o &laquo;unstable&raquo; (inestable)</H3>

<P>

El siguiente fichero de preferencias de APT provocar&aacute; que APT asigne mayor prioridad a las versiones de la distribuci&oacute;n
testing, una prioridad menor a los paquetes de la distribuci&oacute;n
unstable, y una prioridad prohibitiva a los paquetes de otras distribuciones de
Debian.
<P>
<DL COMPACT><DT id="51"><DD>



<PRE>
Package: *
Pin: release a=testing
Pin-Priority: 900

Package: *
Pin: release a=unstable
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Con un fichero
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
adecuado y el fichero de preferencias anterior cualquiera de las siguientes &oacute;rdenes har&aacute; que APT actualice los paquetes a la &uacute;ltima versi&oacute;n de la distribuci&oacute;n
testing.
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
apt-get install <I>paquete</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

La siguiente orden hace que APT actualice un determinado paquete a la &uacute;ltima versi&oacute;n de la distribuci&oacute;n
unstable. M&aacute;s tarde,
<B>apt-get upgrade</B>
actualizar&aacute; el paquete a la &uacute;ltima versi&oacute;n de la distribuci&oacute;n
testing
si es m&aacute;s reciente que la versi&oacute;n instalada. De otro modo, se instalar&aacute; la versi&oacute;n m&aacute;s reciente de la distribuci&oacute;nunstable
si es m&aacute;s reciente que la versi&oacute;n instalada.
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
apt-get install <I>paquete</I>/unstable
</PRE>

</DL>




<P>
<A NAME="lbAN">&nbsp;</A>
<H3>Seguir la evoluci&oacute;n de una publicaci&oacute;n por el nombre</H3>

<P>

El siguiente fichero de preferencias de APT provocar&aacute; que APT asigne una prioridad superior a la predeterminada (500) a todas las versiones de paquetes pertenecientes a un nombre de distribuci&oacute;n especificado, y una prioridad prohibitivamente baja a las versiones de paquetes pertenecientes a otras distribuciones de
Debian, nombres clave y archivos Debian. Tenga en cuenta que con esta preferencia, APT seguir&aacute; la migraci&oacute;n de una publicaci&oacute;n desde el archivo
testing
a
stable
y por &uacute;ltimo
oldstable. Si desea seguir, por ejemplo, el progreso en
testing
obviando el nombre de la publicaci&oacute;n, deber&iacute;a usar los ejemplos de configuraci&oacute;n mencionados anteriormente.
<P>
<DL COMPACT><DT id="54"><DD>



<PRE>
Explanation: Eliminar o no instalar cualquier paquete de Debian cuya versi&oacute;n sea
Explanation: distinta a aquellos en las distribuciones de nombre squeeze o sid
Package: *
Pin: release n=bullseye
Pin-Priority: 900

Explanation: El nombre clave de Debian &laquo;unstable&raquo; siempre es sid
Package: *
Pin: release n=sid
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Con un fichero &laquo;<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)&raquo; adecuado y el fichero de preferencias mostrado anteriormente, cualquiera de las siguientes &oacute;rdenes provocar&aacute; que APT actualice los paquetes a la &uacute;ltima versi&oacute;n de la distribuci&oacute;n llamada
bullseye.
<P>
<DL COMPACT><DT id="55"><DD>



<PRE>
apt-get install <I>paquete</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

La siguiente orden hace que APT actualice un determinado paquete a la &uacute;ltima versi&oacute;n de la distribuci&oacute;n
sid. M&aacute;s tarde,
<B>apt-get upgrade</B>
actualizar&aacute; el paquete a la &uacute;ltima versi&oacute;n de la distribuci&oacute;nbullseye
si es m&aacute;s reciente que la versi&oacute;n instalada. De otro modo, se instalar&aacute; la versi&oacute;n m&aacute;s reciente de la distribuci&oacute;n
sid
si es m&aacute;s reciente que la versi&oacute;n instalada.
<P>
<DL COMPACT><DT id="56"><DD>



<PRE>
apt-get install <I>paquete</I>/sid
</PRE>

</DL>




<P>
<A NAME="lbAO">&nbsp;</A>
<H2>FICHEROS</H2>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="57"><DD>
Ficheros de preferencias de versi&oacute;n. Aqu&iacute; puede especificar el anclaje (&quot;pinning&quot;), una preferencia para conseguir ciertos paquetes a partir de una fuente diferente o de una versi&oacute;n diferente de una distribuci&oacute;n. Opci&oacute;n de configuraci&oacute;n:
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="58"><DD>
Fragmentos de fichero para las preferencias de la versi&oacute;n. Opci&oacute;n de configuraci&oacute;n:
Dir::Etc::PreferencesParts.
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>V&Eacute;ASE TAMBI&Eacute;N</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>P&aacute;gina de errores de APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Si quiere informar de un error en APT, consulte
/usr/share/doc/debian/bug-reporting.txt
o use la orden
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAR">&nbsp;</A>
<H2>TRADUCCI&Oacute;N</H2>

<P>

La traducci&oacute;n al espa&ntilde;ol la realizaron Ismael Fanlo, Carlos Mestre, Rudy Godoy, Gustavo Saldumbide, Javier Fern&aacute;ndez-Sanguino y Rub&eacute;n Porras Campo entre los a&ntilde;os 2003 y 2004. La traducci&oacute;n fue actualizada por Francisco Javier Cuadrado y Omar Campagne Polaino entre los a&ntilde;os 2009 y 2012 .
<P>

Tenga en cuenta que este documento puede contener secciones sin traducir. Esto es intencionado para evitar perder contenido cuando la traducci&oacute;n no est&aacute; actualizada con respecto al documento original.
<A NAME="lbAS">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipo de APT</B>
<DL COMPACT><DT id="59"><DD>
</DL>

<A NAME="lbAT">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="60"> 1.<DD>
P&aacute;gina de errores de APT
<DL COMPACT><DT id="61"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="62"><A HREF="#lbAB">NOMBRE</A><DD>
<DT id="63"><A HREF="#lbAC">DESCRIPCI&Oacute;N</A><DD>
<DL>
<DT id="64"><A HREF="#lbAD">Asignaci&oacute;n de prioridades predeterminadas de APT</A><DD>
<DT id="65"><A HREF="#lbAE">El efecto de las preferencias sobre APT</A><DD>
<DT id="66"><A HREF="#lbAF">Expresiones regulares y sintaxis glob(7)</A><DD>
<DT id="67"><A HREF="#lbAG">Pinning by source package</A><DD>
<DT id="68"><A HREF="#lbAH">Interpretaci&oacute;n de APT de las prioridades</A><DD>
<DT id="69"><A HREF="#lbAI">Determinar la versi&oacute;n del paquete y las propiedades de la distribuci&oacute;n</A><DD>
<DT id="70"><A HREF="#lbAJ">L&iacute;neas opcionales en el registro de preferencias de APT</A><DD>
</DL>
<DT id="71"><A HREF="#lbAK">EJEMPLOS</A><DD>
<DL>
<DT id="72"><A HREF="#lbAL">Seguir la distribuci&oacute;n &laquo;stable&raquo; (estable)</A><DD>
<DT id="73"><A HREF="#lbAM">Seguir la distribuci&oacute;n &laquo;testing&raquo; (en pruebas) o &laquo;unstable&raquo; (inestable)</A><DD>
<DT id="74"><A HREF="#lbAN">Seguir la evoluci&oacute;n de una publicaci&oacute;n por el nombre</A><DD>
</DL>
<DT id="75"><A HREF="#lbAO">FICHEROS</A><DD>
<DT id="76"><A HREF="#lbAP">V&Eacute;ASE TAMBI&Eacute;N</A><DD>
<DT id="77"><A HREF="#lbAQ">BUGS</A><DD>
<DT id="78"><A HREF="#lbAR">TRADUCCI&Oacute;N</A><DD>
<DT id="79"><A HREF="#lbAS">AUTOR</A><DD>
<DT id="80"><A HREF="#lbAT">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:04:59 GMT, March 31, 2021
</BODY>
</HTML>
