
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-MIRR</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-MIRR</H1>
Section: APT (1)<BR>Updated: 09&nbsp;Dezembro&nbsp;2017<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-transport-mirror - Transporte do APT para selec&ccedil;&atilde;o de mirror mais automatizada
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

Este transporte do APT n&atilde;o est&aacute; por si s&oacute; a implementar um protocolo para aceder a reposit&oacute;rios locais ou remotos, mas obt&ecirc;m uma mirrorlist e redirecciona todos os pedidos para os mirro(s) retirados dessa lista, acedendo a eles via outros transportes como
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1). A funcionalidade b&aacute;sica esteve dispon&iacute;vel desde o apt 0.7.24, mas n&atilde;o esteve documentada at&eacute; ao apt 1.6 o qual continha uma reconstru&ccedil;&atilde;o do transporte e das suas funcionalidades suportadas. Note que um transporte nunca &eacute; chamado directamente por um utilizador mas &eacute; usado pelas ferramentas do APT com base na configura&ccedil;&atilde;o do utilizador.
<P>

Se a aquisi&ccedil;&atilde;o de um ficheiro via um mirror falhar, o m&eacute;todo assegura que outro mirror poss&iacute;vel da lista &eacute; tentado automaticamente at&eacute; que o ficheiro seja obtido ou n&atilde;o houver mais nenhum mirror na lista lidando transparentemente com servidores desligados e problemas semelhantes.
<P>

As implica&ccedil;&otilde;es de seguran&ccedil;a do transporte dependem das considera&ccedil;&otilde;es de seguran&ccedil;a associadas ao transporte usado para adquirir a mirrorlist e os transportes envolvidos no acesso ao(s) mirror(s) escolhidos pelo transporte.
<A NAME="lbAD">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Este transporte presentemente n&atilde;o tem op&ccedil;&otilde;es de configura&ccedil;&atilde;o. A selec&ccedil;&atilde;o do mirror &eacute; inteiramente baseada nos mirrors oferecidos na mirrorlist e nos ficheiros que o APT precisa de obter.
<A NAME="lbAE">&nbsp;</A>
<H3>Formato de mirrorlist</H3>

<P>

Uma mirrorlist cont&ecirc;m uma ou mais linhas cada uma especificando um URI para um mirror. S&atilde;o ignoradas as linhas vazias e aquelas come&ccedil;adas com um cardinal (#). Um URI come&ccedil;a sempre com um esquema URI que define o transporte usado para esse mirror. Se por exemplo o URI come&ccedil;ar com
http:, o transporte respons&aacute;vel &eacute;
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
o qual pode ter requerimentos espec&iacute;ficos para o formato da parte restante do URI.
<P>

Podem ser fornecidos na mesma linha meta-dados acerca do mirror, separados do URI por um tab. M&uacute;ltiplos itens de meta-dados podem eles pr&oacute;prios serem separados por tabs ou espa&ccedil;os. (Esta &eacute; uma funcionalidade avan&ccedil;ada apenas dispon&iacute;vel no apt &gt;= 1.6. As vers&otilde;es anteriores do apt ir&atilde;o falhar ao analisar mirrorlists que usem esta funcionalidade.)
<P>

Desde o apt 1.6 que &eacute; tamb&eacute;m suportado o uso de mirrorlists comprimidas. Note que o nome do ficheiro da mirrorlist t&ecirc;m de especificar o algoritmo de compress&atilde;o usado, n&atilde;o h&aacute; auto-detec&ccedil;&atilde;o baseada no conte&uacute;do do ficheiro.
<A NAME="lbAF">&nbsp;</A>
<H3>Selec&ccedil;&atilde;o do Mirror por meta-dados</H3>

<P>

Como especificado no formato, um mirror pode ter meta-dados adicionais acrescentados para impedir que um mirror seja seleccionado para obter um ficheiro que n&atilde;o corresponda a esses meta-dados. Deste modo a mirrorlist pode por exemplo conter mirrors parciais que servem apenas certas arquitecturas e o APT ir&aacute; automaticamente escolher um mirror diferente para ficheiros que requeiram uma arquitectura n&atilde;o listada. S&atilde;o suportados limites para a arquitectura (arch), nome de c&oacute;digo do lan&ccedil;amento (codename), componente do reposit&oacute;rio onde o ficheiro est&aacute; (component), linguagem a que o ficheiro se aplica (lang), nome de suite do lan&ccedil;amento (suite) e o tipo do ficheiro (type).
<A NAME="lbAG">&nbsp;</A>
<H3>Ordem de recurso para mirrors</H3>

<P>

Se nenhuma prioridade for dada para um mirror via chave de meta-dados
priority, a ordem em que os mirrors s&atilde;o contactados &eacute; aleat&oacute;ria. Se um certo conjunto de mirrors deve ser tentado primeiro antes de qualquer outro, pode ser explicitamente definida uma prioridade. Os mirrors com o n&uacute;mero menor s&atilde;o tentados primeiro. Os mirrors que n&atilde;o t&ecirc;m prioridade expl&iacute;cita definida s&atilde;o definidos com o n&uacute;mero mais alto poss&iacute;vel e assim s&atilde;o tentados em &uacute;ltimo. A escolha entre mirrors com a mesma prioridade &eacute; de novo aleat&oacute;ria.
<A NAME="lbAH">&nbsp;</A>
<H3>Transportes permitidos numa mirrorlist</H3>

<P>

A disponibilidade e escolha dos transportes numa mirrorlist est&aacute; limitada em como io cliente do APT est&aacute; a aceder &agrave; mirrorlist. Se for usado um transporte local como
file
ou
copy, a mirrorlist tamb&eacute;m pode incluir fontes locais, enquanto que uma mirrorlist acedida via
http
n&atilde;o pode. Adicionalmente, uma mirrorlist n&atilde;o pode conter outra mirrorlist ou outros transportes de inv&oacute;lucro (como
apt-transport-tor). Veja a documenta&ccedil;&atilde;o destes transportes em como os usar com o m&eacute;todo de mirror.
<P>

Note que as vers&otilde;es do apt anteriores a 1.6 n&atilde;o suportam mais nenhum transporte para al&eacute;m de
http.
<A NAME="lbAI">&nbsp;</A>
<H2>EXEMPLOS</H2>

<A NAME="lbAJ">&nbsp;</A>
<H3>Exemplo b&aacute;sico</H3>

<P>

Um exemplo de mirrorlist b&aacute;sico suportado por todas as vers&otilde;es do apt com um m&eacute;todo de mirror (&gt;= 0.7.24) no qual o cliente ir&aacute; pegar em qualquer um dos tr&ecirc;s mirrors:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<A HREF="http://ftp.de.debian.org/debian/">http://ftp.de.debian.org/debian/</A>
<A HREF="http://ftp.us.debian.org/debian/">http://ftp.us.debian.org/debian/</A>
<A HREF="http://deb.debian.org/debian/">http://deb.debian.org/debian/</A>
</PRE>

</DL>




<P>

Assumindo que um ficheiro com este conte&uacute;do est&aacute; armazenado em
/etc/apt/mirrorlist.txt
na sua m&aacute;quina, pode ser usado desta maneira em
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
(desde o apt 1.6):
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
deb mirror+file:/etc/apt/mirrorlist.txt buster main
</PRE>

</DL>




<P>

Todas as vers&otilde;es do m&eacute;todo mirror suportam uma mirrorlist acess&iacute;vel via HTTP, portanto assumindo que est&aacute; dispon&iacute;vel em
<A HREF="http://apt.example.org/mirror.lst">http://apt.example.org/mirror.lst</A>
a entrada sources.list de cima poder&aacute;, em vez dessa, ser escrita como:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
deb <A HREF="mirror://apt.example.org/mirror.lst">mirror://apt.example.org/mirror.lst</A> buster main
</PRE>

</DL>




<P>

Note que desde o apt 1.6 que o uso de
mirror+http
deve ser preferido a
mirror
para uniformidade. A funcionalidade &eacute; a mesma.
<A NAME="lbAK">&nbsp;</A>
<H3>Exemplo com selec&ccedil;&atilde;o de mirror de meta-dados-avan&ccedil;ado</H3>

<P>

Como explicado nas defini&ccedil;&otilde;es de formato as vers&otilde;es do apt anteriores a 1.6 n&atilde;o suportam isto e ir&atilde;o falhar ao analisar a mirrorlist. Este exemplo de mirrorlist &eacute; complicada intencionalmente para mostrar alguns aspectos da selec&ccedil;&atilde;o. &Eacute; assumida a seguinte configura&ccedil;&atilde;o: O primeiro mirror &eacute; um mirror local acedido via m&eacute;todo file, mas potencialmente incompleto. O segundo mirror tem uma boa liga&ccedil;&atilde;o, mas &eacute; um mirror parcial pois s&oacute; cont&eacute;m ficheiros relacionados com as arquitecturas
amd64
e
all. Os restantes mirrors s&atilde;o mirrors m&eacute;dios que s&atilde;o devem ser contactados se os anteriores n&atilde;o funcionarem.
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
file:/srv/local/debian/mirror/  priority:1 type:index
<A HREF="http://partial.example.org/mirror/">http://partial.example.org/mirror/</A>      priority:2 arch:amd64 arch:all type:deb
<A HREF="http://ftp.us.debian.org/debian/">http://ftp.us.debian.org/debian/</A>        type:deb
<A HREF="http://ftp.de.debian.org/debian/">http://ftp.de.debian.org/debian/</A>        type:deb
<A HREF="https://deb.debian.org/debian/">https://deb.debian.org/debian/</A>
</PRE>

</DL>




<P>

Nesta configura&ccedil;&atilde;o com esta mirrorlist o primeiro mirror ser&aacute; usado para descarregar todos os ficheiros de &iacute;ndice assumindo que a pr&oacute;pria mirrorlist &eacute; acedida via transporte local como
file. Se n&atilde;o o for, o mirror &eacute; caso contr&aacute;rio inacess&iacute;vel ou se n&atilde;o conter o ficheiro requisitado, ser&aacute; usado outro mirror para obter o ficheiro, escolhido dependendo do tipo de ficheiro. Um ficheiro index ser&aacute; servido pelo &uacute;ltimo mirror da lista, enquanto um pacote da arquitectura
amd64
&eacute; servido pelo segundo e aqueles, por exemplo, da arquitectura
i386
por um dos &uacute;ltimos tr&ecirc;s.
<A NAME="lbAL">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAM">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="5"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="6"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="7"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="8"><A HREF="#lbAB">NOME</A><DD>
<DT id="9"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="10"><A HREF="#lbAD">OP&Ccedil;&Otilde;ES</A><DD>
<DL>
<DT id="11"><A HREF="#lbAE">Formato de mirrorlist</A><DD>
<DT id="12"><A HREF="#lbAF">Selec&ccedil;&atilde;o do Mirror por meta-dados</A><DD>
<DT id="13"><A HREF="#lbAG">Ordem de recurso para mirrors</A><DD>
<DT id="14"><A HREF="#lbAH">Transportes permitidos numa mirrorlist</A><DD>
</DL>
<DT id="15"><A HREF="#lbAI">EXEMPLOS</A><DD>
<DL>
<DT id="16"><A HREF="#lbAJ">Exemplo b&aacute;sico</A><DD>
<DT id="17"><A HREF="#lbAK">Exemplo com selec&ccedil;&atilde;o de mirror de meta-dados-avan&ccedil;ado</A><DD>
</DL>
<DT id="18"><A HREF="#lbAL">BUGS</A><DD>
<DT id="19"><A HREF="#lbAM">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="20"><A HREF="#lbAN">AUTOR</A><DD>
<DT id="21"><A HREF="#lbAO">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:21 GMT, March 31, 2021
</BODY>
</HTML>
