
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-HTTP</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-HTTP</H1>
Section: APT (1)<BR>Updated: 04&nbsp;Abril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-transport-http - Transporte do APT para descarregar via Hypertext Transfer Protocol (HTTP)
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

Este transporte do APT permite o uso de reposit&oacute;rios acedidos via Hypertext Transfer Protocol (HTTP). Est&aacute; dispon&iacute;vel por predefini&ccedil;&atilde;o e &eacute; provavelmente o mais usado de todos os transportes. Note que um transporte nunca chamado directamente por um utilizador mas &eacute; usado pelas ferramentas do APT baseadas na configura&ccedil;&atilde;o do utilizador.
<P>

HTTP &eacute; um protocolo de transporte n&atilde;o encriptado o que significa que toda a comunica&ccedil;&atilde;o com o servidor remoto (ou proxy) pode ser observada por um atacante com capacidades suficientes que geralmente &eacute; referido por &quot;man in the middle&quot; (MITM). No entanto, tal atacante
<I>n&atilde;o</I>
consegue modificar a comunica&ccedil;&atilde;o para comprometer a seguran&ccedil;a do seu sistema, pois o modelo de seguran&ccedil;a dos dados do APT &eacute; independente do m&eacute;todo de transporte escolhido. Isto est&aacute; explicado em detalhe em
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8). Uma vis&atilde;o geral dos m&eacute;todos de transporte dispon&iacute;veis &eacute; dada em
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAD">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

V&aacute;rias op&ccedil;&otilde;es podem ser definidas num ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para modificar este comportamento, indo de configura&ccedil;&atilde;o de proxy at&eacute; maneiras de contornar limita&ccedil;&otilde;es espec&iacute;ficas de servidores.
<A NAME="lbAE">&nbsp;</A>
<H3>Configura&ccedil;&atilde;o do Proxy</H3>

<P>

A vari&aacute;vel de ambiente
<B>http_proxy</B>
&eacute; suportada pela configura&ccedil;&atilde;o de todo o sistema. Proxies espec&iacute;ficos para o APT podem ser configurados via op&ccedil;&atilde;o
Acquire::http::Proxy. Proxies que devem ser usados apenas para certas m&aacute;quinas podem ser especificados via
Acquire::http::Proxy::<I>m&aacute;quina</I>. At&eacute; um controle mais afinado pode ser obtido via auto-detec&ccedil;&atilde;o de proxy, detalhado mais abaixo. Todas estas op&ccedil;&otilde;es usam o formato URI
<I>esquema</I>://[[<I>utilizador</I>][:<I>palavra-passe</I>]@]<I>maquina</I>[:<I>porto</I>]/. OS esquemas URI suportados s&atilde;o
socks5h
(SOCKS5 com resolu&ccedil;&atilde;o DNS remota),
http
e
https. Os detalhes de autentica&ccedil;&atilde;o podem ser fornecidos via
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
em vez de os incluir directamente no URI.
<P>

as v&aacute;rias op&ccedil;&otilde;es de configura&ccedil;&atilde;o do APT suportam o valor especial
DIRECT
significando que nenhum proxy dever&aacute; ser usado. A vari&aacute;vel de ambiente
<B>no_proxy</B>
&eacute; tamb&eacute;m suportada para o mesmo objectivo.
<P>

Mais ainda, existem tr&ecirc;s defini&ccedil;&otilde;es disponibilizadas para controle de cache como caches de proxy compat&iacute;veis com HTTP/1.1.
Acquire::http::No-Cache
diz ao proxy para n&atilde;o usar a sua resposta em cache sob nenhumas circunst&acirc;ncias,
Acquire::http::Max-Age
define a idade m&aacute;xima permitida (em segundos) de um ficheiro &iacute;ndice na cache do proxy.
Acquire::http::No-Store
especifica que o proxy n&atilde;o deve armazenar os ficheiros de arquivo pedidos na sua cache, o que pode ser usado para prevenir que o proxy polua a sua cache com (grandes) ficheiros .deb.
<A NAME="lbAF">&nbsp;</A>
<H3>Configura&ccedil;&atilde;o do Proxy Autom&aacute;tica</H3>

<P>

Acquire::http::Proxy-Auto-Detect
pode ser usado para especificar um comando externo para descobrir o proxy HTTP a usar. O primeiro e &uacute;nico par&acirc;metro &eacute; um URL que aponta para a m&aacute;quina a contactar para permitir uma configura&ccedil;&atilde;o espec&iacute;fica para essa m&aacute;quina. O APT espera que o comando forne&ccedil;a o resultado do proxy no stdout numa &uacute;nica linha no formato URI anteriormente especificado ou a palavra
DIRECT
se n&atilde;o dever&aacute; ser usado nenhum proxy. Nenhum resultado fornecido indica que devem ser usadas as defini&ccedil;&otilde;es de proxy gen&eacute;ricas.
<P>

Note que a auto-detec&ccedil;&atilde;o n&atilde;o ser&aacute; usada para uma m&aacute;quina se uma configura&ccedil;&atilde;o de proxy espec&iacute;fica de m&aacute;quina j&aacute; estiver definida via
Acquire::http::Proxy::<I>m&aacute;quina</I>.
<P>

Veja os pacotes
<B><A HREF="/cgi-bin/man/man2html?1+squid-deb-proxy-client">squid-deb-proxy-client</A></B>(1)
e
<B><A HREF="/cgi-bin/man/man2html?1+auto-apt-proxy">auto-apt-proxy</A></B>(1)
para exemplos de implementa&ccedil;&otilde;es.
<P>

Esta op&ccedil;&atilde;o toma preced&ecirc;ncia sobre a op&ccedil;&atilde;o antiga de nome
Acquire::http::ProxyAutoDetect.
<A NAME="lbAG">&nbsp;</A>
<H3>Configura&ccedil;&atilde;o de Liga&ccedil;&atilde;o</H3>

<P>

A op&ccedil;&atilde;o
Acquire::http::Timeout
define o tempo limite usado por este m&eacute;todo, este valor aplica-se &agrave; liga&ccedil;&atilde;o assim como os tempos de limite de dados.
<P>

A largura de banda usada pode ser limitada com
Acquire::http::Dl-Limit
que aceita valores inteiros em kilobytes por segundo. O valor predefinido &eacute; 0 que desactiva o limite e tenta usar toda a largura de banda dispon&iacute;vel. Note que esta op&ccedil;&atilde;o implicitamente desactiva a descarga a partir de m&uacute;ltiplos servidores ao mesmo tempo.
<P>

A defini&ccedil;&atilde;o
Acquire::http::Pipeline-Depth
pode ser usada para activar o 'pipelining' de HTTP (RFC 2616 sec&ccedil;&atilde;o 8.1.2.2) a qual pode ser ben&eacute;fica por exemplo em liga&ccedil;&otilde;es de alta lat&ecirc;ncia. Especifica quantos pedidos s&atilde;o enviados num pipeline. O APT tenta detectar e contornar servidores web e proxies com comportamentos impr&oacute;prios durante a sua execu&ccedil;&atilde;o, mas se voc&ecirc; sabe que o seu n&atilde;o est&aacute; em conformidade com a especifica&ccedil;&atilde;o HTTP/1.1, a liga&ccedil;&atilde;o via pipe pode ser desactivada ao definir o valor para 0. Por predefini&ccedil;&atilde;o est&aacute; activado com o valor 10.
<P>

Acquire::http::AllowRedirect
controla se o APT ir&aacute; seguir os redireccionamentos, o que est&aacute; activo por predefini&ccedil;&atilde;o.
<P>

Acquire::http::User-Agent
pode ser usado para definir um Utilizador-Agente diferente para o m&eacute;todo de download por http, porque alguns proxies apenas permitem acesso a clientes se o cliente usar um identificador conhecido.
<P>

Acquire::http::SendAccept
est&aacute; activa por predefini&ccedil;&atilde;o e envia um campo de cabe&ccedil;alho
Accept: text/*
para o servidor para pedidos sem extens&atilde;o do ficheiro para prevenir que o servidor tente negocia&ccedil;&atilde;o de conte&uacute;do.
<A NAME="lbAH">&nbsp;</A>
<H2>EXEMPLOS</H2>

<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
Acquire::http {
        Proxy::example.org &quot;DIRECT&quot;;
        Proxy &quot;socks5h://apt:<A HREF="mailto:pass@127.0.0.1">pass@127.0.0.1</A>:9050&quot;;
        Proxy-Auto-Detect &quot;/usr/local/bin/apt-http-proxy-auto-detect&quot;;
        No-Cache &quot;true&quot;;
        Max-Age &quot;3600&quot;;
        No-Store &quot;true&quot;;
        Timeout &quot;10&quot;;
        Dl-Limit &quot;42&quot;;
        Pipeline-Depth &quot;0&quot;;
        AllowRedirect &quot;false&quot;;
        User-Agent &quot;My APT-HTTP&quot;;
        SendAccept &quot;false&quot;;
};
</PRE>

</DL>




<A NAME="lbAI">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAJ">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="2"><DD>
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="3"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="4"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NOME</A><DD>
<DT id="6"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="7"><A HREF="#lbAD">OP&Ccedil;&Otilde;ES</A><DD>
<DL>
<DT id="8"><A HREF="#lbAE">Configura&ccedil;&atilde;o do Proxy</A><DD>
<DT id="9"><A HREF="#lbAF">Configura&ccedil;&atilde;o do Proxy Autom&aacute;tica</A><DD>
<DT id="10"><A HREF="#lbAG">Configura&ccedil;&atilde;o de Liga&ccedil;&atilde;o</A><DD>
</DL>
<DT id="11"><A HREF="#lbAH">EXEMPLOS</A><DD>
<DT id="12"><A HREF="#lbAI">VEJA TAMB&Eacute;M</A><DD>
<DT id="13"><A HREF="#lbAJ">BUGS</A><DD>
<DT id="14"><A HREF="#lbAK">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="15"><A HREF="#lbAL">AUTOR</A><DD>
<DT id="16"><A HREF="#lbAM">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:21 GMT, March 31, 2021
</BODY>
</HTML>
