
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-FTPARCHIVE</TITLE>
</HEAD><BODY>
<H1>APT-FTPARCHIVE</H1>
Section: APT (1)<BR>Updated: 10&nbsp;Maio&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-ftparchive - Utilit&aacute;rio para gerar ficheiros de &iacute;ndice
<A NAME="lbAC">&nbsp;</A>
<H2>SINOPSE</H2>

<DL COMPACT>
<DT id="1">
<B>apt-ftparchive</B> [<B>-dsq</B>] [<B>--md5</B>] [<B>--delink</B>] [<B>--readonly</B>] [<B>--contents</B>] [<B>--arch&nbsp;</B><B></B><I>architecture</I>] [<B>-o=</B><B></B><I>config_string</I>] [<B>-c=</B><B></B><I>ficheiro_de_configura&ccedil;&atilde;o</I>] {packages&nbsp;<I>caminho</I>...&nbsp;[<I>ficheiro_de_sobreposi&ccedil;&atilde;o</I>&nbsp;[<I>prefixo_de_caminho</I>]]  | sources&nbsp;<I>caminho</I>...&nbsp;[<I>ficheiro_de_sobreposi&ccedil;&atilde;o</I>&nbsp;[<I>prefixo_de_caminho</I>]]  | contents&nbsp;<I>caminho</I>  | release&nbsp;<I>caminho</I>  | generate&nbsp;<I>ficheiro_de_configura&ccedil;&atilde;o</I>&nbsp;<I>sec&ccedil;&atilde;o</I>...  | clean&nbsp;<I>ficheiro_de_configura&ccedil;&atilde;o</I>  | {-v&nbsp;|&nbsp;--version} | {-h&nbsp;|&nbsp;--help}}
</DL>
<A NAME="lbAD">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

<B>apt-ftparchive</B>
&eacute; a ferramenta de linha de comandos que cria os ficheiros &iacute;ndice que o APT usa para aceder a uma fonte de distribui&ccedil;&atilde;o. Os ficheiros &iacute;ndice devem ser gerados no site de origem baseados no conte&uacute;do desse site.
<P>

<B>apt-ftparchive</B>
&eacute; um super conjunto do programa
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1), incorporando todas as suas funcionalidades atrav&eacute;s do comando
<DD>packages. Tamb&eacute;m cont&eacute;m um gerador de ficheiro de conte&uacute;dos,
contents, e um meio elaborado de colocar em script o processo de gera&ccedil;&atilde;o para um arquivo completo.
<P>

Internamente o
<B>apt-ftparchive</B>
pode fazer uso de bases de dados bin&aacute;rias para por em cache os conte&uacute;dos de um ficheiro .deb e n&atilde;o precisa de nenhum programa externo &agrave; excep&ccedil;&atilde;o do
<B><A HREF="/cgi-bin/man/man2html?1+gzip">gzip</A></B>(1). Quando faz uma gera&ccedil;&atilde;o completa, executa automaticamente verifica&ccedil;&otilde;es de altera&ccedil;&otilde;es de ficheiros e constr&oacute;i os ficheiros comprimidos desejados.
<P>

A menos que a op&ccedil;&atilde;o
<B>-h</B>, ou
<B>--help</B>
seja fornecida, um dos comandos abaixo t&ecirc;m que estar presentes.
<P>

<B>packages</B>
<DL COMPACT><DT id="2"><DD>
O comando packages gera um ficheiro pacote a partir duma &aacute;rvore de direct&oacute;rios. Recebe um dado direct&oacute;rio e procura recursivamente por ficheiros .deb, emitindo um registo de pacote para o stdout por cada um. Este comando &eacute; aproximadamente equivalente ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1).
<P>
A op&ccedil;&atilde;o
<B>--db</B>
pode ser usada para especificar uma base de dados de cache bin&aacute;ria.
</DL>

<P>

<B>sources</B>
<DL COMPACT><DT id="3"><DD>
O comando
sources
gera um &iacute;ndice de fonte a partir duma &aacute;rvore de direct&oacute;rios. Recebe um dado direct&oacute;rio e procura recursivamente por ficheiros .dsc, emitindo um registo de fonte para o stdout por cada um. Este comando &eacute; aproximadamente equivalente ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scansources">dpkg-scansources</A></B>(1).
<P>
Se for especificado um ficheiro de sobreposi&ccedil;&atilde;o ent&atilde;o ser&aacute; procurado um ficheiro de sobreposi&ccedil;&atilde;o de fonte com uma extens&atilde;o de .src. A op&ccedil;&atilde;o --source-override pode ser usada para alterar o ficheiro de sobreposi&ccedil;&atilde;o de fonte que ir&aacute; ser usado.
</DL>

<P>

<B>contents</B>
<DL COMPACT><DT id="4"><DD>
O comandocontents
gera um ficheiro de conte&uacute;dos a partir duma &aacute;rvore de direct&oacute;rios. Recebe um dado direct&oacute;rio e procura recursivamente por ficheiros .deb, e l&ecirc; a lista de ficheiros de cada ficheiro. Ent&atilde;o organiza e escreve para o stdout a lista de ficheiros correspondente a pacotes. Os direct&oacute;rios n&atilde;o s&atilde;o escritos no sa&iacute;da. Se m&uacute;ltiplos pacotes possu&iacute;rem o mesmo ficheiro ent&atilde;o cada pacote &eacute; separado por uma v&iacute;rgula na sa&iacute;da.
<P>
A op&ccedil;&atilde;o
<B>--db</B>
pode ser usada para especificar uma base de dados de cache bin&aacute;ria.
</DL>

<P>

<B>release</B>
<DL COMPACT><DT id="5"><DD>
O comando
release
gera um ficheiro Release a partir de uma &aacute;rvore de direct&oacute;rios. Por predefini&ccedil;&atilde;o, procura recursivamente no direct&oacute;rio fornecido por ficheiros
Packages,
Sources,
Contents,
Components
e
icons
comprimidos e n&atilde;o comprimidos assim como ficheiros
Release,
Index
e
md5sum.txt
por predefini&ccedil;&atilde;o. (APT::FTPArchive::Release::Default-Patterns). Padr&otilde;es adicionais de nomes de ficheiros pode ser adicionados ao list&aacute;-los em
APT::FTPArchive::Release::Patterns. Depois escreve para o stdout um ficheiro
Release
que cont&eacute;m (por predefini&ccedil;&atilde;o) um resultado de MD5, SHA1, SHA256 e SHA512 para cada ficheiro.
<P>
Valores para os campos de metadados adicionais no ficheiro Release s&atilde;o tomados a partir das vari&aacute;veis correspondentes sob
APT::FTPArchive::Release, ex.
APT::FTPArchive::Release::Origin. Os campos suportados s&atilde;o
Origin,
Label,
Suite,
Version,
Codename,
Date,
NotAutomatic,
ButAutomaticUpgrades,
Acquire-By-Hash,
Valid-Until,
Signed-By,
Architectures,
Components
e
Description.
</DL>

<P>

<B>generate</B>
<DL COMPACT><DT id="6"><DD>
O comando
generate
&eacute; desenhado para ser executado a partir dum script cron e constr&oacute;i &iacute;ndices de acordo com o ficheiro de configura&ccedil;&atilde;o fornecido. A linguagem de configura&ccedil;&atilde;o disponibiliza um meio flex&iacute;vel de de especificar quais ficheiros &iacute;ndice s&atilde;o constru&iacute;dos a partir de quais direct&oacute;rios, assim como disponibilizar um meio simples de manter as defini&ccedil;&otilde;es requeridas.
</DL>

<P>

<B>clean</B>
<DL COMPACT><DT id="7"><DD>
O comando
clean
arruma as bases de dados usadas pelo ficheiro de configura&ccedil;&atilde;o fornecido ao remover quaisquer registos que j&aacute; n&atilde;o s&atilde;o necess&aacute;rios.
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>A CONFIGURA&Ccedil;&Atilde;O DO GENERATE</H2>

<P>

O comando
generate
usa um ficheiro de configura&ccedil;&atilde;o para descrever os arquivos que v&atilde;o ser gerados. Segue o formato t&iacute;pico de configura&ccedil;&atilde;o ISC como visto em ferramentas ISC como o bind 8 e dhcpd.
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
cont&eacute;m uma descri&ccedil;&atilde;o da sintaxe. Note que a configura&ccedil;&atilde;o gerada &eacute; analisada de maneira seccional, mas o
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
&eacute; analisado numa maneira de &aacute;rvore. Isto apenas afecta o modo de como a etiqueta scope &eacute; manuseada.
<P>

A configura&ccedil;&atilde;o do generate tem 4 sec&ccedil;&otilde;es separadas, cada uma descrita mais abaixo.
<A NAME="lbAF">&nbsp;</A>
<H3>Sec&ccedil;&atilde;o Dir</H3>

<P>

A sec&ccedil;&atilde;o
Dir
define os direct&oacute;rios standard necess&aacute;rios para localizar os ficheiros requisitados durante o processo de gera&ccedil;&atilde;o. Estes direct&oacute;rios precedem a certos caminhos relativos definidos em sec&ccedil;&otilde;es posteriores para produzir um caminho completo e absoluto.
<P>

<B>ArchiveDir</B>
<DL COMPACT><DT id="8"><DD>
Especifica a raiz do arquivo FTP, numa configura&ccedil;&atilde;o Debian standard este &eacute; o direct&oacute;rio que cont&eacute;m o
ls-LR
e n&oacute;s da distribui&ccedil;&atilde;o.
</DL>

<P>

<B>OverrideDir</B>
<DL COMPACT><DT id="9"><DD>
Especifica a localiza&ccedil;&atilde;o dos ficheiros de sobrepor.
</DL>

<P>

<B>CacheDir</B>
<DL COMPACT><DT id="10"><DD>
Especifica a localiza&ccedil;&atilde;o dos ficheiros de cache
</DL>

<P>

<B>FileListDir</B>
<DL COMPACT><DT id="11"><DD>
Especifica a localiza&ccedil;&atilde;o dos ficheiros de listas de ficheiros, se a defini&ccedil;&atilde;o
FileList
for usada mais abaixo.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H3>Sec&ccedil;&atilde;o Default</H3>

<P>

A sec&ccedil;&atilde;o
Default
especifica valores predefinidos, e defini&ccedil;&otilde;es que controlam a opera&ccedil;&atilde;o do gerador. Outras sec&ccedil;&otilde;es podem sobrepor estas predefini&ccedil;&otilde;es em uma defini&ccedil;&atilde;o por-sec&ccedil;&atilde;o.
<P>

<B>Packages::Compress</B>
<DL COMPACT><DT id="12"><DD>
Define os esquemas de compress&atilde;o predefinidos a usar para os ficheiros de &iacute;ndice package. &Eacute; uma string que cont&eacute;m uma lista separada por espa&ccedil;os de pelo menos um dos compressores configurados via scope de configura&ccedil;&atilde;o
<B>APT::Compressor</B>. A predefini&ccedil;&atilde;o para todos os esquemas de compress&atilde;o &eacute; '. gzip'.
</DL>

<P>

<B>Packages::Extensions</B>
<DL COMPACT><DT id="13"><DD>
Define a lista predefinida das extens&otilde;es de ficheiros que s&atilde;o ficheiros pacote. A predefini&ccedil;&atilde;o &eacute; '.deb'.
</DL>

<P>

<B>Sources::Compress</B>
<DL COMPACT><DT id="14"><DD>
Isto &eacute; semelhante a
Packages::Compress
excepto que controla a compress&atilde;o para os ficheiros das Fontes.
</DL>

<P>

<B>Sources::Extensions</B>
<DL COMPACT><DT id="15"><DD>
Define a lista predefinida das extens&otilde;es de ficheiros que s&atilde;o ficheiros de fontes. A predefini&ccedil;&atilde;o &eacute; '.dsc'.
</DL>

<P>

<B>Contents::Compress</B>
<DL COMPACT><DT id="16"><DD>
Isto &eacute; semelhante a
Packages::Compress
excepto que controla a compress&atilde;o para os ficheiros de Conte&uacute;dos.
</DL>

<P>

<B>Translation::Compress</B>
<DL COMPACT><DT id="17"><DD>
Isto &eacute; semelhante a
Packages::Compress
excepto que controla a compress&atilde;o para o ficheiro mestre Translation-en.
</DL>

<P>

<B>DeLinkLimit</B>
<DL COMPACT><DT id="18"><DD>
Especifica o n&uacute;mero de kilobytes para delink (e substitui com hard links) por execu&ccedil;&atilde;o. Isto &eacute; usado em conjunto com a defini&ccedil;&atilde;o
External-Links
por sec&ccedil;&atilde;o.
</DL>

<P>

<B>FileMode</B>
<DL COMPACT><DT id="19"><DD>
Especifica o modo de todos os ficheiros &iacute;ndice criados. A predefini&ccedil;&atilde;o &eacute; 0644. Todos os ficheiros &iacute;ndice s&atilde;o definidos para este modo independentemente do umask.
</DL>

<P>

<B>LongDescription</B>
<DL COMPACT><DT id="20"><DD>
Define se as descri&ccedil;&otilde;es longas devem ser inclu&iacute;das no ficheiro
Packages
ou divididas em um ficheiro
Translation-en
mestre.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H3>Sec&ccedil;&atilde;o TreeDefault</H3>

<P>

Define predefini&ccedil;&otilde;es espec&iacute;ficas para as sec&ccedil;&otilde;es
Tree. Todas estas vari&aacute;veis s&atilde;o vari&aacute;veis de substitui&ccedil;&atilde;o e t&ecirc;m as strings $(DIST), $(SECTION) e $(ARCH) substitu&iacute;das pelos seus respectivos valores.
<P>

<B>MaxContentsChange</B>
<DL COMPACT><DT id="21"><DD>
Define o n&uacute;mero de kilobytes dos ficheiros de conte&uacute;do que s&atilde;o gerados a cada dia. Os ficheiros de conte&uacute;do s&atilde;o re-circulados para que ao fim de alguns dias todos sejam reconstru&iacute;dos.
</DL>

<P>

<B>ContentsAge</B>
<DL COMPACT><DT id="22"><DD>
Controla o n&uacute;mero de dias que se permite a um ficheiro de conte&uacute;do ser verificado sem altera&ccedil;&atilde;o. Se este limite for ultrapassado o mtime do ficheiro de conte&uacute;do &eacute; actualizado. Este caso pode ocorrer se o ficheiro de pacote &eacute; alterado num modo que n&atilde;o resulta num novo ficheiro de conte&uacute;do [por exemplo uma edi&ccedil;&atilde;o de sobreposi&ccedil;&atilde;o]. &Eacute; permitido um soltar na esperan&ccedil;a que novos .debs sejam instalados, requerendo um novo ficheiro de qualquer modo. A predefini&ccedil;&atilde;o &eacute; 10, as unidades s&atilde;o em dias.
</DL>

<P>

<B>Directory</B>
<DL COMPACT><DT id="23"><DD>
Define o topo da &aacute;rvore de direct&oacute;rios .deb. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/$(SECTION)/binary-$(ARCH)/
</DL>

<P>

<B>SrcDirectory</B>
<DL COMPACT><DT id="24"><DD>
Define o topo da &aacute;rvore de direct&oacute;rios de pacotes fonte. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/$(SECTION)/source/
</DL>

<P>

<B>Packages</B>
<DL COMPACT><DT id="25"><DD>
Define o ficheiro Packages de sa&iacute;da. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/$(SECTION)/binary-$(ARCH)/Packages
</DL>

<P>

<B>Sources</B>
<DL COMPACT><DT id="26"><DD>
Define o ficheiro Sources de sa&iacute;da. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/$(SECTION)/source/Sources
</DL>

<P>

<B>Translation</B>
<DL COMPACT><DT id="27"><DD>
Define se o ficheiro mestre Translation-en de sa&iacute;da com as descri&ccedil;&otilde;es longas n&atilde;o deve ser inclu&iacute;do no ficheiro Packages. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/$(SECTION)/i18n/Translation-en
</DL>

<P>

<B>InternalPrefix</B>
<DL COMPACT><DT id="28"><DD>
Define o prefixo de caminho que causa que um symlink seja considerado um link interno em vez de um link externo. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/$(SECTION)/
</DL>

<P>

<B>Contents</B>
<DL COMPACT><DT id="29"><DD>
Define a sa&iacute;da do ficheiro Contents. A predefini&ccedil;&atilde;o &eacute;
$(DIST)/Contents-$(ARCH). Se esta defini&ccedil;&atilde;o causar m&uacute;ltiplos ficheiros Packages para mapear em um &uacute;nico ficheiro Contents (tal como a predefini&ccedil;&atilde;o) ent&atilde;o o
<B>apt-ftparchive</B>
ir&aacute; automaticamente integrar esses ficheiros pacotes todos juntos.
</DL>

<P>

<B>Contents::Header</B>
<DL COMPACT><DT id="30"><DD>
Define o ficheiro cabe&ccedil;alho para prefixar a sa&iacute;da de conte&uacute;dos.
</DL>

<P>

<B>BinCacheDB</B>
<DL COMPACT><DT id="31"><DD>
Define a base de dados de cache bin&aacute;ria a usar para esta sec&ccedil;&atilde;o. M&uacute;ltiplas sec&ccedil;&otilde;es podem partilhar a mesma base de dados.
</DL>

<P>

<B>FileList</B>
<DL COMPACT><DT id="32"><DD>
Especifica que em vez de navegar na &aacute;rvore de direct&oacute;rios, o
<B>apt-ftparchive</B>
dever&aacute; ler a lista de ficheiros a partir do ficheiro fornecido. Nomes de ficheiros relativos s&atilde;o prefixados com o direct&oacute;rio de arquivo.
</DL>

<P>

<B>SourceFileList</B>
<DL COMPACT><DT id="33"><DD>
Especifica que em vez de navegar na &aacute;rvore de direct&oacute;rios, o
<B>apt-ftparchive</B>
dever&aacute; ler a lista de ficheiros a partir do ficheiro fornecido. Nomes de ficheiros relativos s&atilde;o prefixados com o direct&oacute;rio de arquivo. Isto &eacute; usado quando se processa &iacute;ndices de fonte.
</DL>

<A NAME="lbAI">&nbsp;</A>
<H3>Sec&ccedil;&atilde;o Tree</H3>

<P>

A sec&ccedil;&atilde;o
Tree
define uma &aacute;rvore de ficheiros Debian standard que consiste de um direct&oacute;rio base, depois m&uacute;ltiplas sec&ccedil;&otilde;es nesse direct&oacute;rio base e finalmente m&uacute;ltiplas Arquitecturas em cada sec&ccedil;&atilde;o. O caminho exacto usado &eacute; definido pela vari&aacute;vel de substitui&ccedil;&atilde;o
Directory.
<P>

A sec&ccedil;&atilde;o
Tree
recebe uma etiqueta scope que define a vari&aacute;vel
$(DIST)
e define a raiz da &aacute;rvore (o caminho &eacute; prefixado por
ArchiveDir). Tipicamente esta &eacute; uma defini&ccedil;&atilde;o tal como
dists/buster.
<P>

Todas as defini&ccedil;&otilde;es definidas na sec&ccedil;&atilde;o
TreeDefault
podem ser usadas na sec&ccedil;&atilde;o
Tree
assim como as novas tr&ecirc;s vari&aacute;veis.
<P>

Quando processa uma sec&ccedil;&atilde;o
Tree, o
<B>apt-ftparchive</B>
executa uma opera&ccedil;&atilde;o semelhante a:
<P>
<DL COMPACT><DT id="34"><DD>



<PRE>
for i in Sections do 
   for j in Architectures do
      Generate for DIST=scope SECTION=i ARCH=j
     
</PRE>

</DL>




<P>
<P>

<B>Sections</B>
<DL COMPACT><DT id="35"><DD>
Isto &eacute; uma lista de sec&ccedil;&otilde;es separada por espa&ccedil;os que aparece sob a distribui&ccedil;&atilde;o, tipicamente isto &eacute; algo como
main contrib non-free
</DL>

<P>

<B>Architectures</B>
<DL COMPACT><DT id="36"><DD>
Esta &eacute; uma lista separada por espa&ccedil;os de todas as arquitecturas que aparecem sob a sec&ccedil;&atilde;o de busca. A arquitectura especial 'source' &eacute; usada para indicar que esta &aacute;rvore tem um arquivo fonte. A arquitectura 'all' assinala que ficheiros espec&iacute;ficos de arquitectura como o
Packages
n&atilde;o devem incluir informa&ccedil;&atilde;o acerca de pacotes de
todas
as arquitecturas em todos os ficheiros pois estes estar&atilde;o dispon&iacute;veis num ficheiro dedicado.
</DL>

<P>

<B>LongDescription</B>
<DL COMPACT><DT id="37"><DD>
Define se as descri&ccedil;&otilde;es longas devem ser inclu&iacute;das no ficheiro
Packages
ou divididas em um ficheiro
Translation-en
mestre.
</DL>

<P>

<B>BinOverride</B>
<DL COMPACT><DT id="38"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o bin&aacute;rio. O ficheiro de sobreposi&ccedil;&atilde;o informa&ccedil;&atilde;o de sec&ccedil;&atilde;o, prioridade e endere&ccedil;o do respons&aacute;vel.
</DL>

<P>

<B>SrcOverride</B>
<DL COMPACT><DT id="39"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o fonte. O ficheiro de sobreposi&ccedil;&atilde;o informa&ccedil;&atilde;o de sec&ccedil;&atilde;o.
</DL>

<P>

<B>ExtraOverride</B>
<DL COMPACT><DT id="40"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o extra bin&aacute;rio.
</DL>

<P>

<B>SrcExtraOverride</B>
<DL COMPACT><DT id="41"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o extra fonte.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H3>Sec&ccedil;&atilde;o BinDirectory</H3>

<P>

A sec&ccedil;&atilde;o
bindirectory
define uma &aacute;rvore de direct&oacute;rios bin&aacute;rios sem nenhuma estrutura especial. A etiqueta scope especifica a localiza&ccedil;&atilde;o do direct&oacute;rio bin&aacute;rio e as defini&ccedil;&otilde;es s&atilde;o semelhantes &agrave;s da sec&ccedil;&atilde;o
Tree
sem nenhumas vari&aacute;veis de substitui&ccedil;&atilde;o ou defini&ccedil;&otilde;es
SectionArchitecture.
<P>

<B>Packages</B>
<DL COMPACT><DT id="42"><DD>
Define a sa&iacute;da do ficheiro Packages.
</DL>

<P>

<B>Sources</B>
<DL COMPACT><DT id="43"><DD>
Define a sa&iacute;da do ficheiro Sources. &Eacute; necess&aacute;rio pelo menos um de
Packages
ou
Sources.
</DL>

<P>

<B>Contents</B>
<DL COMPACT><DT id="44"><DD>
Define a sa&iacute;da do ficheiro Contents (opcional)
</DL>

<P>

<B>BinOverride</B>
<DL COMPACT><DT id="45"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o bin&aacute;rio.
</DL>

<P>

<B>SrcOverride</B>
<DL COMPACT><DT id="46"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o fonte.
</DL>

<P>

<B>ExtraOverride</B>
<DL COMPACT><DT id="47"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o extra bin&aacute;rio.
</DL>

<P>

<B>SrcExtraOverride</B>
<DL COMPACT><DT id="48"><DD>
Define o ficheiro de sobreposi&ccedil;&atilde;o extra fonte.
</DL>

<P>

<B>BinCacheDB</B>
<DL COMPACT><DT id="49"><DD>
Define a base de dados de cache.
</DL>

<P>

<B>PathPrefix</B>
<DL COMPACT><DT id="50"><DD>
Acrescenta um caminho a todos os caminhos de sa&iacute;da.
</DL>

<P>

<B>FileList</B>, <B>SourceFileList</B>
<DL COMPACT><DT id="51"><DD>
Especifica o ficheiro de lista de ficheiros.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>O FICHEIRO BINARY OVERRIDE</H2>

<P>

O ficheiro de sobreposi&ccedil;&atilde;o bin&aacute;rio &eacute; totalmente compat&iacute;vel com
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scanpackages">dpkg-scanpackages</A></B>(1). Cont&eacute;m 4 campos separados por espa&ccedil;os. O primeiro campo &eacute; o nome do pacote, o segundo &eacute; a prioridade a qual for&ccedil;ar esse pacote, o terceiro &eacute; a sec&ccedil;&atilde;o onde for&ccedil;ar esse pacote e o &uacute;ltimo campo &eacute; o campo de permuta&ccedil;&atilde;o do respons&aacute;vel.
<P>

O formato geral do campo do respons&aacute;vel &eacute;:
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
old [// oldn]* =&gt; new
</PRE>

</DL>




<P>
ou simplesmente,
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
new
</PRE>

</DL>




<P>
. O primeiro formato permite uma lista separada por um duplo slash (//) de antigos endere&ccedil;os e email a serem especificados. Se nenhum destes for encontrado ent&atilde;o 'new' &eacute; substitu&iacute;do para o campo do respons&aacute;vel. O segundo formato substitui incondicionalmente o campo do respons&aacute;vel.
<A NAME="lbAL">&nbsp;</A>
<H2>O FICHEIRO SOURCE OVERRIDE</H2>

<P>

O ficheiro de sobreposi&ccedil;&atilde;o de fonte &eacute; totalmente compat&iacute;vel com
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-scansources">dpkg-scansources</A></B>(1). Cont&eacute;m dois campos separados por espa&ccedil;os. O primeiro campo &eacute; o nome de pacote fonte, o segundo &eacute; a sec&ccedil;&atilde;o onde o atribuir.
<A NAME="lbAM">&nbsp;</A>
<H2>O FICHEIRO EXTRA OVERRIDE</H2>

<P>

O ficheiro de sobreposi&ccedil;&atilde;o extra permite que qualquer etiqueta arbitr&aacute;ria seja adicionada ou substitu&iacute;da na sa&iacute;da. Tem 3 colunas, a primeira &eacute; o pacote, a segunda &eacute; a etiqueta e restante da linha &eacute; o novo valor.
<A NAME="lbAN">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

Todas as op&ccedil;&otilde;es de linha de comandos podem ser definidas usando o ficheiro de configura&ccedil;&atilde;o, as descri&ccedil;&otilde;es indicam a op&ccedil;&atilde;o de configura&ccedil;&atilde;o a definir. Para op&ccedil;&otilde;es booleanas voc&ecirc; pode sobre por o ficheiro de configura&ccedil;&atilde;o usando algo como
<B>-f-</B>,<B>--no-f</B>,
<B>-f=no</B>
ou v&aacute;rias outras variantes.
<P>

<B>--md5</B>, <B>--sha1</B>, <B>--sha256</B>, <B>--sha512</B>
<DL COMPACT><DT id="54"><DD>
Gera o sum&aacute;rio de verifica&ccedil;&atilde;o dado. Estas op&ccedil;&otilde;es est&atilde;o ligadas por predefini&ccedil;&atilde;o, quando s&atilde;o desligadas os ficheiros de &iacute;ndice gerados n&atilde;o ter&atilde;o os campos de sum&aacute;rio de verifica&ccedil;&atilde;o onde forem poss&iacute;veis. Items de Configura&ccedil;&atilde;o:
APT::FTPArchive::<I>Checksum</I>
e
APT::FTPArchive::<I>Index</I>::<I>Checksum</I>
Onde
<I>Index</I>
pode ser
Packages,
Sources
ou
Release
e
<I>Checksum</I>
pode ser
MD5,
SHA1,
SHA256
ou
SHA512.
</DL>

<P>

<B>-d</B>, <B>--db</B>
<DL COMPACT><DT id="55"><DD>
Usa uma base de dados de cache bin&aacute;ria. Isto n&atilde;o tem efeito no comando generate. Item de configura&ccedil;&atilde;o:
APT::FTPArchive::DB.
</DL>

<P>

<B>-q</B>, <B>--quiet</B>
<DL COMPACT><DT id="56"><DD>
Silencioso; produz sa&iacute;da apropriada para registar em logs, omitindo indicadores de progresso. Mais q's ir&atilde;o produzir mais silencio at&eacute; um m&aacute;ximo de 2. Voc&ecirc; tamb&eacute;m pode usar
<B>-q=#</B>
para definir o n&iacute;vel de sil&ecirc;ncio, sobrepondo o ficheiro de configura&ccedil;&atilde;o. Item de Configura&ccedil;&atilde;o:
quiet.
</DL>

<P>

<B>--delink</B>
<DL COMPACT><DT id="57"><DD>
Executa Dissocia&ccedil;&atilde;o. Se &eacute; usada a defini&ccedil;&atilde;o
External-Links
ent&atilde;o esta op&ccedil;&atilde;o activa a dissocia&ccedil;&atilde;o dos ficheiros. A sua predefini&ccedil;&atilde;o &eacute; ligada e e pode ser desligada com
<B>--no-delink</B>. Item de Configura&ccedil;&atilde;o:
APT::FTPArchive::DeLinkAct.
</DL>

<P>

<B>--contents</B>
<DL COMPACT><DT id="58"><DD>
Executa a gera&ccedil;&atilde;o de conte&uacute;dos. Quando esta op&ccedil;&atilde;o est&aacute; definida e os &iacute;ndices de pacotes s&atilde;o gerados com um base de dados cache ent&atilde;o a listagem de ficheiros tamb&eacute;m ser&aacute; extra&iacute;da e guardada na base de dados para utiliza&ccedil;&atilde;o posterior. Quando se usa o comando generate, esta op&ccedil;&atilde;o tamb&eacute;m permite a cria&ccedil;&atilde;o de quaisquer ficheiros de Conte&uacute;dos. A predefini&ccedil;&atilde;o &eacute; ligado. Item de Configura&ccedil;&atilde;o:
APT::FTPArchive::Contents.
</DL>

<P>

<B>-s</B>, <B>--source-override</B>
<DL COMPACT><DT id="59"><DD>
Selecciona o ficheiro de sobreposi&ccedil;&atilde;o de fonte a usar com o comando
sources. Item de Configura&ccedil;&atilde;o:
APT::FTPArchive::SourceOverride.
</DL>

<P>

<B>--readonly</B>
<DL COMPACT><DT id="60"><DD>
Torna as bases de dados de cache apenas de leitura. Item de Configura&ccedil;&atilde;o:
APT::FTPArchive::ReadOnlyDB.
</DL>

<P>

<B>-a</B>, <B>--arch</B>
<DL COMPACT><DT id="61"><DD>
Aceita nos comandos
packages
e
contents
apenas ficheiros de pacotes que condizem com
*_arch.deb
ou
*_all.deb
em vez de todos os ficheiros de pacotes presentes no caminho fornecido. Item de Configura&ccedil;&atilde;o:
APT::FTPArchive::Architecture.
</DL>

<P>

<B>APT::FTPArchive::AlwaysStat</B>
<DL COMPACT><DT id="62"><DD>
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1)
p&otilde;e em cache o m&aacute;ximo poss&iacute;vel de metadados numa base de dados de cache. Se os pacotes forem recompilados e/ou republicados de novo com a mesma vers&atilde;o, ir&aacute; originar problemas porque ser&atilde;o usados os metadados desactualizados em cache como o tamanho e sum&aacute;rios de verifica&ccedil;&atilde;o. Com esta op&ccedil;&atilde;o activa isto n&atilde;o ir&aacute; mais acontecer porque ser&aacute; verificado se o ficheiro foi alterado. Note que esta op&ccedil;&atilde;o vem regulada para &quot;false&quot; por predefini&ccedil;&atilde;o pois n&atilde;o &eacute; recomendado disponibilizar m&uacute;ltiplas vers&otilde;es/compila&ccedil;&otilde;es de um pacote com o mesmo n&uacute;mero de vers&atilde;o, portanto em teoria ningu&eacute;m ir&aacute; ter estes problemas e ent&atilde;o todas as verifica&ccedil;&otilde;es extras ser&atilde;o desnecess&aacute;rias.
</DL>

<P>

<B>APT::FTPArchive::LongDescription</B>
<DL COMPACT><DT id="63"><DD>
Esta op&ccedil;&atilde;o de configura&ccedil;&atilde;o tem a predefini&ccedil;&atilde;o de &quot;true&quot; e deve apenas ser definida para
&quot;false&quot;
se o Arquivo gerado com
<B><A HREF="/cgi-bin/man/man2html?1+apt-ftparchive">apt-ftparchive</A></B>(1)
tamb&eacute;m disponibilizar ficheiros
Translation. Note que o ficheiro mestre
Translation-en
s&oacute; pode ser criado no comando generate.
</DL>

<P>

<B>-h</B>, <B>--help</B>
<DL COMPACT><DT id="64"><DD>
Mostra um sum&aacute;rio curto da utiliza&ccedil;&atilde;o.
</DL>

<P>

<B>-v</B>, <B>--version</B>
<DL COMPACT><DT id="65"><DD>
Mostra a vers&atilde;o do programa.
</DL>

<P>

<B>-c</B>, <B>--config-file</B>
<DL COMPACT><DT id="66"><DD>
Ficheiro de Configura&ccedil;&atilde;o; Especifica o ficheiro de configura&ccedil;&atilde;o a usar. O programa ir&aacute; ler o ficheiro de configura&ccedil;&atilde;o predefinido e depois este ficheiro de configura&ccedil;&atilde;o. Se as defini&ccedil;&otilde;es de configura&ccedil;&atilde;o precisarem de ser definidas antes, os ficheiros de configura&ccedil;&atilde;o predefinidos s&atilde;o analisados especificando um ficheiro com a vari&aacute;vel de ambiente
<B>APT_CONFIG</B>. Veja
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
para informa&ccedil;&atilde;o de sintaxe.
</DL>

<P>

<B>-o</B>, <B>--option</B>
<DL COMPACT><DT id="67"><DD>
Define uma Op&ccedil;&atilde;o de Configura&ccedil;&atilde;o; Isto ir&aacute; definir uma op&ccedil;&atilde;o de configura&ccedil;&atilde;o arbitr&aacute;ria. A sintaxe &eacute;
<B>-o Foo::Bar=bar</B>.
<B>-o</B>
e
<B>--option</B>
podem ser usadas v&aacute;rias vezes para definir op&ccedil;&otilde;es diferentes.
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>EXEMPLOS</H2>

<P>

Para criar um ficheiro Packages comprimido para um direct&oacute;rio que cont&eacute;m pacotes bin&aacute;rios (.deb):
<P>
<DL COMPACT><DT id="68"><DD>



<PRE>
<B>apt-ftparchive</B> pacotes <I>direct&oacute;rio</I> | <B>gzip</B> &gt; Packages.gz
</PRE>

</DL>




<A NAME="lbAP">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>DIAGN&Oacute;STICO</H2>

<P>

<B>apt-ftparchive</B>
devolve zero na opera&ccedil;&atilde;o normal, 100 decimal em erro.
<A NAME="lbAR">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAS">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAT">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="69"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="70"><DD>
</DL>

<A NAME="lbAU">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="71"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="72"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="73"><A HREF="#lbAB">NOME</A><DD>
<DT id="74"><A HREF="#lbAC">SINOPSE</A><DD>
<DT id="75"><A HREF="#lbAD">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="76"><A HREF="#lbAE">A CONFIGURA&Ccedil;&Atilde;O DO GENERATE</A><DD>
<DL>
<DT id="77"><A HREF="#lbAF">Sec&ccedil;&atilde;o Dir</A><DD>
<DT id="78"><A HREF="#lbAG">Sec&ccedil;&atilde;o Default</A><DD>
<DT id="79"><A HREF="#lbAH">Sec&ccedil;&atilde;o TreeDefault</A><DD>
<DT id="80"><A HREF="#lbAI">Sec&ccedil;&atilde;o Tree</A><DD>
<DT id="81"><A HREF="#lbAJ">Sec&ccedil;&atilde;o BinDirectory</A><DD>
</DL>
<DT id="82"><A HREF="#lbAK">O FICHEIRO BINARY OVERRIDE</A><DD>
<DT id="83"><A HREF="#lbAL">O FICHEIRO SOURCE OVERRIDE</A><DD>
<DT id="84"><A HREF="#lbAM">O FICHEIRO EXTRA OVERRIDE</A><DD>
<DT id="85"><A HREF="#lbAN">OP&Ccedil;&Otilde;ES</A><DD>
<DT id="86"><A HREF="#lbAO">EXEMPLOS</A><DD>
<DT id="87"><A HREF="#lbAP">VEJA TAMB&Eacute;M</A><DD>
<DT id="88"><A HREF="#lbAQ">DIAGN&Oacute;STICO</A><DD>
<DT id="89"><A HREF="#lbAR">BUGS</A><DD>
<DT id="90"><A HREF="#lbAS">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="91"><A HREF="#lbAT">AUTORES</A><DD>
<DT id="92"><A HREF="#lbAU">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:21 GMT, March 31, 2021
</BODY>
</HTML>
