
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT-TRANSPORT-HTTP</TITLE>
</HEAD><BODY>
<H1>APT-TRANSPORT-HTTP</H1>
Section: APT (1)<BR>Updated: 11&nbsp;Maio&nbsp;2018<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt-transport-https - Transporte do APT para descarregar via Protocolo Seguro HTTP (HTTPS)
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

Este transporte do APT permite o uso de reposit&oacute;rios acedidos via HTTP Secure protocol (HTTPS), tamb&eacute;m chamado de HTTP sobre TLS. Est&aacute; dispon&iacute;vel por predefini&ccedil;&atilde;o desde o apt 1.5 e estava dispon&iacute;vel antes no pacote
apt-transport-https. Note que um transporte nunca &eacute; chamado directamente por um utilizador mas usado pelas ferramentas do APT com base na configura&ccedil;&atilde;o do utilizador.
<P>

HTTP &eacute; por si pr&oacute;prio um protocolo de transporte n&atilde;o encriptado (comprove
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)), o qual, sendo indicado pelo S acrescentado, fica embrulhado numa camada encriptada conhecida por Transport Layer Security (TLS) para disponibilizar encripta&ccedil;&atilde;o fim-para-fim. Um atacante com habilidades suficientes pode mesmo assim observar os colegas de comunica&ccedil;&atilde;o e uma an&aacute;lise mais profunda &agrave; comunica&ccedil;&atilde;o encriptada pode mesmo assim revelar detalhes importantes. Uma vis&atilde;o geral sobre m&eacute;todos de transporte dispon&iacute;veis alternativos &eacute; dada em
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5).
<A NAME="lbAD">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES</H2>

<P>

O protocolo HTTPS &eacute; baseado no protocolo HTTP, assim todas as op&ccedil;&otilde;es suportadas pelo
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
s&atilde;o tamb&eacute;m suportadas via
Acquire::https
e ir&atilde;o usa por predefini&ccedil;&atilde;o os mesmos valores especificados para
Acquire::http. Esta manual ir&aacute; apenas documentar as op&ccedil;&otilde;es
<I>&uacute;nicas para https</I>.
<A NAME="lbAE">&nbsp;</A>
<H3>Credenciais do Servidor</H3>

<P>

Por predefini&ccedil;&atilde;o todos os pacotes confi&aacute;veis pelo sistema (veja o pacote
ca-certificates) s&atilde;o usados para a verifica&ccedil;&atilde;o do certificado do servidor. Uma autoridade de certifica&ccedil;&atilde;o (CA) alternativa pode ser configurada com a op&ccedil;&atilde;o
Acquire::https::CAInfo
e a sua op&ccedil;&atilde;o especifica de m&aacute;quina
Acquire::https::CAInfo::<I>m&aacute;quina</I>. A op&ccedil;&atilde;o CAInfo especifica um ficheiro feito de certificados CA (em formato PEM) todos concatenados para criar a cadeia que o APT deve usar para verificar o caminho do seu certificado de raiz auto-assinado. Se o servidor remoto fornecer a cadeia inteira durante a transfer&ecirc;ncia, o ficheiro precisa apenas de conter o certificado de raiz. Caso contr&aacute;rio, &eacute; precisa a cadeia inteira. Se precisar de suportar m&uacute;ltiplas autoridades, a &uacute;nica maneira &eacute; concatenar tudo.
<P>

Uma lista de revoga&ccedil;&atilde;o de certificados personalizada (CRL) pode ser configurada com as op&ccedil;&otilde;es
Acquire::https::CRLFile
e
Acquire::https::CRLFile::<I>m&aacute;quina</I>. Como a op&ccedil;&atilde;o anterior, um ficheiro em formato PEM precisa de ser especificado.
<A NAME="lbAF">&nbsp;</A>
<H3>Desactivar a seguran&ccedil;a</H3>

<P>

Durante a autentica&ccedil;&atilde;o do servidor, se a verifica&ccedil;&atilde;o do certificado falhar por alguma raz&atilde;o (expirada, revogada, intermedi&aacute;rios, etc), a liga&ccedil;&atilde;o falha. Isto &eacute; obviamente o que voc&ecirc; espera em todos os casos e o que o valor predefinido (true) da op&ccedil;&atilde;o
Acquire::https::Verify-Peer
e o que a variante especifica da m&aacute;quina fornece. Se voc&ecirc; sabe
<I>exactamente</I>
o que est&aacute; a fazer, definir esta op&ccedil;&atilde;o para &quot;false&quot; permite saltar a verifica&ccedil;&atilde;o de certificado de peer e concluir a transac&ccedil;&atilde;o com sucesso. Mais uma vez, esta op&ccedil;&atilde;o serve para objectivos de depura&ccedil;&atilde;o e testes apenas pois ela remove toda a seguran&ccedil;a fornecida pelo uso de HTTPS.
<P>

De modo semelhante a op&ccedil;&atilde;o
Acquire::https::Verify-Host
e a sua variante especifica de m&aacute;quina pode ser usada para desactivar uma funcionalidade de seguran&ccedil;a. O certificado fornecido pelo servidor inclui a identidade do servidor a qual deve corresponder ao nome DNS usado para lhe aceder. Por predefini&ccedil;&atilde;o, e como pedido por RFC 2818, o nome do mirror &eacute; verificado contra a identidade encontrada no certificado. Este comportamento predefinido &eacute; seguro e n&atilde;o deve ser alterado, ,mas se voc&ecirc; sabe que o servidor que est&aacute; a usar tem um nome DNS que n&atilde;o corresponde &agrave; identidade no seu certificado, voc&ecirc; pode definir a op&ccedil;&atilde;o para &quot;false&quot;, o que ir&aacute; impedir que a compara&ccedil;&atilde;o seja feita.
<A NAME="lbAG">&nbsp;</A>
<H3>Autentica&ccedil;&atilde;o do cliente</H3>

<P>

Para al&eacute;m de suportar autentica&ccedil;&atilde;o baseada em palavra-passe (veja
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)) o HTTPS tamb&eacute;m suporta autentica&ccedil;&atilde;o baseada em certificados do cliente via
Acquire::https::SSLCert
e
Acquire::https::SSLKey. Estes devem ser definidos respectivamente no nome de ficheiro do certificado de cliente X.509 e a chave privada (n&atilde;o encriptada) associada, ambos em formato PEM. Na pr&aacute;tica o uso de variantes especificas da m&aacute;quina de ambas op&ccedil;&otilde;es &eacute; altamente recomendado.
<A NAME="lbAH">&nbsp;</A>
<H2>EXEMPLOS</H2>

<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
Acquire::https {
        Proxy::example.org &quot;DIRECT&quot;;
        Proxy &quot;socks5h://apt:<A HREF="mailto:pass@127.0.0.1">pass@127.0.0.1</A>:9050&quot;;
        Proxy-Auto-Detect &quot;/usr/local/bin/apt-https-proxy-auto-detect&quot;;
        No-Cache &quot;true&quot;;
        Max-Age &quot;3600&quot;;
        No-Store &quot;true&quot;;
        Timeout &quot;10&quot;;
        Dl-Limit &quot;42&quot;;
        Pipeline-Depth &quot;0&quot;;
        AllowRedirect &quot;false&quot;;
        User-Agent &quot;My APT-HTTPS&quot;;
        SendAccept &quot;false&quot;;

        CAInfo &quot;/path/to/ca/certs.pem&quot;;
        CRLFile &quot;/path/to/all/crl.pem&quot;;
        Verify-Peer &quot;true&quot;;
        Verify-Host::broken.example.org &quot;false&quot;;
        SSLCert::example.org &quot;/path/to/client/cert.pem&quot;;
        SSLKey::example.org &quot;/path/to/client/key.pem&quot;
};
</PRE>

</DL>




<A NAME="lbAI">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAJ">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAK">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAL">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="2"><DD>
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="3"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="4"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="5"><A HREF="#lbAB">NOME</A><DD>
<DT id="6"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="7"><A HREF="#lbAD">OP&Ccedil;&Otilde;ES</A><DD>
<DL>
<DT id="8"><A HREF="#lbAE">Credenciais do Servidor</A><DD>
<DT id="9"><A HREF="#lbAF">Desactivar a seguran&ccedil;a</A><DD>
<DT id="10"><A HREF="#lbAG">Autentica&ccedil;&atilde;o do cliente</A><DD>
</DL>
<DT id="11"><A HREF="#lbAH">EXEMPLOS</A><DD>
<DT id="12"><A HREF="#lbAI">VEJA TAMB&Eacute;M</A><DD>
<DT id="13"><A HREF="#lbAJ">BUGS</A><DD>
<DT id="14"><A HREF="#lbAK">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="15"><A HREF="#lbAL">AUTOR</A><DD>
<DT id="16"><A HREF="#lbAM">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:21 GMT, March 31, 2021
</BODY>
</HTML>
