
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT.CONF</TITLE>
</HEAD><BODY>
<H1>APT.CONF</H1>
Section: APT (5)<BR>Updated: 04&nbsp;Abril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt.conf - Ficheiro de configura&ccedil;&atilde;o para o APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

/etc/apt/apt.conf
&eacute; o ficheiro de configura&ccedil;&atilde;o principal partilhado por todas as ferramentas na suite de ferramentas do APT, no entanto n&atilde;o &eacute; de maneira nenhuma o &uacute;nico local onde se pode definir op&ccedil;&otilde;es. A suite tamb&eacute;m partilha um analisador comum de linha de comandos para disponibilizar um ambiente uniforme.
<P>

Quando a ferramenta APT arranca ir&aacute; ler os ficheiros de configura&ccedil;&atilde;o pela seguinte ordem:
<P>
<DL COMPACT><DT id="1"><DD>
 1.


o ficheiro especificado pela vari&aacute;vel de ambiente
<B>APT_CONFIG</B>
(se existir)
</DL>

<P>
<DL COMPACT><DT id="2"><DD>
 2.


todos os ficheiros em
Dir::Etc::Parts
em ordem ascendente alfa-num&eacute;rica n&atilde;o t&ecirc;m extens&atilde;o ou t&ecirc;m &quot;conf&quot; como extens&atilde;o do nome de ficheiro e que apenas cont&ecirc;m caracteres alfa-num&eacute;ricos, tra&ccedil;os (-), underscores (_) e pontos (.). Caso contr&aacute;rio o APT ir&aacute; escrever um aviso de que ignorou um ficheiro, a menos que o ficheiro corresponda a um padr&atilde;o na lista de configura&ccedil;&atilde;o de
Dir::Ignore-Files-Silently
- que ent&atilde;o nesse caso ser&aacute; ignorado em sil&ecirc;ncio.
</DL>

<P>
<DL COMPACT><DT id="3"><DD>
 3.


o ficheiro de configura&ccedil;&atilde;o principal especificado por
Dir::Etc::main
</DL>

<P>
<DL COMPACT><DT id="4"><DD>
 4.


todas as op&ccedil;&otilde;es definidas na sub-&aacute;rvore de configura&ccedil;&atilde;o espec&iacute;fica de bin&aacute;rio s&atilde;o movidas para a raiz da &aacute;rvore.
</DL>

<P>
<DL COMPACT><DT id="5"><DD>
 5.


as op&ccedil;&otilde;es de linha de comandos s&atilde;o aplicadas para sobrepor as directivas de configura&ccedil;&atilde;o ou para carregar mais ficheiros de configura&ccedil;&atilde;o.
</DL>

<A NAME="lbAD">&nbsp;</A>
<H2>SINTAXE</H2>

<P>

O ficheiro de configura&ccedil;&atilde;o &eacute; organizado numa &aacute;rvore com as op&ccedil;&otilde;es organizadas em grupos de funcionamento. A especifica&ccedil;&atilde;o das op&ccedil;&otilde;es &eacute; dada com um sinal de dois pontos duplo , por exemplo
APT::Get::Assume-Yes
&eacute; uma op&ccedil;&atilde;o dentro do grupo de ferramentas do APT, para a ferramenta Get. A op&ccedil;&otilde;es n&atilde;o herdam dos seus grupos parentes.
<P>

Sint&aacute;cticamente a linguagem de configura&ccedil;&atilde;o &eacute; modelada ap&oacute;s o que as ferramentas ISC usam, como o bind e o dhcp. As linhas que come&ccedil;am com
//
s&atilde;o tratadas como coment&aacute;rios (ignoradas), assim como todo o texto entre
/*
e
*/, tal como os coment&aacute;rios de C/C++. Cada linha &eacute; do formato
APT::Get::Assume-Yes &quot;true&quot;;. As aspas e o ponto-e-v&iacute;rgula final s&atilde;o necess&aacute;rios. O valor deve estar em uma linha, e n&atilde;o existe nenhum tipo de concatena&ccedil;&atilde;o de string. Os valores n&atilde;o podem incluir barras invertidas ou aspas extras. Os nomes das op&ccedil;&otilde;es s&atilde;o feitos de caracteres alfa-num&eacute;ricos e os caracteres &quot;/-:._+&quot;. Um novo scope pode ser aberto com chavetas, assim:
<P>
<DL COMPACT><DT id="6"><DD>



<PRE>
   
APT {
  Get {
    Assume-Yes &quot;true&quot;;
    Fix-Broken &quot;true&quot;;
  };
};
</PRE>

</DL>




<P>

com novas linhas colocadas para o tornar mais leg&iacute;vel. As listas podem ser criadas ao abrir um scope e incluindo uma string &uacute;nica entre aspas seguida por um ponto e v&iacute;rgula. Podem ser inclu&iacute;das m&uacute;ltiplas entradas, separadas por um ponto e v&iacute;rgula (;).
<P>
<DL COMPACT><DT id="7"><DD>



<PRE>
   
DPkg::Pre-Install-Pkgs {&quot;/usr/sbin/dpkg-preconfigure --apt&quot;;};
</PRE>

</DL>




<P>

Em geral o exemplo de ficheiro de configura&ccedil;&atilde;o
/usr/share/doc/apt/examples/configure-index.gz
&eacute; um bom guia de como deve ficar.
<P>

Mai&uacute;sculas e min&uacute;sculas n&atilde;o s&atilde;o significativas nos nomes dos items de configura&ccedil;&atilde;o, portanto no exemplo pr&eacute;vio voc&ecirc; poderia usar
dpkg::pre-install-pkgs.
<P>

Os nomes dos items de configura&ccedil;&atilde;o s&atilde;o opcionais se uma lista for definida com pode ser vista no exemplo
DPkg::Pre-Install-Pkgs
acima. Se voc&ecirc; n&atilde;o especificar um nome, uma nova entrada ir&aacute; simplesmente adicionar uma nova op&ccedil;&atilde;o &agrave; lista. Se voc&ecirc; especificar um nome, voc&ecirc; pode sobrepor a op&ccedil;&atilde;o como qualquer outra op&ccedil;&atilde;o ao re-atribuir um novo valor &agrave; op&ccedil;&atilde;o.
<P>

Est&atilde;o definidos dois comandos especiais,
#include
(a qual est&aacute; obsoleto e n&atilde;o &eacute; suportado por implementa&ccedil;&otilde;es alternativas) e
#clear:
#include
ir&aacute; incluir o ficheiro fornecido, a menos que o nome do ficheiro termine numa barra (/), que no caso todo o direct&oacute;rio &eacute; inclu&iacute;do.
#clear
&eacute; usado para apagar uma parte da &aacute;rvore de configura&ccedil;&atilde;o. O elemento especificado e os seus descendentes s&atilde;o apagados. (Note que estas linhas tamb&eacute;m precisam de acabar com um 'ponto e v&iacute;rgula' (;) .)
<P>

O comando
#clear
&eacute; a &uacute;nica maneira de apagar uma lista ou um scope completo. Reabrindo um scope (ou usando a sintaxe descrita em baixo com um
::
acrescentado)
<I>n&atilde;o</I>
ir&aacute; sobrepor entradas escritas anteriormente. As op&ccedil;&otilde;es podem apenas ser sobrepostas ao atribuir um novo valor a elas - listas e scopes n&atilde;o podem ser sobrepostos, apenas limpos.
<P>

Todas as ferramentas do APT recebem uma op&ccedil;&atilde;o -o que permite uma directiva de configura&ccedil;&atilde;o arbitr&aacute;ria para ser especificada na linha de comandos. A sintaxe &eacute; um nome de op&ccedil;&atilde;o completo (APT::Get::Assume-Yes
por exemplo) seguido por um igual (=) e depois o valor da op&ccedil;&atilde;o. Para acrescentar um novo elemento a uma lista, adicione um
::
ao final do nome da lista. (Como deve suspeitar, a sintaxe de scope n&atilde;o pode ser usada na linha de comandos.)
<P>

Note que acrescentar itens a uma lista usando
::
s&oacute; funciona para um item por linha, e que n&atilde;o o dever&aacute; usar em combina&ccedil;&atilde;o com a sintaxe scope (a qual adiciona
::
implicitamente). Usar ambas as sintaxes juntamente ir&aacute; disparar um bug de que infelizmente alguns utilizadores dependem: uma op&ccedil;&atilde;o com o nome pouco usual &quot;::&quot; o qual actua como qualquer outra op&ccedil;&atilde;o com um nome. Isto introduz muitos problemas: por um lado, os utilizadores que escrevem m&uacute;ltiplas linhas nesta sintaxe
<I>errada</I>
na esperan&ccedil;a de acrescentarem numa lista ir&atilde;o obter o oposto, pois apenas ser&aacute; usada a &uacute;ltima atribui&ccedil;&atilde;o para esta op&ccedil;&atilde;o &quot;::&quot;. Vers&otilde;es futuras do APT ir&atilde;o dar erros e parar de funcionar se encontrarem esta m&aacute; utiliza&ccedil;&atilde;o, portanto, por favor, corrija tais declara&ccedil;&otilde;es agora enquanto o APT ainda n&atilde;o se queixa explicitamente delas.
<A NAME="lbAE">&nbsp;</A>
<H2>O GRUPO APT</H2>

<P>

Este grupo de op&ccedil;&otilde;es controla o comportamento geral do APT assim como mant&eacute;m as op&ccedil;&otilde;es para todas as ferramentas.
<P>

<B>Architecture</B>
<DL COMPACT><DT id="8"><DD>
System Architecture; define a arquitectura a usar quando procura ficheiros e analisa listas de pacotes. A predefini&ccedil;&atilde;o interna &eacute; a arquitectura para a qual o APT foi compilado.
</DL>

<P>

<B>Architectures</B>
<DL COMPACT><DT id="9"><DD>
Todas as arquitecturas que o sistema suporta. Por exemplo, CPUs que implementam o conjunto de instru&ccedil;&otilde;es
amd64
(tamb&eacute;m chamada
x86-64) s&atilde;o tamb&eacute;m capazes de executar bin&aacute;rios compilados para o conjunto de instru&ccedil;&otilde;es
i386
(x86). Esta lista &eacute; usada quando se busca ficheiros e analisa listas de pacotes. A predefini&ccedil;&atilde;o inicial &eacute; sempre a arquitectura nativa do sistema (APT::Architecture), e as arquitecturas alien&iacute;genas s&atilde;o adicionadas &agrave; lista predefinida quando s&atilde;o registadas via
<B>dpkg --add-architecture</B>.
</DL>

<P>

<B>Compressor</B>
<DL COMPACT><DT id="10"><DD>
Este escopo define quais formatos de compress&atilde;o s&atilde;o suportados, como a compress&atilde;o e descompress&atilde;o pode ser executada se o suporte para este formato n&atilde;o est&aacute; compilado directamente no apt e um valor de custo que indica o custo de se comprimir algo neste formato. Como um exemplo a seguinte estrofe de configura&ccedil;&atilde;o iria permitir ao apt descarregar e descomprimir assim como criar e armazenar ficheiros com a extens&atilde;o
.reversed
de baixo custo os quais ir&aacute; passar ao comando
<B>rev</B>
sem par&acirc;metros adicionais de linha de comandos para a compress&atilde;o e descompress&atilde;o.
<P>
<DL COMPACT><DT id="11"><DD>



<PRE>
APT::Compressor::rev {
        Name &quot;rev&quot;;
        Extension &quot;.reversed&quot;;
        Binary &quot;rev&quot;;
        CompressArg {};
        UncompressArg {};
        Cost &quot;10&quot;;
};
</PRE>

</DL>




</DL>

<P>

<B>Build-Profiles</B>
<DL COMPACT><DT id="12"><DD>
Lista todos os perfis de compila&ccedil;&atilde;o activos para resolu&ccedil;&atilde;o de depend&ecirc;ncias de compila&ccedil;&atilde;o, sem o prefixo &quot;profile.&quot; no espa&ccedil;o do nome. Por predefini&ccedil;&atilde;o esta lista est&aacute; vazia. O
<B>DEB_BUILD_PROFILES</B>
usado pelo
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)
sobrep&otilde;e a nota&ccedil;&atilde;o da lista.
</DL>

<P>

<B>Default-Release</B>
<DL COMPACT><DT id="13"><DD>
Lan&ccedil;amento predefinido de onde instalar pacotes se existir mais de uma vers&atilde;o dispon&iacute;vel. Cont&eacute;m o nome do lan&ccedil;amento, nome de c&oacute;digo ou vers&atilde;o de lan&ccedil;amento. Exemplos: 'stable', 'testing', 'unstable', 'buster', 'bullseye', '4.0', '5.0*'. Veja tamb&eacute;m
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
</DL>

<P>

<B>Ignore-Hold</B>
<DL COMPACT><DT id="14"><DD>
Ignore Held packages; Esta op&ccedil;&atilde;o global faz com que ao resolver problemas, os pacotes segurados sejam ignorados na sua decis&atilde;o de marca&ccedil;&atilde;o.
</DL>

<P>

<B>Clean-Installed</B>
<DL COMPACT><DT id="15"><DD>
A predefini&ccedil;&atilde;o &eacute; ligada. Quando ligada, a funcionalidade autoclean ir&aacute; remover quaisquer pacotes que j&aacute; n&atilde;o possam ser descarregados a partir da cache. Se desligada, ent&atilde;o os pacotes que est&atilde;o instalados localmente s&atilde;o tamb&eacute;m exclu&iacute;dos da limpeza - mas note que o APT n&atilde;o disponibiliza um meio directo de os reinstalar.
</DL>

<P>

<B>Immediate-Configure</B>
<DL COMPACT><DT id="16"><DD>
A predefini&ccedil;&atilde;o &eacute; ligada, o que ir&aacute; fazer com que o APT instale pacotes essenciais e importantes assim que poss&iacute;vel numa opera&ccedil;&atilde;o de instala&ccedil;&atilde;o/actualiza&ccedil;&atilde;o, de modo a limitar o efeito de uma chamada ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
falhada. Se esta op&ccedil;&atilde;o for desactivada, o APT trata um pacote importante do mesmo modo que um pacote extra: entre o desempacotamento do pacote A e a sua configura&ccedil;&atilde;o podem existir muitas outras chamadas de desempacotamento ou configura&ccedil;&atilde;o para outros pacotes B, C, etc n&atilde;o relacionados. Se eles causarem a falha da chamada do
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
(ex. porque os scripts do maintainer do pacote B geram um erro), isto resulta num estado do sistema em que o pacote A fica desempacotado mas n&atilde;o configurado - ent&atilde;o n&atilde;o fica garantido o funcionamento de qualquer pacote que dependa de A, porque a sua depend&ecirc;ncia de A n&atilde;o est&aacute; mais satisfeita.
<P>
O marcador de configura&ccedil;&atilde;o imediata tamb&eacute;m &eacute; aplicado no caso potencialmente problem&aacute;tico de depend&ecirc;ncias circulares, pois uma depend&ecirc;ncia com a bandeira de imediato &eacute; equivalente a uma Pr&eacute;-Depend&ecirc;ncia. Em teoria isto permite ao APT reconhecer uma situa&ccedil;&atilde;o na qual est&aacute; incapaz de executar configura&ccedil;&atilde;o imediata, abortar, e sugerir ao utilizador que a op&ccedil;&atilde;o dever&aacute; ser desactivada temporariamente de modo a permitir que a opera&ccedil;&atilde;o prossiga. Note o uso da palavra &quot;teoria&quot; aqui; no mundo real este problema tem sido raramente encontrado, em vers&otilde;es n&atilde;o-est&aacute;vel da distribui&ccedil;&atilde;o, e foram causados por depend&ecirc;ncias erradas do pacote em quest&atilde;o ou por um sistema j&aacute; no estado corrompido; portanto voc&ecirc; n&atilde;o deve desactivar esta op&ccedil;&atilde;o &agrave;s cegas. porque em primeiro lugar o cen&aacute;rio mencionado em cima n&atilde;o &eacute; o &uacute;nico problema que pode ajudar a prevenir.
<P>
Antes de uma grande opera&ccedil;&atilde;o como
dist-upgrade
ser executada com esta op&ccedil;&atilde;o desactivada voc&ecirc; deve tentar explicitamente um
install
ao pacote que o APT n&atilde;o &eacute; capaz de configurar imediatamente; mas por favor certifique-se que tamb&eacute;m reporta o seu problema &agrave; sua distribui&ccedil;&atilde;o e &aacute; equipa do APT com o link de bug em baixo, para que eles possa trabalhar em melhorar ou corrigir o processo de actualiza&ccedil;&atilde;o.
</DL>

<P>

<B>Force-LoopBreak</B>
<DL COMPACT><DT id="17"><DD>
Nunca active esta op&ccedil;&atilde;o a menos que
<I>realmente</I>
saiba o que est&aacute; a fazer. Ela permite que o APT remova temporariamente um pacote essencial para quebrar um ciclo infinito de Conflito/Conflito ou Conflito/Pr&eacute;-Depend&ecirc;ncia entre dois pacotes essenciais.
<I>Tal ciclo nunca deveria existir e &eacute; um bug grave.</I>. Esta op&ccedil;&atilde;o ir&aacute; funcionar se os pacotes essenciais n&atilde;o forem
<B>tar</B>,
<B>gzip</B>,
<B>libc</B>,
<B>dpkg</B>,
<B>dash</B>
ou nada de que esses pacotes dependam.
</DL>

<P>

<B>Cache-Start</B>, <B>Cache-Grow</B>, <B>Cache-Limit</B>
<DL COMPACT><DT id="18"><DD>
O APT usa desde a vers&atilde;o 0.7.26 um ficheiro de cache com mapa de mem&oacute;ria de tamanho ajust&aacute;vel para armazenar a informa&ccedil;&atilde;o dispon&iacute;vel.
Cache-Start
actua como uma dica do tamanho que a cache ir&aacute; crescer, e &eacute; por isso a quantidade de mem&oacute;ria que o APT ir&aacute; requerer no arranque. O valor predefinido &eacute; 20971520 bytes (~20 MB). Note que esta quantidade de espa&ccedil;o precisa estar dispon&iacute;vel para o APT; caso contr&aacute;rio ele ir&aacute; com certeza falhar, portanto para dispositivos com pouca mem&oacute;ria este valor deve ser diminu&iacute;do enquanto que em sistemas com muitas fontes configuradas este deve ser aumentado.
Cache-Grow
define em bytes com a predefini&ccedil;&atilde;o de 1048576 (~1 MB) em quanto o tamanho da Cache ser&aacute; aumentado no caso do espa&ccedil;o definido por
Cache-Start
n&atilde;o ser suficiente. Este valor ser&aacute; aplicado v&aacute;rias vezes at&eacute; que a cache seja suficientemente grande para armazenar toda a informa&ccedil;&atilde;o ou que o tamanho da cache alcance o
Cache-Limit. O valor predefinido de
Cache-Limit
&eacute; 0 o que significa nenhum limite. Se
Cache-Grow
for definido para 0, o crescimento autom&aacute;tico da cache &eacute; desactivado.
</DL>

<P>

<B>Build-Essential</B>
<DL COMPACT><DT id="19"><DD>
Define quais pacotes s&atilde;o considerados depend&ecirc;ncias essenciais de compila&ccedil;&atilde;o.
</DL>

<P>

<B>Get</B>
<DL COMPACT><DT id="20"><DD>
A subsec&ccedil;&atilde;o Get controla a ferramenta
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8), por favor veja a sua documenta&ccedil;&atilde;o para mais informa&ccedil;&atilde;o acerca das op&ccedil;&otilde;es daqui.
</DL>

<P>

<B>Cache</B>
<DL COMPACT><DT id="21"><DD>
A subsec&ccedil;&atilde;o Cache controla a ferramenta
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8), por favor veja a sua documenta&ccedil;&atilde;o para mais informa&ccedil;&atilde;o acerca das op&ccedil;&otilde;es daqui.
</DL>

<P>

<B>CDROM</B>
<DL COMPACT><DT id="22"><DD>
A subsec&ccedil;&atilde;o CDROM controla a ferramenta
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8), por favor veja a sua documenta&ccedil;&atilde;o para mais informa&ccedil;&atilde;o acerca das op&ccedil;&otilde;es de aqui.
</DL>

<A NAME="lbAF">&nbsp;</A>
<H2>O GRUPO ACQUIRE</H2>

<P>

O grupo de op&ccedil;&otilde;es
Acquire
controla a descarga de pacotes assim como os v&aacute;rios &quot;m&eacute;todos de obten&ccedil;&atilde;o&quot; respons&aacute;veis pela pr&oacute;pria descarga (veja tamb&eacute;m
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)).
<P>

<B>Check-Date</B>
<DL COMPACT><DT id="23"><DD>
Op&ccedil;&atilde;o relacionada com seguran&ccedil;a que predefine para verdadeira, activando as verifica&ccedil;&otilde;es relativas a hora. Desactiv&aacute;-la significa que a hora da m&aacute;quina n&atilde;o pode ser confiada,e o APT ir&aacute; ent&atilde;o desactivar todos as verifica&ccedil;&otilde;es relacionadas com horas, tais como
<B>Check-Valid-Until</B>
e verificar que o campo Date de um ficheiro release n&atilde;o est&aacute; no futuro.
</DL>

<P>

<B>Max-FutureTime</B>
<DL COMPACT><DT id="24"><DD>
O tempo m&aacute;ximo (em segundos) antes da sua cria&ccedil;&atilde;o (como indicado pelo cabe&ccedil;alho
Date) que o ficheiro
Release
deve ser considerado como v&aacute;lido. O valor predefinido &eacute;
10. Podem ser criadas defini&ccedil;&otilde;es espec&iacute;ficas de arquivo ao acrescentar a etiqueta do arquivo ao nome da op&ccedil;&atilde;o. Preferencialmente, o mesmo pode ser conseguido para entradas
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
espec&iacute;ficas ao usar l&aacute; a op&ccedil;&atilde;o
<B>Date-Max-Future</B>.
</DL>

<P>

<B>Check-Valid-Until</B>
<DL COMPACT><DT id="25"><DD>
Op&ccedil;&atilde;o relacionada com seguran&ccedil;a com predefini&ccedil;&atilde;o a 'verdadeiro', como dar a ficheiros Release uma data de expira&ccedil;&atilde;o previne ataques repetidos durante longo tempo e pode, por exemplo, ajudar os utilizadores a identificar mirrors que n&atilde;o s&atilde;o actualizados &agrave; muito tempo - mas a funcionalidade depende da precis&atilde;o de hora no sistema do utilizador. Os respons&aacute;veis do arquivo s&atilde;o encorajados a criar ficheiros Release com o cabe&ccedil;alho
Valid-Until, mas se n&atilde;o o fizerem ou se preferir-se um valor mais rigoroso pode-se usar a op&ccedil;&atilde;o
Max-ValidTime
seguinte. A op&ccedil;&atilde;o
<B>Check-Valid-Until</B>
das entradas
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
deve ser preferida para desactivar a verifica&ccedil;&atilde;o selectiva em vez de usar esta sobreposi&ccedil;&atilde;o global.
</DL>

<P>

<B>Max-ValidTime</B>
<DL COMPACT><DT id="26"><DD>
O tempo m&aacute;ximo (em segundos) ap&oacute;s a sua cria&ccedil;&atilde;o (como indicado pelo cabe&ccedil;alho
Date) que o ficheiro
Release
deve ser considerado como v&aacute;lido. Se o pr&oacute;prio ficheiro Release incluir um cabe&ccedil;alho
Valid-Until
&eacute; usada como data de expira&ccedil;&atilde;o a data que expira mais cedo. O valor predefinido &eacute;
0
o que significa &quot;v&aacute;lido para sempre&quot;. Podem ser criadas defini&ccedil;&otilde;es espec&iacute;ficas de arquivo ao acrescentar a etiqueta do arquivo ao nome da op&ccedil;&atilde;o. Preferencialmente, o mesmo pode ser conseguido para entradas
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
espec&iacute;ficas ao usar aqui a op&ccedil;&atilde;o
<B>Valid-Until-Max</B>.
</DL>

<P>

<B>Min-ValidTime</B>
<DL COMPACT><DT id="27"><DD>
O tempo m&iacute;nimo (em segundos) ap&oacute;s a sua cria&ccedil;&atilde;o (como indicado no cabe&ccedil;alho
Date) que o ficheiro
Release
deve ser considerado como v&aacute;lido. Utilize isto se voc&ecirc; necessitar de usar um mirror raramente actualizado (local) de um arquivo actualizado mais frequentemente com um cabe&ccedil;alho
Valid-Until
em vez de desactivar completamente a verifica&ccedil;&atilde;o de data de expira&ccedil;&atilde;o. Podem e devem ser usadas defini&ccedil;&otilde;es especificas do arquivo ao acrescentar a etiqueta do arquivo ao nome da op&ccedil;&atilde;o. Preferencialmente, pode ser conseguido o mesmo para entradas
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
espec&iacute;ficas ao usar aqui a op&ccedil;&atilde;o
<B>Valid-Until-Min</B>
</DL>

<P>

<B>AllowTLS</B>
<DL COMPACT><DT id="28"><DD>
Permite o uso do suporte TLS interno no m&eacute;todo http. Se definido para falso, isto desactiva completamente o suporte para TLS nos m&eacute;todos pr&oacute;prios do apt (excluindo o m&eacute;todo https baseado em curl). N&atilde;o ser&atilde;o mais chamadas fun&ccedil;&otilde;es relacionadas com TLS.
</DL>

<P>

<B>PDiffs</B>
<DL COMPACT><DT id="29"><DD>
Tenta descarregar deltas chamados
PDiffs
para &iacute;ndices (como os ficheiros
Packages) em vez de os descarregar por inteiro. Verdadeiro por predefini&ccedil;&atilde;o. Preferencialmente, isto pode ser definido para entradas
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
espec&iacute;ficas ou ficheiros index ao usar aqui a op&ccedil;&atilde;o
<B>PDiffs</B>.
<P>
Est&atilde;o tamb&eacute;m dispon&iacute;veis duas sub-op&ccedil;&otilde;es para limitar o uso de PDiffs:
FileLimit
pode ser usada para especificar um n&uacute;mero m&aacute;ximo de ficheiros PDiff que devem ser descarregados para actualizar um ficheiro. Por outro lado
SizeLimit
&eacute; a percentagem m&aacute;xima do tamanho de todas as patches comparadas com o tamanho do ficheiro de destino. Se um destes limites for excedido, &eacute; descarregado o ficheiro completo em vez das patches.
</DL>

<P>

<B>By-Hash</B>
<DL COMPACT><DT id="30"><DD>
Tenta descarregar &iacute;ndices via um URL constru&iacute;do a partir de um sum&aacute;rio &quot;hashsum&quot; do ficheiro esperado, em vez de descarregar via um nome de ficheiro bem conhecido como est&aacute;vel. Verdadeiro por predefini&ccedil;&atilde;o, mas desactivado automaticamente se a fonte indicar que n&atilde;o tem suporte para tal. A utiliza&ccedil;&atilde;o pode ser for&ccedil;ada com o valor especial &quot;force&quot;. Preferencialmente, isto pode ser definido para entradas
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
espec&iacute;ficas ou ficheiros index ao usar aqui a op&ccedil;&atilde;o
<B>By-Hash</B>.
</DL>

<P>

<B>Queue-Mode</B>
<DL COMPACT><DT id="31"><DD>
Modo de fila;
Queue-Mode
pode ser um de
host
ou
access
que determina como o APT paraleliza liga&ccedil;&otilde;es de sa&iacute;da.
host
significa que ser&aacute; aberta uma liga&ccedil;&atilde;o por m&aacute;quina destino,
access
significa que ser&aacute; aberta uma liga&ccedil;&atilde;o por tipo de URI.
</DL>

<P>

<B>Retries</B>
<DL COMPACT><DT id="32"><DD>
N&uacute;mero de tentativas a executar. Se isto for diferente de zero o APT ir&aacute; tentar, no n&uacute;mero fornecido de vezes, obter ficheiros falhados.
</DL>

<P>

<B>Source-Symlinks</B>
<DL COMPACT><DT id="33"><DD>
Usa links simb&oacute;licos para arquivos fonte. Se definido para verdadeiro, ent&atilde;o os arquivos fonte ser&atilde;o links simb&oacute;licos, quando poss&iacute;vel, em vez de c&oacute;pias. A predefini&ccedil;&atilde;o &eacute; verdadeiro.
</DL>

<P>

<B>http</B> <B>https</B>
<DL COMPACT><DT id="34"><DD>
As op&ccedil;&otilde;es nesses scopes configuram a obten&ccedil;&atilde;o de transportes do APT para os protocolos HTTP e HTTPS e est&atilde;o documentadas nos manuais
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1)
e
<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-https">apt-transport-https</A></B>(1)
respectivamente.
</DL>

<P>

<B>ftp</B>
<DL COMPACT><DT id="35"><DD>
ftp::Proxy
define o proxy predefinido a usar para URIs FTP. Est&aacute; no formato standard de
<A HREF="ftp://[[user][:pass]@]host[:port]/.">ftp://[[user][:pass]@]host[:port]/.</A> Os proxies por m&aacute;quina podem tamb&eacute;m ser especificados ao usar o formato
ftp::Proxy::&lt;host&gt;
com a palavra chave especial
DIRECT
que significa n&atilde;o usar nenhum proxy. Se nenhuma das defini&ccedil;&otilde;es acima for especificada, ser&aacute; usada a vari&aacute;vel de ambiente
<B>ftp_proxy</B>. Para usar um proxy FTP voc&ecirc; tem que definir o script
ftp::ProxyLogin
no ficheiro de configura&ccedil;&atilde;o. Esta entrada especifica os comandos a enviar para dizer ao servidor proxy ao que se ligar. Por favor veja
/usr/share/doc/apt/examples/configure-index.gz
para um exemplo de como fazer isto. As vari&aacute;veis de substitui&ccedil;&atilde;o que representam o componente URI correspondente s&atilde;o
$(PROXY_USER)
$(PROXY_PASS)
$(SITE_USER)
$(SITE_PASS)
$(SITE)
e
$(SITE_PORT).
<P>
A op&ccedil;&atilde;o
timeout
define o tempo limite usado por este m&eacute;todo, este valor aplica-se &agrave; liga&ccedil;&atilde;o assim como os tempos de limite de dados.
<P>
S&atilde;o disponibilizadas v&aacute;rias defini&ccedil;&otilde;es para controlar o modo passivo. Geralmente &eacute; seguro deixar o modo passivo ligado, funciona em quase todos ambientes. No entanto algumas situa&ccedil;&otilde;es requerem que o modo passivo seja desactivado e em vez disso usar o modo port ftp. Isto pode ser feito globalmente ou para liga&ccedil;&otilde;es que passam por um proxy ou para uma m&aacute;quina espec&iacute;fica (veja a amostra de ficheiro de configura&ccedil;&atilde;o para exemplos).
<P>
&Eacute; poss&iacute;vel usar proxy FTP sobre HTTP ao definir a vari&aacute;vel de ambiente
<B>ftp_proxy</B>
para um URL HTTP - veja a discuss&atilde;o do m&eacute;todo http em cima para a sintaxe. Voc&ecirc; n&atilde;o pode definir isto no ficheiro de configura&ccedil;&atilde;o e n&atilde;o &eacute; recomendado usar FTP sobre HTTP devido &agrave; sua baixa efici&ecirc;ncia.
<P>
A defini&ccedil;&atilde;o
ForceExtended
controla o uso de comandos RFC2428
EPSV
e
EPRT. A predefini&ccedil;&atilde;o &eacute; falso, o que significa que estes comandos apenas s&atilde;o usados se a liga&ccedil;&atilde;o de controle for IPv6. Definir isto para verdadeiro for&ccedil;a o seu uso mesmo em liga&ccedil;&otilde;es IPv4. Note que a maioria dos servidores FTP n&atilde;o suporta RFC2428.
</DL>

<P>

<B>cdrom</B>
<DL COMPACT><DT id="36"><DD>
Para URIs que usam o m&eacute;todo
cdrom, a &uacute;nica op&ccedil;&atilde;o configur&aacute;vel &eacute; ponto de montagem,
cdrom::Mount, o qual deve ser o ponto de montagem para o leitor de CD-ROM (ou DVD, etc.) como especificado em
/etc/fstab.&Eacute; poss&iacute;vel fornecer comandos de montar e desmontar alternativos se o seu ponto de montagem n&atilde;o puder ser listado na fstab. A sintaxe &eacute; colocar
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
/cdrom/::Mount &quot;foo&quot;;
</PRE>

</DL>




<P>
dentro do bloco
cdrom. &Eacute; importante ter a barra final. Comandos para desmontar podem ser especificados usando o UMount.
</DL>

<P>

<B>gpgv</B>
<DL COMPACT><DT id="38"><DD>
Para URIs de GPGV a &uacute;nica op&ccedil;&atilde;o configur&aacute;vel &eacute;
gpgv::Options, a qual passa par&acirc;metros adicionais ao gpgv.
</DL>

<P>

<B>CompressionTypes</B>
<DL COMPACT><DT id="39"><DD>
Lista dos tipos de compress&atilde;o que s&atilde;o compreendidos pelos m&eacute;todos de aquisi&ccedil;&atilde;o. Ficheiros como
Packages
podem estar dispon&iacute;veis em v&aacute;rios formatos de compress&atilde;o. Por predefini&ccedil;&atilde;o os m&eacute;todos de aquisi&ccedil;&atilde;o podem descomprimir e re-comprimir muitos formatos comuns como
<B>xz</B>
e
<B>gzip</B>; com este scope os formatos suportados podem ser consultados, modificados assim como pode ser adicionado suporte para mais formatos (veja tamb&eacute;m
<B>APT::Compressor</B>). A sintaxe para isto &eacute;:
<P>
<DL COMPACT><DT id="40"><DD>



<PRE>
Acquire::CompressionTypes::<I>Extens&atilde;o de Ficheiro</I> &quot;<I>Nome de m&eacute;todo</I>&quot;;
</PRE>

</DL>




<P>
Tamb&eacute;m o subgrupo
Order
pode ser usado para definir em que ordem o sistema de aquisi&ccedil;&atilde;o ir&aacute; tentar descarregar os ficheiros comprimidos. O sistema de aquisi&ccedil;&atilde;o ir&aacute; tentar com o primeiro e prosseguir com o pr&oacute;ximo tipo de compress&atilde;o na lista em caso de erro, portanto para preferir um sobre outro tipo, simplesmente adicione o tipo preferido em primeiro lugar - tipos n&atilde;o j&aacute; adicionados ser&atilde;o acrescentados implicitamente ao fim da lista, ent&atilde;o, ex.
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Acquire::CompressionTypes::Order:: &quot;gz&quot;;
</PRE>

</DL>




<P>
pode ser usado para preferir ficheiros comprimidos em
<B>gzip</B>
sobre todos os outros formatos de compress&atilde;o. Se o
<B>xz</B>
deve ser preferido sobre o
<B>gzip</B>
e o
<B>bzip2</B>
a defini&ccedil;&atilde;o de configura&ccedil;&atilde;o dever&aacute; parecer-se com isto:
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
Acquire::CompressionTypes::Order { &quot;xz&quot;; &quot;gz&quot;; };
</PRE>

</DL>




<P>
. N&atilde;o &eacute; necess&aacute;rio adicionar explicitamente
bz2
&agrave; lista pois isso ser&aacute; adicionado automaticamente.
<P>
Note que o
Dir::Bin::<I>nome de m&eacute;todo</I>
ser&aacute; verificado em tempo de execu&ccedil;&atilde;o. Se esta defini&ccedil;&atilde;o estiver definida e o suporte para este formato n&atilde;o est&aacute; compilado directamente no apt, o m&eacute;todo apenas ser&aacute; usado se este ficheiro existir; ex. para o m&eacute;todo
bzip2
(o embutido) a defini&ccedil;&atilde;o &eacute;:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Dir::Bin::bzip2 &quot;/bin/bzip2&quot;;
</PRE>

</DL>




<P>
. Note tamb&eacute;m que as entradas na lista especificadas na linha de comandos ser&atilde;o adicionadas no fim da lista especificada nos ficheiros de configura&ccedil;&atilde;o, mas antes das entradas predefinidas. Para preferir um tipo neste caso sobre aqueles especificados nos ficheiros de configura&ccedil;&atilde;o voc&ecirc; pode definir a op&ccedil;&atilde;o directamente - n&atilde;o em estilo de lista. Isto n&atilde;o ir&aacute; sobrepor a lista definida, ir&aacute; apenas prefixar a lista com este tipo.
<P>
O tipo especial
uncompressed
pode ser usado para dar prefer&ecirc;ncia a ficheiros n&atilde;o comprimidos, mas note que a maioria dos arquivos n&atilde;o disponibiliza ficheiros n&atilde;o comprimidos, portanto isto &eacute; usado maioritariamente apenas para mirrors locais.
</DL>

<P>

<B>GzipIndexes</B>
<DL COMPACT><DT id="44"><DD>
Quando descarrega &iacute;ndices comprimidos em
gzip
(Pacotes, Fontes ou Tradu&ccedil;&otilde;es), mant&ecirc;m-os localmente comprimidos em gzip em vez de os desempacotar. Isto poupa imenso espa&ccedil;o no disco &agrave; custa de mais pedidos &agrave; CPU quando constr&oacute;i as caches de pacotes locais. Falso por predefini&ccedil;&atilde;o.
</DL>

<P>

<B>Languages</B>
<DL COMPACT><DT id="45"><DD>
A subsec&ccedil;&atilde;o Languages controla quais ficheiros
Translation
s&atilde;o descarregados e em que ordem o APT tenta mostrar as tradu&ccedil;&otilde;es das descri&ccedil;&otilde;es. O APT ir&aacute; tentar mostrar a primeira descri&ccedil;&atilde;o dispon&iacute;vel para a linguagem que est&aacute; listada em primeiro. As linguagens podem ser definidas com os seus c&oacute;digos de linguagem curtos ou longos. Note que nem todos os arquivos disponibilizam ficheiros
Translation
para todas as linguagens - os c&oacute;digos de linguagem longos s&atilde;o especialmenteraros.
<P>
A lista predefinida inclui &quot;environment&quot; e &quot;en&quot;. &quot;environment&quot; tem um significado especial aqui: ser&aacute; substitu&iacute;da em tempo de execu&ccedil;&atilde;o por c&oacute;digos de linguagem extra&iacute;dos a partir da vari&aacute;vel de ambiente
LC_MESSAGES. Tamb&eacute;m ir&aacute; assegurar que estes c&oacute;digos n&atilde;o s&atilde;o inclu&iacute;dos duas vezes na lista. Se
LC_MESSAGES
estiver definida para &quot;C&quot; apenas o ficheiro
Translation-en
ser&aacute; usado (se dispon&iacute;vel). Para for&ccedil;ar o apt a n&atilde;o usar nenhum ficheiro de tradu&ccedil;&atilde;o use a defini&ccedil;&atilde;o
Acquire::Languages=none. &quot;none&quot; &eacute; outro c&oacute;digo de significado especial que ir&aacute; parar a procura por um ficheiro
Translation
apropriado. Isto diz ao APT para tamb&eacute;m descarregar estes ficheiros sem realmente os usar a menos que o ambiente especifique as linguagens. Portanto o seguinte exemplo de configura&ccedil;&atilde;o ir&aacute; resultar na ordem &quot;en, de&quot; num ambiente em Ingl&ecirc;s e &quot;de, en&quot; num ambiente em Alem&atilde;o. Note que o &quot;fr&quot; &eacute; descarregado, mas n&atilde;o &eacute; usado a menos que o APT seja usado num ambiente em Franc&ecirc;s (onde a ordem deveria ser &quot;fr, de, en&quot;.
<P>
<DL COMPACT><DT id="46"><DD>



<PRE>
Acquire::Languages { &quot;environment&quot;; &quot;de&quot;; &quot;en&quot;; &quot;none&quot;; &quot;fr&quot;; };
</PRE>

</DL>




<P>
Nota: Para prevenir problemas resultantes do APT ser executado em ambientes diferentes (ex. por diferentes utilizadores ou por outros programas) todos os ficheiros de Tradu&ccedil;&atilde;o que se encontram em
/var/lib/apt/lists/
ser&atilde;o adicionados ao final da lista (ap&oacute;s um &quot;none&quot; impl&iacute;cito).
</DL>

<P>

<B>ForceIPv4</B>
<DL COMPACT><DT id="47"><DD>
Ao descarregar, for&ccedil;a o uso exclusivo do protocolo IPv4.
</DL>

<P>

<B>ForceIPv6</B>
<DL COMPACT><DT id="48"><DD>
Ao descarregar, for&ccedil;a o uso exclusivo do protocolo IPv6.
</DL>

<P>

<B>MaxReleaseFileSize</B>
<DL COMPACT><DT id="49"><DD>
O tamanho m&aacute;ximo dos ficheiros Release/Release.gpg/InRelease. A predefini&ccedil;&atilde;o &eacute; 10MB.
</DL>

<P>

<B>EnableSrvRecords</B>
<DL COMPACT><DT id="50"><DD>
Esta op&ccedil;&atilde;o controla se o apt ir&aacute; usar o registo do servidor DNS SRV como especificado em RFC 2782 para seleccionar um servidor alternativo a onde ligar: A predefini&ccedil;&atilde;o &eacute; &quot;true&quot;.
</DL>

<P>

<B>AllowInsecureRepositories</B>
<DL COMPACT><DT id="51"><DD>
Permite &agrave;s opera&ccedil;&otilde;es de actualiza&ccedil;&atilde;o carregarem ficheiros de dados a partir de reposit&oacute;rios se informa&ccedil;&atilde;o se seguran&ccedil;a suficiente. O valor predefinido &eacute;
false&quot;. O conceito, implica&ccedil;&otilde;es assim como alternativas est&atilde;o detalhados em
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>AllowWeakRepositories</B>
<DL COMPACT><DT id="52"><DD>
Permite &agrave;s opera&ccedil;&otilde;es de actualiza&ccedil;&atilde;o carregarem ficheiros de dados a partir de reposit&oacute;rios que disponibilizam informa&ccedil;&atilde;o de seguran&ccedil;a, mas estes j&aacute; n&atilde;o s&atilde;o considerados suficiente fortes criptograficamente. O valor predefinido &eacute;
false&quot;. O conceito, implica&ccedil;&otilde;es assim como alternativas est&atilde;o detalhados em
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>AllowDowngradeToInsecureRepositories</B>
<DL COMPACT><DT id="53"><DD>
Permite que um reposit&oacute;rio anteriormente assinado com gpg se torne em n&atilde;o-assinado durante uma opera&ccedil;&atilde;o de actualiza&ccedil;&atilde;o. Quando n&atilde;o existe uma assinatura v&aacute;lida para um reposit&oacute;rio anteriormente de confian&ccedil;a, o apt ir&aacute; recusar a actualiza&ccedil;&atilde;o. Esta op&ccedil;&atilde;o pode ser usada para ultrapassar esta protec&ccedil;&atilde;o. Certamente voc&ecirc; nunca vai querer activar isto. A predefini&ccedil;&atilde;o &eacute;
false. O conceito, implica&ccedil;&otilde;es assim como alternativas est&atilde;o detalhadas em
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8).
</DL>

<P>

<B>Changelogs::URI</B> scope
<DL COMPACT><DT id="54"><DD>
Adquirir changelogs s&oacute; pode ser feito se for conhecido um URL de onde os obter. De prefer&ecirc;ncia o ficheiro Release indica isto num campo 'Changelogs'. Se isto n&atilde;o estiver dispon&iacute;vel, &eacute; usado o campo Label/Origin do ficheiro Release para verificar se uma op&ccedil;&atilde;o
Acquire::Changelogs::URI::Label::<I>LABEL</I>
ou
Acquire::Changelogs::URI::Origin::<I>ORIGIN</I>
existem e se sim &eacute; utilizado este valor. Este valor no ficheiro Release pode ser sobreposto com
Acquire::Changelogs::URI::Override::Label::<I>LABEL</I>
ou
Acquire::Changelogs::URI::Override::Origin::<I>ORIGIN</I>. O valor deve ser um URI normal para um ficheiro de texto, excepto se os dados desse pacote espec&iacute;fico for substitu&iacute;do pelo marcador de posi&ccedil;&atilde;o
@CHANGEPATH@. O valor para isto &eacute;: 1. se o pacote pertence a um componente (ex.
main) esta &eacute; a primeira parte, caso contr&aacute;rio &eacute; omitida. 2. a primeira letra do nome do pacote fonte, excepto se o nome do pacote fonte come&ccedil;ar com 'lib' e neste caso ser&aacute; as primeiras quatro letras. 3. O nome completo do pacote fonte. 4. O nome completo outra vez e 5. a vers&atilde;o da fonte. A primeira (se presente), segunda, terceira e quarta partes s&atilde;o separadas por uma barra ('/') e entre a quarta e quinta partes fica um underscore ('_'). O valor especial 'no' est&aacute; dispon&iacute;vel para esta op&ccedil;&atilde;o e indica que esta fonte n&atilde;o pode ser usada para adquirir ficheiros changelog a partir dela. Neste caso ser&aacute; tentada outra fonte se estiver dispon&iacute;vel.
</DL>

<A NAME="lbAG">&nbsp;</A>
<H2>CONFIGURA&Ccedil;&Atilde;O ESPEC&Iacute;FICA DE BIN&Aacute;RIO</H2>

<P>

Especialmente com a introdu&ccedil;&atilde;o do bin&aacute;rio
<B>apt</B>
pode ser &uacute;til para definir certas op&ccedil;&otilde;es apenas para um bin&aacute;rio espec&iacute;fico mesmo como op&ccedil;&otilde;es que parecessem apenas afectar um certo bin&aacute;rio como
<B>APT::Get::Show-Versions</B>
afecta
<B>apt-get</B>
assim como
<B>apt</B>.
<P>

Definir uma op&ccedil;&atilde;o para apenas um bin&aacute;rio espec&iacute;fico s&oacute; pode ser conseguido ao definir a op&ccedil;&atilde;o dentro escopo
<B>Binary::</B><B></B><I>specific-binary</I>. Definir a op&ccedil;&atilde;o
<B>APT::Get::Show-Versions</B>
apenas para o
<B>apt</B>
pode, por exemplo, ser feito de outra maneira definindo
<B>Binary::apt::APT::Get::Show-Versions</B>.
<P>

Note que como visto na sec&ccedil;&atilde;o DESCRI&Ccedil;&Atilde;O mais acima, voc&ecirc; n&atilde;o pode definir op&ccedil;&otilde;es bin&aacute;rio-especificas na pr&oacute;pria linha de comandos nem em ficheiros de configura&ccedil;&atilde;o carregados via linha de comandos.
<A NAME="lbAH">&nbsp;</A>
<H2>DIRECT&Oacute;RIOS</H2>

<P>

A sec&ccedil;&atilde;o
Dir::State
tem direct&oacute;rios que pertencem &agrave; informa&ccedil;&atilde;o de estado local.
lists
&eacute; o direct&oacute;rio para colocar listas de pacotes descarregadas e
status
&eacute; o nome do ficheiro de estado do
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
preferences
&eacute; o nome do ficheiro
preferences
do APT.
Dir::State
cont&eacute;m o direct&oacute;rio predefinido para pr&eacute;-fixar em todos os sub-items que n&atilde;o come&ccedil;am com
/
ou
./.
<P>

Dir::Cache
cont&eacute;m localiza&ccedil;&otilde;es pertencentes a informa&ccedil;&atilde;o da cache local, como as caches de dois pacotes
srcpkgcache
e
pkgcache
assim como a localiza&ccedil;&atilde;o onde colocar arquivos descarregados,
Dir::Cache::archives. A gera&ccedil;&atilde;o de caches pode ser desligada ao definir
pkgcache
ou
srcpkgcache
para
&quot;&quot;. Isto ir&aacute; abrandar o arranque mas poupar espa&ccedil;o em disco. Provavelmente &eacute; prefer&iacute;vel desligar o pkgcache em vez do srcpkgcache. Tal como
Dir::State
o direct&oacute;rio predefinido &eacute; contido em
Dir::Cache
<P>

Dir::Etc
cont&eacute;m a localiza&ccedil;&atilde;o dos ficheiros de configura&ccedil;&atilde;o,
sourcelist
fornece a localiza&ccedil;&atilde;o da sourcelist e
main
&eacute; o ficheiro da configura&ccedil;&atilde;o predefinida (defini&ccedil;&atilde;o n&atilde;o tem efeito, a menos que seja feita a partir do ficheiro de configura&ccedil;&atilde;o especificado por
<B>APT_CONFIG</B>).
<P>

A defini&ccedil;&atilde;o
Dir::Parts
l&ecirc; todos os fragmentos de configura&ccedil;&atilde;o em ordem l&eacute;xica a partir do direct&oacute;rio especificado. Ap&oacute;s isto estar feito ent&atilde;o &eacute; carregado o ficheiro de configura&ccedil;&atilde;o principal.
<P>

Programas bin&aacute;rios s&atilde;o apontados por
Dir::Bin.
Dir::Bin::Methods
especifica a localiza&ccedil;&atilde;o dos manipuladores do m&eacute;todo e de
gzip,
bzip2,
lzma,
dpkg,
apt-get
dpkg-source
dpkg-buildpackage
e
apt-cache
especifica a localiza&ccedil;&atilde;o dos respectivos programas.
<P>

O item de configura&ccedil;&atilde;o
RootDir
tem um significado especial. Se definido, todos os caminhos ser&atilde;o relativos a
RootDir,
<I>mesmo caminhos que est&atilde;o absolutamente especificados</I>. Ent&atilde;o, por exemplo, se
RootDir
estiver definido para
/tmp/staging
e
Dir::State::status
estiver definido para
/var/lib/dpkg/status, ent&atilde;o o ficheiro status ser&aacute; procurado em
/tmp/staging/var/lib/dpkg/status. Se desejar usar como prefixo apenas caminhos relativos, defina antes
Dir.
<P>

A lista
Ignore-Files-Silently
pode ser usada para especificar quais os ficheiros que o APT deve ignorar em sil&ecirc;ncio enquanto analisa os ficheiros nos direct&oacute;rios de fragmento. Por predefini&ccedil;&atilde;o que termine com
.disabled,
~,
.bak
ou
.dpkg-[a-z]+
&eacute; ignorado em sil&ecirc;ncio. Como visto no &uacute;ltimo valor predefinido, estes padr&otilde;es podem usar sintaxe de express&atilde;o regular.
<A NAME="lbAI">&nbsp;</A>
<H2>APT EM DSELECT</H2>

<P>

Quando o APT &eacute; usado com um m&eacute;todo
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1), v&aacute;rias directivas de configura&ccedil;&atilde;o controlam o comportamento predefinido. Estas est&atilde;o na sec&ccedil;&atilde;o
DSelect.
<P>

<B>Clean</B>
<DL COMPACT><DT id="55"><DD>
Modo Cache Clean: este valor deve ser um de
always,
prompt,
auto,
pre-auto
e
never.
always
e
prompt
ir&atilde;o remover todos os pacotes da cache ap&oacute;s a actualiza&ccedil;&atilde;o,
prompt
(a predefini&ccedil;&atilde;o) f&aacute;-lo condicionalmente.
auto
apenas aqueles pacotes que j&aacute; n&atilde;o podem ser descarregados (por exemplo, substitu&iacute;dos por uma nova vers&atilde;o).
pre-auto
executa esta ac&ccedil;&atilde;o antes de descarregar novos pacotes.
</DL>

<P>

<B>options</B>
<DL COMPACT><DT id="56"><DD>
O conte&uacute;do desta vari&aacute;vel &eacute; passado ao
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
como op&ccedil;&otilde;es de linha de comandos quando &eacute; corrido para a fase de instala&ccedil;&atilde;o.
</DL>

<P>

<B>Updateoptions</B>
<DL COMPACT><DT id="57"><DD>
O conte&uacute;do desta vari&aacute;vel &eacute; passado ao
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
como op&ccedil;&otilde;es de linha de comandos quando &eacute; executado para a fase de actualiza&ccedil;&atilde;o.
</DL>

<P>

<B>PromptAfterUpdate</B>
<DL COMPACT><DT id="58"><DD>
Se for verdadeira a opera&ccedil;&atilde;o [U]pdate no
<B><A HREF="/cgi-bin/man/man2html?1+dselect">dselect</A></B>(1)
ir&aacute; sempre avisar para continuar. A predefini&ccedil;&atilde;o &eacute; avisar apenas em caso de erro.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>COMO O APT CHAMA O <A HREF="/cgi-bin/man/man2html?1+DPKG">DPKG</A>(1)</H2>

<P>

V&aacute;rias directivas de configura&ccedil;&atilde;o controlam como o APT invoca o invokes
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Estas est&atilde;o na sec&ccedil;&atilde;o
DPkg.
<P>

<B>options</B>
<DL COMPACT><DT id="59"><DD>
Isto &eacute; uma lista de op&ccedil;&otilde;es para passar ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). As op&ccedil;&otilde;es t&ecirc;m de ser especificadas usando a nota&ccedil;&atilde;o de lista e cada item da lista &eacute; passado como um argumento &uacute;nico ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>

<B>Path</B>
<DL COMPACT><DT id="60"><DD>
Esta &eacute; uma string que define a vari&aacute;vel de ambiente
<B>PATH</B>
usada quando se corre o dpkg. Pode ser definida para qualquer valor v&aacute;lido dessa vari&aacute;vel de ambiente, ou para string vazia, e neste caso a vari&aacute;vel n&atilde;o &eacute; alterada.
</DL>

<P>

<B>Pre-Invoke</B>, <B>Post-Invoke</B>
<DL COMPACT><DT id="61"><DD>
Isto &eacute; uma lista de comandos shell para executar antes/ap&oacute;s invocar o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Tal como as
op&ccedil;&otilde;es
isto tem que ser especificado em nota&ccedil;&atilde;o listada. Os comandos s&atilde;o invocados em ordem usando
/bin/sh, caso algum deles falhe, o APT ir&aacute; abortar.
</DL>

<P>

<B>Pre-Install-Pkgs</B>
<DL COMPACT><DT id="62"><DD>
Isto &eacute; uma lista de comandos shell para executar antes de invocar o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1). Tal como as
op&ccedil;&otilde;es
isto tem que ser especificado em nota&ccedil;&atilde;o listada. Os comandos s&atilde;o invocados em ordem usando
/bin/sh, caso algum deles falhe, o APT ir&aacute; abortar. O APT ir&aacute; passar para os comandos os nomes de ficheiros de todos os ficheiros .deb que vai instalar, um por cada linha no descritor de ficheiro requisitado, usando por predefini&ccedil;&atilde;o a entrada standard.
<P>
A vers&atilde;o 2 deste protocolo envia mais informa&ccedil;&atilde;o atrav&eacute;s do descritor de ficheiro requerido: uma linha com o texto
VERSION 2, o espa&ccedil;o de configura&ccedil;&atilde;o do APT, e uma lista de ac&ccedil;&otilde;es de pacote com informa&ccedil;&atilde;o de nome de ficheiro e vers&atilde;o.
<P>
Cada linha directiva de configura&ccedil;&atilde;o tem a forma
chave=valor. Caracteres especiais (sinais de igual, novas-linhas, caracteres n&atilde;o imprim&iacute;veis, aspas, e sinais de percentagem na
chave
e novas-linhas, caracteres n&atilde;o imprim&iacute;veis, e sinais de percentagem no
value) s&atilde;o %-codificados. As listas s&atilde;o representadas por m&uacute;ltiplas linhas
chave=valor
com a mesma chave. A sec&ccedil;&atilde;o de configura&ccedil;&atilde;o termina com uma linha vazia.
<P>
As linhas de ac&ccedil;&atilde;o de pacotes consistem de cinco campos na Vers&atilde;o 2: nome do pacote (sem a qualifica&ccedil;&atilde;o da arquitectura mesmo que alien&iacute;gena), vers&atilde;o anterior, direc&ccedil;&atilde;o da altera&ccedil;&atilde;o de vers&atilde;o (&lt; para actualiza&ccedil;&otilde;es, &gt; para regresses (downgrades), = para nenhuma altera&ccedil;&atilde;o), nova vers&atilde;o, ac&ccedil;&atilde;o. Os campos da vers&atilde;o s&atilde;o &quot;-&quot; para nenhuma vers&atilde;o (por exemplo quando se instala um pacote pela primeira vez; nenhuma vers&atilde;o &eacute; tratada como anterior a nenhuma vers&atilde;o real, ent&atilde;o isso &eacute; uma actualiza&ccedil;&atilde;o, indicada como
- &lt; 1.23.4). O campo de ac&ccedil;&atilde;o &eacute; &quot;**CONFIGURE**&quot; se o pacote est&aacute; a ser configurado, &quot;**REMOVE**&quot; se est&aacute; a ser removido, ou o nome de ficheiro de um ficheiro .deb se estiver a ser desempacotado.
<P>
Na vers&atilde;o 3 ap&oacute;s cada campo de vers&atilde;o segue-se a arquitectura dessa vers&atilde;o, a qual &eacute; &quot;-&quot; se n&atilde;o existir nenhuma vers&atilde;o, e um campo que mostra o tipo de MultiArch &quot;same&quot;, &quot;foreign&quot;, &quot;allowed&quot; ou &quot;none&quot;. Note que &quot;none&quot; &eacute; um nome de tipo incorrecto o qual &eacute; apenas mantido para permanecer compat&iacute;vel, deve ser lido como &quot;no&quot; e os utilizadores s&atilde;o encorajados a suportar ambos.
<P>
A vers&atilde;o do protocolo a ser usado para o comando
<I>cmd</I>
pode ser escolhida ao definir
DPkg::Tools::options::<I>cmd</I>::Version
correctamente, sendo a predefini&ccedil;&atilde;o a vers&atilde;o 1. Se o APT n&atilde;o suportar a vers&atilde;o requisitada ir&aacute; ent&atilde;o enviar a informa&ccedil;&atilde;o na vers&atilde;o mais alta que suporta.
<P>
O descritor de ficheiro a ser usado para enviar a informa&ccedil;&atilde;o pode ser requisitado com
DPkg::Tools::options::<I>cmd</I>::InfoFD
o qual usa
0
por predefini&ccedil;&atilde;o para a sa&iacute;da standard e est&aacute; dispon&iacute;vel desde a vers&atilde;o 0.9.11. como confirma&ccedil;&atilde;o pode ser detectado o suporte para a op&ccedil;&atilde;o ao observar a vari&aacute;vel de ambiente
<B>APT_HOOK_INFO_FD</B>
que cont&eacute;m o n&uacute;mero do descritor de ficheiro usado.
</DL>

<P>

<B>Run-Directory</B>
<DL COMPACT><DT id="63"><DD>
O APT muda para este direct&oacute;rio (chdir) antes de invocar o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), a predefini&ccedil;&atilde;o &eacute;
/.
</DL>

<P>

<B>Build-options</B>
<DL COMPACT><DT id="64"><DD>
Estas op&ccedil;&otilde;es s&atilde;o passadas ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg-buildpackage">dpkg-buildpackage</A></B>(1)
quando compila pacotes, a predefini&ccedil;&atilde;o &eacute; desactivar a assinatura e produzir todos os bin&aacute;rios.
</DL>

<P>

<B>DPkg::ConfigurePending</B>
<DL COMPACT><DT id="65"><DD>
Se esta op&ccedil;&atilde;o for definida, o APT ir&aacute; chamar
<B>dpkg --configure --pending</B>
para permitir ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
lidar como todas as configura&ccedil;&otilde;es e triggers requisitados. Esta op&ccedil;&atilde;o &eacute; activada por predefini&ccedil;&atilde;o, mas desactiv&aacute;-la pode ser &uacute;til se deseja correr o APT m&uacute;ltiplas vezes numa sequ&ecirc;ncia - ex. numa instala&ccedil;&atilde;o. Neste cen&aacute;rio voc&ecirc; pode desactivar esta op&ccedil;&atilde;o em todas excepto na &uacute;ltima execu&ccedil;&atilde;o.
</DL>

<A NAME="lbAK">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES PERIODIC E ARCHIVES</H2>

<P>

Os grupos de op&ccedil;&otilde;es
APT::Periodic
e
APT::Archives
configuram o comportamento das actualiza&ccedil;&otilde;es peri&oacute;dicas do APT, o que &eacute; feito pelo script
/usr/lib/apt/apt.systemd.daily. Veja o cabe&ccedil;alho deste script para uma breve documenta&ccedil;&atilde;o das suas op&ccedil;&otilde;es.
<A NAME="lbAL">&nbsp;</A>
<H2>OP&Ccedil;&Otilde;ES DE DEPURA&Ccedil;&Atilde;O</H2>

<P>

Activar op&ccedil;&otilde;es na sec&ccedil;&atilde;o
Debug::
ir&aacute; causar o envio de informa&ccedil;&atilde;o de depura&ccedil;&atilde;o para o fluxo de erros standard do programa utilizando as bibliotecas do
apt, ou activar modos especiais do programa que s&atilde;o principalmente &uacute;teis para depurar o comportamento do
apt. A maioria destas op&ccedil;&otilde;es n&atilde;o t&ecirc;m interesse para o utilizador normal, mas algumas podem ter:
<P>
<DL COMPACT><DT id="66"><DD>
&bull;


Debug::pkgProblemResolver
activa mensagens na sa&iacute;da acerca das decis&otilde;es tomadas por
dist-upgrade, upgrade, install, remove, purge.
</DL>

<P>
<DL COMPACT><DT id="67"><DD>
&bull;


Debug::NoLocking
desactiva o bloqueio de todos os ficheiros. Isto pode ser usado para executar algumas opera&ccedil;&otilde;es (por exemplo,
apt-get -s install) como um utilizador n&atilde;o root.
</DL>

<P>
<DL COMPACT><DT id="68"><DD>
&bull;


Debug::pkgDPkgPM
escreve a linha de comandos actual de cada vez que o
apt
invoca o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>
<DL COMPACT><DT id="69"><DD>
&bull;


<P>
Debug::IdentCdrom
desactiva a inclus&atilde;o de dados statfs em IDs de CD-ROM.
</DL>

<P>

Segue-se uma lista completa de op&ccedil;&otilde;es de depura&ccedil;&atilde;o para o apt.
<P>

<B>Debug::Acquire::cdrom</B>
<DL COMPACT><DT id="70"><DD>
Escreve informa&ccedil;&atilde;o relacionada com o acesso a fontes de
<A HREF="cdrom://.">cdrom://.</A>
</DL>

<P>

<B>Debug::Acquire::ftp</B>
<DL COMPACT><DT id="71"><DD>
Escreve informa&ccedil;&atilde;o relacionada com o descarregamento de pacotes usando FTP.
</DL>

<P>

<B>Debug::Acquire::http</B>
<DL COMPACT><DT id="72"><DD>
Escreve informa&ccedil;&atilde;o relacionada com o descarregamento de pacotes usando HTTP.
</DL>

<P>

<B>Debug::Acquire::https</B>
<DL COMPACT><DT id="73"><DD>
Escreve informa&ccedil;&atilde;o relacionada com o descarregamento de pacotes usando HTTPS.
</DL>

<P>

<B>Debug::Acquire::gpgv</B>
<DL COMPACT><DT id="74"><DD>
Escreve informa&ccedil;&atilde;o relacionada com a verifica&ccedil;&atilde;o de assinaturas criptogr&aacute;ficas usando
gpg.
</DL>

<P>

<B>Debug::aptcdrom</B>
<DL COMPACT><DT id="75"><DD>
Escreve informa&ccedil;&atilde;o acerca do processo de aceder a colec&ccedil;&otilde;es de pacotes armazenados em CD-ROMs.
</DL>

<P>

<B>Debug::BuildDeps</B>
<DL COMPACT><DT id="76"><DD>
Descreve os processos de resolver depend&ecirc;ncias de compila&ccedil;&atilde;o no
<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8).
</DL>

<P>

<B>Debug::Hashes</B>
<DL COMPACT><DT id="77"><DD>
Escreve cada hash criptogr&aacute;fico que &eacute; gerado pelas bibliotecas do
apt.
</DL>

<P>

<B>Debug::IdentCDROM</B>
<DL COMPACT><DT id="78"><DD>
N&atilde;o inclui informa&ccedil;&atilde;o de
statfs, nomeadamente o n&uacute;mero de blocos usados e livres no sistema de ficheiros do CD-ROM, quando gera um ID para um CD-ROM.
</DL>

<P>

<B>Debug::NoLocking</B>
<DL COMPACT><DT id="79"><DD>
Desactiva o bloqueio de todos os ficheiros. Por exemplo, isto ir&aacute; permitir o funcionamento de duas inst&acirc;ncias do
"apt-get update"
ao mesmo tempo.
</DL>

<P>

<B>Debug::pkgAcquire</B>
<DL COMPACT><DT id="80"><DD>
Regista no log quando os items s&atilde;o adicionados ou removidos da fila de download global.
</DL>

<P>

<B>Debug::pkgAcquire::Auth</B>
<DL COMPACT><DT id="81"><DD>
Escreve mensagens de estado e erros relacionados com a verifica&ccedil;&atilde;o de checksums e assinaturas criptogr&aacute;ficas dos ficheiros descarregados.
</DL>

<P>

<B>Debug::pkgAcquire::Diffs</B>
<DL COMPACT><DT id="82"><DD>
Escreve informa&ccedil;&atilde;o acerca do download e aplica&ccedil;&atilde;o de diffs de lista de &iacute;ndice do pacote, e erros relacionados com as diffs de lista de &iacute;ndice do pacote.
</DL>

<P>

<B>Debug::pkgAcquire::RRed</B>
<DL COMPACT><DT id="83"><DD>
Escreve informa&ccedil;&atilde;o relacionada com a aplica&ccedil;&atilde;o de patch na lista de pacotes do apt quando se descarrega diffs de &iacute;ndice em vez de &iacute;ndices completos.
</DL>

<P>

<B>Debug::pkgAcquire::Worker</B>
<DL COMPACT><DT id="84"><DD>
Regista todas as interac&ccedil;&otilde;es com os sub-processos que realmente executam os downloads.
</DL>

<P>

<B>Debug::pkgAutoRemove</B>
<DL COMPACT><DT id="85"><DD>
Regista no log eventos relacionados com o estado instalado-automaticamente de pacotes e com a remo&ccedil;&atilde;o de pacotes n&atilde;o utilizados.
</DL>

<P>

<B>Debug::pkgDepCache::AutoInstall</B>
<DL COMPACT><DT id="86"><DD>
Gera mensagens de depura&ccedil;&atilde;o descrevendo quais pacotes est&atilde;o a ser instalados automaticamente para resolver depend&ecirc;ncias. Isto corresponde ao passo de instala&ccedil;&atilde;o-autom&aacute;tica inicial executado em, ex,
apt-get install, e n&atilde;o ao resolvedor de depend&ecirc;ncias total do
apt; veja
Debug::pkgProblemResolver
para isso.
</DL>

<P>

<B>Debug::pkgDepCache::Marker</B>
<DL COMPACT><DT id="87"><DD>
Gera mensagens de depura&ccedil;&atilde;o descrevendo qual pacote est&aacute; marcado como manter/instalar/remover enquanto o &quot;solucionador-de-problemas&quot; faz o seu trabalho. Cada adi&ccedil;&atilde;o ou remo&ccedil;&atilde;o pode activar ac&ccedil;&otilde;es adicionais; elas s&atilde;o mostradas indentadas dois espa&ccedil;os adicionais sob da entrada original. O formato de cada linha &eacute;
MarkKeep,
MarkDelete
ou
MarkInstall
seguido por
package-name &lt;a.b.c -&gt; d.e.f | x.y.z&gt; (sec&ccedil;&atilde;o)
onde
a.b.c
&eacute; a vers&atilde;o actual do pacote,
d.e.f
&eacute; a vers&atilde;o considerada para instala&ccedil;&atilde;o e
x.y.z
&eacute; a vers&atilde;o mais recente, mas n&atilde;o considerada para instala&ccedil;&atilde;o (devido a baixa pontua&ccedil;&atilde;o). Os dois &uacute;ltimos podem ser omitidos se n&atilde;o existir nenhum ou for a mesma vers&atilde;o que aquela instalada.
section
&eacute; o nome da sec&ccedil;&atilde;o onde o pacote aparece.
</DL>

<P>

<B>Debug::pkgDPkgPM</B>
<DL COMPACT><DT id="88"><DD>
Ao invocar o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1), escreve com precis&atilde;o a linha de comandos com a qual est&aacute; a ser invocado, com argumentos separados por um caractere de espa&ccedil;o &uacute;nico.
</DL>

<P>

<B>Debug::pkgDPkgProgressReporting</B>
<DL COMPACT><DT id="89"><DD>
Escreve todos os dados recebidos do
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1)
no descritor de ficheiro de estado e quaisquer erros encontrados enquanto os analisa.
</DL>

<P>

<B>Debug::pkgOrderList</B>
<DL COMPACT><DT id="90"><DD>
Gera um rastro do algoritmo que decide a ordem na qual o
apt
deve passar os pacotes ao
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>

<B>Debug::pkgPackageManager</B>
<DL COMPACT><DT id="91"><DD>
Escreve mensagens de estado seguindo os passos executados quando invoca o
<B><A HREF="/cgi-bin/man/man2html?1+dpkg">dpkg</A></B>(1).
</DL>

<P>

<B>Debug::pkgPolicy</B>
<DL COMPACT><DT id="92"><DD>
Escreve a prioridade da cada lista de pacote no arranque.
</DL>

<P>

<B>Debug::pkgProblemResolver</B>
<DL COMPACT><DT id="93"><DD>
Rastreia a execu&ccedil;&atilde;o do resolvedor de depend&ecirc;ncias (isto s&oacute; se aplica ao que acontece quando &eacute; encontrado um problema de depend&ecirc;ncias complexo).
</DL>

<P>

<B>Debug::pkgProblemResolver::ShowScores</B>
<DL COMPACT><DT id="94"><DD>
Mostra uma lista de todos os pacotes instalados com as suas pontua&ccedil;&otilde;es calculadas usadas pelo pkgProblemResolver. A descri&ccedil;&atilde;o do do pacote &eacute; a mesma que &eacute; descrita em
Debug::pkgDepCache::Marker
</DL>

<P>

<B>Debug::sourceList</B>
<DL COMPACT><DT id="95"><DD>
Escreve informa&ccedil;&atilde;o acerca dos fornecedores lida de
/etc/apt/vendors.list.
</DL>

<P>

<B>Debug::RunScripts</B>
<DL COMPACT><DT id="96"><DD>
Mostra os comandos externos que s&atilde;o chamados por hooks do apt. Isto inclui por exemplo as op&ccedil;&otilde;es de configura&ccedil;&atilde;o
DPkg::{Pre,Post}-Invoke
ou
APT::Update::{Pre,Post}-Invoke.
</DL>

<A NAME="lbAM">&nbsp;</A>
<H2>EXEMPLOS</H2>

<P>

/usr/share/doc/apt/examples/configure-index.gz
&eacute; um ficheiro de configura&ccedil;&atilde;o que mostra valores exemplo para todas as op&ccedil;&otilde;es poss&iacute;veis.
<A NAME="lbAN">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/etc/apt/apt.conf
<DL COMPACT><DT id="97"><DD>
Ficheiro de configura&ccedil;&atilde;o do APT. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Main.
</DL>

<P>

/etc/apt/apt.conf.d/
<DL COMPACT><DT id="98"><DD>
Ficheiros de configura&ccedil;&atilde;o fragmentados do APT. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Parts.
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<P>
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?8+apt-config">apt-config</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+apt_preferences">apt_preferences</A></B>(5).
<A NAME="lbAP">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAQ">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAR">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="99"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="100"><DD>
</DL>

<P>

<B>Daniel Burrows</B> &lt;<A HREF="mailto:dburrows@debian.org">dburrows@debian.org</A>&gt;
<DL COMPACT><DT id="101"><DD>
Documenta&ccedil;&atilde;o inicial do Debug::*.
</DL>

<A NAME="lbAS">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="102"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="103"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="104"><A HREF="#lbAB">NOME</A><DD>
<DT id="105"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="106"><A HREF="#lbAD">SINTAXE</A><DD>
<DT id="107"><A HREF="#lbAE">O GRUPO APT</A><DD>
<DT id="108"><A HREF="#lbAF">O GRUPO ACQUIRE</A><DD>
<DT id="109"><A HREF="#lbAG">CONFIGURA&Ccedil;&Atilde;O ESPEC&Iacute;FICA DE BIN&Aacute;RIO</A><DD>
<DT id="110"><A HREF="#lbAH">DIRECT&Oacute;RIOS</A><DD>
<DT id="111"><A HREF="#lbAI">APT EM DSELECT</A><DD>
<DT id="112"><A HREF="#lbAJ">COMO O APT CHAMA O DPKG(1)</A><DD>
<DT id="113"><A HREF="#lbAK">OP&Ccedil;&Otilde;ES PERIODIC E ARCHIVES</A><DD>
<DT id="114"><A HREF="#lbAL">OP&Ccedil;&Otilde;ES DE DEPURA&Ccedil;&Atilde;O</A><DD>
<DT id="115"><A HREF="#lbAM">EXEMPLOS</A><DD>
<DT id="116"><A HREF="#lbAN">FICHEIROS</A><DD>
<DT id="117"><A HREF="#lbAO">VEJA TAMB&Eacute;M</A><DD>
<DT id="118"><A HREF="#lbAP">BUGS</A><DD>
<DT id="119"><A HREF="#lbAQ">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="120"><A HREF="#lbAR">AUTORES</A><DD>
<DT id="121"><A HREF="#lbAS">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
