
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_PREFERENCES</TITLE>
</HEAD><BODY>
<H1>APT_PREFERENCES</H1>
Section: APT (5)<BR>Updated: 17&nbsp;Janeiro&nbsp;2020<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt_preferences - Ficheiro de controle de prefer&ecirc;ncias para o APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

O ficheiro de prefer&ecirc;ncias do APT
/etc/apt/preferences
e os ficheiros fragmentados no direct&oacute;rio
/etc/apt/preferences.d/
podem ser usados para controlar quais as vers&otilde;es de pacotes ir&atilde;o ser seleccionadas para instala&ccedil;&atilde;o.
<P>

V&aacute;rias vers&otilde;es de um pacote podem estar dispon&iacute;veis para instala&ccedil;&atilde;o quando o ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
cont&eacute;m refer&ecirc;ncias a mais do que uma distribui&ccedil;&atilde;o (por exemplo,
stable
e
testing). O APT atribui uma prioridade a cada vers&atilde;o que est&aacute; dispon&iacute;vel. Sujeito a constrangimentos de depend&ecirc;ncias, o
<B>apt-get</B>
selecciona a vers&atilde;o com a prioridade mais alta para instala&ccedil;&atilde;o. As prefer&ecirc;ncias do APT sobrep&otilde;em as prioridades que o APT atribui &agrave;s vers&otilde;es de pacotes por predefini&ccedil;&atilde;o, assim dando controle ao utilizador sobre qual &eacute; seleccionado para instala&ccedil;&atilde;o.
<P>

Podem estar dispon&iacute;veis v&aacute;rias inst&acirc;ncias da mesma vers&atilde;o de um pacote quando o ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
cont&eacute;m refer&ecirc;ncias a mais do que uma fonte. Neste caso o
<B>apt-get</B>
descarrega a inst&acirc;ncia listada mais cedo no ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5). As prefer&ecirc;ncias do APT n&atilde;o afectam a escolha da inst&acirc;ncia, apenas a escolha da vers&atilde;o.
<P>

As prefer&ecirc;ncias s&atilde;o um poder forte nas m&atilde;os de um administrador de sistemas mas tamb&eacute;m se podem tornar no seu maior pesadelo se forem usadas sem cuidado! O APT n&atilde;o ir&aacute; questionar as prefer&ecirc;ncias, portanto as defini&ccedil;&otilde;es erradas ir&atilde;o acabar em pacotes n&atilde;o instal&aacute;veis ou decis&otilde;es erradas ao actualizar pacotes. Ir&atilde;o surgir ainda mais problemas se forem misturadas m&uacute;ltiplas distribui&ccedil;&otilde;es sem o perfeito entendimento dos par&aacute;grafos seguintes. Os pacotes inclu&iacute;dos num lan&ccedil;amento espec&iacute;fico n&atilde;o s&atilde;o testados e por isso nem sempre funcionam como esperado nos lan&ccedil;amentos mais antigos ou recentes ou em conjunto com outros pacotes de lan&ccedil;amentos diferentes. Voc&ecirc; foi avisado.
<P>

Note que os ficheiros no direct&oacute;rio
/etc/apt/preferences.d
s&atilde;o analisados em ordem alfanum&eacute;rica ascendente e precisam obedecer &agrave; conven&ccedil;&atilde;o de nomes seguinte: Os ficheiros ou n&atilde;o t&ecirc;m extens&atilde;o ou t&ecirc;m &quot;pref&quot; na extens&atilde;o do nome de ficheiro e apenas cont&ecirc;m caracteres alfanum&eacute;ricos, tra&ccedil;o (-), underscore (_) e ponto (.). Caso contr&aacute;rio o APT ir&aacute; escrever um aviso de que ignorou um ficheiro, a menos que esse ficheiro corresponda a um padr&atilde;o da lista de configura&ccedil;&atilde;o
Dir::Ignore-Files-Silently
- e neste caso ser&aacute; ignorado em sil&ecirc;ncio.
<A NAME="lbAD">&nbsp;</A>
<H3>Atribui&ccedil;&otilde;es de Prioridade Predefinidas do APT</H3>

<P>

Sen&atilde;o existir um ficheiro de prefer&ecirc;ncias ou se n&atilde;o existe uma entrada no ficheiro que se aplique a uma vers&atilde;o particular ent&atilde;o a prioridade atribu&iacute;da a essa vers&atilde;o &eacute; a prioridade da distribui&ccedil;&atilde;o &agrave; qual essa vers&atilde;o pertence. &Eacute; poss&iacute;vel definir uma distribui&ccedil;&atilde;o singular, &quot;o lan&ccedil;amento de destino&quot;, a qual recebe uma prioridade mais alta que as outras distribui&ccedil;&otilde;es por predefini&ccedil;&atilde;o. O lan&ccedil;amento de destino pode ser definido na linha de comandos do
<B>apt-get</B>
ou no ficheiro de configura&ccedil;&atilde;o do APT
/etc/apt/apt.conf. Note que isto tem preced&ecirc;ncias sobre qualquer prioridade geral que possa definir no ficheiro
/etc/apt/preferences
descrito mais tarde, mas n&atilde;o sobre pacotes especificamente imobilizados. Por exemplo,
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
<B>apt-get install -t testing </B><B></B><I>algum-pacote</I>
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
APT::Default-Release &quot;stable&quot;;
</PRE>

</DL>




<P>

Se o lan&ccedil;amento destinado foi especificado, ent&atilde;o o APT usa o seguinte algoritmo para definir as prioridades das vers&otilde;es de um pacote. Atribuir:
<P>

priority 1
<DL COMPACT><DT id="3"><DD>
para as vers&otilde;es vindas de arquivos cujos ficheiros
Release
estejam marcados como &quot;NotAutomatic: yes&quot; mas
<I>n&atilde;o</I>
como &quot;ButAutomaticUpgrades: yes&quot; como o arquivo
experimental
da Debian.
</DL>

<P>

priority 100
<DL COMPACT><DT id="4"><DD>
para a vers&atilde;o que j&aacute; est&aacute; instalada (se alguma) e para as vers&otilde;es vindas de arquivos cujos ficheiros
Release
estejam marcados como &quot;NotAutomatic: yes&quot; e &quot;ButAutomaticUpgrades: yes&quot; como o arquivo backports da Debian desde
squeeze-backports.
</DL>

<P>

priority 500
<DL COMPACT><DT id="5"><DD>
para as vers&otilde;es que n&atilde;o pertencem ao lan&ccedil;amento destinado.
</DL>

<P>

priority 990
<DL COMPACT><DT id="6"><DD>
para as vers&otilde;es que pertencem ao lan&ccedil;amento destinado.
</DL>

A mais alta dessas prioridades cuja descri&ccedil;&atilde;o coincide com a vers&atilde;o &eacute; especificada para a vers&atilde;o.
<P>

Se o lan&ccedil;amento de destino n&atilde;o foi especificado, ent&atilde;o o APT simplesmente atribui prioridade 100 a todas as vers&otilde;es de pacotes instalados e prioridade 500 e todas as vers&otilde;es de pacotes n&atilde;o instalados, &agrave; excep&ccedil;&atilde;o de vers&otilde;es que venham de arquivos cujos ficheiros
Release
estejam marcados como &quot;NotAutomatic: yes&quot; - estas vers&otilde;es ficam com prioridade 1 ou prioridade 100 se for marcado adicionalmente como &quot;ButAutomaticUpgrades: yes&quot;.
<P>

O APT ent&atilde;o aplica as seguintes regras, listadas em ordem de preced&ecirc;ncia, para determinar qual vers&atilde;o de um pacote deve instalar.
<P>
<DL COMPACT><DT id="7"><DD>
&bull;


Nunca faz downgrade a menos que uma vers&atilde;o dispon&iacute;vel exceda 1000. (&quot;Downgrading&quot; &eacute; instalar uma vers&atilde;o menos recente de um pacote no lugar de uma vers&atilde;o mais recente. Note que nenhuma das prioridades predefinidas do APT excede 1000; tais altas prioridades s&oacute; podem ser definidas no ficheiro de prefer&ecirc;ncias. Note tamb&eacute;m que fazer o downgrade a um pacote pode ser arriscado.)
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


Instala a vers&atilde;o de prioridade mais alta.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


Se duas ou mais vers&otilde;es tiverem a mesma prioridade, instala a mais recente (isto &eacute;, aquela com o n&uacute;mero de vers&atilde;o mais alto).
</DL>

<P>
<DL COMPACT><DT id="10"><DD>
&bull;


Se duas ou mais vers&otilde;es t&ecirc;m a mesma prioridade e o mesmo n&uacute;mero de vers&atilde;o mas ou os pacotes diferem em alguns dos seus metadados ou a op&ccedil;&atilde;o
--reinstall
&eacute; fornecida, instala a que foi desinstalada.
</DL>

<P>

Numa situa&ccedil;&atilde;o t&iacute;pica, a vers&atilde;o instalada de um pacote (prioridade 100) n&atilde;o &eacute; t&atilde;o recente como uma das vers&otilde;es dispon&iacute;veis nas fontes listadas no ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
(prioridade 500 ou 990). Ent&atilde;o o pacote ser&aacute; actualizado quando for executado
<B>apt-get install </B><B></B><I>algum-pacote</I>
ou
<B>apt-get upgrade</B>.
<P>

Mais raramente, a vers&atilde;o instalada de um pacote &eacute;
<I>mais</I>
recente que qualquer das outras vers&otilde;es dispon&iacute;veis. O pacote n&atilde;o ser&aacute; regredido para uma vers&atilde;o inferior quando for executado
<B>apt-get install </B><B></B><I>algum-pacote</I>
ou
<B>apt-get upgrade</B>.
<P>

Por vezes a vers&atilde;o instalada de um pacote &eacute; mais recente que a vers&atilde;o pertencente ao lan&ccedil;amento de destino, mas n&atilde;o t&atilde;o recente que uma vers&atilde;o pertencente a alguma outra distribui&ccedil;&atilde;o. Tal pacote ser&aacute; de facto actualizado quando for executado
<B>apt-get install </B><B></B><I>algum-pacote</I>
ou
<B>apt-get upgrade</B>, porque pelo menos
<I>uma</I>
das vers&otilde;es dispon&iacute;veis tem uma prioridade mais alta que a vers&atilde;o instalada.
<A NAME="lbAE">&nbsp;</A>
<H3>O Efeito das Prefer&ecirc;ncias do APT</H3>

<P>

O ficheiro de prefer&ecirc;ncias do APT permite ao administrador do sistema controlar a atribui&ccedil;&atilde;o de prioridades. O ficheiro consiste em um ou mais registos de multi-linhas separados por linhas vazias. Os registos podem ter um ou dois formatos, um formato espec&iacute;fico e um formato geral.
<P>
<DL COMPACT><DT id="11"><DD>
&bull;


O formato espec&iacute;fico atribui um prioridade (um &quot;Pin-Priority&quot;) a um ou mais pacotes espec&iacute;ficos e vers&atilde;o espec&iacute;fica ou s&eacute;rie de vers&otilde;es. Por exemplo, o seguinte registo atribui uma alta prioridade a todas as vers&otilde;es do pacote
perl
cujo n&uacute;mero de vers&atilde;o come&ccedil;a com &quot;5.20&quot;. M&uacute;ltiplos pacotes podem ser separados por espa&ccedil;os.
<P>
<DL COMPACT><DT id="12"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001
</PRE>

</DL>




</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


O formato geral atribui uma prioridade a todas as vers&otilde;es de pacotes numa dada distribui&ccedil;&atilde;o (isto &eacute;, a todas as vers&otilde;es de pacotes que est&atilde;o listados num certo ficheiro
Release) ou a todas as vers&otilde;es de pacotes vindos de um site de Internet particular, como identificado pelo nome de dom&iacute;nio totalmente qualificado do site.
<P>
Esta entrada general-form no ficheiro de prefer&ecirc;ncias do APT aplica-se apenas a grupos de pacotes. Por exemplo, o seguinte registo atribui uma alta prioridade a todas as vers&otilde;es de pacotes dispon&iacute;veis a partir de um site local.
<P>
<DL COMPACT><DT id="14"><DD>



<PRE>
Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Uma nota de aten&ccedil;&atilde;o: a palavra chave usada aqui &eacute; &quot;origin&quot; que pode ser usada para corresponder a um nome de m&aacute;quina. O seguinte registo ir&aacute; atribuir uma alta prioridade a todas as vers&otilde;es dispon&iacute;veis do servidor identificadas pelo nome de m&aacute;quina &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
<P>
<DL COMPACT><DT id="15"><DD>



<PRE>
Package: *
Pin: origin &quot;<A HREF="ftp://ftp.de.debian.org">ftp.de.debian.org</A>&quot;
Pin-Priority: 999
</PRE>

</DL>




<P>
Isto
<I>n&atilde;o</I>
deve ser confundido com a Origem de uma distribui&ccedil;&atilde;o como especificada num ficheiro
Release. O que representa a etiqueta &quot;Origin:&quot; num ficheiro
Release
n&atilde;o &eacute; um endere&ccedil;o de Internet mas um nome de autor ou marca, tal como &quot;Debian&quot; ou &quot;Ximian&quot;.
<P>
O seguinte registo atribui uma baixa prioridade a todas as vers&otilde;es de pacotes pertencentes a qualquer distribui&ccedil;&atilde;o cujo nome de Arquivo &eacute; &quot;unstable&quot;.
<P>
<DL COMPACT><DT id="16"><DD>



<PRE>
Package: *
Pin: release a=unstable
Pin-Priority: 50
</PRE>

</DL>




<P>
O seguinte registo atribui uma alta prioridade a todas as vers&otilde;es de pacotes pertencentes a qualquer distribui&ccedil;&atilde;o cujo nome de c&oacute;digo &eacute; &quot;bullseye&quot;.
<P>
<DL COMPACT><DT id="17"><DD>



<PRE>
Package: *
Pin: release n=bullseye
Pin-Priority: 900
</PRE>

</DL>




<P>
O seguinte registo atribui alta prioridade a todas as vers&otilde;es de pacotes pertencentes a qualquer lan&ccedil;amento cujo nome de Arquivo &eacute; &quot;stable&quot; e cujo n&uacute;mero de Vers&atilde;o de lan&ccedil;amento &eacute; &quot;10&quot;.
<P>
<DL COMPACT><DT id="18"><DD>



<PRE>
Package: *
Pin: release a=stable, v=10
Pin-Priority: 500
</PRE>

</DL>




</DL>

<P>
O efeito do operador v&iacute;rgula &eacute; semelhante a um &quot;e&quot; l&oacute;gico. Todas as condi&ccedil;&otilde;es t&ecirc;m de ser satisfeitas para o pin corresponder. H&aacute; uma excep&ccedil;&atilde;o: Para qualquer tipo de condi&ccedil;&atilde;o (tal como duas condi&ccedil;&otilde;es &quot;a&quot;), apenas a &uacute;ltima de tais condi&ccedil;&otilde;es &eacute; verificada.
<A NAME="lbAF">&nbsp;</A>
<H3>Express&otilde;es regulares e sintaxe <A HREF="/cgi-bin/man/man2html?7+glob">glob</A>(7)</H3>

<P>

O APT tamb&eacute;m suporta &quot;pinning&quot; por express&otilde;es
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7), e express&otilde;es regulares rodeadas por barras. Por exemplo, o seguinte designa a prioridade de 500 a todos os pacotes de experimental onde o nome come&ccedil;a com gnome (como uma express&atilde;o tipo
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)) ou cont&eacute;m a palavra kde (como uma express&atilde;o regular extensa do POSIX rodeada de barras).
<P>
<DL COMPACT><DT id="19"><DD>



<PRE>
Package: gnome* /kde/
Pin: release a=experimental
Pin-Priority: 500
</PRE>

</DL>




<P>

A regra para essas express&otilde;es &eacute; que elas podem ocorrer em qualquer s&iacute;tio onde uma string pode ocorrer. Assim, o seguinte pin designa a prioridade 990 a todos os pacotes de um lan&ccedil;amento que come&ccedil;a com focal.
<P>
<DL COMPACT><DT id="20"><DD>



<PRE>
Package: *
Pin: release n=focal*
Pin-Priority: 990
</PRE>

</DL>




<P>

Se ocorrer uma express&atilde;o regular num campo
Package, o comportamento &eacute; o mesmo como se esta express&atilde;o regular fosse substitu&iacute;da por uma lista de todos os nomes de pacotes a que ela coincide. No entanto n&atilde;o est&aacute; decidido se isto ir&aacute; mudar no futuro; assim voc&ecirc; deve sempre listar os pins &quot;wild-card&quot; primeiro, para que depois os pins espec&iacute;ficos os sobreporem. O padr&atilde;o &quot;*&quot; num campo Package n&atilde;o &eacute; considerado uma express&atilde;o
<B><A HREF="/cgi-bin/man/man2html?7+glob">glob</A></B>(7)
em si pr&oacute;prio.
<A NAME="lbAG">&nbsp;</A>
<H3>Pinning by source package</H3>

<P>

APT supports pinning by source packages. To pin by a source package, prepend &quot;src:&quot; to the package name.
<P>

For example, to pin all binaries produced by the apt source package of this APT's version to 990, you can do:
<P>
<DL COMPACT><DT id="21"><DD>



<PRE>
Package: src:apt
Pin: version 2.0.4
Pin-Priority: 990
</PRE>

</DL>




<P>

Source package pinning can be combined with regular expressions and glob patterns, and can also take a binary architecture.
<P>

For example, let's pin all binaries for all architectures produced by any source package containing apt in its name to 990:
<P>
<DL COMPACT><DT id="22"><DD>



<PRE>
Package: src:*apt*:any
Pin: version *
Pin-Priority: 990
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H3>Como o APT Interpreta as Prioridades</H3>

<P>

As prioridades (P) atribu&iacute;das no ficheiro de prefer&ecirc;ncias do APT t&ecirc;m de ser inteiros positivos ou negativos. Elas s&atilde;o interpretadas como o seguinte (falando grosso):
<P>

P &gt;= 1000
<DL COMPACT><DT id="23"><DD>
provoca que uma vers&atilde;o seja instalada mesmo que isso constitua uma redu&ccedil;&atilde;o na vers&atilde;o do pacote (downgrade)
</DL>

<P>

990 &lt;= P &lt; 1000
<DL COMPACT><DT id="24"><DD>
provoca que uma vers&atilde;o seja instalada mesmo que n&atilde;o venha do lan&ccedil;amento de destino, a menos que a vers&atilde;o instalada seja mais recente
</DL>

<P>

500 &lt;= P &lt; 990
<DL COMPACT><DT id="25"><DD>
provoca que uma vers&atilde;o seja instalada a menos que exista uma vers&atilde;o dispon&iacute;vel pertencente ao lan&ccedil;amento de destino ou se a vers&atilde;o instalada &eacute; mais recente
</DL>

<P>

100 &lt;= P &lt; 500
<DL COMPACT><DT id="26"><DD>
provoca que uma vers&atilde;o seja instalada a menos que exista uma vers&atilde;o dispon&iacute;vel pertencente a outra distribui&ccedil;&atilde;o ou se a vers&atilde;o instalada &eacute; mais recente
</DL>

<P>

0 &lt; P &lt; 100
<DL COMPACT><DT id="27"><DD>
provoca que uma vers&atilde;o seja instalada apenas se n&atilde;o existir nenhuma vers&atilde;o instalada do pacote
</DL>

<P>

P &lt; 0
<DL COMPACT><DT id="28"><DD>
previne a instala&ccedil;&atilde;o da vers&atilde;o
</DL>

<P>

P = 0
<DL COMPACT><DT id="29"><DD>
tem comportamento n&atilde;o definido, n&atilde;o o utilize.
</DL>

<P>

O primeiro registo de forma-especifica que corresponda a uma vers&atilde;o de pacote dispon&iacute;vel determina a prioridade da vers&atilde;o do pacote. Falhando isso, a prioridade do pacote &eacute; definida como o m&aacute;ximo de todas as prioridades definidas por registos de forma-gen&eacute;rica que correspondam &agrave; vers&atilde;o. Os registos definidos que usem padr&otilde;es diferentes de &quot;*&quot; no campo Pin s&atilde;o tratados como registos de forma-especifica.
<P>

Por exemplo, suponha que o ficheiro de prefer&ecirc;ncias do APT cont&eacute;m os tr&ecirc;s registos apresentados atr&aacute;s:
<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Package: perl
Pin: version 5.20*
Pin-Priority: 1001

Package: *
Pin: origin &quot;&quot;
Pin-Priority: 999

Package: *
Pin: release unstable
Pin-Priority: 50
</PRE>

</DL>




<P>

Ent&atilde;o:
<P>
<DL COMPACT><DT id="31"><DD>
&bull;


Ser&aacute; instalada a vers&atilde;o mais recente dispon&iacute;vel do pacote
perl, desde que o n&uacute;mero da vers&atilde;o comece com &quot;5.20&quot;. Se
<I>qualquer</I>
vers&atilde;o 5.20* do
perl
estiver dispon&iacute;vel e a vers&atilde;o instalada for 5.24*, ent&atilde;o ser&aacute; feito um downgrade ao
perl.
</DL>

<P>
<DL COMPACT><DT id="32"><DD>
&bull;


Uma vers&atilde;o de qualquer pacote que n&atilde;o seja o
perl
e que esteja dispon&iacute;vel a partir do sistema local tem prioridade sobre outras vers&otilde;es, mesmo vers&otilde;es que pertencem ao lan&ccedil;amento de destino.
</DL>

<P>
<DL COMPACT><DT id="33"><DD>
&bull;


Uma vers&atilde;o de um pacote cuja origem n&atilde;o &eacute; o sistema local mas qualquer outro site listado em
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
e o qual pertence a uma distribui&ccedil;&atilde;o
unstable
apenas &eacute; instalado se for seleccionado para instala&ccedil;&atilde;o e se nenhuma vers&atilde;o do pacote j&aacute; estiver instalada.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H3>Determina&ccedil;&atilde;o da Vers&atilde;o do Pacote e Propriedades da Distribui&ccedil;&atilde;o</H3>

<P>

As localiza&ccedil;&otilde;es listadas no ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
devem fornecer os ficheiros
Packages
e
Release
para descrever os pacotes dispon&iacute;veis nessa localiza&ccedil;&atilde;o.
<P>

O ficheiro
Packages
&eacute; normalmente encontrado no direct&oacute;rio
.../dists/<I>nome-da-distribui&ccedil;&atilde;o</I>/<I>componente</I>/<I>arquitectura</I>: por exemplo,
.../dists/stable/main/binary-i386/Packages. Consiste numa s&eacute;rie de registos de v&aacute;rias linhas, um para cada pacote dispon&iacute;vel nesse direct&oacute;rio. Apenas duas linhas em cada registo s&atilde;o relevantes para definir prioridades do APT:
<P>

a linha Package:
<DL COMPACT><DT id="34"><DD>
fornece o nome do pacote
</DL>

<P>

a linha Version:
<DL COMPACT><DT id="35"><DD>
fornece o n&uacute;mero de vers&atilde;o do pacote nomeado
</DL>

<P>

O ficheiro
Release
fica normalmente no direct&oacute;rio
.../dists/<I>nome da distribui&ccedil;&atilde;o</I>: por exemplo,
.../dists/stable/Release, ou
.../dists/buster/Release. Consiste num &uacute;nico registo de v&aacute;rias linhas que se aplica a
<I>todos</I>
os pacotes na &aacute;rvore de direct&oacute;rios sob o seu pai. Ao contr&aacute;rio do ficheiro
Packages, quase todas as linhas num ficheiro
Release
s&atilde;o relevantes para definir as prioridades do APT:
<P>

a linha Archive: ou Suite:
<DL COMPACT><DT id="36"><DD>
nomeia o arquivo ao qual pertencem todos os pacotes na &aacute;rvore de direct&oacute;rios. Por exemplo, a linha &quot;Archive: stable&quot; ou &quot;Suite: stable&quot; especifica que todos os pacotes na &aacute;rvore de direct&oacute;rios abaixo do pai do ficheiro
Release
est&atilde;o num arquivo
stable. Especificar este valor no ficheiro de prefer&ecirc;ncias do APT ir&aacute; requerer a linha:
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
Pin: release a=stable
</PRE>

</DL>




</DL>

<P>

a linha Codename:
<DL COMPACT><DT id="38"><DD>
nomeia o nome de c&oacute;digo a qual todos os pacotes na &aacute;rvore de direct&oacute;rios pertencem. Por exemplo, a linha &quot;Codename: bullseye&quot; especifica que todos os pacotes na &aacute;rvore de direct&oacute;rios abaixo do pai do ficheiro
Release
pertencem a uma vers&atilde;o chamada
bullseye. Especificar este valor no ficheiro de prefer&ecirc;ncias do APT requer a linha:
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
Pin: release n=bullseye
</PRE>

</DL>




</DL>

<P>

a linha Version:
<DL COMPACT><DT id="40"><DD>
nomeia a vers&atilde;o de lan&ccedil;amento. Por exemplo, os pacotes na &aacute;rvore podem pertencer ao lan&ccedil;amento de Debian vers&atilde;o 10. Note que n&atilde;o h&aacute; normalmente um n&uacute;mero de vers&atilde;o para as distribui&ccedil;&otilde;es
testing
e
unstable. porque ainda n&atilde;o foram lan&ccedil;adas. Especificar isto no ficheiro de prefer&ecirc;ncias do APT ir&aacute; requerer uma das seguintes linhas:
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
Pin: release v=10
Pin: release a=stable, v=10
Pin: release 10
</PRE>

</DL>




</DL>

<P>

a linha Component:
<DL COMPACT><DT id="42"><DD>
nomeia o componente de licenciamento associado com os pacotes na &aacute;rvore de direct&oacute;rios do ficheiro
Release. Por exemplo, a linha &quot;Component: main&quot; especifica que todos os pacotes na &aacute;rvore de direct&oacute;rios s&atilde;o do componente
main, o que implica que est&atilde;o licenciados sob os termos listados em Debian Free Software Guidelines. Especificar este componente no ficheiro de prefer&ecirc;ncias do APT ir&aacute; requerer a linha:
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
Pin: release c=main
</PRE>

</DL>




</DL>

<P>

a linha Origin:
<DL COMPACT><DT id="44"><DD>
nomeia a originador dos pacotes na &aacute;rvore de direct&oacute;rios do ficheiro
Release. Geralmente, isto &eacute;
Debian. Especificar esta etiqueta no ficheiro de prefer&ecirc;ncias do APT ir&aacute; requerer a linha:
<P>
<DL COMPACT><DT id="45"><DD>



<PRE>
Pin: release o=Debian
</PRE>

</DL>




</DL>

<P>

a linha Label:
<DL COMPACT><DT id="46"><DD>
nomeia a etiqueta dos pacotes na &aacute;rvore de direct&oacute;rios do ficheiro
Release. Geralmente, isto &eacute;
Debian. Especificar esta etiqueta no ficheiro de prefer&ecirc;ncias do APT ir&aacute; requerer a linha:
<P>
<DL COMPACT><DT id="47"><DD>



<PRE>
Pin: release l=Debian
</PRE>

</DL>




</DL>

<P>

Todos os ficheiros
Packages
e
Release
obtidos das localiza&ccedil;&otilde;es listadas no ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
s&atilde;o armazenados no direct&oacute;rio
/var/lib/apt/lists, ou no ficheiro nomeado pela vari&aacute;vel
Dir::State::Lists
no ficheiro
apt.conf. Por exemplo, o ficheiro
debian.lcs.mit.edu_debian_dists_unstable_contrib_binary-i386_Release
cont&eacute;m o ficheiro
Release
obtido do site
debian.lcs.mit.edu
para ficheiros da arquitectura
binary-i386
do componente
contrib
da distribui&ccedil;&atilde;o
unstable.
<A NAME="lbAJ">&nbsp;</A>
<H3>Linhas Opcionais num Registo de Prefer&ecirc;ncias do APT</H3>

<P>

Cada registo no ficheiro de prefer&ecirc;ncias do APT por come&ccedil;ar opcionalmente com uma ou mais linhas come&ccedil;adas com a palavra
Explanation:. Isto disponibiliza um espa&ccedil;o para coment&aacute;rios.
<A NAME="lbAK">&nbsp;</A>
<H2>EXEMPLOS</H2>

<A NAME="lbAL">&nbsp;</A>
<H3>Acompanhando Stable</H3>

<P>

O seguinte ficheiro de prefer&ecirc;ncias do APT ir&aacute; fazer com que o APT atribua uma prioridade mais alta que o predefinido (500) a todos as vers&otilde;es de pacotes que pertencem a uma distribui&ccedil;&atilde;o
stable
e uma prioridade proibitivamente baixa a vers&otilde;es de pacotes pertencentes a outras distribui&ccedil;&otilde;es
Debian.
<P>
<DL COMPACT><DT id="48"><DD>



<PRE>
Explica&ccedil;&atilde;o: Desinstala ou n&atilde;o instala quaisquer vers&otilde;es de pacotes originais
Explica&ccedil;&atilde;o: Debian para al&eacute;m daquelas da distribui&ccedil;&atilde;o stable
Package: *
Pin: release a=stable
Pin-Priority: 900

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Com um ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
apropriado e o ficheiro de prefer&ecirc;ncias acima, qualquer dos seguintes comandos ir&aacute; fazer com que o APT actualize para as vers&otilde;es
stable
mais recentes.
<P>
<DL COMPACT><DT id="49"><DD>



<PRE>
apt-get install <I>nome-do-pacote</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

O seguinte comandos ir&aacute; fazer com que o APT actualize o pacote especificado para a vers&atilde;o mais recente da distribui&ccedil;&atilde;o
testing; o pacote n&atilde;o ser&aacute; actualizado de novo a menos que seja executado este comando outra vez.
<P>
<DL COMPACT><DT id="50"><DD>



<PRE>
apt-get install <I>pacote</I>/testing
</PRE>

</DL>




<P>
<A NAME="lbAM">&nbsp;</A>
<H3>Acompanhando Testing ou Unstable</H3>

<P>

O seguinte ficheiro de prefer&ecirc;ncias do APT ir&aacute; fazer com que o APT atribua uma prioridade alta a vers&otilde;es de pacotes da distribui&ccedil;&atilde;o
testing, uma prioridade mais baixa a vers&otilde;es de pacotes da distribui&ccedil;&atilde;o
unstable, e uma prioridade proibitivamente baixa a vers&otilde;es de pacotes de outras distribui&ccedil;&otilde;es
Debian.
<P>
<DL COMPACT><DT id="51"><DD>



<PRE>
Package: *
Pin: release a=testing
Pin-Priority: 900

Package: *
Pin: release a=unstable
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Com um ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
apropriado e o ficheiro de prefer&ecirc;ncias acima, qualquer dos seguintes comandos ir&aacute; fazer com que o APT actualize para as vers&otilde;es
testing
mais recentes.
<P>
<DL COMPACT><DT id="52"><DD>



<PRE>
apt-get install <I>nome-do-pacote</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

O comando seguinte ir&aacute; fazer com que o APT actualize o pacote especificado para a vers&atilde;o mais recente da distribui&ccedil;&atilde;o
unstable. Posteriormente, o
<B>apt-get upgrade</B>
ir&aacute; actualizar o pacote para a vers&atilde;o
testing
mais recente se essa for mais recente que a vers&atilde;o instalada, caso contr&aacute;rio, para a vers&atilde;o
unstable
mais recente se essa for mais recente que a vers&atilde;o instalada.
<P>
<DL COMPACT><DT id="53"><DD>



<PRE>
apt-get install <I>pacote</I>/unstable
</PRE>

</DL>




<P>
<A NAME="lbAN">&nbsp;</A>
<H3>Acompanhando a evolu&ccedil;&atilde;o de um nome de c&oacute;digo de lan&ccedil;amento</H3>

<P>

O seguinte ficheiro de prefer&ecirc;ncias do APT ir&aacute; fazer com que o APT atribua uma prioridade mais alta que a predefinida (500) a todas as vers&otilde;es de pacotes pertencentes a um nome de c&oacute;digo especificado de uma distribui&ccedil;&atilde;o com uma prioridade proibitivamente baixa a vers&otilde;es de pacotes pertencentes a outras distribui&ccedil;&otilde;es, nomes de c&oacute;digo ou arquivos
Debian. Note que com estas prefer&ecirc;ncias o APT ir&aacute; seguir a migra&ccedil;&atilde;o de um lan&ccedil;amento a partir do arquivo
testing
para
stable
e mais tarde
oldstable. Se voc&ecirc; que seguir por exemplo o progresso em
testing
n&atilde;o obstante as altera&ccedil;&otilde;es do nome de c&oacute;digo, voc&ecirc; deve usar as configura&ccedil;&otilde;es exemplo acima.
<P>
<DL COMPACT><DT id="54"><DD>



<PRE>
Explica&ccedil;&atilde;o: Desinstala ou n&atilde;o instala nenhumas vers&otilde;es de pacotes originais Debian
Explica&ccedil;&atilde;o: para al&eacute;m daquelas da distribui&ccedil;&atilde;o com nome de c&oacute;digo bullseye ou sid
Package: *
Pin: release n=bullseye
Pin-Priority: 900

Explica&ccedil;&atilde;o: Debian unstable tem sempre o nome de c&oacute;digo sid
Package: *
Pin: release a=sid
Pin-Priority: 800

Package: *
Pin: release o=Debian
Pin-Priority: -10
</PRE>

</DL>




<P>

Com um ficheiro
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
apropriado e o ficheiro de prefer&ecirc;ncias acima, qualquer dos seguintes comandos far&aacute; com que o APT actualize para a vers&atilde;o mais recente no lan&ccedil;amento com nome de c&oacute;digo
bullseye.
<P>
<DL COMPACT><DT id="55"><DD>



<PRE>
apt-get install <I>nome-do-pacote</I>
apt-get upgrade
apt-get dist-upgrade
</PRE>

</DL>




<P>

O seguinte comando ir&aacute; fazer com que o APT actualize o pacote especificado para a vers&atilde;o mais recente da distribui&ccedil;&atilde;o
sid. Posteriormente,
<B>apt-get upgrade</B>
ir&aacute; actualizar o pacote para a vers&atilde;o
bullseye
mais recente se essa for mais recente que a vers&atilde;o instalada, caso contr&aacute;rio, para a vers&atilde;o
sid
mais recente se essa for mais recente que a vers&atilde;o instalada.
<P>
<DL COMPACT><DT id="56"><DD>



<PRE>
apt-get install <I>pacote</I>/sid
</PRE>

</DL>




<P>
<A NAME="lbAO">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/etc/apt/preferences
<DL COMPACT><DT id="57"><DD>
Ficheiro de prefer&ecirc;ncias de vers&atilde;o. Isto &eacute; onde voc&ecirc; deve especificar &quot;pinning&quot;, isto &eacute;, uma prefer&ecirc;ncia para obter certos pacotes A partir de uma fonte separada ou a partir duma vers&atilde;o diferente de uma distribui&ccedil;&atilde;o. Item de Configura&ccedil;&atilde;o:
Dir::Etc::Preferences.
</DL>

<P>

/etc/apt/preferences.d/
<DL COMPACT><DT id="58"><DD>
Ficheiros fragmentados para as prefer&ecirc;ncias de vers&atilde;o. Item de Configura&ccedil;&atilde;o:
Dir::Etc::PreferencesParts.
</DL>

<A NAME="lbAP">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?8+apt-cache">apt-cache</A></B>(8)
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAQ">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAR">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAS">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="59"><DD>
</DL>

<A NAME="lbAT">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="60"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="61"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="62"><A HREF="#lbAB">NOME</A><DD>
<DT id="63"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DL>
<DT id="64"><A HREF="#lbAD">Atribui&ccedil;&otilde;es de Prioridade Predefinidas do APT</A><DD>
<DT id="65"><A HREF="#lbAE">O Efeito das Prefer&ecirc;ncias do APT</A><DD>
<DT id="66"><A HREF="#lbAF">Express&otilde;es regulares e sintaxe glob(7)</A><DD>
<DT id="67"><A HREF="#lbAG">Pinning by source package</A><DD>
<DT id="68"><A HREF="#lbAH">Como o APT Interpreta as Prioridades</A><DD>
<DT id="69"><A HREF="#lbAI">Determina&ccedil;&atilde;o da Vers&atilde;o do Pacote e Propriedades da Distribui&ccedil;&atilde;o</A><DD>
<DT id="70"><A HREF="#lbAJ">Linhas Opcionais num Registo de Prefer&ecirc;ncias do APT</A><DD>
</DL>
<DT id="71"><A HREF="#lbAK">EXEMPLOS</A><DD>
<DL>
<DT id="72"><A HREF="#lbAL">Acompanhando Stable</A><DD>
<DT id="73"><A HREF="#lbAM">Acompanhando Testing ou Unstable</A><DD>
<DT id="74"><A HREF="#lbAN">Acompanhando a evolu&ccedil;&atilde;o de um nome de c&oacute;digo de lan&ccedil;amento</A><DD>
</DL>
<DT id="75"><A HREF="#lbAO">FICHEIROS</A><DD>
<DT id="76"><A HREF="#lbAP">VEJA TAMB&Eacute;M</A><DD>
<DT id="77"><A HREF="#lbAQ">BUGS</A><DD>
<DT id="78"><A HREF="#lbAR">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="79"><A HREF="#lbAS">AUTOR</A><DD>
<DT id="80"><A HREF="#lbAT">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
