
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of APT_AUTH.CONF</TITLE>
</HEAD><BODY>
<H1>APT_AUTH.CONF</H1>
Section: APT (5)<BR>Updated: 02&nbsp;Dezembro&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

apt_auth.conf - Ficheiro de configura&ccedil;&atilde;o de Login para fontes e proxies do APT
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

Os ficheiros de configura&ccedil;&atilde;o do APT como
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
ou
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
precisam de estar acess&iacute;veis para todos os que usam as ferramentas do apt no sistema para terem acesso a toda a informa&ccedil;&atilde;o relacionadas com pacotes como os pacotes dispon&iacute;veis num reposit&oacute;rio. Por outro lado, a informa&ccedil;&atilde;o de login necess&aacute;ria para liga&ccedil;&atilde;o a um proxy ou para descarregar dados de um reposit&oacute;rio n&atilde;o deve estar sempre acess&iacute;vel a todos e n&atilde;o deve ser colocada num ficheiro com palavras leg&iacute;veis e permiss&otilde;es de leitura.
<P>

O ficheiro auth.conf do APT
/etc/apt/auth.conf, e os ficheiros .conf dentro de
/etc/apt/auth.conf.d
podem ser usados para armazenar informa&ccedil;&atilde;o de login num formato estilo netrc com permiss&otilde;es de ficheiro restritas.
<A NAME="lbAD">&nbsp;</A>
<H2>FORMATO TIPO NETRC</H2>

<P>

O formato definido aqui &eacute; semelhante ao formato do ficheiro
~/.netrc
usado pelo
<B><A HREF="/cgi-bin/man/man2html?1+ftp">ftp</A></B>(1)
e programas semelhantes que interagem com servidores. &Eacute; um formato simples baseado em token com os seguintes tokens a serem reconhecidos. Os tokens desconhecidos ser&atilde;o ignorados. Os tokens podem ser separados por espa&ccedil;os, tabs ou nova-linha.
<P>

machine <I>[protocol://]</I><I>hostname</I>[:<I>port</I>][/<I>path</I>]
<DL COMPACT><DT id="1"><DD>
As entradas s&atilde;o procuradas ao pesquisar pelo token
<I>machine</I>
que corresponde ao nome de m&aacute;quina do URI para que o apt precisa de informa&ccedil;&atilde;o de login. Estendendo o formato netrc, pode ser especificado um n&uacute;mero de porto. Se nenhum porto for fornecido o token corresponde a todos os portos. De modo semelhante, o caminho &eacute; opcional e apenas necess&aacute;rio e &uacute;til se residirem no mesmo servidor v&aacute;rios reposit&oacute;rios com informa&ccedil;&atilde;o de login diferentes. Um token de m&aacute;quina com um caminho corresponde se o caminho no URI come&ccedil;ar com o caminho fornecido no token. Quando existe uma correspond&ecirc;ncia, os tokens subsequentes s&atilde;o processados, parando quando &eacute; alcan&ccedil;ado o final do ficheiro ou &eacute; encontrado outro token
<I>machine</I>.
<P>
If protocol is not specified, the entry only matches https and tor+https.
</DL>

<P>

login <I>nome</I>
<DL COMPACT><DT id="2"><DD>
O nome de utilizador a ser usado.
</DL>

<P>

password <I>string</I>
<DL COMPACT><DT id="3"><DD>
A palavra passe a ser usada
</DL>

<A NAME="lbAE">&nbsp;</A>
<H2>EXEMPLO</H2>

<P>

Fornecer informa&ccedil;&atilde;o de login para um utilizador chamado
apt
com a palavra passe
debian
para a entrada
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
deb <A HREF="https://example.org/debian">https://example.org/debian</A> buster main
</PRE>

</DL>




<P>
de
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
pode ser feito na entrada directamente:
<P>
<DL COMPACT><DT id="5"><DD>



<PRE>
deb <A HREF="https://apt:debian@example.org/debian">https://apt:debian@example.org/debian</A> buster main
</PRE>

</DL>




<P>
Alternativamente, pode ser usada uma entrada como a seguinte no ficheiro auth.conf:
<P>
<DL COMPACT><DT id="6"><DD>



<PRE>
machine example.org
login apt
password debian
</PRE>

</DL>




<P>
Ou alternativamente dentro de uma linha &uacute;nica:
<P>
<DL COMPACT><DT id="7"><DD>



<PRE>
machine example.org login apt password debian
</PRE>

</DL>




<P>
Se precisar de ser mais espec&iacute;fico, todas estas linha poder&atilde;o ser aplicadas no exemplo de entrada:
<P>
<DL COMPACT><DT id="8"><DD>



<PRE>
machine example.org/deb login apt password debian
machine example.org/debian login apt password debian
machine example.org/debian/ login apt password debian
</PRE>

</DL>




<P>
Por outro lado nenhuma das seguintes linhas aplicam-se:
<P>
<DL COMPACT><DT id="9"><DD>



<PRE>
machine example.org:443 login apt password debian
machine example.org/deb/ login apt password debian
machine example.org/ubuntu login apt password debian
machine example.orga login apt password debian
machine example.net login apt password debian
</PRE>

</DL>




<P>
<A NAME="lbAF">&nbsp;</A>
<H2>NOTAS</H2>

<P>

O suporte b&aacute;sico para esta funcionalidade est&aacute; presente desde a vers&atilde;o 0.7.25, mas esteve sem documenta&ccedil;&atilde;o durante anos. A documenta&ccedil;&atilde;o foi adicionada na vers&atilde;o 1.5 mudando tamb&eacute;m ligeiramente a implementa&ccedil;&atilde;o. Para o m&aacute;ximo de compatibilidade regressiva, voc&ecirc; deve evitar m&uacute;ltiplos tokens
machine
com o mesmo nome-de-m&aacute;quina, mas se precisar de m&uacute;ltiplos eles deves todos ter um caminha especificado no token
machine.
<P>

Login information in auth.conf are more flexible than those in sources.list. For example, login information can be specified for parts of a repository only, or if the sources.list entry redirects elsewhere, login information for the redirect destination can be supplied.
<A NAME="lbAG">&nbsp;</A>
<H2>FICHEIROS</H2>

<P>

/etc/apt/auth.conf
<DL COMPACT><DT id="10"><DD>
Informa&ccedil;&atilde;o de login para fontes e proxies do APT em formato estilo netrc. Item de Configura&ccedil;&atilde;o:
Dir::Etc::netrc.
</DL>

<P>

/etc/apt/auth.conf.d/*.conf
<DL COMPACT><DT id="11"><DD>
Informa&ccedil;&atilde;o de login para fontes e proxies do APT em formato estilo netrc Item de Configura&ccedil;&atilde;o:
Dir::Etc::netrcparts.
</DL>

<A NAME="lbAH">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5)
<B><A HREF="/cgi-bin/man/man2html?5+sources.list">sources.list</A></B>(5)
<A NAME="lbAI">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAJ">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAK">&nbsp;</A>
<H2>AUTOR</H2>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="12"><DD>
</DL>

<A NAME="lbAL">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="13"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="14"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="15"><A HREF="#lbAB">NOME</A><DD>
<DT id="16"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="17"><A HREF="#lbAD">FORMATO TIPO NETRC</A><DD>
<DT id="18"><A HREF="#lbAE">EXEMPLO</A><DD>
<DT id="19"><A HREF="#lbAF">NOTAS</A><DD>
<DT id="20"><A HREF="#lbAG">FICHEIROS</A><DD>
<DT id="21"><A HREF="#lbAH">VEJA TAMB&Eacute;M</A><DD>
<DT id="22"><A HREF="#lbAI">BUGS</A><DD>
<DT id="23"><A HREF="#lbAJ">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="24"><A HREF="#lbAK">AUTOR</A><DD>
<DT id="25"><A HREF="#lbAL">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
