
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML><HEAD><TITLE>Man page of SOURCES.LIST</TITLE>
</HEAD><BODY>
<H1>SOURCES.LIST</H1>
Section: APT (5)<BR>Updated: 04&nbsp;Abril&nbsp;2019<BR><A HREF="#index">Index</A>
<A HREF="/cgi-bin/man/man2html">Return to Main Contents</A><HR>





















<A NAME="lbAB">&nbsp;</A>
<H2>NOME</H2>

sources.list - Lista das fontes de dados APT configuradas
<A NAME="lbAC">&nbsp;</A>
<H2>DESCRI&Ccedil;&Atilde;O</H2>

<P>

A lista de fontes
/etc/apt/sources.list
e os ficheiros contidos em
/etc/apt/sources.list.d/
est&atilde;o desenhados para suportar qualquer n&uacute;mero de fontes activas e uma variedade de meios de fontes. Os ficheiros listam uma fonte por linha (estilo-uma-linha) ou cont&ecirc;m m&uacute;ltiplas estrofes definindo uma ou mais fontes por estrofe (estilo deb822), com a fonte de maior prefer&ecirc;ncia listada em primeiro lugar (no caso de uma vers&atilde;o &uacute;nica estar dispon&iacute;vel a partir de mais do que uma fonte). A informa&ccedil;&atilde;o dispon&iacute;vel a partir das fontes configuradas &eacute; obtida pelo
<B>apt-get update</B>
(ou por um comando equivalente de outro front-end do APT).
<A NAME="lbAD">&nbsp;</A>
<H2>SOURCES.LIST.D</H2>

<P>

O direct&oacute;rio
/etc/apt/sources.list.d
disponibiliza um modo de adicionar entradas na sources.list em ficheiros separados. S&atilde;o permitidos dois formatos diferentes de ficheiro como descrito nas pr&oacute;ximas duas sec&ccedil;&otilde;es. Os nomes de ficheiros precisam de ter ou a extens&atilde;o
.list
ou
.sources
dependendo do formato contido. Os nomes dos ficheiros podem apenas conter letras (a-z e A-Z), d&iacute;gitos (0-9), e os caracteres underscore (_), menos (-) e ponto (.). De outro modo o APT ir&aacute; escrever um aviso de que ignorou um ficheiro, a menos que esse ficheiro coincida com um padr&atilde;o na lista de configura&ccedil;&atilde;o
Dir::Ignore-Files-Silently
- que neste caso ser&atilde;o ignorados em sil&ecirc;ncio.
<A NAME="lbAE">&nbsp;</A>
<H2>FORMATO ESTILO-UMA-LINHA</H2>

<P>

Os ficheiros neste formato t&ecirc;m a extens&atilde;o
.list. Cada linha que especifica uma fonte come&ccedil;a com um tipo (ex.
deb-src) seguido de op&ccedil;&otilde;es e argumentos para esse tipo. Entradas individuais n&atilde;o podem ser continuadas at&eacute; a linha seguinte. As linhas vezias s&atilde;o ignoradas,e um caractere
#
em qualquer pondo de uma linha marca o restante da linha como um coment&aacute;rio. Consequentemente uma entrada pode ser desactivada ao comentar a linha inteira. Se for preciso fornecer op&ccedil;&otilde;es, estas s&atilde;o separadas por espa&ccedil;os e elas todas juntas s&atilde;o posicionas entre par&ecirc;nteses rectos ([]) inclu&iacute;dos na linha ap&oacute;s o tipo e separado dele por um espa&ccedil;o. Se uma op&ccedil;&atilde;o permitir v&aacute;rios valores estes s&atilde;o separados entre eles com uma v&iacute;rgula (,). Um nome de op&ccedil;&atilde;o &eacute; separado do(s) seu(s) valor(es) por um sinal de igual (=). Op&ccedil;&otilde;es de multi-valor tamb&eacute;m t&ecirc;m
-=
e
+=
como separadores, os quais em vez de substituir a predefini&ccedil;&atilde;o pelos valor(es) fornecidos modificam os valor(es) predefinidos para remover ou incluir os valores fornecidos.
<P>

Este &eacute; o formato tradicional e suportado por todas as vers&otilde;es do apt. Note que nem todas as op&ccedil;&otilde;es descritas abaixo s&atilde;o suportadas por todas as vers&otilde;es do apt. Note tamb&eacute;m que algumas aplica&ccedil;&otilde;es mais antigas que analisem este formato por si mesmas podem n&atilde;o esperar encontrar op&ccedil;&otilde;es pois estas n&atilde;o eram comuns antes da introdu&ccedil;&atilde;o do suporte a multi-arquitecturas.
<A NAME="lbAF">&nbsp;</A>
<H2>FORMATO ESTILO-DEB822</H2>

<P>

Os ficheiros neste formato t&ecirc;m a extens&atilde;o
.sources. O formato &eacute; semelhante em sintaxe a outros ficheiros usados por Debian e seus derivados, tais como os ficheiros de meta-dados que o apt ir&aacute; descarregar das fontes configuradas ou o ficheiro
debian/control
de um pacote fonte Debian. As entradas individuais s&atilde;o separadas por uma linha vazia; as linha vazias adicionais s&atilde;o ignoradas, e um caractere
#
no inicia da linha marca a linha inteira como um coment&aacute;rio. Uma entrada pode assim ser desactivada ao comentar cada linha que pertence &agrave; estrofe, mas &eacute; geralmente mais f&aacute;cil adicionar o campo &quot;Enabled: no&quot; &agrave; estrofe para desactivar a entrada. Removendo o campo ou defini-lo para &quot;yes&quot; volta a activ&aacute;-la. As op&ccedil;&otilde;es t&ecirc;m a mesma sintaxe que todos os outros campos. Um nome de campo &eacute; separado por dois pontos (:) e opcionalmente por espa&ccedil;os dos seus valor(es). Note especialmente que m&uacute;ltiplos valores s&atilde;o separados por espa&ccedil;os em branco (como espa&ccedil;os, tabs e novas-linhas), n&atilde;o por v&iacute;rgulas como no formado de uma-linha. Os campos de multi-valor como
Architectures
tamb&eacute;m t&ecirc;m
Architectures-Add
e
Architectures-Remove
para modificar o valor predefinido em vez de o substituir.
<P>

Este &eacute; um novo formato suportado pelo apt desde vers&atilde;o 1.1. As vers&otilde;es anteriores ignoravam tais ficheiros com uma mensagem descrita antes. &Eacute; objectivo tornar gradualmente este formato no formato predefinido, descontinuando o anteriormente descrito formato de estilo-uma-linha, pois &eacute; mais f&aacute;cil de criar, aumentar e modificar para as pessoas e para as m&aacute;quinas especialmente se estiverem envolvidas muitas fontes e/ou op&ccedil;&otilde;es. Os desenvolvedores que est&atilde;o a trabalhar com e/ou a analisar fontes do apt s&atilde;o altamente encorajados a adicionar suporte a este formato e a contactar a equipa do APT para coordenar e partilhar este trabalho. Os utilizadores podem j&aacute; livremente adoptar este formato, mas podem encontrar problemas com software que ainda n&atilde;o suporte o formato.
<A NAME="lbAG">&nbsp;</A>
<H2>OS TIPOS DEB E DEB-SRC: FORMATO GERAL</H2>

<P>

O tipo
deb
descreve um arquivo Debian t&iacute;pico de dois n&iacute;veis,
distribution/component. A
distribution
&eacute; geralmente um nome de uma suite como
stable
ou
testing
ou um nome de c&oacute;digo como
buster
ou
bullseye
enquanto que componente &eacute; um de
main,
contrib
ou
non-free. O tipo
deb-src
faz refer&ecirc;ncia a um c&oacute;digo fonte de distribui&ccedil;&atilde;o Debian no mesmo formato que o tipo
deb. &Eacute; necess&aacute;ria uma linha
deb-src
para obter &iacute;ndices das fontes.
<P>

O formato para duas entradas estilo-uma-linha usando os tipos
deb
e
deb-src
&eacute;:
<P>
<DL COMPACT><DT id="1"><DD>



<PRE>
deb [ option1=value1 option2=value2 ] uri suite [component1] [component2] [...]
deb-src [ option1=value1 option2=value2 ] uri suite [component1] [component2] [...]
</PRE>

</DL>




<P>

Em alternativa, a entrada equivalente em estilo deb822 parece-se com isto:
<P>
<DL COMPACT><DT id="2"><DD>



<PRE>
     Types: deb deb-src
     URIs: uri
     Suites: suite
     Components: [component1] [component2] [...]
     option1: value1
     option2: value2
   
</PRE>

</DL>




<P>

O URI para o tipo
deb
tem de especificar a base da distribui&ccedil;&atilde;o Debian, a partir do qual o APT ir&aacute; encontrar a informa&ccedil;&atilde;o que precisa.
suite
pode especificar um caminho exacto, que no caso os componente t&ecirc;m de ser omitidos e
suite
deve terminar com uma barra (/). Isto &eacute; &uacute;til para o caso de apenas ser de interesse um sub-direct&oacute;rio particular do arquivo denotado pelo URI. Se
suite
n&atilde;o especificar um caminho exacto, pelo menos um
component
tem de estar presente.
<P>

suite
tamb&eacute;m pode conter uma vari&aacute;vel.
$(ARCH)
a qual se expande &agrave; arquitectura Debian (tal como
amd64
ou
armel) usada no sistema. Isto permite que seja usados ficheiros
sources.list
independentes da arquitectura. Em geral, isto &eacute; apenas de interesse quando se especifica um caminho exacto; de outro modo o
APT
ir&aacute; gerar automaticamente um URI com a arquitectura actual.
<P>

Especialmente no formato de estilo uma-linha como apenas pode ser especificada por linha uma distribui&ccedil;&atilde;o, pode ser necess&aacute;rio ter v&aacute;rias linhas para o mesmo URI, se s&oacute; for desejado um sub-conjunto de todas as distribui&ccedil;&otilde;es e componentes dessa localiza&ccedil;&atilde;o. O APT ir&aacute; ordenar a lista de URI ap&oacute;s ter gerado internamente um conjunto completo, e ir&aacute; desabar as v&aacute;rias refer&ecirc;ncias &agrave; mesma m&aacute;quina na Internet, por exemplo, numa &uacute;nica liga&ccedil;&atilde;o, para que n&atilde;o estabele&ccedil;a uma liga&ccedil;&atilde;o ineficiente, a feche, fa&ccedil;a outra coisa, e depois volte a estabelecer liga&ccedil;&atilde;o &agrave; mesma m&aacute;quina. O APT tamb&eacute;m paraleliza liga&ccedil;&otilde;es a m&aacute;quinas diferentes para lidar mais eficientemente com sites com largura de banda baixa.
<P>

&Eacute; importante listar as fontes por ordem de prefer&ecirc;ncia, com a fonte mais preferida listada em primeiro lugar. Tipicamente isto ir&aacute; resultar numa ordena&ccedil;&atilde;o por velocidades desde o mais r&aacute;pido at&eacute; ao mais lento (CD-ROM seguido por m&aacute;quinas numa rede local, seguido por m&aacute;quinas distantes na Internet, por exemplo).
<P>

Como um exemplo, as fontes da sua distribui&ccedil;&atilde;o podem-se parecer com isto no formato estilo uma-linha:
<P>
<DL COMPACT><DT id="3"><DD>



<PRE>
deb <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A> focal main restricted
deb <A HREF="http://security.ubuntu.com/ubuntu">http://security.ubuntu.com/ubuntu</A> focal-security main restricted
deb <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A> focal-updates main restricted
</PRE>

</DL>




<P>
ou com isto no formato estilo deb822:
<P>
<DL COMPACT><DT id="4"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://us.archive.ubuntu.com/ubuntu">http://us.archive.ubuntu.com/ubuntu</A>
Suites: focal focal-updates
Components: main restricted

Types: deb
URIs: <A HREF="http://security.ubuntu.com/ubuntu">http://security.ubuntu.com/ubuntu</A>
Suites: focal-security
Components: main restricted
</PRE>

</DL>




<A NAME="lbAH">&nbsp;</A>
<H2>OS TIPOS DEB E DEB-SRC: OP&Ccedil;&Otilde;ES</H2>

<P>

Cada entrada de fonte pode ter op&ccedil;&otilde;es especificas para modificar qual fonte &eacute; acedida e como os dados s&atilde;o adquiridos dela. O formato, sintaxe e nomes das op&ccedil;&otilde;es varia entre os formatos de estilo-uma-linha e estilo-deb822 como descrito, mas estes n&atilde;o t&ecirc;m as mesmas op&ccedil;&otilde;es dispon&iacute;veis. Para simplificar listamos o nome-de-campo deb822 e disponibilizamos o nome de uma-linha entre par&ecirc;nteses. Lembre-se que al&eacute;m de definir explicitamente op&ccedil;&otilde;es de multi-valor, existe tamb&eacute;m a op&ccedil;&atilde;o de modific&aacute;-os com base na predefini&ccedil;&atilde;o, mas n&atilde;o estamos a listar explicitamente esses nomes aqui. As op&ccedil;&otilde;es n&atilde;o suportadas s&atilde;o ignoradas em sil&ecirc;ncio por todas as vers&otilde;es do APT.
<P>
<DL COMPACT><DT id="5"><DD>
&bull;


<B>Architectures</B>
(<B>arch</B>) &eacute; uma op&ccedil;&atilde;o multi-valor que define para quais arquitecturas deve ser descarregada a informa&ccedil;&atilde;o. Se esta op&ccedil;&atilde;o n&atilde;o for definida &eacute; todas as arquitecturas como definido pela op&ccedil;&atilde;o de configura&ccedil;&atilde;o
<B>APT::Architectures</B>.
</DL>

<P>
<DL COMPACT><DT id="6"><DD>
&bull;


<B>Languages</B>
(<B>lang</B>) &eacute; uma op&ccedil;&atilde;o multi-valor que define para quais linguagens deve ser descarregada informa&ccedil;&atilde;o tal como as descri&ccedil;&otilde;es de pacotes traduzidas. Se esta op&ccedil;&atilde;o for definida a predefini&ccedil;&atilde;o &eacute; todas as linguagens como definido pela op&ccedil;&atilde;o de configura&ccedil;&atilde;o
<B>Acquire::Languages</B>.
</DL>

<P>
<DL COMPACT><DT id="7"><DD>
&bull;


<B>Targets</B>
(<B>target</B>) &eacute; uma op&ccedil;&atilde;o multi-valor que define quais alvos de download o apt ir&aacute; tentar adquirir a partir desta fonte. Se n&atilde;o for especificado, o valor predefinido &eacute; definido pelo scope de configura&ccedil;&atilde;o
<B>Acquire::IndexTargets</B>
(os alvos s&atilde;o especificados pelo seu nome no campo
Created-By). Adicionalmente, pode-se activar ou desactivar alvos ao usar campo
Identifier
como uma op&ccedil;&atilde;o com um valor booleano em vez de se usar esta op&ccedil;&atilde;o multi-valor.
</DL>

<P>
<DL COMPACT><DT id="8"><DD>
&bull;


<B>PDiffs</B>
(<B>pdiffs</B>) &eacute; um valor sim/n&atilde;o que controla se o APT deve tentar usar PDiffs para actualizar &iacute;ndices antigos em vez de descarregar totalmente novos &iacute;ndices. O valor desta op&ccedil;&atilde;o &eacute; ignorado se o reposit&oacute;rio n&atilde;o anunciar a disponibilidade de PDiffs. Usa por predefini&ccedil;&atilde;o o valor da op&ccedil;&atilde;o com o mesmo nome para um ficheiro &iacute;ndice espec&iacute;fico definido no scope
<B>Acquire::IndexTargets</B>, o qual usa por predefini&ccedil;&atilde;o o valor da op&ccedil;&atilde;o de configura&ccedil;&atilde;o
<B>Acquire::PDiffs</B>
o qual usa por predefini&ccedil;&atilde;o
yes.
</DL>

<P>
<DL COMPACT><DT id="9"><DD>
&bull;


<B>By-Hash</B>
(<B>by-hash</B>) pode ter o valor
yes,
no
ou
force
e controlam se o APT deve tentar obter &iacute;ndices via um URL constru&iacute;do a partir de um hashsum do ficheiro esperado em vez de usar um nome de ficheiro est&aacute;vel e bem conhecido do &iacute;ndice. Usar isto pode evitar erros de correspond&ecirc;ncia de hashsum, mas requer um mirror que suporte. Um valor
yes
ou
no
activa/desactiva o uso desta funcionalidade se esta fonte indicar suporte para tal, enquanto
force
ir&aacute; activar a funcionalidade independentemente do que a fonte indique. Recorre &agrave; predefini&ccedil;&atilde;o do valor da op&ccedil;&atilde;o com o mesmo nome para um ficheiro index espec&iacute;fico definido no scope
<B>Acquire::IndexTargets</B>, que o pr&oacute;prio usa por predefini&ccedil;&atilde;o o valor da op&ccedil;&atilde;o de configura&ccedil;&atilde;o
<B>Acquire::By-Hash</B>
a qual &eacute; predefinida para
yes.
</DL>

<P>
Mais ainda, existem op&ccedil;&otilde;es que se definidas afectam
<I>todas</I>
as fontes com o mesmo URL e Suite, ent&atilde;o elas t&ecirc;m de ser definidas em todas as tais entradas e n&atilde;o podem variar entre componentes diferentes. O APT ir&aacute; tentar detectar e terminar em erro em tais anomalias.
<P>
<DL COMPACT><DT id="10"><DD>
&bull;


<B>Allow-Insecure</B>
(<B>allow-insecure</B>),
<B>Allow-Weak</B>
(<B>allow-weak</B>) e
<B>Allow-Downgrade-To-Insecure</B>
(<B>allow-downgrade-to-insecure</B>) s&atilde;o valores booleanos os todos s&atilde;o predefinidos com
no. Se definidos para
yes
eles contornam partes de
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
e por isto n&atilde;o devem ser usados de forma leviana!
</DL>

<P>
<DL COMPACT><DT id="11"><DD>
&bull;


<B>Trusted</B>
(<B>trusted</B>) &eacute; um valor de tr&ecirc;s estados o qual &eacute; predefinido para o APT decidir se uma fonte &eacute; de confian&ccedil;a ou se levem ser activados avisos antes de, por ex, pacotes serem instalados a partir dessa fonte. Esta op&ccedil;&atilde;o pode ser usada para sobrepor essa decis&atilde;o. O valor
yes
diz ao APT que deve sempre considerar essa fonte como de confian&ccedil;a, mesmo que n&atilde;o aprove nas verifica&ccedil;&otilde;es de autentica&ccedil;&atilde;o. Desactiva partes de
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8), e portanto apenas deve ser usada num contexto local e de confian&ccedil;a (e se assim for mesmo) pois caso contr&aacute;rio a seguran&ccedil;a perde-se. O valor
no
faz o aposto, fazendo com que a fonte seja lidada como n&atilde;o confi&aacute;vel mesmo que as verifica&ccedil;&otilde;es de autentica&ccedil;&atilde;o passem com sucesso. O valor predefinido n&atilde;o pode ser regulado explicitamente.
</DL>

<P>
<DL COMPACT><DT id="12"><DD>
&bull;


<B>Signed-By</B>
(<B>signed-by</B>) &eacute; uma op&ccedil;&atilde;o para requerer a um reposit&oacute;rio para passar a verifica&ccedil;&atilde;o
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
com um certo conjunto de chaves em vez das chaves de tudo confian&ccedil;a que o apt tem configurado. &Eacute; especificada como uma lista de caminhos absolutos para ficheiros de chaveiro (t&ecirc;m de estar acess&iacute;veis e leg&iacute;veis para o utilizador do sistema
_apt, portanto assegure que todos t&ecirc;m permiss&otilde;es de leitura ao ficheiro) e impress&otilde;es digitais de chaves para seleccionar a partir destes chaveiros. Se n&atilde;o forem especificados nenhuns ficheiros chaveiro, o predefinido &eacute; o chaveiro
trusted.gpg
e todos os chaveiros no direct&oacute;rio
trusted.gpg.d/
(veja
<B>apt-key fingerprint</B>). Se n&atilde;o for especificada nenhuma impress&atilde;o digital, s&atilde;o seleccionadas todas as chaves nos chaveiros. Uma impress&atilde;o digital ir&aacute; tamb&eacute;m aceitar todas as assinaturas por uma sub-chave dessa chave. Se isto n&atilde;o for desejado pode ser adicionado um ponto de exclama&ccedil;&atilde;o (!) &agrave; impress&atilde;o digital para desactivar este comportamento. A op&ccedil;&atilde;o usa por predefini&ccedil;&atilde;o o valor da op&ccedil;&atilde;o com o mesmo nome se for definida no ficheiro
Release
previamente adquirido deste reposit&oacute;rio (apenas impress&otilde;es digitais podem ser especificadas l&aacute; totalmente). Caso contr&aacute;rio, todas as chaves nos chaveiros de confian&ccedil;a s&atilde;o consideradas assinantes v&aacute;lidos para este reposit&oacute;rio.
</DL>

<P>
<DL COMPACT><DT id="13"><DD>
&bull;


<B>Check-Valid-Until</B>
(<B>check-valid-until</B>) &eacute; um valor yes/no que controla se o APT dever&aacute; tentar detectar ataques de repeti&ccedil;&atilde;o. Um criador de reposit&oacute;rio pode declarar uma hora limite para os dados disponibilizados no reposit&oacute;rio serem considerados como v&aacute;lidos, e se esta hora for atingida, e nenhuns novos dados forem fornecidos, os dados s&atilde;o considerados expirados e &eacute; provocado um erro. Para al&eacute;m de aumentar a seguran&ccedil;a, pois um atacante malicioso n&atilde;o pode enviar dados antigos eternamente para impedir um utilizador de actualizar para uma nova vers&atilde;o, isto tamb&eacute;m ajuda os utilizadores a identificar mirrors que n&atilde;o est&atilde;o mais actualizados. No entanto, alguns reposit&oacute;rios tais como os arquivos hist&oacute;ricos que n&atilde;o s&atilde;o mais actualizados propositadamente, assim esta verifica&ccedil;&atilde;o pode ser desactivada ao definir esta op&ccedil;&atilde;o para
no. Usa por predefini&ccedil;&atilde;o o valor da op&ccedil;&atilde;o de configura&ccedil;&atilde;o
<B>Acquire::Check-Valid-Until</B>
a qual ela pr&oacute;pria usa por predefini&ccedil;&atilde;o
yes.
</DL>

<P>
<DL COMPACT><DT id="14"><DD>
&bull;


<B>Valid-Until-Min</B>
(<B>valid-until-min</B>) e
<B>Valid-Until-Max</B>
(<B>valid-until-max</B>) podem ser usadas para elevar ou baixar o per&iacute;odo de tempo em segundos no qual os dados deste reposit&oacute;rio s&atilde;o considerados v&aacute;lidos. -Max pode ser especialmente &uacute;til para definir o sue pr&oacute;prio valor se o reposit&oacute;rio n&atilde;o disponibilizar um campo Valid-Until no seu ficheiro Release, enquanto -Min pode ser usado para aumentar o tempo v&aacute;lido em mirrors raramente actualizados (locais) de um arquivo mais frequentemente actualizado mas menos acess&iacute;vel (o qual est&aacute; tamb&eacute;m em sources.list) em vez de desactivar completamente a verifica&ccedil;&atilde;o. Usa por predefini&ccedil;&atilde;o o valor das op&ccedil;&otilde;es de configura&ccedil;&atilde;o
<B>Acquire::Min-ValidTime</B>
and
<B>Acquire::Max-ValidTime</B>
que est&atilde;o ambas n&atilde;o definidas por predefini&ccedil;&atilde;o.
</DL>

<P>
<DL COMPACT><DT id="15"><DD>
&bull;


<B>Check-Date</B>
(<B>check-date</B>) &eacute; um valor yes/no que controla se o APT deve considerar a hora da m&aacute;quina correcta e assim executar as verifica&ccedil;&otilde;es relacionadas com horas, tal como verificar que um ficheiro Release n&atilde;o veio do futuro. Desactiv&aacute;-lo tamb&eacute;m desactiva a op&ccedil;&atilde;o
<B>Check-Valid-Until</B>
mencionada em cima.
</DL>

<P>
<DL COMPACT><DT id="16"><DD>
&bull;


<B>Date-Max-Future</B>
(<B>date-max-future</B>) controla qu&atilde;o longe do futuro um reposit&oacute;rio pode estar. Usa por predefini&ccedil;&atilde;o o valor da op&ccedil;&atilde;o de configura&ccedil;&atilde;o
<B>Acquire::Max-FutureTime</B>
a qual &eacute; 10 segundo por predefini&ccedil;&atilde;o.
</DL>

<P>
<DL COMPACT><DT id="17"><DD>
&bull;


<B>InRelease-Path</B>
(<B>inrelease-path</B>) determina o caminho para o ficheiro InRelease, relativamente &agrave; posi&ccedil;&atilde;o normal de um ficheiro
InRelease. Por predefini&ccedil;&atilde;o, esta op&ccedil;&atilde;o n&atilde;o est&aacute; definida e o APT ir&aacute; tentar obter um
InRelease
ou, se isso falhar, um ficheiro
Release
e o seu ficheiro associado
Release.gpg. Ao definir esta op&ccedil;&atilde;o, ser&aacute; tentado o caminho especificado em vez do ficheiro InRelease, e o recurso a ficheiros
Release
ser&aacute; desactivado.
</DL>

<P>
<A NAME="lbAI">&nbsp;</A>
<H2>ESPECIFICA&Ccedil;&Atilde;O DA URI</H2>

<P>

Os tipos de URI actualmente reconhecidos s&atilde;o:
<P>

<B>http</B> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-http">apt-transport-http</A></B>(1))
<DL COMPACT><DT id="18"><DD>
O esquema http especifica um servidor HTTP para um arquivo e o m&eacute;todo mais comum usado. O URI pode incluir directamente informa&ccedil;&atilde;o de login se o arquivo o requerer, mas deve ser prefer&iacute;vel o uso de
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5). O m&eacute;todo tamb&eacute;m suporta proxies SOCKS5 e HTTP(S) sejam configurados via configura&ccedil;&atilde;o espec&iacute;fica do apt ou especificada pela vari&aacute;vel de ambiente
<B>http_proxy</B>
no formato (assumindo um proxy HTTP que requer autentica&ccedil;&atilde;o)
<I><A HREF="http://user:pass@server:port/">http://user:pass@server:port/</A></I>. Os detalhes de autentica&ccedil;&atilde;o para proxies tamb&eacute;m pode ser fornecidos via
<B><A HREF="/cgi-bin/man/man2html?5+apt_auth.conf">apt_auth.conf</A></B>(5).
<P>
Note que estas formas de autentica&ccedil;&atilde;o s&atilde;o inseguras pois toda a comunica&ccedil;&atilde;o com o servidor remoto (ou proxy) n&atilde;o est&aacute; encriptada, portanto um atacante suficientemente capaz pode observar e guarda o login assim como todas as outras interac&ccedil;&otilde;es. O atacante pode
<I>n&atilde;o</I>
pode modificar a comunica&ccedil;&atilde;o totalmente pois o modelo de seguran&ccedil;a de dados do APT &eacute; independente do m&eacute;todo de transporte escolhido. Veja
<B><A HREF="/cgi-bin/man/man2html?8+apt-secure">apt-secure</A></B>(8)
para mais detalhes.
</DL>

<P>

<B>https</B> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-https">apt-transport-https</A></B>(1))
<DL COMPACT><DT id="19"><DD>
O esquema https especifica um servidor HTTPS para um arquivo e &eacute; muito semelhante em utiliza&ccedil;&atilde;o e op&ccedil;&otilde;es dispon&iacute;veis ao esquema http. A principal diferen&ccedil;a &eacute; que a comunica&ccedil;&atilde;o entre o apt e o servidor (ou proxy) &eacute; encriptada. Note que a encripta&ccedil;&atilde;o n&atilde;o previne um atacante de saber com qual servidor (ou proxy) o apt est&aacute; a comunicar e com uma an&aacute;lise mais profunda pode potencialmente ainda revelar que dados est&atilde;o a ser descarregados. Se isto for preocupante, os esquemas baseados em Tor mencionados mais abaixo podem ser uma alternativa apropriada.
</DL>

<P>

<B>mirror</B>, <B>mirror+</B><B></B><I>esquema</I> (<B><A HREF="/cgi-bin/man/man2html?1+apt-transport-mirror">apt-transport-mirror</A></B>(1))
<DL COMPACT><DT id="20"><DD>
O esquema mirror especifica a localiza&ccedil;&atilde;o de uma mirrorlist. Por predefini&ccedil;&atilde;o o esquema usado para a localiza&ccedil;&atilde;o &eacute;
http, mas pode ser usado qualquer outro esquema via
<B>mirror+</B><B></B><I>esquema</I>. A pr&oacute;pria mirrorlist pode conter v&aacute;rios URIs diferentes para mirrors que o cliente do APT pode transparentemente pegar, escolher e recorrer entre os pretendentes para ajudar tanto com a distribui&ccedil;&atilde;o da carga sobre os mirrors dispon&iacute;veis e assegurando que os clientes podem adquirir dados mesmo que alguns dos mirrors configurados n&atilde;o estejam dispon&iacute;veis.
</DL>

<P>

<B>file</B>
<DL COMPACT><DT id="21"><DD>
O esquema file permite que um direct&oacute;rio arbitr&aacute;rio do sistema de ficheiros seja considerado um arquivo. Isto &eacute; &uacute;til para montagens NFS e mirrors ou arquivos locais.
</DL>

<P>

<B>cdrom</B>
<DL COMPACT><DT id="22"><DD>
O esquema cdrom permite ao APT usar uma drive de CD-ROM, DVD ou caneta USB local com mudan&ccedil;a de media. Use o programa
<B><A HREF="/cgi-bin/man/man2html?8+apt-cdrom">apt-cdrom</A></B>(8)
para criar entradas cdrom na lista de fontes.
</DL>

<P>

<B>ftp</B>
<DL COMPACT><DT id="23"><DD>
O esquema ftp especifica um servidor FTP para um arquivo. O uso de FTP est&aacute; em decl&iacute;nio em favor de
http
e
https
e muitos arquivos ou nunca ofereceram ou est&atilde;o a retirar o acesso FTP. Se voc&ecirc; ainda precisa deste m&eacute;todo, est&atilde;o dispon&iacute;veis muitas op&ccedil;&otilde;es de configura&ccedil;&atilde;o no escopo
Acquire::ftp
e detalhadas em
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5).
<P>
Por favor note que pode ser especificado um proxy FTP ao usar a vari&aacute;vel de ambiente
<B>ftp_proxy</B>. &Eacute; poss&iacute;vel especifica um proxy HTTP (os servidores proxy HTTP geralmente compreendem URLs de FTP) usando esta vari&aacute;vel de ambiente e
<I>apenas</I>
esta vari&aacute;vel de ambiente. Os proxies que usam HTTP especificados no ficheiro de configura&ccedil;&atilde;o ser&atilde;o ignorados.
</DL>

<P>

<B>copy</B>
<DL COMPACT><DT id="24"><DD>
O esquema copy &eacute; id&ecirc;ntico ao esquema file com a excep&ccedil;&atilde;o que os pacotes s&atilde;o copiados para o direct&oacute;rio cache em vez serem usados directamente da sua localiza&ccedil;&atilde;o. Isto &eacute; &uacute;til para quem use um meio amov&iacute;vel para copiar ficheiros com o APT.
</DL>

<P>

<B>rsh</B>, <B>ssh</B>
<DL COMPACT><DT id="25"><DD>
O m&eacute;todo rsh/ssh invoca RSH/SSH a ligar a uma m&aacute;quina remota e aceder a ficheiros como um dado utilizador. &Eacute; recomendada a configura&ccedil;&atilde;o pr&eacute;via de rhosts ou chaves RSA. Os comandos standard
<B>find</B>
e
<B>dd</B>
s&atilde;o usados para executar as transfer&ecirc;ncias de ficheiros a partir da m&aacute;quina remota.
</DL>

<P>

adicionando mais tipos de URI reconhec&iacute;veis
<DL COMPACT><DT id="26"><DD>
O APT pode ser estendido com mais m&eacute;todos lan&ccedil;ados em outros pacotes opcionais, que devem seguir o esquema de nomea&ccedil;&atilde;o
apt-transport-<I>m&eacute;todo</I>. Por exemplo, a equipa do APT tamb&eacute;m mant&eacute;m o pacote
apt-transport-tor, o qual disponibiliza m&eacute;todos de acesso para URIs de HTTP e HTTPS com rota via rede Tor.
</DL>

<A NAME="lbAJ">&nbsp;</A>
<H2>EXEMPLOS</H2>

<P>

Usa o arquivo armazenado localmente (ou montagem NFS) em /home/apt/debian para stable/main, stable/contrib, e stable/non-free.
<P>
<DL COMPACT><DT id="27"><DD>



<PRE>
deb file:/home/apt/debian stable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="28"><DD>



<PRE>
Types: deb
URIs: file:/home/apt/debian
Suites: stable
Components: main contrib non-free
</PRE>

</DL>




<P>

Como em cima, excepto que usa a distribui&ccedil;&atilde;o unstable (de desenvolvimento).
<P>
<DL COMPACT><DT id="29"><DD>



<PRE>
deb file:/home/apt/debian unstable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="30"><DD>



<PRE>
Types: deb
URIs: file:/home/apt/debian
Suites: unstable
Components: main contrib non-free
</PRE>

</DL>




<P>

Especifica&ccedil;&atilde;o de fontes para o referido acima.
<P>
<DL COMPACT><DT id="31"><DD>



<PRE>
deb-src file:/home/apt/debian unstable main contrib non-free
</PRE>

</DL>




<P>
<DL COMPACT><DT id="32"><DD>



<PRE>
Types: deb-src
URIs: file:/home/apt/debian
Suites: unstable
Components: main contrib non-free
</PRE>

</DL>




<P>

A primeira linha obt&eacute;m a informa&ccedil;&atilde;o do pacote para a arquitectura em
APT::Architectures
enquanto a segunda obt&eacute;m sempre
amd64
e
armel.
<P>
<DL COMPACT><DT id="33"><DD>



<PRE>
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> buster main
deb [ arch=amd64,armel ] <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> buster main
</PRE>

</DL>




<P>
<DL COMPACT><DT id="34"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: buster
Components: main

Types: deb
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: buster
Components: main
Architectures: amd64 armel
</PRE>

</DL>




<P>

Usa HTTP para aceder ao arquivo em archive.debian.org, e usa apenas a &aacute;rea hamm/main.
<P>
<DL COMPACT><DT id="35"><DD>



<PRE>
deb <A HREF="http://archive.debian.org/debian-archive">http://archive.debian.org/debian-archive</A> hamm main
</PRE>

</DL>




<P>
<DL COMPACT><DT id="36"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://archive.debian.org/debian-archive">http://archive.debian.org/debian-archive</A>
Suites: hamm
Components: main
</PRE>

</DL>




<P>

Usa FTP para aceder ao arquivo em <A HREF="ftp://ftp.debian.org">ftp.debian.org</A>, sob o direct&oacute;rio debian, e usa apenas a &aacute;rea buster/contrib.
<P>
<DL COMPACT><DT id="37"><DD>



<PRE>
deb <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A> buster contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="38"><DD>



<PRE>
Types: deb
URIs: <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A>
Suites: buster
Components: contrib
</PRE>

</DL>




<P>

Usa FTP para aceder ao arquivo em <A HREF="ftp://ftp.debian.org">ftp.debian.org</A>, sob o direct&oacute;rio debian, e usa apenas a &aacute;rea unstable/contrib. Se esta linha aparecer tamb&eacute;m como aquela no exemplo anterior em
sources.list
ser&aacute; usada uma &uacute;nica sess&atilde;o FTP para ambas linhas de recurso.
<P>
<DL COMPACT><DT id="39"><DD>



<PRE>
deb <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A> unstable contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="40"><DD>



<PRE>
Types: deb
URIs: <A HREF="ftp://ftp.debian.org/debian">ftp://ftp.debian.org/debian</A>
Suites: unstable
Components: contrib
</PRE>

</DL>




<P>

Usa HTTP para aceder ao arquivo em <A HREF="ftp://ftp.tlh.debian.org">ftp.tlh.debian.org</A>, sob o direct&oacute;rio universe, e usa apenas os ficheiros encontrados sob
unstable/binary-i386
em m&aacute;quinas i386,
unstable/binary-amd64
em amd64, e assim por diante para outras arquitecturas suportadas. [Note que este exemplo apenas mostra como usar a vari&aacute;vel de substitui&ccedil;&atilde;o; os arquivos oficiais debian n&atilde;o est&atilde;o estruturados assim]
<P>
<DL COMPACT><DT id="41"><DD>



<PRE>
deb <A HREF="http://ftp.tlh.debian.org/universe">http://ftp.tlh.debian.org/universe</A> unstable/binary-$(ARCH)/
</PRE>

</DL>




<P>
<P>
<P>
<DL COMPACT><DT id="42"><DD>



<PRE>
Types: deb
URIs: <A HREF="http://ftp.tlh.debian.org/universe">http://ftp.tlh.debian.org/universe</A>
Suites: unstable/binary-$(ARCH)/
</PRE>

</DL>




<P>

Usa HTTP para obter pacotes bin&aacute;rios assim como fontes a partir das suites stable, testing e unstable e os componentes main e contrib.
<P>
<DL COMPACT><DT id="43"><DD>



<PRE>
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> stable main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> stable main contrib
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> testing main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> testing main contrib
deb <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> unstable main contrib
deb-src <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A> unstable main contrib
</PRE>

</DL>




<P>
<DL COMPACT><DT id="44"><DD>



<PRE>
Types: deb deb-src
URIs: <A HREF="http://deb.debian.org/debian">http://deb.debian.org/debian</A>
Suites: stable testing unstable
Components: main contrib
</PRE>

</DL>




<A NAME="lbAK">&nbsp;</A>
<H2>VEJA TAMB&Eacute;M</H2>

<P>

<B><A HREF="/cgi-bin/man/man2html?8+apt-get">apt-get</A></B>(8),
<B><A HREF="/cgi-bin/man/man2html?5+apt.conf">apt.conf</A></B>(5),
/usr/share/doc/apt-doc/acquire-additional-files.md.gz
<A NAME="lbAL">&nbsp;</A>
<H2>BUGS</H2>

<P>

m[blue]<B>p&aacute;gina de bugs do APT</B>m[]<FONT SIZE="-2">[1]</FONT>. Se deseja reportar um bug no APT, por favor veja
/usr/share/doc/debian/bug-reporting.txt
ou o comando
<B><A HREF="/cgi-bin/man/man2html?1+reportbug">reportbug</A></B>(1).
<A NAME="lbAM">&nbsp;</A>
<H2>TRADU&Ccedil;&Acirc;O</H2>

<P>

A tradu&ccedil;&atilde;o Portuguesa foi feita por Am&eacute;rico Monteiro
&lt;<A HREF="mailto:a_monteiro@netcabo.pt">a_monteiro@netcabo.pt</A>&gt;
de 2009 a 2012. A tradu&ccedil;&atilde;o foi revista pela equipa de tradu&ccedil;&otilde;es portuguesas da Debian
&lt;<A HREF="mailto:traduz@debianpt.org">traduz@debianpt.org</A>&gt;.
<P>

Note que este documento traduzido pode conter partes n&atilde;o traduzidas. Isto &eacute; feito propositadamente, para evitar perdas de conte&uacute;do quando a tradu&ccedil;&atilde;o est&aacute; atrasada relativamente ao conte&uacute;do original.
<A NAME="lbAN">&nbsp;</A>
<H2>AUTORES</H2>

<P>

<B>Jason Gunthorpe</B>
<DL COMPACT><DT id="45"><DD>
</DL>

<P>

<B>Equipa do APT</B>
<DL COMPACT><DT id="46"><DD>
</DL>

<A NAME="lbAO">&nbsp;</A>
<H2>NOTAS</H2>

<DL COMPACT>
<DT id="47"> 1.<DD>
p&aacute;gina de bugs do APT
<DL COMPACT><DT id="48"><DD>
<A HREF="http://bugs.debian.org/src:apt">http://bugs.debian.org/src:apt</A>
</DL>

<P>
</DL>

<HR>
<A NAME="index">&nbsp;</A><H2>Index</H2>
<DL>
<DT id="49"><A HREF="#lbAB">NOME</A><DD>
<DT id="50"><A HREF="#lbAC">DESCRI&Ccedil;&Atilde;O</A><DD>
<DT id="51"><A HREF="#lbAD">SOURCES.LIST.D</A><DD>
<DT id="52"><A HREF="#lbAE">FORMATO ESTILO-UMA-LINHA</A><DD>
<DT id="53"><A HREF="#lbAF">FORMATO ESTILO-DEB822</A><DD>
<DT id="54"><A HREF="#lbAG">OS TIPOS DEB E DEB-SRC: FORMATO GERAL</A><DD>
<DT id="55"><A HREF="#lbAH">OS TIPOS DEB E DEB-SRC: OP&Ccedil;&Otilde;ES</A><DD>
<DT id="56"><A HREF="#lbAI">ESPECIFICA&Ccedil;&Atilde;O DA URI</A><DD>
<DT id="57"><A HREF="#lbAJ">EXEMPLOS</A><DD>
<DT id="58"><A HREF="#lbAK">VEJA TAMB&Eacute;M</A><DD>
<DT id="59"><A HREF="#lbAL">BUGS</A><DD>
<DT id="60"><A HREF="#lbAM">TRADU&Ccedil;&Acirc;O</A><DD>
<DT id="61"><A HREF="#lbAN">AUTORES</A><DD>
<DT id="62"><A HREF="#lbAO">NOTAS</A><DD>
</DL>
<HR>
This document was created by
<A HREF="/cgi-bin/man/man2html">man2html</A>,
using the manual pages.<BR>
Time: 00:06:22 GMT, March 31, 2021
</BODY>
</HTML>
